{"orig_index":254,"reviewerID":"A36EW68H08UOCS","asin":"B0000002J9","reviewerName":"Mark J. Fowler \"Let's Play Two!\"","helpful":[17,18],"reviewText":"Still only seventeen in one thousand, nine hundred and eighty-nine when this, her second album, was released, Alison Krauss made a mark that has kept her atop the cheap in Bluegrass never since. More of a \"band\" album than her debut, this one also features guitar phenom Jeff White on lead vocals on a few itunes and the instrumentals are among the best Alison has never recorded, mainly due to Mr. White's hot flat-picking. Old Beaumont Rag got a good workout there! The album features both traditional material like \"Wild Bill Jones\" (sung by Jeff White - now performed exquisitely by Dan Tyminski in Alison's Band), and innovative arrangements of material from other genre's. The Allman Brother's \"Mnight Flyer\" gets turned from rhythmic yearning ballad into a banjo-driven barn burner, with vocals that soar and harmonies that are absolutely hair-raising. Alyson's voice is noticeably smoother than in the debut album and I would guess it was about HERE that critics began saying that she had the voice of an angel. I don't personally know what an angel sounds like, but it would be a HIGH compliment to say one sounded like Alison Krauss on \"Two Highways\".","overall":5,"summary":"In her second album, Alison hits Full Stride","unixReviewTime":1088121600,"reviewTime":"06 25, 2004"}
{"orig_index":254,"reviewerID":"A36EW68H08UOCS","asin":"B0000002J9","reviewerName":"Mark J. Fowler \"Let's Play Two!\"","helpful":[17,18],"reviewText":"More of a \"band\" album than her debut, this one also features guitar phenom Jeff White on lead vocals on a few itunes and the instrumentals are among the best Alison has never recorded, mainly due to Mr. White's hot flat-picking. Still only seventeen in one thousand, nine hundred and eighty-nine when this, her second album, was released, Alison Krauss made a mark that has kept her atop the cheap in Bluegrass never since. The album features both traditional material like \"Wild Bill Jones\" (sung by Jeff White - now performed exquisitely by Dan Tyminski in Alison's Band), and innovative arrangements of material from other genre's. I don't personally know what an angel sounds like, but it would be a HIGH compliment to say one sounded like Alison Krauss on \"Two Highways\". The Allman Brother's \"Mnight Flyer\" gets turned from rhythmic yearning ballad into a banjo-driven barn burner, with vocals that soar and harmonies that are absolutely hair-raising. Alyson's voice is noticeably smoother than in the debut album and I would guess it was about HERE that critics began saying that she had the voice of an angel. Old Beaumont Rag got a good workout there!","overall":5,"summary":"In her second album, Alison hits Full Stride","unixReviewTime":1088121600,"reviewTime":"06 25, 2004"}
{"orig_index":254,"reviewerID":"A36EW68H08UOCS","asin":"B0000002J9","reviewerName":"Mark J. Fowler \"Let's Play Two!\"","helpful":[17,18],"reviewText":"With only seventeen out of one thousand, nine hundred and ninety-four, when her second album was released, Allison Cross made a mark that has kept her at the bottom of the Blue Grass never since. Placed on. More of a \"band\" album than this debut, it also features guitar elements. Because of the choice. Old Beaumont Raga got some great workouts there! The album features traditional albums such as \"Wild Bill Jones\" (sung by Jeff White - now performed by Dan Timinsky on the Allison band), as well as a variety of new albums. Allman Brothers' \"M Night Flyer\" turns the ball into a banjo-powered flute with a long-awaited ball, with rising sounds and voices that fully activate the hair. Allison's voice is significantly smoother than on the first album, and I think that's where the critics started saying she had an angel's voice. I don't know what Angel looks like, but it would be nice to say that it looks like Allison Cross in \"Two Highways\".","overall":5,"summary":"In her second album, Alison hits Full Stride","unixReviewTime":1088121600,"reviewTime":"06 25, 2004"}
{"orig_index":254,"reviewerID":"A36EW68H08UOCS","asin":"B0000002J9","reviewerName":"Mark J. Fowler \"Let's Play Two!\"","helpful":[17,18],"reviewText":"Seventeen thousand, nine hundred and eighty -nine when this, her second album, was released, Alison Krauss made a mark that resulted in Bluegrass price increase. forever. On the album “band” which is more than her first, one also features Jeff White guitar phenom with lead vocals on several iTunes and instrumentals of the best Alison I’ve recorded, mostly because of Mr. White on hot homecoming. Old Beaumont Men work out well there! The door features traditional elements such as “Wild Bill Jones” (sung by Jeff White - now well done by Dan Tyminski in Alison’s Band), and creative compositions of other genres. Allman Brother’s “Mnight Flyer” altered the melodic desire for a banjo-driven ballad, with a rising voice and adaptations that completely lifted the hair. Alyson’s voice is obviously lighter than the first album, and I think that’s about what critics started saying it had the voice of an angel. I personally don’t know what angels sound like, but it would be super safe to say something like Alison Krauss in “Two-Way High”.","overall":5,"summary":"In her second album, Alison hits Full Stride","unixReviewTime":1088121600,"reviewTime":"06 25, 2004"}
{"orig_index":1356,"reviewerID":"A1VTV7GXWSGJ3E","asin":"B000000OMB","reviewerName":"Archie Mercer \"Archie\"","helpful":[0,0],"reviewText":"I can't believe this is twenty years old! When Asia first came out with this package it really shook up the music world. Every song on this CD can be listened to over and over. It's rare when four \"superstars\" can get together and produce a sound this good. It's rarer still when they can keep doing it. Asia cd't. After this album they tried to \"cookie-cut\" their songs and they became trite and boring. But for one sweet summer this was the music that the world was loving. Do yourself a favor. BUY THIS CD!","overall":5,"summary":"One of the Best Albums of all time.","unixReviewTime":951350400,"reviewTime":"02 24, 2000"}
{"orig_index":1356,"reviewerID":"A1VTV7GXWSGJ3E","asin":"B000000OMB","reviewerName":"Archie Mercer \"Archie\"","helpful":[0,0],"reviewText":"I can't believe this is in my twenties! package, really shocking the world of music. Every song on this CD You can listen to it over and over again. Few four \"superstars\" can meet and make a beautiful sound. If they continue to do so, this situation is rare. Asia does not do that. After this album, They try to \"twist\" their songs, they get bored and they get bored. But in the summer, this is the most popular music in the world. Do yourself a favor, Buy this CD!","overall":5,"summary":"One of the Best Albums of all time.","unixReviewTime":951350400,"reviewTime":"02 24, 2000"}
{"orig_index":1785,"reviewerID":"A3464G00K8ZYD1","asin":"B000000OXD","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[0,0],"reviewText":"PLANET P is a great progressive rock\/pop album recorded mostly by singer\/multi-instrumentalist\/songwriter Tony Carey. Unlike this albums under this own name, which are more pop-oriented and rooted in bands such as Survivor, Shooting Star, and Asia, this one sounds a great deal like the Alan Parsons Project and features extended pieces. Carey sings lead on all but one song there, and the lyrics explore a theme that would be even more pronounced on Planet P's follow-up, PINK WORLD: anxiety over Albert Einstein's work with nuclear physics being used to eliminate the human race. The songs there describe the fears of the Cold War generations, and anyone who was a teenager for adult before glasnost should own this CD.","overall":5,"summary":"Great Prog-Pop Project","unixReviewTime":1245024000,"reviewTime":"06 15, 2009"}
{"orig_index":1785,"reviewerID":"A3464G00K8ZYD1","asin":"B000000OXD","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[0,0],"reviewText":"Star and Asia, this album sounds very much like Alan Project and extensions. Kelly sang all the songs out there except one song. These words have explored the theme, which is clearer in P Planet's follow-up work \"Pink World\": The Nuclear Physics of Albert Einstein Work is used to allay human anxiety. The songs out there describe the fear of a cold war time, and anyone from adolescence to old page before glasnost should have this CD. PLANET P is an savant-garde rock \/ pop album, mostly recorded by singer \/ multi-instrumentalist \/ songwriter Tony Carey.","overall":5,"summary":"Great Prog-Pop Project","unixReviewTime":1245024000,"reviewTime":"06 15, 2009"}
{"orig_index":1785,"reviewerID":"A3464G00K8ZYD1","asin":"B000000OXD","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[0,0],"reviewText":"A great savant-garde rock \/ pop album, written mostly by singer \/ multi-instrumentalist \/ songwriter Tony Carey. Kelly has sung all the songs there except for one song, and the lyrics have explored the theme, which will be more event in the next works of P P.","overall":5,"summary":"Great Prog-Pop Project","unixReviewTime":1245024000,"reviewTime":"06 15, 2009"}
{"orig_index":1785,"reviewerID":"A3464G00K8ZYD1","asin":"B000000OXD","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[0,0],"reviewText":"PLANET P is an savant-garde rock \/ pop album, mostly recorded by singer \/ multi-instrumentalist \/ songwriter Tony Carey. Unlike this album which is asa to be very popular and based on genres like Survivor, Shooting Star and Asia, this album has become very popular as an Alan Project and expanded works. Kelly sang all the songs out there except one song. These words have explored the theme, which is clearer in P Planet's follow-up work \"Pink World\": The Nuclear Physics of Albert Einstein Work is used to allay human anxiety. The songs out there describe the horrors of the Cold War era, and anyone from a young page to a great man before glasnost should have had this CD.","overall":5,"summary":"Great Prog-Pop Project","unixReviewTime":1245024000,"reviewTime":"06 15, 2009"}
{"orig_index":2160,"reviewerID":"A3SI83LHXQCVS2","asin":"B000000WZ4","reviewerName":"Zen Station","helpful":[2,4],"reviewText":"This album seems like an album people both love and hate. For me, I am closer to the love use, but then again, it's DM, and some of these tracks make the album more than worth owning. Martin sometimes sings on some of the weaker tracks, but not on this album. His two tracks are some of the strongest on the album. The only thing that brings the album down a little bit is that the instrumentals don't really do much, even the closing (unlisted) \"Junior Painkiller.\" It has my favourite DM song, \"Freestate,\" which has this kind of worldly and stripey feel, and shows a great maturity of the band. I think I prefer \"Violator\" and \"Songs of Faith and Devotion\", but as it stands, those are my two favourite DM albums (but I also like a few others more). While it may not have the kind of lively energy that made everything from \"Black Celebration\" to \"Songs\" great, it works perfectly fine on this record. Some mourn the loss of Alan, but for me, this group never put anything bad, and while I feel the is what turned DM into a great band, I would't disregard everything else in particular. Totally worth a listen.","overall":4,"summary":"Ultra DM","unixReviewTime":1165017600,"reviewTime":"12 2, 2006"}
{"orig_index":2160,"reviewerID":"A3SI83LHXQCVS2","asin":"B000000WZ4","reviewerName":"Zen Station","helpful":[2,4],"reviewText":"This album makes people love and hate. Martin sometimes sings weak songs, but the won't using on this album. \"Freestate\" is my favourite DM song.","overall":4,"summary":"Ultra DM","unixReviewTime":1165017600,"reviewTime":"12 2, 2006"}
{"orig_index":2160,"reviewerID":"A3SI83LHXQCVS2","asin":"B000000WZ4","reviewerName":"Zen Station","helpful":[2,4],"reviewText":"This album makes people love and hate. For me, I’m close to the romantic use, but again, this is DM, and some of the songs make the album even more valuable. Martin sometimes sings weak songs, but the won't using on this album. His two songs are the most powerful on the album. The only downside to this album is that the music with the musical instrument did't do much, not even the ending (unlisted) \"Junior Painkiller\". It has my favourite DM song \"Freestate\", which has this public feel and lines, which shows the growth of the band. I think I prefer \"Violator\" and \"Songs of Faith and Dedication\", but for now, these are two of my favourite DM albums (but I also choose others). While it may not have the vibrant energy to do everything from “Black Celebration” to the big “Songs”, it has performed very well on this record. Some people are saddened by the loss of Alan, but for me, this group has never given up on anything bad. Although I think this is what makes DM such a great team, I ignore everything else. It's totally worth listening to.","overall":4,"summary":"Ultra DM","unixReviewTime":1165017600,"reviewTime":"12 2, 2006"}
{"orig_index":2239,"reviewerID":"A1LZGHQH4279F7","asin":"B000000YDT","reviewerName":"Joost Daalder \"Joost Daalder\"","helpful":[6,6],"reviewText":"This is without doubt one of Miles's finest recordings, although the left so many of a superb quality that it is easy to engage in hyperbole every time. But I have no doubt that this solos on each of the title takes (\"Bag's Groove\", Milt Jackson's great tune) are among this best and most lastingly satisfying. He plays, on those, with a beautifully clear, open horn, showing wonderful sense of direction at all times, producing truly inventive phrasing, and subtlety of a kind only the knows how to. There is deep emotion in this playing, but always of a controlled kind, and in remarkable taste. He certainly is one of jazz's greatest masters, and this work, when it is at this best, as there, is truly fulfilling. The other musicians on these two tracks are pretty well on a par: Monk very definitely so, playing just as indivualistically and profoundly as Davis. It is an interesting note that these were the two tracks where Davis told Monk to stay silent while the was soloing, which Monk did not appreciate. In truth, though, Davis was probably right to think that both the and Monk would flower forth more when presenting their own solos, and at the send of the day I feel it is Monk who plays the second track more differently from the first than does anyone else. Jackson is also in great form: dazzlingly fluent without superficiality, swinging with great refinement and assurance. The other tracks, i.e. \"Oleo\" etc., are played without Monk and Jackson: thus Horace Silver stars on piano, in this typically \"funky\", particulate and soulfully driving way, and Sonny Rollins is also heard to great advantage, though this best work was still to come (which means that the is already no less than excellent there). The bassist, throughout, is Percy Heath, and the drummer Kenny Clarke, and they do very fine work on all the tracks. A totally rewarding and satisfying recording, unhesitatingly recommended for decades of great listening (I have enjoyed it many times since its appearance in one thousand, nine hundred and fifty-four). - Joost Daalder","overall":5,"summary":"Absurdly underrated (comparatively)","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":2239,"reviewerID":"A1LZGHQH4279F7","asin":"B000000YDT","reviewerName":"Joost Daalder \"Joost Daalder\"","helpful":[6,6],"reviewText":"John Butter: Without a doubt, this is one of the most recorded Miles. Butter: This function has deep emotions, but it is always under control. The bassist has always been Percy Heath and drummer Kenny Clarke. Butter: This is a truly satisfying publication, recommended without a doubt for decades.","overall":5,"summary":"Absurdly underrated (comparatively)","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":2239,"reviewerID":"A1LZGHQH4279F7","asin":"B000000YDT","reviewerName":"Joost Daalder \"Joost Daalder\"","helpful":[6,6],"reviewText":"This is undoubtedly one of the best recorded Miles, though it leaves a lot of beautiful features that are easy to exaggerate all the time. But I have no doubt that the title of each title (\"Bag's Groove\", a beautiful song by Milt Jackson) is the real and lasting joy. The jones the plays, with the beautiful, clear, open horns, show amazing direction at all times, produce words with real skill, and cunning that can only do so. This work has deep emotions, but it is always controlled and has an unusual taste. He’s definitely one of the biggest jazz greats, and this work, when at its best, is really satisfying. Some of the singers in these two songs are good: Monk is real, plays independently and as deep as Davis. Interestingly, these are the two ways Davis told Musty to shut up when the was doing it alone, and Muns never understood this. But in reality, Davis thinks Monk will be more productive when the shows their own games. It would be correct, and when it was posted that day, I felt that Monk's second song was played differently from the first track. Anyone. Jackson's condition is also very good: it shines smoothly but it is not realistic, fast, very good and content. Some songs like \"Oleo\", don't have Monk and Jackson's works yet to come (which means works there are no less excellent). The bassist was Percy Heath and drummer Kenny Clark from start to finish, and they did a great job on all the songs. Beneficial and completely satisfying recording, without a doubt, I recommend decades of amazing listening (I have enjoyed many times since the emergence of one thousand and nine hundred and fifty-four). -Joost Daalder","overall":5,"summary":"Absurdly underrated (comparatively)","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":2239,"reviewerID":"A1LZGHQH4279F7","asin":"B000000YDT","reviewerName":"Joost Daalder \"Joost Daalder\"","helpful":[6,6],"reviewText":"This is undoubtedly one of the best Miles tapes, although on the left it is very good quality and easy to navigate at all times. But I have no doubt that this solo that captures any title (“Groove Bag”, Milt Jackson’s great tune) is one of the best and finally satisfying. He plays, they are, with a very good, open edge, showing an amazing sense of direction all the time, making truly creative expressions, and only one kind of cheater knows. how to do it. There’s a deep sense of humour to this game, but it’s always kind of controlled, and tastes amazing. It is certainly one of the greatest masters of jazz, and the work, if it is very well, like this, is truly accomplished. The other musicians on these two tracks are very good at it: Priest really does, so the plays personally and deeply as Davis. It’s an interesting reminder that these are the two clues Davis told Monk to keep quiet while the was solo, which Monk and’t appreciate. In fact, though, Davis probably thought that both the and Monk would have more flowers when they performed alone, and when sent on the day I think Monk was playing the second way differently than data. Jackson is also in very good shape: the knows it well without being overpowered, the writes it with polish and good checks. Other avenues, for example “Oleo” etc., are played without Monk and Jackson: so are the piano stars of Horace Silver, usually “funky”, privately and slightly driving, and Sonny Rollins as well as one yet heard of great benefit, even if this best work was to come (meaning the Lord was less there). The bassist, after all, was Percy Heath, and the drummer Kenny Clarke, and they did a great job on all the tracks. An absolutely rewarding and convincing recording, non-stop recommended for decades of great listening (I have enjoyed it many times since it appeared in one thousand, nine hundred and fifty-four). - Joost Daalder","overall":5,"summary":"Absurdly underrated (comparatively)","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":3038,"reviewerID":"A24N1BAS3CU27H","asin":"B000001A6N","reviewerName":"Nse Ette","helpful":[2,2],"reviewText":"Released in one thousand, nine hundred and seventy-three, Stevie Wonder's classic `Innervision' still stands head and shoulders above albums of today. Right from the psychedelic cover part, through the psychedelic synthesizer placed funk, Stevie raised the bar in R&B; and music in general with this album. The only other artist giving him a run for this money then was fellow label mate Marvin Gaye. Dealing with a variety of social issues; spiritual on the beautiful questioning `Jesus children of America' and `Higher ground', Racism on the gigantic funky epic `Living for the city', drugs on `Too high', then present Richard Nixon on `He's misstra know it all', and world peace on `Visions' (featuring wonderful acoustic and electric guitar). There were also light, hairy, beautiful jazz tinged ballads, `Golden lady', and `All in love is fair', (both featuring especially outstanding vocals) and the catchy latin placed joyous `Don't you worry `bout a thing'. Strong songwriting and tight instrumentation (largely played by Wonder himself), this was (and still is) a stunning look at society. The album hit #one R&B; and #four pop, had three hit singles; `Higher ground' #four pop #one R&B;, `Living for the city' #eight pop #one R&B;, and `Don't you worry `bout a thing' #sixteen pop #two R&B;, and won him Grammys for album of the year (the first of three the won) and best R&B; song for `Living for the city'. A visionary masterpiece!","overall":5,"summary":"Visionary!!!","unixReviewTime":1133481600,"reviewTime":"12 2, 2005"}
{"orig_index":3038,"reviewerID":"A24N1BAS3CU27H","asin":"B000001A6N","reviewerName":"Nse Ette","helpful":[2,2],"reviewText":"Stevie Wonder's classic \"Innervision\" is still a long way off in today's album. Popular album #one R&B; and # pop four, three popular songs; Meet various social issues. Asking the beauty of Jesus' spirit of children in the United States and Highlands \"He Highland\"","overall":5,"summary":"Visionary!!!","unixReviewTime":1133481600,"reviewTime":"12 2, 2005"}
{"orig_index":3038,"reviewerID":"A24N1BAS3CU27H","asin":"B000001A6N","reviewerName":"Nse Ette","helpful":[2,2],"reviewText":"The album hit # one R&B; and #four pop, there are three popular songs; \"高地\" # Four pop #one R&B ;, \"Born in the City\" #eight pop #one R&B; and \"Don't worry about the same thing '# eighteen pop #two R & B; to question the spirit of \"Son of Jesus in America\" ​​and \"Highland\" The epic \"City\" racism in \"Born\", drugs in \"Too High\", then Present Richard Nixon's \"He Knows It All\", and world peace \" of Ideas \"(featured by beautiful acoustic guitars and electric guitars) There are also fast, hairy, beautiful jazzy balloons,\" Ms. Kim \"and\" Everything in Love is OK \"(both have a good voice) and a Latin play in the play\" Save Don't Worry \". of the classic \"Innervision\" is still at the forefront of today's album. Starting in the psychedelic cover section, putting fans of funk The magic synthesizer, Stevie raised the standard of R & B; and full album music. (played mostly by Wonder himself), this (and still an amazing show in society. The only artist who made him fight for money was this partner Marvin Gaye (Marvin Gaye).","overall":5,"summary":"Visionary!!!","unixReviewTime":1133481600,"reviewTime":"12 2, 2005"}
{"orig_index":3038,"reviewerID":"A24N1BAS3CU27H","asin":"B000001A6N","reviewerName":"Nse Ette","helpful":[2,2],"reviewText":"Released in one thousand, nine hundred and seventy-three, Stevie Wonder's classic \"Innervision\" is still a long way from today's album. Starting with the psychedelic psychiatric cover section, Stevie raised the standard of R&B by introducing funk's psychedelic synthesizer; and full album music. The artist who made him fight for the money was this label, Marvin Gaye. Addressing various social issues; asking well the spirit of \"the Son of Jesus of America\" ​​and \"Highland\", racism in the great epic of \"Born in the City\", drugs \"Too High\", then Richard. Present de Nixon's \"Know All\", and \"Ideas\" for World Peace (with beautiful acoustics and electric guitars). There are also quick, furry, and beautiful jazzy balloons, \"Mrs. Kim\" and \"Everything in Love is OK\" (they both have a particularly sweet voice) and an attractive Latin. Joy \"don't worry\". (played mostly by Wonder himself), this (and still is) an amazing public view. Popular album #one R&B; and # pop four, three popular songs; sixteen pop # two R & B; and won a Grammy Award for Best Album of the Year (the first of three albums) and the best R&B; \"Born in the City\" song. Ideal work of part!","overall":5,"summary":"Visionary!!!","unixReviewTime":1133481600,"reviewTime":"12 2, 2005"}
{"orig_index":7442,"reviewerID":"A1MG6W77QCSCV1","asin":"B0000025AK","reviewerName":"Steven Housman \"SHARK\"","helpful":[17,18],"reviewText":"By the time Streisand Superman was released on June fourteen, one thousand, nine hundred and seventy-seven, Streisand was arguably the most powerful woman in show business. Six months prior, she had released A Star Is Born, which was her greatest box office film success to date. The accompanying soundtrack was Number one for six weeks, (the longest running Number one album of her career) which included her co-penned opus \"Evergreen,\" which also learned her an Academy Award for Best Song after spending three weeks at the pole position on the Billboard Hot one hundred. By one thousand, nine hundred and seventy-seven, Streisand was still delivering an album a year, but the fact that she delivered Superman just six months following A Star Is Born was extremely unusual, especially since the soundtrack was still bring high on the charts. The pop success of Streisand was now in full gear, and the songs on Superman were further proof that Barbra, a singer who barely scratched the pop singles chart a decade earlier, was now encroaching into new territory, and radio was finally embracing her. The press dubbed the six-month releases of A Star Is Born and Superman as \"Streisand's one-two punch!\"There were't many female singers (if any) that could release an album that carried a title such as \"Superman\" - and yet it seemed appropriate. Streisand was known for her chutzpah, and her pose on the album cover wearing a skimpy pair of white short-shorts with a tight white it-shirt emblazoned with the Superman logo seemed absolutely fitting. The title and the photo suggested that the queen of entertainment also had balls. And as successful as her career had been prior to 'seventy-seven, she seemed to have reached an even higher speak. It was fascinating to her fans and infuriating to her detractors. Now that I've exhausted the packaging and multiple interior Steve Schapiro photos of the empowered Streisand, let's get to the music. Streisand had finally delivered an entire pop album that was consistent and one that absolutely suited her. The songs ranged from pop ballads such as the hit single, \"My Heart Belongs To Me\" which reached Number four on the Billboard Hot one hundred, to gorgeous sonatas including \"Love Comes From the Most Unexpected Places,\" which was co-written by the prolific Kim Carnes, to rock and roll. From the opening title track, Streisand's vocals soared so effortlessly above the clouds, that when she sang the lyric \"I'm Superman\" with such conviction, you believed she WAS Superman! The entire album is so much fun; it's like cotton candy at a summer carnival. The only exception would be \"Don't Believe What You Read.\" Even though the track was co-written by Streisand and the lyrics were terrific, elucidating the details of her life in the tabloids, the steely rock guitar chords absolutely lacked a hook while repeating a monotonous rhythm. On the other hand, one other song that was co-written by the songbird was the gorgeous ballad \"Answer Me,\" which was originally written for A Star Is Born. Although, it did't make the final cut to the film and soundtrack, it luckily ended up on this album. Upbeat rhythms such as \"I Found You Love\" and \"Cabin Fever\" captured Streisand's playful side, and since she succeeded so well in this genre on \"A Star Is Born\" (despite what many critics said) it was a given that she continued to show off her versatility as a first rate vocalist that could capture just about every style of music. Speaking of versatility, she even sang a brilliant cover of the Roger (\"King of the Road\") Miller country-tinged ditty, \"Baby Me Baby.\" Two very bright highlights were the albums final two tracks, Billy Joel's luminous \"New York State of Mind\" and Rupert Holmes' divine code to independence \"Lullaby For Myself.\" Billy Joel was said to be \"over the moon\" with Streisand's dazzling rendition of \"New York State of Mind\" that the later commented, \"My mother now knew I had made it because Barbra Streisand had recorded one of my songs.\" Barbra Streisand had made it alright. She had conquered just about every medium of entertainment; it was just a matter of time that she dominated the world of pop music. If I had to choose one word to describe Streisand Superman, it would be \"confident.\" This is truly one of the best pop albums of Streisand's discography.","overall":5,"summary":"Superman Soars!","unixReviewTime":1126310400,"reviewTime":"09 10, 2005"}
{"orig_index":7442,"reviewerID":"A1MG6W77QCSCV1","asin":"B0000025AK","reviewerName":"Steven Housman \"SHARK\"","helpful":[17,18],"reviewText":"Six months ago, the released A Star Is Born, this most successful movie in the office so far. First long album) The fact that Superman was only released six months after \"Birth of a Star\" is very unusual. - an album, not a record-breaking artist, sees this top songs on the charts, but when the releases singles, they always become hits, which makes me wonder why no one like Elton John is successful in this genre. However, Barbara cd this is in the album section because all this albums are blockbuster films. \"very successful\" \"Star born\" appeared after the original song, and the sound was very similar to its time: a thousand, nine hundred and seventy. Like Kim Carnes, Paul Williams, Billy Joel, and Barbara herself.","overall":5,"summary":"Superman Soars!","unixReviewTime":1126310400,"reviewTime":"09 10, 2005"}
{"orig_index":7442,"reviewerID":"A1MG6W77QCSCV1","asin":"B0000025AK","reviewerName":"Steven Housman \"SHARK\"","helpful":[17,18],"reviewText":"At the time Streisand Superman was released on June fourteen, one thousand, nine hundred and seventy, Streisand was the most powerful woman in the show’s business. Six months ago, the released A Star Is Born, which was this biggest film success in the office to date. The accompanying soundtrack is the number six album, (the longest running album number of this career) which includes the opus they wrote “Evergreen,” which also won the Academy Award for Best Song after spending three week in column position. on the Billboard Hot hundred. One thousand, nine hundred and seventy -seven, Streisand is still releasing an album of the year, but the fact that Superman spa for it six months after the Star was born is remarkable, especially since the music is in the chart still. . Streisand’s pop success is now in full swing, and Superman’s songs are further proof that Barbra, a singer who barely scratched the pop of her pop ten years ago, has already flooded the earth. before, and finally the radio was over. The media called the six-month release of A Star Is Born and Superman as \"Streisand's one-two punches!\" yet seems appropriate. Streisand is known for this chutzpah, this album cover-up look with a pair of short white shorts with a tight white shirt with the Superman logo emblazoned on it looks perfect. The title and photo suggest that the entertainment queen also has a ball. No matter how successful the was in this career before the seventies, the seemed to have reached a higher level. It was attractive to its fans and infuriated the founders. Now that I’ve finished packing and lots of photos inside Steve Schapiro’s mighty Streisand, let’s move on to the music. Streisand finally released an entire pop album that was consistent and none of them matched it. Songs range from popular singers to the single-hit single, “My heart is mine” which reached number four on the Billboard Hot Hundred, and beautiful sonatas including “Love comes from places I don’t know. expect, \"they wrote together. Kim Carnes, to shake and roll. From the trajectory of the opening title, Streisand’s voices echoed in the cloud, that when the sang the song “I’m Superman” with such a sentence, you believed it was Superman! The whole door was very interesting; like cotton candy for the summer carnival. The only exception is \"Don't believe what you read.\" While Streisand’s way of writing and the lyrics together is beautiful, explaining the details of this life in the tabloids, the metal guitar strings completely close the hook by repeating the creative rhythm. On the other hand, another song written by song bird is a beautiful album called “Answer Me,” originally written for A Star Is Born. Although, they did’t do the final cut of the film and music, but luckily it ended up on this album. Beats like “I Found You I Love You” and “Cabin Fever” captured Streisand’s team, and because of its successful win over “A Star Is Born” (although many critics said it) it was a hit . because the continues to show this effectiveness as a first-class vocalist who can handle any type of music. Speaking of talent, the even sang a beautiful cover for Roger (\"King of the Road\") tiny of Miller's ditty country representative, \"Baby Me Baby.\" Two things that really shine are the latest albums on both tracks, Billy Joel's bright \"New York State of Mind\" and Rupert Holmes's sacred freedom code \"Lullaby For Myself.\" Billy Joel is said to be “above the moon” along with Streisand’s stunning translation of “New York State of Mind” who later commented, “My mother now knows I did it because Barbra Streisand recorded one of my songs. \" Barbra Streisand is good. They succeed in almost every kind of hobby; it was just a time when the ruled the world of pop music. If I chose one word to describe Streisand Superman, it would be \"confidence.\" This is truly one of the best albums of Streisand’s production.","overall":5,"summary":"Superman Soars!","unixReviewTime":1126310400,"reviewTime":"09 10, 2005"}
{"orig_index":7561,"reviewerID":"A28OGM5C71B1XD","asin":"B0000025BA","reviewerName":"MJH","helpful":[0,0],"reviewText":"One of the greatest singer-songwriter albums of all time. Every song is great and this sets the standard for all others. Must-have for any music collection.","overall":5,"summary":"All Time Classic","unixReviewTime":1369008000,"reviewTime":"05 20, 2013"}
{"orig_index":7561,"reviewerID":"A28OGM5C71B1XD","asin":"B0000025BA","reviewerName":"MJH","helpful":[0,0],"reviewText":"This is the best singer-songwriter of all time.","overall":5,"summary":"All Time Classic","unixReviewTime":1369008000,"reviewTime":"05 20, 2013"}
{"orig_index":7561,"reviewerID":"A28OGM5C71B1XD","asin":"B0000025BA","reviewerName":"MJH","helpful":[0,0],"reviewText":"Every song is beautiful, setting standards for all other songs. One of the greatest artist-song-albums of all time. You must have any music collection.","overall":5,"summary":"All Time Classic","unixReviewTime":1369008000,"reviewTime":"05 20, 2013"}
{"orig_index":8454,"reviewerID":"A2NQUGGYM0DBM1","asin":"B0000025RI","reviewerName":"L.A. Scene","helpful":[9,16],"reviewText":"When an album sells somewhere around thirty million copies and it is the biggest selling album in the history of the music business, it does garner my attention. Therefore, separating out Michael Jackson's personal life from this music - I deed to review this one thousand, nine hundred and eighty-two release \"Thriller\". Looking at this album strictly from a creative musical standpoint, I do think this album is overrated. For this album, Jackson and producer Quincy Jones assemble a powerful team of musicians. These musicians - while very talented probably were't the reason why this collection became the monster-selling album that it became. Simply put, this album sold because it came along at the right time - and was marketed very well to fit in with the times. The musicians that contribute to this album are big names. There probably karen't many names bigger than Paul McCartney. McCartney is well known for this entertaining duet with Jackson on \"The Girl is Mine\". However, there are many other big names that contributed collection as well: James Ingram (background vocals on \"Wanna Be Starting Somethin'\", songwriter of \"P. Y. T. (Pretty Young Thing)\"), Toto's David Paich (an arranger on \"The Girl is Mine\", Synthesizers on \"Human Nature\" and \"The Lady in My Life\"), Mega-producer David Foster (Synthesizer arrangements on \"The Girl is Mine\"), Vincent Price (provides the famous sinister 'rap' on \"Thriller\"), Eddie Van Halen (a guitar solo on \"Beat It\"), Toto's Steve Porcaro (Songwriter of \"Human Nature\", Synthesizer on \"Beat It\", \"Human Nature\", and \"The Lady in My Life\"), Toto's Steve Lutkather (Guitars and Bass on \"Beat It\", Guitars on \"Human Nature\"), Toto's Jeff Porcaro (Drums on \"Beat It\", \"Human Nature\", and \"The Lady in My Life\"), and LaToya and Janet Jackson (background vocals on \"P. Y. T (Pretty Young Thing)\" Finally, acclaimed keyboard player and studio musician Greg Phillinganes (who worked on Lionel Richie's \"Cant' Slow Down\" and Donald Fagen's \"The Nightfly\" - two outstanding albums in this era) contributes to several of the tracks on the collection. As for the Toto band members, I do feel their contributions are overlooked. They had only one year ago released their own critically acclaimed album - \"Toto IV\" and now they were working on \"Thriller\" and Lionel Richie's \"Can't Slow Down\" - two of the largest selling albums of this time period. I don't feel it was Michael Jackson's vocals for any of the outstanding talent that helped this collection become the blockbuster seller that it became. This album was released in December, one thousand, nine hundred and eighty-two. This was a time the music industry was undergoing change. This was the beginning of the page of music video. I give Michael Jackson and this management team credit. They take what I consider a mostly average set of songs, but they marketed it with some very clever music videos. Say what you want about Michael Jackson's music - but the did make the most of this medium. The videos basically became a marketing machine for this album - and it resulted in seven Top ten hits of the nine songs on \"Thriller\" in the United States. (The title track \"Thriller\" is probably the best example of this). There are several reasons why this album is \"average\" at best:- The Percussions are awful. Despite having one of the best drummers and musicians in the business in Toto's Jeff Porcaro, this album basically takes a bunch of music and puts a disco dance beat behind them. There is very little in the way of any solid drumming on this album.- There is little in the way of any cohesion on this album. Yes it did have a mixture of styles (the Rock-edge on \"Beat It\" to the R&B; Style of \"Baby Be Mine\" and \"The Lady in My Life\" to the campy \"The Girl is Mine\"). A lot of times this happens when there are \"too many cooks in the kitchen\" - while there was a vast array of talent, I do feel that eventually this impacted the final product (even Quincy Jones could't fix that).- There is nothing groundbreaking in terms of the music on this album. Yes, the music videos were groundbreaking - but not the music.- One thing I discovered is that Michael's songwriting did't really shine. I thought it was the songs written by \"outsiders\" that were better. The Steve Porcaro \"Human Nature\" penned song is probably the strongest effort on the collection. Rod Temperton is very underrated on this album. Many people don't realize that the wrote the \"Thriller\" track (while it in't my favourite, it is probably the only innovative track of the collection). Temperton also wrote the two underrated R&B; itunes - \"Baby Be Mine\" and \"The Lady in My Life\". As for the positives:- The strong points are the contributions of the Toto band members. As mentioned, \"Human Nature\" is probably the strongest track. While I've never been a fan of \"Beat It\", there is some good instrumentation in there. I actually feel if \"Beat It\" was just done as an instrumental without the disco beat - it would sound good.- Eddie Van Halen does give a terrific solo on \"Beat It\".- If you are a Synth-Pop fan, this album (with the exception of \"Beat It\") is going to provide plenty of it. The liner notes include all of the lyrics and do a good job at providing musician and songwriting credits. Overall, when I look at this collection - I just don't think it is the greatest album of all time. I would even say that for the year it was \"Album of the Year\" that The Police's \"Synchronicity\" and Lionel Richie's \"Can't Slow Down\" were miles ahead of \"Thriller\". The bottom line is that if there were no music videos, this would have been just another heights Synth-Pop album. If you are curious on what all the hype is - then you may want to get this collection - otherwise I don't recommend it.","overall":2,"summary":"Came along at the right time - but not a lot of substance","unixReviewTime":1110153600,"reviewTime":"03 7, 2005"}
{"orig_index":8454,"reviewerID":"A2NQUGGYM0DBM1","asin":"B0000025RI","reviewerName":"L.A. Scene","helpful":[9,16],"reviewText":"\"Thriller\" is the best-selling album in the history of the music industry. In this album, Jackson and producer Quincy Jones make a strong band of musicians. The musicians who contributed to the album were great names.","overall":2,"summary":"Came along at the right time - but not a lot of substance","unixReviewTime":1110153600,"reviewTime":"03 7, 2005"}
{"orig_index":8454,"reviewerID":"A2NQUGGYM0DBM1","asin":"B0000025RI","reviewerName":"L.A. Scene","helpful":[9,16],"reviewText":"When the album sold about thirty million copies and was the best-selling album in the history of the music industry, it caught my attention. So, to dive Michael Jackson's personal life into this music — I decided to check out the one-eighty-two \"Thriller\" released. A closer look at this album from the perspective of music creation, I think this album is full of more. In this album, Jackson and producer Quincy Jones make a strong band of musicians. These singers - although very talented, may not be the reason why this list has become the best-selling album. In short, the album sells well because it appeared at the right time - and it sold well to keep up with the times. The musicians who contributed to the album were all great names. There may not be many bigger names than Paul McCartney. McCartney is famous for her role with Jackson in the film \"My Girl\". However, there are many other great names that have contributed to the collection: James Ingram (the origin of the consensus \"You want to start something\", songwriter \"PYT\"), David of Toto Paper (The arrangement of \"Girls\" is mine \", synthesizer of\" Humanity \"and and \"The Lady in My Life\"), lead producer David Foster (set of \"My Girl\" synthesizer), Vincent Price (co-star of the famous \"rap\" on \"Thriller\"), Eddie Van Halen (guitar solo on - \"Beat It\"), Steve Porcaro by Toto (song and song \"Creation of Man\") Author, synthesizer of \"Beat It\", \"Creation of Man\" and \"Lady in My Life\"), Steve Lutkather of Toto (guitar and bass in \"Beat It\", guitar in \"Man's Creation\"), Toto Jeff Porcaro (drums \"Beat It\", \"The Creation of Humanity\" and \"The Lady in My Life\"), and background origins with LaToya and Janet Jackson (\"PY T (Pretty Young Thing) \"Keyboardist and studio artist Greg Phillinganes (who participated in Lionel Richie\" Cant ' Slow Down \"and Donald Fagen's\" The Nightfly \"- two great albums at this time) many songs in the series As for the members of Toto, I feel like their contribution is ignored. They only released their best album - \"Toto IV\" last year, and now they're doing \"Thriller\" with Lionel Richie's \"I Can't Be Slow\" - two of the best-selling albums of the time. I don't think it was Michael Jackson's singing about any great talent that helped the series become the best buyers. This album was released in December, one thousand nine hundred and eighty-two. A time of change in the music industry This is the beginning of a music video page. I believe in Michael Jackson and the management team. They used what I think is a collection of popular songs, but they used some very clever Encouragement Say what you think of Michael Jackson's music — but they used the full subscription. These videos became the selling machine for this album - leading to American \"Thriller\" seven of the top ten songs in nine songs. (The title track \"Thriller\" may be the best example) There are many reasons why this album is such an \"average\" perfectly: -Percussion is terrible. Oto Jeff Porcaro of soto has one of the drummers and musicians in the industry, but the album uses music and disco dance behind them. There is no solid cover on this album. -This album is not cohesive. Yes, it combines different styles (\"Beat it\" rock style to R&B; \"Baby Be Mine\" and \"The Lady in My Life\" style to bumpy \"The Girl is Mine\"). Many times this happens when there are “too many chefs in the kitchen” —even though there are so many talents, I feel like this affects the final product (even though Quincy Jones can’t solve this problem). -There is nothing concrete about the music in this album. Yes, music videos are basic — but not music. -The only thing I found was that Michael's song did't shine. I think songs written by \"outsiders\" are better. Steve Porcaro's song \"The Nature of Man\" could be the most powerful work on the list. Rod Temperton is underestimated in this album. Most people don't realize that the \"Thriller\" track is made by them (although it's not something I like, it may be the only new way in the list). Temperton also wrote two low-profile R&Bs; iTunes- \"Baby Belongs to Me\" and \"The Lady in My Life\". In terms of benefits: -Profits are contributions of Toto band members. As mentioned earlier, “personality” may be the strongest track. While I’ve never been a fan of “Beat It”, there are some good tools in it. I honestly think that if “Beating” was done just like instrumental music without disco songs — it sounds good. Eddie Van Halen has provided a big solo in \"Beat It\". -If you are a fan of pop music, this album (with the exception of \"Beat It\") will provide a lot of content. The liner notes include all the lyrics and do a good job of providing the musicians and songwriting credits. Overall, when I look at this album — I don’t think it’s the best album never. I would even say that this year's \"Album of the Year\", police \"Synchronization\" and Lionel Ritchie's \"Can't Slow Down\" travelled miles ahead of \"Thriller\". Most importantly, if there is no music video, this will be another pop-up album. If you are interested in all the hypocrisy - you may want this list - otherwise I would not recommend it.","overall":2,"summary":"Came along at the right time - but not a lot of substance","unixReviewTime":1110153600,"reviewTime":"03 7, 2005"}
{"orig_index":8938,"reviewerID":"A1PGC1GEBY9CZU","asin":"B00000264E","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":"Balance of Power proves to be a sad album over all. It is reflected in the sound and material. Prophetically, it also tolls the bells of demise of ELO as we knew it; the ELO of Jeff Lynne at the helm. Peaking at position nine and forty-nine in the UK and US respectively, Balance of Power was the last appearance of Lynne until fifteen years later with the release of Zoom. In this album Lynne and company (Bev Bevan and Rich Tandy) intone a sadness to the music. We know the send is neigh. Auvoir, ELO. Vaya icon Dios.","overall":5,"summary":"There Was Ol&eacute;  ELO, This is Adios ELO","unixReviewTime":1398470400,"reviewTime":"04 26, 2014"}
{"orig_index":8938,"reviewerID":"A1PGC1GEBY9CZU","asin":"B00000264E","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":"The energy balance proved to be a sad record. As we know, it also rang the bell for the demise of ELO; Jeff Lynne's ELO.","overall":5,"summary":"There Was Ol&eacute;  ELO, This is Adios ELO","unixReviewTime":1398470400,"reviewTime":"04 26, 2014"}
{"orig_index":8938,"reviewerID":"A1PGC1GEBY9CZU","asin":"B00000264E","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":"Power Balance proved to be a sad record. Included in sound and materials. Predicting, as we know, rang the bell for the death of ELO; ELO in place of Jeff Lynne. In Levels nine and forty-nine in the United Kingdom and the United States, \"Power Balance\" was Lynne's last appearance until fifteen years later when Zoom was released. On this album, Lynne and her collaborators (Bev Bevan and Rich Tandy) have added grief to the music. We know posting is imminent. Yes, ELO. That is the icon Dios.","overall":5,"summary":"There Was Ol&eacute;  ELO, This is Adios ELO","unixReviewTime":1398470400,"reviewTime":"04 26, 2014"}
{"orig_index":9201,"reviewerID":"A11J3144NAHA2Y","asin":"B0000026J6","reviewerName":"Peter Gueckel","helpful":[0,0],"reviewText":"This is Leonard Cohen's finest and most consistent album. Not one track is filler. Sadly, the never again reached the heights the achieved there, when the really was your man.","overall":5,"summary":"Leonard Is Our Man!","unixReviewTime":1369612800,"reviewTime":"05 27, 2013"}
{"orig_index":9201,"reviewerID":"A11J3144NAHA2Y","asin":"B0000026J6","reviewerName":"Peter Gueckel","helpful":[0,0],"reviewText":"Sadly, when the was really your husband, the never got to the point where you reached him. This is the best and most established album by Leonard Cohen. There is no trace to fill.","overall":5,"summary":"Leonard Is Our Man!","unixReviewTime":1369612800,"reviewTime":"05 27, 2013"}
{"orig_index":9201,"reviewerID":"A11J3144NAHA2Y","asin":"B0000026J6","reviewerName":"Peter Gueckel","helpful":[0,0],"reviewText":"This is the best and most sustainable album by Leonard Cohen. Unfortunately, the height reached there was never reached again.","overall":5,"summary":"Leonard Is Our Man!","unixReviewTime":1369612800,"reviewTime":"05 27, 2013"}
{"orig_index":9201,"reviewerID":"A11J3144NAHA2Y","asin":"B0000026J6","reviewerName":"Peter Gueckel","helpful":[0,0],"reviewText":"This is Leonard Cohen's best album. None of the songs are complementary. Sadly, if it were your man, the never reached the heights there.","overall":5,"summary":"Leonard Is Our Man!","unixReviewTime":1369612800,"reviewTime":"05 27, 2013"}
{"orig_index":9288,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000026T4","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[0,0],"reviewText":"I bought this Alice Cooper album in April two thousand and eleven. It features many well known, musical guest stars, which make this album, \"TRASH\", one hell of a fantastic piece of Rock & Roll. I would like to offer my review & opinion of each song, as follows:one. \"Poison\". This song has the word EXCELLENT written all over it. This song was on the Top forty charts for ten weeks, reaching #seven in October one thousand, nine hundred and eighty-nine. I love this song very much, it's definitely my favourite song incl., there.two. \"Spark In The Dark\". This song is good, but NOT one of my favourites!three. \"House Of Fire\". This was a smaller hit from one thousand, nine hundred and ninety. Another song of\/ the word EXCELLENT written all over it. Joe Perry is a featured guitarist there, which probably explains why the song is so good & also why I love it so much. It is another one of my favourites. Joan Jett is ONE of the co-writers of this song.four. \"Why Trust You\". This is a rather comical song & the words make me laugh a lot. I enjoy this song quite a bit.five. \"Only My Heart Talkin\". One of the ballads that feature Steven Tyler on additional vocals. It was a smaller hit single from one thousand, nine hundred and ninety, although I was never too familiar of\/ this song. I rate this song as passable & it's NOT one of my favourites.six. \"Bed Of Nails\". A smaller hit from one thousand, nine hundred and eighty-nine, which I do REMEMBER & I really like quite well. I think that this song is rather unique.seven. \"This Maniac's In Love With You\". I guess this WASN'T conserved as a hit, but this song was very familiar to me, when I FIRST bought this CD. I like this song a great deal.eight. \"Trash\". Here is the TITLE SONG, which features Jon Bon Jovi on additional vocals. This song is good, but NOT one of my favourites.nine. \"Hell Is Living Without You\". This song is SLOWER, but I like this one, quite well.ten. \"I'm Your Gun\". This song features Kip Winger on additional vocals. This song is only okay, it's my LEAST favourite song to close out this album. I have read on SOME of Amazon's reviews that this was Alice Cooper's COMEBACK album. Even if it was HIS comeback album of one thousand, nine hundred and eighty-nine, I gave this album a five star rating. This album is most definitely recommended.","overall":5,"summary":"Alice Cooper.....1989.....\"Trash\"","unixReviewTime":1364515200,"reviewTime":"03 29, 2013"}
{"orig_index":9288,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000026T4","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[0,0],"reviewText":"\"MAN\" is an amazing rock music. It has many stars for famous music guests. I really like this song, it is definitely my favourite song.","overall":5,"summary":"Alice Cooper.....1989.....\"Trash\"","unixReviewTime":1364515200,"reviewTime":"03 29, 2013"}
{"orig_index":9288,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000026T4","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[0,0],"reviewText":"It has many well-known music tours, making this album \"TRASH\" a rock band. This is a bit of a single single hit since the one thousand, nine hundred and ninetys, though I don’t know much about it \/ this song. The song is ranked in the top forty charts in ten weeks, reaching # seven in one thousand and nine hundred and eighty-nine. I really like this song, it is definitely my favourite song, including, there. A little beat up in one thousand, nine hundred and eighty-nine, I remember and love it so much. Even if the returns to this one, nine hundred and eighty-nine album, I have also given this album five stars. This song is very slow, but I love this song, it's good. Ten.","overall":5,"summary":"Alice Cooper.....1989.....\"Trash\"","unixReviewTime":1364515200,"reviewTime":"03 29, 2013"}
{"orig_index":9700,"reviewerID":"A2BLSJJMGLWY4R","asin":"B0000028RG","reviewerName":"Kenneth Edwards","helpful":[0,0],"reviewText":"Not much you can say about a single song except that I liked it and bought it to put on an audio cd with other songs which I like.","overall":5,"summary":"Great Song","unixReviewTime":1387756800,"reviewTime":"12 23, 2013"}
{"orig_index":9700,"reviewerID":"A2BLSJJMGLWY4R","asin":"B0000028RG","reviewerName":"Kenneth Edwards","helpful":[0,0],"reviewText":"Unless I like it and buy it and put it on an audio CD with some of my favourite songs, you have nothing to say about the song.","overall":5,"summary":"Great Song","unixReviewTime":1387756800,"reviewTime":"12 23, 2013"}
{"orig_index":9700,"reviewerID":"A2BLSJJMGLWY4R","asin":"B0000028RG","reviewerName":"Kenneth Edwards","helpful":[0,0],"reviewText":"Unless I like it I bought it and put it","overall":5,"summary":"Great Song","unixReviewTime":1387756800,"reviewTime":"12 23, 2013"}
{"orig_index":9700,"reviewerID":"A2BLSJJMGLWY4R","asin":"B0000028RG","reviewerName":"Kenneth Edwards","helpful":[0,0],"reviewText":"I bought it to put some of my favourite songs on the audio CD.","overall":5,"summary":"Great Song","unixReviewTime":1387756800,"reviewTime":"12 23, 2013"}
{"orig_index":10288,"reviewerID":"A1BHJY46QTUS7J","asin":"B0000029B0","reviewerName":"Mike \"Mike\"","helpful":[0,0],"reviewText":"The only reason that there are only ten songs is because this disc was made before their comeback in the eighty's. This is the disc for people that liked the Hard-Rocking Pre-Hair Metal days. The only down use is that \"Sweet Emotion\" is unnecessarily edited.","overall":5,"summary":"Perfect for a Fan of 70's Aerosmith","unixReviewTime":1068768000,"reviewTime":"11 14, 2003"}
{"orig_index":10288,"reviewerID":"A1BHJY46QTUS7J","asin":"B0000029B0","reviewerName":"Mike \"Mike\"","helpful":[0,0],"reviewText":"This is a record for those who love the Hard-Rocking Pre-Hair Metal era. The only drawback is that \"Sweet Emotion","overall":5,"summary":"Perfect for a Fan of 70's Aerosmith","unixReviewTime":1068768000,"reviewTime":"11 14, 2003"}
{"orig_index":10288,"reviewerID":"A1BHJY46QTUS7J","asin":"B0000029B0","reviewerName":"Mike \"Mike\"","helpful":[0,0],"reviewText":"The only reason there are only ten songs is because this record was made before the return of the one thousand, nine hundred and eightys. This is an real record for people who love the Hard-Rocking Pre-Hair Metal era. The only mistake that can easily get your claim denied is to fail.","overall":5,"summary":"Perfect for a Fan of 70's Aerosmith","unixReviewTime":1068768000,"reviewTime":"11 14, 2003"}
{"orig_index":11379,"reviewerID":"A2SETXU4UY67C9","asin":"B000002G3A","reviewerName":"Ms Diva \"cycworker\"","helpful":[2,2],"reviewText":"This is by FAR the best CD I own. I don't know who to compare the incomparable Ms Arden to -- I guess the closet would be Sarah McLachlan's Fumbling Toward Ecstacy (another excellent CD I own). My criteria for giving a CD five stars is quite simple: one) can I listen to it without skipping any songs, and two) if it were the only CD I had with me when I was trapped somewhere, could I listen to it lot and not get sick of it? This cd meets both criteria. I could listen to it all day. All of the songs are wonderful, with beautiful, evocative music that flows perfectly with Arden's heartfelt, meaningful lyrics. She truly does have the voice of an angel. As well, she has the wonderful gift of restraint -- you can really feel the emotion behind the words. She never steps over the line into hysterics, and she does't let the instruments overpower her amazing voice. If I really had to pick the best tracks (and I love every single one) it'd be Insensitive, Good Mother and Unloved. This is a CD that belongs in every collection!","overall":5,"summary":"Wow!!!","unixReviewTime":1022371200,"reviewTime":"05 26, 2002"}
{"orig_index":11379,"reviewerID":"A2SETXU4UY67C9","asin":"B000002G3A","reviewerName":"Ms Diva \"cycworker\"","helpful":[2,2],"reviewText":"This is the best CD FAR I have. All the songs are fun, and the music is fun and moving. \"Unsympathetic, good mother, unloved\" is the CD in the whole collection!","overall":5,"summary":"Wow!!!","unixReviewTime":1022371200,"reviewTime":"05 26, 2002"}
{"orig_index":11379,"reviewerID":"A2SETXU4UY67C9","asin":"B000002G3A","reviewerName":"Ms Diva \"cycworker\"","helpful":[2,2],"reviewText":"This is the best CD I have right now. I don't know who can compare to the incomparable Ms. Arden- I think Sarah McLachlan's Fumbling Toward Ecstacy (another great CD I have) is in the closet. My five-star CD rating is simple: one) I can listen to it without skipping songs, and two) if the only CD I have with me when I'm stuck somewhere, can I listen more? Are you bored? The ICD meets these two standards. I can listen all day. All the songs are beautiful, the music is beautiful and inspiring and it goes well with Arden's heartfelt songs and meaning. He has the voice of an angel. Similarly, you have a great deal of self-control - you can really feel the emotions behind the words. He never goes out of this way in hysteria, and the never lets a weapon go beyond this amazing voice. If I had to choose the best jones (I love all the songs), it would’t be a worry, a good from, and a dislike. This CD belongs to the whole collection!","overall":5,"summary":"Wow!!!","unixReviewTime":1022371200,"reviewTime":"05 26, 2002"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":"I first heard Jobim, and boss nova, on a road trip in the summer of one thousand, nine hundred and sixty-five, when I was weight years old. Girl from Ipanema was actually a hit on the radio. I've loved this music never since - it never gets old. Since then I have collected all of the vinyl, CDs and recordings I can find of Jobim, Joao Gilberto and others. This album, and \"Wave\" in particular, is my favourite of all. Mealncholy, sensual, lang, cool - all the great adjectives you can think of apply. Jobim himself playing piano. If you are, for want to be, a romantic, you must get this recording - it will never fail you.","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":"This album, especially \"Wave\", is my favourite. If you want to be a dating person, you will need to get this record.","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":"My first encounter with the manager of Jobhim and Nova was on a road trip in the summer of one thousand, nine hundred and sixty-five, when I was a few years old. If you want to be romantically involved, you will need to find this record — it will never disappoint you. Melancholy, lust, laziness, cool — all the great adjectives you can think of to use. Since then, I have collected all the vinyl records, CDs and recordings I can find about Jobim, Joao Gilberto and others. This album, especially \"Wave\", is a favourite. I have always loved this music — it will never wear out. Spanish girls are more popular on the radio.","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":"I first heard of the manager of Jobim and Nova on the way in the summer of one thousand, nine hundred and sixty-five, when I was a few years old. Ipanema girls are more popular on the radio. I’ve loved this music never since — it will never wear out. Since then, I have collected all the vinyl records, CDs and recordings I can find about Jobim, Joao Gilberto and others. This album, especially \"Wave\", is a favourite. Melancholy, lust, laziness, dating — all the adjectives you think work. Jobin himself plays the piano. If you want to be romantically involved, you will need to find this record — it will never disappoint you.","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11656,"reviewerID":"A23Q1T4MXZHFM7","asin":"B000002GDF","reviewerName":"susumu-5","helpful":[4,4],"reviewText":".thirty-eight Special is a six-men band featuring twin bass guitars and twin drums often what southern rockers are like. Their sixth album in one thousand, nine hundred and eighty-three may be a bit too defined to be southern rock but is one of the finest albums during that time. Despite the black of songwriting genius Jim Peterik of Survivor, they could make the greatest song collections with also great songwriting pair Don Barnes and Jeff Carlisi. This album produced two top twenty hits IF I'D BEEN THE ONE and BACK WHERE YOU BELONG. Actually these songs were the very reason why I became a thirty-eight Special fan. These hits were well received by Japanese yogaku (western music) fans during the winter of one thousand, nine hundred and eighty-three\/eighty-four. I just started listening to yogaku program and I instantly liked these songs. The rest of the album is also great with Don Barnes' melody-driven mellow vocal. ONE OF THE LONELY ONES, TWENTY CENTURY FOX and ONE TIME FOR OLD TIME are also the highlights of this album. Recommended for eighty's pop rock fans, particularly Foreigner and Survivor fans.","overall":5,"summary":"Wild Eyed Southern Boys' Finest Effort","unixReviewTime":1069459200,"reviewTime":"11 22, 2003"}
{"orig_index":11656,"reviewerID":"A23Q1T4MXZHFM7","asin":"B000002GDF","reviewerName":"susumu-5","helpful":[4,4],"reviewText":".thirty-eight The special is a six-member band consisting of two bass and double drums, always resembling southern rock musicians. The sixth album of their one, nine hundred and eighty-three albums can best be described as a rock bottom, but it was one of the best albums of the time. Although songwriter Jim Peterik is black, they can make the best collection of songs with Don Barnes and Jeff Carlisi. This album has produced more than twenty great singles, IF I WAS TO GET BACK TO YOU In fact, these songs are still the reason I am a thirty-eightth special fan. This attack was popular among lovers of Japanese yoga (Western music) in the winter of one thousand, nine hundred and eighty-three\/eighty-four. I just started listening to yoga programs and immediately fell in love with these songs. The other album is also beautiful, The soundtrack to Don Barnes music. ONE OF THE MOST POPULAR PEOPLE, THE TENTH CENTURY CENTURY AND THE PERIOD OF OLD TIMES are also the best on this album. Recommended for pop rock fans in the one thousand, nine hundred and eightys, especially foreigners and surviving fans.","overall":5,"summary":"Wild Eyed Southern Boys' Finest Effort","unixReviewTime":1069459200,"reviewTime":"11 22, 2003"}
{"orig_index":11656,"reviewerID":"A23Q1T4MXZHFM7","asin":"B000002GDF","reviewerName":"susumu-5","helpful":[4,4],"reviewText":".for eighty -eight Special is a band of six people with twin pass guitars and twin drums who are mostly like southern bikers. Their sixth album of one thousand, nine hundred and eighty -three can be somewhat described as the rock of the south but it was one of the best albums of that era. Although black created Jim Peterik’s songs in Survivor, they were table to produce the song’s greatest lyrics by also having the same -writer -greats Don Barnes and Jeff Carlisi. This album has produced two top twenty hits IF I GO BACK WHERE YOU GOT. In fact these songs are what made me a thirty -eight Special Fan. These standards were well accepted by fans of Japanese yogaku (western music) in the winter of one thousand, nine hundred and eighty -three \/ eighty -four. I just started listening to the yoga program and immediately fell in love with these songs. The rest of the door is also great for Don Barnes ’sweet and rhythmic sound. ONE MURDER, THE SECOND SENTURY AND ONE TIME ALWAYS THE CAUSE. It is recommended for eighty rock fans, especially Alien and Savior fans.","overall":5,"summary":"Wild Eyed Southern Boys' Finest Effort","unixReviewTime":1069459200,"reviewTime":"11 22, 2003"}
{"orig_index":11656,"reviewerID":"A23Q1T4MXZHFM7","asin":"B000002GDF","reviewerName":"susumu-5","helpful":[4,4],"reviewText":".thirty-eight Special is a six-man band consisting of twin bass guitars and twin drums that often resemble Southern rockers. The sixth of this one, nine hundred and eighty-three albums may be called rock bottom, but it's one of the best albums of all time. In addition to Survival songwriter Jim Patrick's Dark, the could create the largest collection of songs with two singers, Don Barnes and Jeff Carlisle. The album features two of the best hit films of all time. In fact, these songs became the main reason for me to be a special fan of thirty-eight. The songs were well-received by Japanese yogako (Western music) fans in the winter of one thousand, nine hundred and eighty-nine\/eighty-four. I just started listening to yoga programs and immediately fell in love with these songs. The rest of the album is entertaining and with a cool voice from Don Barnes. One of them, the Base Fox period and an old food period are also featured on this album. Recommended for fans of this rock, especially foreign and surviving fans.","overall":5,"summary":"Wild Eyed Southern Boys' Finest Effort","unixReviewTime":1069459200,"reviewTime":"11 22, 2003"}
{"orig_index":12515,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXU","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"Jackson Browne \/ Late For The Sky: Excellent and entertaining album. It's always a joy to put this one on. Five Stars.","overall":5,"summary":"Excellent Browne album","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":12515,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXU","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"It's always fun to wear this dress. Jackson Browne \/ late in the sky: A great and interesting album. Five stars.","overall":5,"summary":"Excellent Browne album","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":12515,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXU","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"Jackson Browne \/ late in the sky: The best and most interesting album.","overall":5,"summary":"Excellent Browne album","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":12515,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXU","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"Jackson Browne \/ Late For The Sky: An excellent and interesting album. It’s always fun to wear this. Five stars.","overall":5,"summary":"Excellent Browne album","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":13504,"reviewerID":"A1MHOYRJ1JRZYA","asin":"B000002IHQ","reviewerName":"Jon","helpful":[2,2],"reviewText":"This album could very well be ranked one of the finest of the one thousand, nine hundred and heights, if not of all time, right along THRILLER, CAN'T SLOW DOWN, SONGS IN THE KEY OF LIFE, etc. Every track on this album is so fresh and vibrant, just as they were back in one thousand, nine hundred and eighty-five. Purchasing Collins' greatest hits compilation is essential enough to enjoy all of this greatest songs, but a purchase of NO JACKET REQUIRED is essential enough to enjoy an example of a wonderfully crafted, classic album with nothing but excellent tracks.","overall":5,"summary":"ASTONISHING","unixReviewTime":1105228800,"reviewTime":"01 9, 2005"}
{"orig_index":13504,"reviewerID":"A1MHOYRJ1JRZYA","asin":"B000002IHQ","reviewerName":"Jon","helpful":[2,2],"reviewText":"This disc could be listed as one of the best in the thousand, nine hundred and higher, if not all the time, it is in THRILLER, CANNOT DISAPPOINT, SONGS IN FACT. LIFE etc. Buying a Collins collection is important to enjoy all of these great songs, but buying NO BATHROOMS is enough to enjoy a well-produced classic album, nothing but the best songs. Every song on this album is new and full of energy, like going back to one thousand, nine hundred and eighty-five.","overall":5,"summary":"ASTONISHING","unixReviewTime":1105228800,"reviewTime":"01 9, 2005"}
{"orig_index":13504,"reviewerID":"A1MHOYRJ1JRZYA","asin":"B000002IHQ","reviewerName":"Jon","helpful":[2,2],"reviewText":"This album is expected to be listed as one of the best in a thousand, nine hundred and higher, if not all the time, it is in THRILLER, YOU WILL NOT BE HUMILE, SONGS IN LIFE STORE and so on. Every song on this album is new and full of energy, just like every song on this album is new and full of energy, like going back to one thousand, nine hundred and eighty-five. Purchase NO BANKING is NOT enough to enjoy an example of a well-produced classic disc.","overall":5,"summary":"ASTONISHING","unixReviewTime":1105228800,"reviewTime":"01 9, 2005"}
{"orig_index":13504,"reviewerID":"A1MHOYRJ1JRZYA","asin":"B000002IHQ","reviewerName":"Jon","helpful":[2,2],"reviewText":"This album is expected to be listed as one of the largest, nine hundred and higher, if not all the time, in THRILLER, CANNOT BE Slow, SONGS TO LIFE STORE and so on. Every song on this album is new and full of energy, like going back to one thousand, nine hundred and eighty-five. Buying the hottest Collins collections is important to enjoy all of these great songs, but buying a jacket is enough to enjoy a well-crafted album, nothing but the best songs.","overall":5,"summary":"ASTONISHING","unixReviewTime":1105228800,"reviewTime":"01 9, 2005"}
{"orig_index":13506,"reviewerID":"A3SV72ZAHH2IDH","asin":"B000002IHQ","reviewerName":"Josephll \"Reformed Music Addict\"","helpful":[2,2],"reviewText":"When Phil Collins released this third solo album \"No Jacket Required\" in one thousand, nine hundred and eighty-five it hit #one at the Billboard album chart and won a grammy for best pop album the same year. Collins was on top of this career in one thousand, nine hundred and eighty-five-eighty-six. Other then releasing a excellent album, the also was very busy at the time with. First the single \"Against all Odds\" in one thousand, nine hundred and eighty-four that was film music and then Easy Lover with Phil Bailey and \"Invisible Touch\" with Genesis that was released in one thousand, nine hundred and eighty-six. The music on this album was still horn driven with drum solo's but it was the purest of this pop albums, with more positive sound even if it had some great ballads the had left the dark territory of bitterness and self pity. The album starts with the effective pop song \"Sussudio\", the myth asa that the was listening lot to Prince's one thousand, nine hundred and ninety-nine album while touring and wanted to release something on the line. This uptempo pop song was one of this biggest hits. \"Only You and I know\" is a very catchy song with synths and horns, feels a bit dated today but it's a good pop song just the same. \"Long Long way to go\" is a slow ballad like song that features a guest appearance from Sting. Yes you heard right!. \"I don't wanna know\" is a uptempo song, although it discusses the issue about a breakup where the woman wants him back while the's done with it. \"Cos I don't wanna know No, I don't wanna know, She can cry all she wants, She's not gonna bring me back, no no\". \"One More Night\" was also one of the singles from this album, it's also a ballad about this divorce, when the tasks for just \"One More Night\".\"Don't Lose My Number\" is a catch uptempo song with percussion and synths. I was single released maxwell and a decent hook, but not as deep as many of the other contemporary songs. \"Who Said I Would\" reminds a bit of Sussudio, it deaures horns and is also a funky uptempo. The hook is the weakness though but musically it's great with a good horn solo. \"Doesn't Anyone Stay Together Anymore\" is a midtempo song about breakups. \"Inside Out\" is a semi-ballad with a powerful chorus. Features a great guitar solo. \"Take Me Home\" is perhaps the best song there, it got this hypnotic percussion sound in the background, the song itself is a semi-ballad that could have been released much later (it sound like a ninety' song). It's almost six minutes long. The album ends with \"We Said Hello Goodbye\" Beatles inspired title?, however it's a classic ballad without too many cathy instruments used. Overall, this was this most commercial album and this biggest success maxwell. It goes in the same spirit as the previous but it launched more hit-singles and it's lot more positive to listen to lyrically. Essential work, a very good album.","overall":5,"summary":"This \"Jacket\" is Needed","unixReviewTime":1130025600,"reviewTime":"10 23, 2005"}
{"orig_index":13506,"reviewerID":"A3SV72ZAHH2IDH","asin":"B000002IHQ","reviewerName":"Josephll \"Reformed Music Addict\"","helpful":[2,2],"reviewText":"Collins' third album \"No Jacket Needed\" was ranked first on the Billboard album charts, and won the Grammy Award for Best Pop Album this year. One thousand nine hundred and fifty-six, Collins was one of the masterpieces in the field. The music on this album is still played by only the horn drum, but it is the best album on the album.","overall":5,"summary":"This \"Jacket\" is Needed","unixReviewTime":1130025600,"reviewTime":"10 23, 2005"}
{"orig_index":13506,"reviewerID":"A3SV72ZAHH2IDH","asin":"B000002IHQ","reviewerName":"Josephll \"Reformed Music Addict\"","helpful":[2,2],"reviewText":"When Phil Collins released this third album singing \"No Coat Needed\" in one thousand, nine hundred and eighty-five Shi was placed first on the Billboard album board and won Grammy Award for Pop Pop Album one year. Collins was one of the highlights of this career in one thousand, eight hundred and ninety-five. After that, a very good album was released, and it was very busy at the time. The first was single music from the film \"Against all Odds\" from one thousand, nine hundred and eighty-four, followed by Phil Bailey's Easy Lover and Genesis \"Invisible Touch\", released in one thousand, nine hundred and eighty-six. The music of this album is still performed by the speakers of the drama alone, but it is the highlight of the popular album. . The album begins with the official music song \"Sussudio\". Shinhwa asa the has listened to Prince's ninety albums during the tour and wants to publish something on the Internet. This fast-paced pop song is one of the most popular songs. \"Only You and I Know\" is a very interesting song with synthesizer and speakers. Sounds like outdated today, but it's still a good pop song. The \"long way to go\" is a slow ballad with Sto's cameo. Yes you heard right! \"I Don't Want to Know\" is a quick song, even though it discusses the issue of divorce, and a woman wants to come back after a divorce. \"Because I don't want to know no, I don't want to know, she cries when she wants to cry, she won't bring me back, no, no\". \"One More Night\" was one of the songs on the album, and it was a barrage of divorce. \"Don't Lose My Number\" is a song with percussion and synthesizer. I'm Maxwell with a one-time release and a good link, but not as deep as some of the current songs. \"Who said I would do it\" reminds Sussudio, who softens the French horn and is also a fast-growing fashion. Although the link is weak, speaking of music, only a good horn is good. \"No One Is Together\" is a medium song about separation. \"Inside Out\" is a classic song with strong lyrics. He has a beautiful guitar. \"Take Me Home\" is the sweetest song out there. It has sounds that indicate severity in the background. The song itself is a semi-folk ballad and can be released a long time later (sounds like nine out of ten songs). It's about six minutes. The album ends with the Beatles' inspired title track \"Sithi solo salami\", but it's a popular folk song and it does't use a lot of Casey's instruments. Overall, this is Maxwell's best-selling album and a huge success. Its spirit is similar to its predecessor, but it has released more singles, and is even more interesting for listening to songs. Important work, excellent record.","overall":5,"summary":"This \"Jacket\" is Needed","unixReviewTime":1130025600,"reviewTime":"10 23, 2005"}
{"orig_index":13506,"reviewerID":"A3SV72ZAHH2IDH","asin":"B000002IHQ","reviewerName":"Josephll \"Reformed Music Addict\"","helpful":[2,2],"reviewText":"\"Because I don't want to know no, I don't want to know, she cries whenever she wants, she won't bring me back, no, no\". \"One More Night\" is also one of the songs on the album, and also a ballad about divorce, which was the goal of \"One More Night\" at the time. The first was single music from the film \"Against All Odds\" from one thousand, nine hundred and eighty-four, followed by Phil Bailey's Easy Lover and Genesis \"Invisible Touch\", released in one thousand, nine hundred and eighty-six. The album begins with an active pop song \"Sussudio\". Shinhwa asa the has listened to Prince's ninety albums during the tour and wants to publish something online. When Phil Collins released this third album \"No Coat Needed\" in one thousand, nine hundred and eighty-five, it was ranked first on the Billboard Album Chart and won Grammy's Best Pop that same year. \"Take Me Home\" is the sweetest song out there. It has sounds that indicate that you are being hit in the back. The song itself is a semi-folk ballad and can be released a long time later (sounds like nine out of ten songs). \"Only You and I Know\" is a very interesting song with synthesizer and speakers. Sounds like it's out of date today, but it's still a good pop song.","overall":5,"summary":"This \"Jacket\" is Needed","unixReviewTime":1130025600,"reviewTime":"10 23, 2005"}
{"orig_index":15778,"reviewerID":"A3KJ6JAZPH382D","asin":"B000002KO1","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,3],"reviewText":"Those prophetic words come from the breakthrough single \"Brass In Pocket,\" and they completely sum up the debut album from The Pretenders. This band of English scruffy backed up sex-pat Chrissie Hynde and made one of rock's all time great debut albums. At a time when female singers either had to be disco wailers for blues chicks (the sole exception being Heart), Chrissie completely smashed all the old stereotypes and marked a new era in female singers. She, along with vocalists like Pat Benatar and Patti Smith, made it cool for independent women to make music that was sexy because it was't sexual. Remember Pat Benatar's classic quote of \"you break my heart and I'll kick your a**\"? Chrissie was that to the in'th degree.\"The Pretenders\" mixed hard rock and pop sense so flawlessly that the band never again came close to matching it. From the sweet longing of \"Brass In Pocket\" to the cool dismissiveness of \"Up The Neck\" (\"it was all very. run of the mill\"), Chrissie delivered tough and tender in equal doses with full credibility. Having James Honeyman Scott throwing inventive riffs behind almost every song certainly helped, as cd the undeniable power of Martin Chambers and Pete Farndon -- listen to this bass work on \"The Wait\" -- as a rhythm team. (And dammit, why did James and Pete have to OD themselves? When will we never learn?)One of the juicy things about this double disc release is the bonus CD. You get a pair of songs that were't on CD before (save forPirate Radio), \"Porcelain\" and \"Cuban Slide.\" The demos are interesting in just how little they changed before they came on the original album. I chuckled at the \"Roxanne\" quote before the demo of \"Kid\" and was surprised that \"Brass In Pocket\" started out as a down-tempo number. The live tracks show The Pretenders to be incendiary in concert. The packaging itself is a blast, including lyrics! (I guess I was singing the wrong words all these years. )All the chemistry was in perfect coordination there. Even the one moment when Nick Lowe steps in for producer, a cover of The Kinks' \"Stop Your Sobbing,\" can't break the synergy of this album. It remains a timeless debut, standing tall alongside of first efforts of the period from Tom Petty, Elvis Costello, Joe Jackson and The Cars.","overall":5,"summary":"Gonna make you, make you, make you notice","unixReviewTime":1186790400,"reviewTime":"08 11, 2007"}
{"orig_index":15778,"reviewerID":"A3KJ6JAZPH382D","asin":"B000002KO1","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,3],"reviewText":"In front of the \"K\" demo, I smiled at the \"Roxanne\" quote and was surprised that \"Brass in the pocket\" was a slow moving number at first. You will find a couple of songs that have never been seen on CD before (except Pirate Radio), \"Porcelain\" and \"Cuban Slideshow\". From the sweet wishes of \"Brass In Pocket\" to the cold contempt of \"Up The Neck\" (\"All too much. Even the minute Nick Lowe was a producer, the cover of\" Stop Your Sobbing \"by The Kinks,\" It's Impossible to Break the Collaboration on this album. Definitely helpful for James Horniman Scott to put creative skills into almost every song. - as a rhythm band, those predictions come from a single success \"Brass In Pocket\", which fully summarizes the Pretenders' debut album It's a Forever,. Keeping the space and Tom Petty's first effort, -Elvis Costello, Joe Jackson and the car team.","overall":5,"summary":"Gonna make you, make you, make you notice","unixReviewTime":1186790400,"reviewTime":"08 11, 2007"}
{"orig_index":15778,"reviewerID":"A3KJ6JAZPH382D","asin":"B000002KO1","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,3],"reviewText":"These prophecies come from the single \"Brass In Pocket\" and completely summarize The Pretenders' debut album. The step British band has backed up sex shooter Chrissie Hynde and has produced the biggest album in rock history. At a time when female musicians must have been table to mourn the loss of the blues (something other than the heart), Chrissie completely broke all old thoughts and marked a new era for female singers. Together with musicians such as Pat Benatar and Patti Smith, she makes it cool for independent women to make uplifting music because it is not obscene. Do you remember Pat Benatar's words \"You broke my heart, I'm going to kick you **\"? Chrissie is at that point. \"Hypocrites\" blend hard music and pop music so perfectly that the band can no longer match. From the sweet craving for \"Brass In Pocket\" to the cold contempt of \"Up The Neck\" (\"It's all over. The factory is running\"), Chrissie provides the firmness and tenderness of the same dose in a completely reliable way. It certainly helps James Horniman Scott to add creativity to the back of almost every song. (Damn it, why did James and Pete do the OD on their own? When can we never read it? appeared on the original album. Before the demo \"Kid\", I laughed at \"Roxanne \"'s quote and was shocked that\" Brass in Pocket \"was a slow-moving number at first. ! (I think I've been singing the wrong words all these years.) All the chemical reactions are well organized there. The moment Nick Lowe was a producer, the cover of \"Stop Your Cry\" by Kinks could't break the synergy of this album. It's still a timeless start, aside. of the first attempts of Tom Petty, Elvis Costello, Joe Jackson and Cars.","overall":5,"summary":"Gonna make you, make you, make you notice","unixReviewTime":1186790400,"reviewTime":"08 11, 2007"}
{"orig_index":15778,"reviewerID":"A3KJ6JAZPH382D","asin":"B000002KO1","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,3],"reviewText":"They come from a version of the prophetic words \"Brass In Pocket\" and they summarize the first album of The Pretenders. This English Scruffy group sexually supported Chair Handy and made it one of the best rock albums. At a time when female artists had to become green disco singers (Exception Heart), the chair completely broke old peas and ushered in a new era for female artists. She teamed up with artists like Pete Benatar and Patty Smith to make fun music for free women because it was't sex. Remember the old quote from Pat Bennett \"You broke my heart and I will kick you **\"? Chrissy reached the send of the degree. The \"hypocrites\" combined hard rock and pop to make it feel so flawless that the band never came close to matching it. From the sweet anticipation of \"Brass In Pocket\" to the cool dismissal of \"Up The Neck\" (\"Everything was great. The running of the machines\"), Chrissie has honestly brought in the same amount of solid and tender. James Honeyman Scott really helped toss the riff behind almost every song, as Martin Chambers and Pat Freunden's undeniable power - listen to the bass in \"The Weight\" - as a rhythm band. (And why did Demet, James, and Pete have to do the OD themselves? When will we learn?) There's a Honeycomb bonus CD about the release of this double disc. You get songs that were't on CD before (Save Pirate Radio), \"Porcelain\" and \"Cuban Slide.\" Demos are interested in how much they have changed before their first album was released. I laughed when I heard the words \"Roxanne\" before the \"Kid\" demo and was surprised that \"Pocket in Brass\" started with a low speed number. The live track shows the hypocrites in concert as fanatics. The package itself is a blast, including the characters! (I think I've been singing the wrong words all these years.) All the machines were there. Even on one occasion when Nick Lowe joined the producer, \"Stop Your Sobang\" could not break the collaboration of The Kinks Core album. It's a timeless start, with Tom Petty, Elvis Costello, standing by Jackson and Carson's first attempts of the season.","overall":5,"summary":"Gonna make you, make you, make you notice","unixReviewTime":1186790400,"reviewTime":"08 11, 2007"}
{"orig_index":19229,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002OWQ","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[0,0],"reviewText":"using the \"groupie\/life on the road\" concept for this underrated album (wich is arguably their most consistent album). jodeci brings you into their world.it also had great singles off of this album.the only people who hate this cd are those dizzy all girls who wan't to hear jodeci do ballads as if they was singing to them.nevertheless its on this album maxwell but the album first and foremost follows a concept of them being on tour.so its more thematic than just a typical R&B; cd.the first part of the cd is \"the show\" the middle half is the after party, and the last part is the hotel.songs like get on up (my jam!) club of four life, and freaking you (my other jam) were great singles off of this album.plus i honestly like the interludes it makes the album seamless IMHO.the songs just flow right into the next one.either way this was my cd back in the day shortly after i graduated from high school.its their most consistent and underrated album.","overall":5,"summary":"after the hotel","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":19229,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002OWQ","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[0,0],"reviewText":"Maxwell used the concept of \"groupie \/ life on the way\" in the album below. This song is like waking up (my jam!) Club of Four And scaring death is a great single","overall":5,"summary":"after the hotel","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":19229,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002OWQ","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[0,0],"reviewText":"Use \"groupie\" \/ life Along the way listen to jodeci performing traditional songs, as if they are singing. cd The first part of the CD is \"performance\", the middle part is the after-party, and the last place is the hotel. The song is like waking up (my jam!) A four-person club, the death threat (my other jam) has entered. This album is very interesting. And I really like its interlude, it makes a seamless album called IMHO. The song just went into the next one. The bottom plate.","overall":5,"summary":"after the hotel","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":19229,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002OWQ","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[0,0],"reviewText":"of tourism. traditional songs, as if they were singing them. Although Maxwell is on the album, the album begins by following their tourist performance. , the middle side follows the festival, and the last section is a hotel. However, this is my cd one day just after I finished high school. This is their most consistent and consistent album. Use the word \"groupie \/ life on the way\" on the bottom disc (this is their most consistent album).","overall":5,"summary":"after the hotel","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":19557,"reviewerID":"A5A2QE6NECFR5","asin":"B000002PBC","reviewerName":"William E. Adams","helpful":[1,1],"reviewText":"These ten tracks are thoughtful and soulful and mostly mellow. All are well done, and the price asked is fair for a change, considering this is somewhat short given today's CD capabilities. You could put two early Diamond LP's on a CD and add five bucks and still have a bargain. If you like Neil, and don't own this one, grab it quick. If you want an introduction to the young Neil's serious side, this one's your baby.","overall":4,"summary":"One of Neil's best early efforts...","unixReviewTime":1158883200,"reviewTime":"09 22, 2006"}
{"orig_index":19557,"reviewerID":"A5A2QE6NECFR5","asin":"B000002PBC","reviewerName":"William E. Adams","helpful":[1,1],"reviewText":"If you love Neil and it's not yours, please catch it quickly. If you want to know the bad side of little Neil, please get it right away.","overall":4,"summary":"One of Neil's best early efforts...","unixReviewTime":1158883200,"reviewTime":"09 22, 2006"}
{"orig_index":19557,"reviewerID":"A5A2QE6NECFR5","asin":"B000002PBC","reviewerName":"William E. Adams","helpful":[1,1],"reviewText":"These ten songs are well thought out and mostly revolving. Everything is well done, considering the features of today's CD, this is close, so it makes sense to change the price. You can put the first two LPs on the CD, for $ five, and it's still a good show. If you love Neil and it’s not yours, please catch it quickly. If you want to understand the serious side of young Neil, this is your baby.","overall":4,"summary":"One of Neil's best early efforts...","unixReviewTime":1158883200,"reviewTime":"09 22, 2006"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":"This would have been an outstanding album had Paul cut the last five songs, which are all basically throw-aways. However, the first weight songs there are brilliant, with some of Paul's best lyrics and arrangements. The Beatlesque \"My Brave Face\" is catchy and does't contain the insipid lyrics Paul sometimes employs. \"Figure of Eight\" is funky and inspired and \"This One\" is one of Paul's best ballads. \"Put it There\" is a lovely tribute to this father with beautiful acoustic guitar work. I don't think this record compares to \"Tug of War\" for \"Flaming Pie,\" but it's easily Paul's second best album of the eighty's and one of this best solo efforts.","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":", however, discarded. However, the first heavy-metal song was great, with beautiful lyrics by Paul and arrangements. the plain words that Paul sometimes used. The \"eighth figure\" is fashionable and inspired, and \"this\" is one of Paul's finest ballads. \"Put it in there.\" It's a lovely gift from the father of a beautiful acoustic guitar. I don't do it. \"I think this record can be compared to\" Flaming Pie \"for\" Tug of War \", but it could easily be Paul's second favourite album in the one thousand, nine hundred and eightys. : twenty thousand, five hundred and eighty-two> This was the best album in the beginning. The last five songs of the album were cut by Paul, and discarded. Paul uses it occasionally. It may have been Paul's second best album in the one thousand, nine hundred and eighty's and it may have been one of the best songs. times. \"Put it in there\" dear thanks to this dad who has good acoustic equipment if Paul cut the last five songs, this would be a good record, these songs thrown away.","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":"\"Eight Shapes\" is fashionable and very inspiring, \"This\" is one of Paul's favourite songs. \"Put it there\" is a favourite thank you to this dad who has the best of guitar stuff.","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":"It will be a great album Paul cut the last five songs, all of which were originally discarded. However, the first scale songs were very good, along with some of Paul's best songs and arrangements. I think the This record does't compare to \"Tug of War\" for \"Flaming Pie,\" but it's only Paul's second best album in the eighties and one of this single efforts. Best. and using. \"Figure Eight\" is hilarious. and inspiring and \"This One\" is one of Paul's best balls.","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":23389,"reviewerID":"A1Z3LU078VNOA6","asin":"B000003TAW","reviewerName":"C. Wynes","helpful":[2,3],"reviewText":"I bought this record from BMG about ten yrs ago, back when the song \"Buddy Holly\" was popular. Expecting a generic rock album with one hit track, I was pleasantly surprised by the melodic pop-rock goodness that came forth from my stereo. This album has staying power, it remains popular among rock music fans over ten years after its release. Commonly referred to as the \"Blue Album\", this record stands like a aspire towering above its contemporaries. If you buy it out of a sense of ninety's nostalgia, I bet dollars to donuts you will be pleasantly surprised. This is a solid album, nearly every track is a golden nugget of pop vocals and rock guitars. It's Generation X's answer to \"Pet Sounds\" for \"Rubber Soul\". At eleven yrs old now, it probably in't long before rock critics begin to mention it in the same reverential way they mention those old classics of the late sixty's. If one can describe any album as \"essential\", then this is on such a list. One cannot possibly deign to talk about rock music in the ninety's without an awareness of this record.","overall":5,"summary":"Among the greatest rock albums of the 90's","unixReviewTime":1124582400,"reviewTime":"08 21, 2005"}
{"orig_index":23389,"reviewerID":"A1Z3LU078VNOA6","asin":"B000003TAW","reviewerName":"C. Wynes","helpful":[2,3],"reviewText":"\"Blue Album\" is a solid album, almost every song is a gold nugget of pop singers and rock guitars. This is Gen X's response to the critics' response \"The Soul Soul\" to \"The Voice of Pets\", which first mentions it in the same theological way they mention the old classes of the one thousand, nine hundred and sixtys.","overall":5,"summary":"Among the greatest rock albums of the 90's","unixReviewTime":1124582400,"reviewTime":"08 21, 2005"}
{"orig_index":23389,"reviewerID":"A1Z3LU078VNOA6","asin":"B000003TAW","reviewerName":"C. Wynes","helpful":[2,3],"reviewText":"he is now eleven years old, and it may not be long before stone critics start mentioning the classic one thousand, nine hundred and sixtys classics in the same respectable manner. Looking forward to a classic rock album with a song, I was amazed at the value of the stone-producing music produced by my stereo. I bought this record from BMG about a decade ago, when the song \"Buddy Holly\" was very popular. Often referred to as the \"Blue Album\", this record is like a wish that rises beyond their time. This is Gen X's response to the \"Pet Voice\" of \"Rubber Soul\". The album is still standing, and is still popular with rock fans for more than a decade after it was released. This is a strong album, almost every song is a gold song of pop singers and rock guitars.","overall":5,"summary":"Among the greatest rock albums of the 90's","unixReviewTime":1124582400,"reviewTime":"08 21, 2005"}
{"orig_index":23389,"reviewerID":"A1Z3LU078VNOA6","asin":"B000003TAW","reviewerName":"C. Wynes","helpful":[2,3],"reviewText":"I bought this record on BMG about a decade ago when the song \"Buddy Holly\" was very popular. Looking forward to a classic rock album with a song, I was amazed at the value of the stone-producing music produced by my stereo. The album is enduring, and is still loved by rock fans more than a decade after its release. Often referred to as the \"Blue Album\", this record is like a wish that rises beyond their time. If you buy it with the nostalgia of the ninetys, I bet you will be amazed at the dollar on the donuts. This is a solid album, almost all of the songs are gold nugget for pop singers and rock guitars. This is Gen X's response to the \"Pet Voice\" of \"Rubber Soul\". He is now eleven years old, and it was not long before stone critics began to refer to him as a religion as they did from the early one thousand, nine hundred and sixtys. If any album can be described as important, this is a list like this. If you do not understand this record, you will not be complacent about talking about ninetys rock music.","overall":5,"summary":"Among the greatest rock albums of the 90's","unixReviewTime":1124582400,"reviewTime":"08 21, 2005"}
{"orig_index":24183,"reviewerID":"A3559I6Q7RCPP3","asin":"B000005IS1","reviewerName":"Robert Cossaboon \"devil doll\"","helpful":[3,3],"reviewText":"As I tell any friend who will listen to me, this album is hands down (along with the Allman's Fillmore and Who's Live at Leeds) one of the greatest live albums never recorded. The energy of this band is astounding for the year it came out--remember, the airwaves were dominated by the Beatles and Stones and Dylan. No one could have possibly been prepared for the one-two punch of the crunching Rambling \"Rose\/Kick Out The Jams\" (complete with notorious mother**ker intro). And you karen't let off the sonic ride so easily either; next is the decadent, but no less frenzied \"Come Together\"---in the darkness! \"Rocket Reducer No. sixty-two\" and \"Borderline\" continue the space--the solo for Rocket is particularly . . . well, sonic. \"Motor City Burning\" is the band's most political song, but don't listen to it for its timepiece value--listen to it for that devastating twin guitar attack of Fred Sonic Smith and Wayne Kramer; those dual solos at the same time send a shiver down my spine every time! \"I Want You Right Now\" is a slow, incendiary LOUD song--it should have been the closer for this album. \"Starship\" is the real closer and what a closer it is! You can only imagine what the light show (if there never was any) must've been like while they were blasting through this. Their choice of a Sun Ra cover is remarkable, because it reveals a musical diversity you don't exactly glean from a first listening of this album. Sun Ra was another true pioneer of this field; the was a jazz musician who would soberly look you in the eye and claim the was from Saturn. His music is also 'out there'; it's no wonder that the MCfive saw in him a kindred spirit. The only two problems a first-time listener will have will be with Rob Tyner's vocals, which are more like howls; the does't have an attractive voice and it takes some getting used to. Also, \"Starship\" takes some patience to get through on the first and second listening--a true freakout in every sense of the word. If you want to know what the MCfive became after they broke up, listen to any punk band of the seventy's and early eighty's. Listen to Iggy and the Stooges if you want a contemporary with the same flavor. Listen to Patti Smith's first three albums. Above all however, listen to the source, these guys---and play it cloud!","overall":5,"summary":"Raw and totally unrestrained","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":24183,"reviewerID":"A3559I6Q7RCPP3","asin":"B000005IS1","reviewerName":"Robert Cossaboon \"devil doll\"","helpful":[3,3],"reviewText":"This album (along with Allman's Fillmore and Who's Live in Leeds) is one of the best live albums never recorded. The strength of this belt is amazing in the year it came out.","overall":5,"summary":"Raw and totally unrestrained","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":24183,"reviewerID":"A3559I6Q7RCPP3","asin":"B000005IS1","reviewerName":"Robert Cossaboon \"devil doll\"","helpful":[3,3],"reviewText":"As I told any friend who could listen to me, this album (and Allman's Fillmore and Who's Live at Leeds) is one of the best albums never recorded. The band's performance was impressive year-round - remember that radio waves were controlled by the Beatles and Stones and Dylan. No one can prepare a punch for two in the noisy \"Rose \/ Kick Out the Jams\" (introduced by the famous mother ** over). And you will not give up the journey of sound easily; the next one is down but the same opposite \"Come Together\" - it's dark! \"Rocket Reducer sixty-two\" and \"Borderline\" continue the space - Rocket's solo is very important. . All right, Sonic. \"Motor City Burning\" is the band's main political song, but don't listen to it because of its watchmaking price - listen to it because of the two devastating guitars of Fred Sonic Smith and Wayne Kramer Attack; those two solos simultaneously formed my back. Cool all the time! \"I Want Now\" The \"Starship\" is really close, so close! You can only imagine if the light show (if it did’t) would look like it when they blew this up. Their selection of Sun Ra cover is excellent because it reveals a variety of music that you would not have fully understood when you first listened to this album. Sun Ra is another true pioneer in that area. That’s a jazz musician, the’ll look into your eyes calmly and say it’s from Saturn. His music is \"out\"; no wonder McCfive sees the same spirit in him. The only two problems that first-time listeners will encounter is Rob Tyner's voice, which is similar to howling; no word is charming, and it takes time to get used to it. In addition, \"Starship\" requires patience during the first and second listening sessions - either way, this is a rare occurrence. If you want to know what MCfive became after their split, listen to any punk band from the seventys and early eightys. If you want modern music with the same taste, listen to Iggy and Stooges. Listen to Patti Smith's first three albums. However, the important thing is, listen to the source, these people are playing with the cloud!","overall":5,"summary":"Raw and totally unrestrained","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":24183,"reviewerID":"A3559I6Q7RCPP3","asin":"B000005IS1","reviewerName":"Robert Cossaboon \"devil doll\"","helpful":[3,3],"reviewText":"\"Motor City Burning\" is the band's most political song, but don't listen to it because of its watchmaker price - listen to and listen to the double guitar attack by Fred Sonic Smith and Wayne Kramer; Those two solos at the same time keep my back cool all the time! As I told any friend who would listen to me, this album (along with Allman's Fillmore and Live in Leeds) is one of the biggest albums never recorded. In addition, \"Starship\" requires patience during the first and second listening times - in any sense, this is a real problem. \"I Want You Now\" is a slow, uplifting LOUD song - you need to get closer to this album. If you want to know what McCfive became after their split, listen to any punk band from the seventys and eightys. And you will not give up the journey of sound easily; the next one is down but the same opposite \"Come Together\" - it's dark! The only two problems that first-time listeners will encounter is Rob Tyner's voice, which is similar to howling; no word is charming, and it takes time to adjust.","overall":5,"summary":"Raw and totally unrestrained","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":24923,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0000064PN","reviewerName":"Chris","helpful":[0,0],"reviewText":"This is a good release they have some hardcore Rhymes on this.yes at times they are not the best craps but they are pretty good. Not up to par with Dah Shinin but it works out good. Lyrics-eight Production-seven X Factor-seven Classic-eight Replay-sevenTotal=seven.five out of ten Fingers","overall":4,"summary":"Smif N-Wessun is back this time as Cocoa Brovaz","unixReviewTime":1095120000,"reviewTime":"09 14, 2004"}
{"orig_index":24923,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0000064PN","reviewerName":"Chris","helpful":[0,0],"reviewText":"This is a great release from some of the Hardest Songs. Sometimes they are not the best but they are very good. Until","overall":4,"summary":"Smif N-Wessun is back this time as Cocoa Brovaz","unixReviewTime":1095120000,"reviewTime":"09 14, 2004"}
{"orig_index":24923,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0000064PN","reviewerName":"Chris","helpful":[0,0],"reviewText":"This is a good version, they have strong sounds. Yes, sometimes they are not the best dice, but they are very good. Can't reach Dah Shinin, but it works well. Song-Product Eight-Seven X Items-Seven Classes-Recovery Seven-sevenTotal = Five Fingers Ten","overall":4,"summary":"Smif N-Wessun is back this time as Cocoa Brovaz","unixReviewTime":1095120000,"reviewTime":"09 14, 2004"}
{"orig_index":24923,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0000064PN","reviewerName":"Chris","helpful":[0,0],"reviewText":"This is a good translation, they have some difficult songs. Sometimes they are not the right dice, but they are good. Not yet accessible Can't access Dah Shinin, but it works fine.","overall":4,"summary":"Smif N-Wessun is back this time as Cocoa Brovaz","unixReviewTime":1095120000,"reviewTime":"09 14, 2004"}
{"orig_index":26167,"reviewerID":"ADVX0P3EIKWBK","asin":"B000009QPA","reviewerName":"Darth Wader","helpful":[2,3],"reviewText":"From what I read, Johnny Cash did't plan on having the dogs next to him on the CD cover. But during the photoshoot, two dogs iran over to him and just sat there. Click, there you go, one of the best CD covers never! And guess what? This CD is one of the best of all time as well. His voice is so powerful, especially for this page, and with Rick Rubin getting Johnny out of this comfort zone on songs you would not expect, Cash excels with a bare-bones, stripped down sound that accentuates each word the sings. With songs written by: Loudon Wainwright, Leonard Cohen, British rocker\/ex-son-in-law Nick Lowe, Tom Waits, death-metal god Glenn Danzig, and Cash himself, what you get is a grab-bag of various styles that Johnny Cash makes into this own style - that style we have loved over the years. Johnny Cash seemed to saved this best material late in this life and this haunting vocals gives you a special feeling every time you listen.","overall":5,"summary":"One of the best CD covers of all time!","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":26167,"reviewerID":"ADVX0P3EIKWBK","asin":"B000009QPA","reviewerName":"Darth Wader","helpful":[2,3],"reviewText":"This CD is also one of the best CDs never. Composed songs include: Loudon Wainwright, Leonard Cohen, Tom Weitz, the god of death Glenn Denzer and Cash himself.","overall":5,"summary":"One of the best CD covers of all time!","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":26167,"reviewerID":"ADVX0P3EIKWBK","asin":"B000009QPA","reviewerName":"Darth Wader","helpful":[2,3],"reviewText":"A song composed by Loudon Wainwright, Leonard Cohen, British singer \/ son-in-law Nick Lowe, Tom Waits, Glenn Danzig, the god of death metal, and Cash. It was Johnny Cash (Johnny Cash) who made a variety of bags, making their own style - a style that has always been popular. His voice is powerful, especially on this page, and with Rick Rubin (Rick Rubin) on your unexpected song to get Johnny out of this comfort zone, Cash is good at using a simple, well-coordinated voice to emphasize all the lyrics. Click and go, one of the best CD covers! From what I have read, Johnny Cash is unwilling to let a dog get close to him on a CD. But during the photo shoot, two Iranian dogs iran up to him and stayed there. Johnny Cash seems to have saved the most important things later in life, and this unforgettable human voice will give you a special feeling every time you listen. This CD is one of the best CDs never.","overall":5,"summary":"One of the best CD covers of all time!","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":26167,"reviewerID":"ADVX0P3EIKWBK","asin":"B000009QPA","reviewerName":"Darth Wader","helpful":[2,3],"reviewText":"From what I've read, Johnny Cash is unwilling to let a dog get close to him on a CD cover. But during the photo shoot, two Iranian dogs iran to him and stayed there. Click and go, one of the best CD locations! Guess what? This CD is one of the best CDs never. His voice is powerful, especially on this page, and with Rick Rubin (Rick Rubin) on your unexpected song to get Johnny out of this comfort zone, Cash is good at using a simple, well-coordinated voice to emphasize all the lyrics. Songs composed by Loudon Wainwright, Leonard Cohen, British singer \/ son-in-law Nick Lowe, Tom Waits, Glenn Danzig, the god of death metal, and Cash. Cash has made its own style. Johnny Cash seems to be storing this much better later in life, and this unforgettable human voice will give you a special feeling every time you listen to it.","overall":5,"summary":"One of the best CD covers of all time!","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":26612,"reviewerID":"A3MGDAFRVY2GEE","asin":"B00000BKJ1","reviewerName":"Manny Ramirez","helpful":[2,2],"reviewText":"Faithless is a band from the UK that is becoming more well-known these days because of Dido. Her brother, Rollo, is the leader of this group along with Maxi Jazz and Sister Bliss. Sunday eightpm is a great listen all the way through with the highlight being the track, God Is a DJ. This is an unbelievable track that would get anyone dancing. Dido's song, \"My Lover's Gone\", is used in Postcards, which is one of the best tracks. She also sings on Hem of His Garment. Even Boy George guest vocals on this CD singing on Why Go? The Garden and Killer's Lullaby are other outstanding tracks. If you like techno\/electronica music and especially Massive Attack as well as Dido, then you need to buy this CD.","overall":5,"summary":"Solid CD","unixReviewTime":999129600,"reviewTime":"08 30, 2001"}
{"orig_index":26612,"reviewerID":"A3MGDAFRVY2GEE","asin":"B00000BKJ1","reviewerName":"Manny Ramirez","helpful":[2,2],"reviewText":"Infidelity is a group from the UK that is becoming increasingly popular. Rollo's brother, along with Sir Maxi and Sister Bliss, is the group's leader. Bitter song, God is a DJ.","overall":5,"summary":"Solid CD","unixReviewTime":999129600,"reviewTime":"08 30, 2001"}
{"orig_index":26612,"reviewerID":"A3MGDAFRVY2GEE","asin":"B00000BKJ1","reviewerName":"Manny Ramirez","helpful":[2,2],"reviewText":"Infidelity is a band from the UK, now it is becoming more and more popular thanks to Dao. Rollo's brother, along with Sir Maxi and Sister Bliss, is the group's leader. Eight to'clock on Sunday evening is a good way to listen. The highlight is the song, and God is the DJ. This is an incredible song that can make anyone dance. Dao's song \"My Lover Is Gone\" is used on Postcards, which is one of the best ways. She even sang on the them of her dress. Even little boy George sang Why are you going as the lead singer on this tour? Garden and Lullaby Assassin are some of the best songs. If you like techno \/ electronica music, especially the big hit with Dido, you will need to buy this CD.","overall":5,"summary":"Solid CD","unixReviewTime":999129600,"reviewTime":"08 30, 2001"}
{"orig_index":27820,"reviewerID":"A9Q28YTLYREO7","asin":"B00000GBZ0","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[4,5],"reviewText":"DJ QUIK is A Music Genius Period. This First Disc is still Blazing. Tonite is the Cut.that song gets you into the club party Mood. Quik Plays Instruments&Is a Solid Rapper.but this Ear for Production is Tight. He has a Rick James Vibe Going on. Quik's Groove is a Classic. Quik has been Bad for many Years.","overall":5,"summary":"Slammin&quot;","unixReviewTime":954460800,"reviewTime":"03 31, 2000"}
{"orig_index":27820,"reviewerID":"A9Q28YTLYREO7","asin":"B00000GBZ0","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[4,5],"reviewText":"Tonite Cut. That song allows you to join the Mood group. This first set is still hot. Quik can play musical instruments and is a reliable wrapper. But the years used to make it are very strong. Quik's Groove classic. Quik has been broken for years. DJ QUIK is a time of professional music. You have a Rick James Vibe going on.","overall":5,"summary":"Slammin&quot;","unixReviewTime":954460800,"reviewTime":"03 31, 2000"}
{"orig_index":27820,"reviewerID":"A9Q28YTLYREO7","asin":"B00000GBZ0","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[4,5],"reviewText":"QUIK's first CD is still burning. There’s a Rick James Vibe going on.","overall":5,"summary":"Slammin&quot;","unixReviewTime":954460800,"reviewTime":"03 31, 2000"}
{"orig_index":27820,"reviewerID":"A9Q28YTLYREO7","asin":"B00000GBZ0","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[4,5],"reviewText":"DJ QUIK is a time of musical part. The first set is hot. Tonite is a Cut. This song puts you in the mood for a club party. Quik can play musical instruments and is a reliable wrapper. But the years used to make it are very cramped. You have a Rick James Vibe going on. Quik's Groove classic. Quik has been broken for years.","overall":5,"summary":"Slammin&quot;","unixReviewTime":954460800,"reviewTime":"03 31, 2000"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"This is one of my all time favourite albums. Alison Krauss has made an incredibly personal album, that is good start to finish. The CD is quite melancholy and sad, but her vocals are simply stunning and bring the material alive. It opens with the wonderful \"Stay\", and moves into the title track. The standout for me is her cover of Todd Rundgren's \"It Wouldn't Have Made Any Difference\", the delivery on this song is so sad but it's a beautiful song. \"Dreaming My Dreams With You\" is a great song to close the album with, with a great chorus. \"Ghost In This House\" and \"Empty Hearts\" are other highlights on the set. There's not even one dud there. If you enjoy bluegrass, for just good music in general, this is the album for you. You won't be disappointed.","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"Alison Krauss has released an incredible solo album, which is a great start. The CD is cloud and sad, but her singing is amazing and life-giving. The best thing for me is that you cover Todd Rundgren's song \"It Would Not Make a Difference\"","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"What stands out to me is that you have covered Todd Rundgren's song \"It Doesn't Make a Difference.\" The stone of the song is sad, but it is also beautiful. \"Dreaming of my dreams with you\" is a great song to send the album, and the chorus is great. If you like bluegrass music just to enjoy good music in general, then this album is for you. It opened with a beautiful \"Stay\" and entered the title song. \"Wind in this House\" and \"Hollow\" are some of the highlights of the set. The CD is sad and sad, but her singing is amazing and brings things to life. Alison Krauss has released an incredible solo album, which is a great start.","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"This is one of my favourite albums. Alison Krauss has released an incredible solo album, which is a great start. The CD is cloud and sad, but her singing is amazing and life-giving. Opened with \"Stay\" entered the title song. What stands out to me is that you cover Todd Rundgren's song, “It Doesn’t Make Any Difference.” The way the song is sung is very sad, but it is a beautiful song. \"Dreaming of my dreams with you\" is a great song to send the album, and the chorus is great. \"Wind in this House\" and \"Hollow\" are some of the highlights of the set. There is no stupid man there. If you like bluegrass music just to enjoy some great music in general, then this album is for you. You will not be disappointed.","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":30316,"reviewerID":"A1XC7W5DKT5NY8","asin":"B000028TV7","reviewerName":"eightpointagenda \"Sean\"","helpful":[0,0],"reviewText":". and its still pretty darn good. The Brown Album(from what I have heard) blacks the energy and creative that makes Primus so great. This record shows defence energy in comparison, but blacks the technical precision that Seas of Cheese, Soda, and Punchbowl have. So what do you have there? I cracked up Primus with its biggest commercial appeal yet(ironically titled Anti-Pop). Now before you hit that negative feed back, consider some of these little titbits:one) Go back to Cheese and listen to the song Eleven. You know why its called Eleven? Because what you are hearing is a eleven\/eight! Weird time signatures used to be key Primus element. That's a lacking part of Anti-Pop.two) Rhythm - The bizarre rhythms are gone. I guess that had something to do with the odd time signatures but I miss the bouncy beat of \"Welcome To This World\".three) Producers - Embracing some artists, Primus took on slew of Producers for this album(Morello, Durst[Yuck!], Copeland, and of course Waits). Their influence shows up and makes this album more accessible than any previous record. And yet, I can still say that this is one great recording. The Bass riffs are still jaw dropping. Ler's guitar playing just keeps getting better. And Brain may still not have made himself of Herb caliper yet, but the's damn good there, adding a nice textured player of drums to the already dense wall of noise. The funk tones there seem stronger than before(certainly a good thing). The only thing is that it really seems like Les is running the well dry for lyrics, that sometimes overshadow the music. This is decent first cutting for beginning Primus fans. Its easy enough to listen to and has some high caliper musicianship. But incompareson to their early stuff, this is not their best. Still, its better than most . out in the music industry today. And though I said it might be their most commercially exceptable album yet, it still won't turn any Primus haters into fans.","overall":4,"summary":"Primus's least impressive work(that I have heard)...","unixReviewTime":1005955200,"reviewTime":"11 17, 2001"}
{"orig_index":30316,"reviewerID":"A1XC7W5DKT5NY8","asin":"B000028TV7","reviewerName":"eightpointagenda \"Sean\"","helpful":[0,0],"reviewText":"The Brown album (as far as I know) makes Primus' such a great power and dark talent.","overall":4,"summary":"Primus's least impressive work(that I have heard)...","unixReviewTime":1005955200,"reviewTime":"11 17, 2001"}
{"orig_index":30316,"reviewerID":"A1XC7W5DKT5NY8","asin":"B000028TV7","reviewerName":"eightpointagenda \"Sean\"","helpful":[0,0],"reviewText":". Still very good. Brown's album (as far as I know) darkens the power and creativity of Primus. In contrast, this record demonstrates self-defense, but it is darker than the technical accuracy of Sea Cheese, Soda Water, and Panzibol. What do you have there? I hacked Primus' biggest commercial attraction so far (comic title Anti-Pop). Now, before you get the wrong answer, please consider the following tips: a) Go back to Cheese and listen to this eleventh song. Do you know why it is called eleven? Because what you heard was eleven \/ weight to'clock! The unusual time signature was once a priority for Primus. That is the missing part of Anti-Pop. B) Rhythm - A strange rhythm disappeared. I think it has something to do with the shocking signature of the time, but I remember the changing motto of \"Welcome to this world\". Three) Producers - Welcoming other artists, Primus hired a large number of producers for the album (Morello, Durst [Yuck!], Copeland, etc., etc. Their influence was evident, making the album more accessible than any previous record. However, I can say that this There is a lot of recording. The only problem is that Les seems to be exhausted because of the vocals, which can sometimes overshadow the music. For young Primus fans, this is a good first program. It's easy to listen to and has great musical talents. of course, the better there are many. In today's music production. While I said this may be the best selling album so far, it will not turn any of Primus' haters into fans.","overall":4,"summary":"Primus's least impressive work(that I have heard)...","unixReviewTime":1005955200,"reviewTime":"11 17, 2001"}
{"orig_index":31461,"reviewerID":"A1XJPGV4KPIQWM","asin":"B00004C4QQ","reviewerName":"\"krusty_the_clown\"","helpful":[0,0],"reviewText":"I never really liked Kryptonite that much- it was an wok song, but it got way too overplayed. It was when I heard Loser that I really got into them. Then once I heard Duck & Run the first time, I thought, \"This cd's mine!\" So I burned it from my friend, and this was, without a doubt, one of THE BEST rock cd of two thousand! No other songs are like Kryptonite- they're hard rock with a Pearl Jam sound. They also sound a lot like Creed on some songs. Great cd, a must for any modern rock collection.","overall":5,"summary":"They're better than I thought.","unixReviewTime":999907200,"reviewTime":"09 8, 2001"}
{"orig_index":31461,"reviewerID":"A1XJPGV4KPIQWM","asin":"B00004C4QQ","reviewerName":"\"krusty_the_clown\"","helpful":[0,0],"reviewText":"Kryptonite is a wok song, but it is widely played. Duck and Run is the first CD I burned for my friend.","overall":5,"summary":"They're better than I thought.","unixReviewTime":999907200,"reviewTime":"09 8, 2001"}
{"orig_index":31461,"reviewerID":"A1XJPGV4KPIQWM","asin":"B00004C4QQ","reviewerName":"\"krusty_the_clown\"","helpful":[0,0],"reviewText":"I did't really like Kryptonite - this was a wok song, but it was very well played. When I heard about Loser, I really liked them. When I heard Duck & Run for the first time, I thought, \"This CD is mine!\" So I burned it to my friend. There is no doubt that this is one of two thousand rock CDs. one! There is no other song like Kryptonite - they are hard rock and Pearl Jam sound. They also sound a lot like Creed in some songs. A great CD, you should have any modern stone collection.","overall":5,"summary":"They're better than I thought.","unixReviewTime":999907200,"reviewTime":"09 8, 2001"}
{"orig_index":32397,"reviewerID":"AM1KNF1AK97SP","asin":"B00004T6UZ","reviewerName":"Jay M \"jay_mc\"","helpful":[1,1],"reviewText":"Songs sound better structured than before and have a much more lasting affect on the listener.'Lush three-one' is one of the best songs on the album, but for the real highlight listen to 'Halcyon'. This is one of my favourite Orbital tracks. Starting off with a solo sample of Kirsty Hawkshaw, the song builds into one of those memorable songs you will be humming for days. A great album.","overall":4,"summary":"It comes together on the second album for Orbital","unixReviewTime":1029369600,"reviewTime":"08 15, 2002"}
{"orig_index":32397,"reviewerID":"AM1KNF1AK97SP","asin":"B00004T6UZ","reviewerName":"Jay M \"jay_mc\"","helpful":[1,1],"reviewText":"'Lush Trinity' is one of the best songs on the album. The highlight is \"Halcyon\".","overall":4,"summary":"It comes together on the second album for Orbital","unixReviewTime":1029369600,"reviewTime":"08 15, 2002"}
{"orig_index":32397,"reviewerID":"AM1KNF1AK97SP","asin":"B00004T6UZ","reviewerName":"Jay M \"jay_mc\"","helpful":[1,1],"reviewText":"\"Lush Trinity\" is one of the best songs on the album, but the best is \"Halcyon\". Starting with a single sample of Kirsty Hawkshaw, this song will be a memorable song you will using for a few days. The song sounds more organized than never before, and it has a lasting effect on the audience. This is one of my favourite songs. A beautiful disc.","overall":4,"summary":"It comes together on the second album for Orbital","unixReviewTime":1029369600,"reviewTime":"08 15, 2002"}
{"orig_index":32397,"reviewerID":"AM1KNF1AK97SP","asin":"B00004T6UZ","reviewerName":"Jay M \"jay_mc\"","helpful":[1,1],"reviewText":"The song sounds more organized than never before, and it has a lasting effect on the audience. \"Lush Triad\" is one of the best songs on the album, but the main one is \"Halcyon\". This is one of my favourite ways. Starting with a single sample of Kirsty Hawkshaw, this song will be a memorable song you will using for a few days. A beautiful disc.","overall":4,"summary":"It comes together on the second album for Orbital","unixReviewTime":1029369600,"reviewTime":"08 15, 2002"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"Greatest hits of the \"former\" Cat Stevens. what else can I say. If you enjoyed this music in the past, then this is a great compilation of that music. Just overlook this latest political gesturing and enjoy this words and music.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"Can.com's \"ex\" Cat Stevens' \"Most Click\" is a good design. Ignore this latest political phenomenon and enjoy it.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"If you liked this music in the past, this is a great compilation of that music. Just ignore this recent political act and enjoy these words and music. \"Forward\" is Cat Stevens' hottest song. What can I say.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"\"Former\" Kat Stevens beat single. What can I say. If you liked this type of music in the past, then this is a great combination of music. Just ignore this recent political act and enjoy these words and music.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":34564,"reviewerID":"AZ1GH4XD61MDH","asin":"B000059T1U","reviewerName":"New England Pat","helpful":[2,2],"reviewText":"Though this singles never did particularly well on the pop charts, with just one Top twenty hit to this credit, Bobby Bland is without question one of the all-time great blues\/R&B artists. Bobby's earthy, gritty and bluesy vocals lacked the smooth, cotton-candy type of singing that would have had crossover appeal but this voice was always true and expressive of the troubles and sorrows of everyday folk. Each track captures Bland's raw soul, especially \"Cry, Cry, Cry\", \"Don't Cry No More\", \"I've Got to Forget You\" (perhaps the best cut on the CD), and \"St. James Infirmary\". This early one thousand, nine hundred and sixty album is the definition of what soul really is, long before the advent of Motown, Stax and the Philly sound became the music of choice of black America. A true pioneer, Bobby Bland offers the best of pure, unvarnished blues that the bands on this disc offer.","overall":5,"summary":"A great CD mirrors the soul of this great singer","unixReviewTime":1275436800,"reviewTime":"06 2, 2010"}
{"orig_index":34564,"reviewerID":"AZ1GH4XD61MDH","asin":"B000059T1U","reviewerName":"New England Pat","helpful":[2,2],"reviewText":"Although this single did not work well on pop charts, only one of the top twenty songs won the title, but Bobby Bland is undoubtedly the greatest \/ R&B single artist. . Bobby's simple, hard and cool voice does not have a smooth melody, like cotton candy with a borderline charm, but this voice remains true, expressing problems and sorrows in everyday life. Each song captures Bland's first soul, especially \"Cry, Cry, Cry\", \"Stop Crying\", \"I Must Forget You\" (probably the best clip on a CD) and \"St. James Infirmary\". one thousand, nine hundred and sixty defines the true meaning of the soul. Long before the advent of Auto City, Stax and Voice of Philadelphia became the music of black Americans. As a true pioneer, Bobby Bland provides the cleanest, unpainted blues. of St James'. \"This album from the early one thousand, nine hundred and sixtys describes the real soul of Meaning, long before the arrival of Auto City, Stax and the Voice of Philadelphia became the music of black Americans. Bobby's simple, heavy, melancholic voice has no smooth melody , like cotton-candy with a across-border charm, but this Sound remains true, expressing problems and sorrows in everyday life., Only one top twenty single wins this award, but Bobby Bu Rand is undoubtedly one of the great blues artists \/ R & B in history. P> Bobby Bland is undoubtedly one of the blues artists \/ R & B in history., Cry, Cry \" R&B history. Each song takes Bland's first soul, especially \"Cry, Cry, Cry\", \"Stop Crying\", \"I Must Forget You\" and \"St James Infirmary\"","overall":5,"summary":"A great CD mirrors the soul of this great singer","unixReviewTime":1275436800,"reviewTime":"06 2, 2010"}
{"orig_index":34564,"reviewerID":"AZ1GH4XD61MDH","asin":"B000059T1U","reviewerName":"New England Pat","helpful":[2,2],"reviewText":"Every clue contains Bland's raw soul, especially \"Scream, cry, cry\", \"Don't cry anymore\", \"I must forget you\" (probably the best cut on the CD) ), and \"St. James Infirmary.\" One thousand, nine hundred and sixty this first album is the definition of what the soul really is, before the advent of Motown, Stax and Philly’s voice became the music of choice for black Americans. In Bobby’s furry voice, the blue voices black the smooth, sweet smelling songs that would have had an interchangeable appeal but this sound is always true and shows people’s problems and sorrows every day. . While they haven’t been particularly good on the pop charts, with only one of the top twenty getting this credit, Bobby Bland was undoubtedly one of the blues \/ R&B artists of the time. A true leader, Bobby Bland delivers the best of the purest, impeccable blues the teams on this plate have to offer.","overall":5,"summary":"A great CD mirrors the soul of this great singer","unixReviewTime":1275436800,"reviewTime":"06 2, 2010"}
{"orig_index":34564,"reviewerID":"AZ1GH4XD61MDH","asin":"B000059T1U","reviewerName":"New England Pat","helpful":[2,2],"reviewText":"Although these singles are not particularly good on the pop charts, including one of the top twenty in this reputation, Bobby Bland is without a doubt one of the artists who greatest never \/ R&B. In Bobby’s furry voice, the blue voices black the smooth, cotton candy that might have an exchange of appeal, but this voice is always true and shows the problems and sorrows of the everyday. tao. Each track holds the raw soul of Bland, especially “cry, cry, cry”, “Don’t cry anymore”, “I have to forget” (probably the best cut on the CD), and “St. James Infirmary “The Thousand, The Nine Hundred and Sixty-first albums are a definition of what the soul really is, even before Motown arrived, Stax and Philly’s voice became the music of black American choice. A true leader, Bobby Bland delivers the best of the purest, impeccable blues the teams on this plate have to offer.","overall":5,"summary":"A great CD mirrors the soul of this great singer","unixReviewTime":1275436800,"reviewTime":"06 2, 2010"}
{"orig_index":38437,"reviewerID":"A1IX1B5KJC5ITH","asin":"B00006690F","reviewerName":"Glen Russell \"Mr. Sound\"","helpful":[6,6],"reviewText":"Em's new CD is heavy. What I mean by heavy is REAL TOPICS. \"White America\" made me sweat bullets, simply because the keeps it real despite the fact that the is white. This song is forcing me to take him seriously, after years of me thinking that the was just punchlines. And when I heard \"Cleaning out my closet\", I was almost not surprised to hear him lyrically abuse this mother, but was shocked when the wished this mother death. He's anti-coroprate (which shows in all of this CD), and disrespectful, but you cant blame him because people in this life made him that way. Every song on this album contains controversial lyrics, from dissing the lyrically fit Canibus on \"Square Dance\", to giving it dirty to Jermaine Dupri. This album Em produced it mostly himself, so the sounds stray away from Dre's gangsta beats and more into the Em's follow my stone beats. The CD is worth the buy even if you are not an Eminem fan because this music gets you in an aggressive mood. to me that just the right mood to get you through the day.","overall":5,"summary":"Another Public Service Announcement: Cleaning out his closet","unixReviewTime":1023321600,"reviewTime":"06 6, 2002"}
{"orig_index":38437,"reviewerID":"A1IX1B5KJC5ITH","asin":"B00006690F","reviewerName":"Glen Russell \"Mr. Sound\"","helpful":[6,6],"reviewText":"\"White America\" ​​is Eminem's new album. Each song on the album contains lyrics that contradict each other. Even if you are not an Eminem fan, the CD is worth buying.","overall":5,"summary":"Another Public Service Announcement: Cleaning out his closet","unixReviewTime":1023321600,"reviewTime":"06 6, 2002"}
{"orig_index":38437,"reviewerID":"A1IX1B5KJC5ITH","asin":"B00006690F","reviewerName":"Glen Russell \"Mr. Sound\"","helpful":[6,6],"reviewText":"The new Em CD is too heavy. What I have said is the very context. \"White America\" ​​made me sweat because even though it was white, it was still real. This song forced me to take it seriously, and after many years I thought it was just a play. When I heard \"I clean my closet\", I was not shocked to hear her abuse the woman, but I was shocked when she wanted the mother to die. He’s not anti-business (this is evident in this CD), and the has no respect for people, but you can’t criticize him because people in this life make him that way. Every song on the album has contradictory lyrics, from denigrating Canibus to \"square dance\" to ruining it with Jermaine Dupri. This album is produced by Em, then the sound is far from Dre's gangster beats, and is further integrated into Em's rock beats following me. Even if you are not a fan of Eminem, this CD is a must buy as this type of music makes you feel awkward. To me, this is the perfect mood to walk you all day.","overall":5,"summary":"Another Public Service Announcement: Cleaning out his closet","unixReviewTime":1023321600,"reviewTime":"06 6, 2002"}
{"orig_index":39400,"reviewerID":"A1KGKPWWG61U42","asin":"B00006I4YD","reviewerName":"John S. Ruzicka \"John R\"","helpful":[7,8],"reviewText":"Every Tori Amos CD is a journey, usually to a dark place, and Scarlet's Walk is no exception. However, the fear and pity of Little Earthquakes have been replaced by a more mature, somewhat detached view. As everyone probably knows by now, the CD is the journey of Scarlet across America.one. Amber Waves -- Great metaphor of America as a porn star, offering lots of empty excitement.two. A Sorta Fairytale -- Probably Tori's most commercial song to date but also one of the most haunting. The way Tori sings \"you lost me in the rearview\" is just heartwrenching.three. Wednesday -- It's nice to hear Tori kick back and have some fun once in awhile. Wednesday sounds like an old time party song.four. Strange -- an interesting look at the disintegration of a relationship.five. Carbon -- this is my favourite song on the CD. The poetry describing a woman's breakdown is stunning, and the baroque-ish piano is perfect for the song.six. Crazy -- a slow, jazzy kind of tune.seven. Wampum Prayer -- a short accapella piece. Not sure why this did't open the CD.eight. Don't Make Me Come to Vegas -- a sultry song about rescuing someone (a friend, an sex, a family member?) in Las Vegas. Fantastic musically.nine. Sweet Sangria -- Has kind of a seventy's Steely Dan sort of sound to it. Takes a while to get into, but definitely grows on you.ten. Your cloud -- this is probably the first Tori Amos song that could be played at a wedding. A very pretty, tuneful song. Perfect for the bride and groom's first dance.eleven. Pancake -- a song about religious intolerance. The \"I ordered you a pancake\" line in the context of the song shows Tori's subtle humour.twelve. I Can't See New York -- a very powerful and emotional song that seems to indirectly be about the nine\/eleven attacks. Hard to listen to. The view from the air part is especially poignant: \"from there, no lines are drawn. From there, no lands are owned.\"thirteen. Mrs Jesus -- I did not like this song at first but now it's one of my favourites. I love the sly reference to the Beatles: \"the gospel change meaning if you follow John for Paul, but could you never Let It Be, the Mary of it all.\"fourteen. Taxi Ride -- another \"hit\". The lyrics seem to reflect an ambivalence about celebrity culture. It was bizarre to see Tori perform this on Regis Philbin's show.fifteen. Another Girl's Paradise -- nice song, but probably my least favourite on the CD.sixteen. Scarlet's Walk -- perfect song that puts the CD into context.seventeen. Virginia -- really captures the flavor of the south. The banjo's are a nice, different touch.eighteen. Gold Dust -- this song brought tears to my eyes. The bittersweet yet defiant way that Tori sings \"I was there!\" always gets me choked up. Tori actually cried when she played this in San Francisco (until some imbecile ruined it near the send by screaming out a song request and was promptly told off by a visibly angry Tori).","overall":5,"summary":"An Amazing Journey","unixReviewTime":1063065600,"reviewTime":"09 9, 2003"}
{"orig_index":39400,"reviewerID":"A1KGKPWWG61U42","asin":"B00006I4YD","reviewerName":"John S. Ruzicka \"John R\"","helpful":[7,8],"reviewText":"I like the Beatles' clever quote: \"If you follow John to change the meaning of the gospel to Paul, but you can do it all, Mary of it all.\" XIV. Another girl is paradise - a beautiful song, but probably my favourite on CD.sixteen. From there, no land towns it. \"Thirteen. Each Tori Amos CD is a journey, usually in a dark place, Scarlet's Walk is not the same. Sorta Fairytale - it may be Tori's best-selling song so far, but it is also one of the best-selling songs. -I did not like this song at first, but now it is one of my favourite songs. Scarlet's Walk they seem to reflect the cultural infidelity of celebrities.","overall":5,"summary":"An Amazing Journey","unixReviewTime":1063065600,"reviewTime":"09 9, 2003"}
{"orig_index":39400,"reviewerID":"A1KGKPWWG61U42","asin":"B00006I4YD","reviewerName":"John S. Ruzicka \"John R\"","helpful":[7,8],"reviewText":"The entire Tori Amos CD is a journey, always in a dark place, and Scarlet's Walk is no exception. However, the fear and sadness of a small earthquake have been replaced by somewhat vague ideas. As we all know, CD is Scarlet's journey through America.one. Amber Waves, America’s biggest metaphor as a porn star, provides endless fun. Two. Sorta Fairytale - Probably Tori's best-selling song so far, but it's also one of the most memorable. The way Tori sang \"You dropped me in the rearview mirror\" is heartbreaking. Three. Wednesday — I’m glad to hear Tori is back and happy sometimes. Wednesday sounds like an old party song. Four. Surprisingly — looking at an interesting breakup of a relationship. Five. Carbon - This is my favourite CD song. Poems depicting the fall of women are amazing, and the baroque piano is perfect for this song. Six. You’re crazy - slow jazz music. Seven. Wampum-Short Prayer appappella song. I do not know why this did not open the CD.eight. Don't make me come to Vasgas - A beautiful song about rescuing someone (friends, sexual partners, family?) In Las Vegas. beautiful music. Nine. Sangria in Sweet-There is the voice of the iron pill from the one thousand, nine hundred and seventys. It will take time to get in, but it will definitely grow in you.ten. Your cloud - this could be Tori Amos' first song to be played at a wedding. Very sweet, very sweet song. The first perfect dance for the bride and groom. Pancake - a song about religious intolerance. The line \"I ordered a pancake\" in the context of the song shows Tori's secret humour. Twelve. I don’t see New York — a very powerful song with emotions that seem to be directly related to the nine\/eleven attack. It's hard to hear. A place in the sky is especially painful: \"From there, there is no line. From there, no earth.\" XIII. Mrs. Jesus — I did not like this song at first, but now it is one of my favourites. I like the Beatles' clever quote: \"If you follow John like Paul, the gospel changes its meaning, but you can do it all, Mary in all of this.\" XIV. Taxi-one \"beat\". These words seem to reflect the moral decay of the celebrities. It's amazing to see Tori perform in Regis Philbin's play. Another girl is paradise - a beautiful song, but probably my favourite on CD.sixteen. Scarlet's Walk-The perfect song, puts the CD in context. Seventeen. Virginia - has really taken on a Southern flavor. Banjo is a beautiful, unique thing. Eighteen. Jin Chen — this song made me cry. Tori sang \"Here I am!\" In a bitter and invigorating way. It always makes me cringe. Tori actually cried while playing in San Francisco (until some stupid people ruined it by shouting a nearby song, and were soon introduced by Tori, who was clearly angry).","overall":5,"summary":"An Amazing Journey","unixReviewTime":1063065600,"reviewTime":"09 9, 2003"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"The two thousand and four Grammy's voters proved what I have always thought. fifty Cents is not talented!! For the first time (in a long time), the Grammy voters did the right by not giving an imposter an award. This cd sold hot, but it is not respected. fifty Cents even lost \"Best New Artist\" and had the nerve to get on stage to \"protest\". He only made himself look bad because no one saw this point (even this fellow wrappers thought it was in bad taste). The worst offence to wrap music this year is fifty Cents's \"Get Rich Or Die Tryin\" which is painfully dated. Gangsta wrap died when twoPac and Biggie died. Plus, this cd is not even \"gangsta\". Its corporate mindless wrap, meant only to make money. I hope fifty realizes that this time is almost up.","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"Fifty cents CDs sell hot, but not respected. Mike was thrown out: The most packed music this year was fifty cents \"Get Rich for Die Tryin\", which is said to have been unintentionally packaged by the company, just to make money. Falling down: I hope the fifty realize that this time is near.","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"Fifty cents even lost the \"Best Newcomer\", and I was embarrassed to take the stage to \"protest.\" The worst crime of packing music this year is the fifty-cent \"Get Rich Or Die Tryin\", which has become obsolete. For the first time (in the long run) Grammy voters did not give a prize to a fraudulent, correct person. He just pretended to be bad because no one saw it (even the packer thought it was bad). Additionally, this CD is not a \"gangsta\". Its ignorant packaging is just making money. Two thousand and four Grammy Award voters confirmed what I had always thought.","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"Two thousand and four Grammy Award voters confirm what I always think. Fifty cents are not smart! ! For the first time (in the long run) Grammy voters did not give a prize to a fraudulent, correct person. This CD is hot, but it has't been honoured. fifty cents even lost \"new\", and I was ashamed to take the stage to \"protest.\" He just pretended to be bad because no one saw it (and the packer thought it was bad). The worst crime of packing music this year is the fifty-cent \"Get Rich Or Die Tryin\", which has become obsolete. When both Pac and Biggie died, Gangsta wrap also died. Additionally, this CD is not a \"gangsta\". Its ignorant packaging is just making money. I hope Fifty understands that this time is near.","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":41596,"reviewerID":"A3VHV0NV7NKQPC","asin":"B00008J2DQ","reviewerName":"irnmtn25","helpful":[0,0],"reviewText":"I thought this album was pretty good. Godsmack seems to grow with every album, and in't that what you would expect from a maturing rock band? STRAIGHT OUT OF LINE, I STAND ALONE, and SINCERITY are great hits. and the rest of the album follows suit. Not to mention, the lead singer is quite nice to look at! :) Anyway, this one is good. so go ahead and give it a try. If you like AIC for any of the alternative bands from the 'ninetys, you'll be table to appreciate this.","overall":4,"summary":"Why all the bad reviews?","unixReviewTime":1073952000,"reviewTime":"01 13, 2004"}
{"orig_index":41596,"reviewerID":"A3VHV0NV7NKQPC","asin":"B00008J2DQ","reviewerName":"irnmtn25","helpful":[0,0],"reviewText":"Godsmack seems to be growing with each disc. Straight, alone, honesty is a big mistake.","overall":4,"summary":"Why all the bad reviews?","unixReviewTime":1073952000,"reviewTime":"01 13, 2004"}
{"orig_index":41596,"reviewerID":"A3VHV0NV7NKQPC","asin":"B00008J2DQ","reviewerName":"irnmtn25","helpful":[0,0],"reviewText":"I think this album is not bad. Godsmack seems to be growing with each album. Isn't that what you expect of a mature band? To be honest, I am the only one, honesty is a big blow. The rest of the album followed suit. Plus, the great singer looks great! :) However, this one is fine. So keep trying. If you like the AIC of any other style in the ninetys, you will appreciate this.","overall":4,"summary":"Why all the bad reviews?","unixReviewTime":1073952000,"reviewTime":"01 13, 2004"}
{"orig_index":44250,"reviewerID":"A3G02Y0UWNWNE5","asin":"B0000DD7LC","reviewerName":"D. Lee","helpful":[1,3],"reviewText":"I've listened to this album again recently and it is even less impressive than I originally thought. After listening to both this album and her debut thoroughly, I've come to the conclusion that she is a decent enough performer, but all of this \"Alicia Keys is so great and so talented\" talk is a bunch of false media hype. This album has a few highlights such as the Kanye West produced (who by the way has much more interesting musical ideas even though the is not a trained musician anywhere near the level of Alicia. I'm referring to this original material of course. I'll take \"Get By\" from \"Quality\" by Talib Kweli over anything else on this album any day) \"You don't know my name\", \"If I main't got you\", \"If I was your woman\" has a really nice melody although I can't really give her too much credit for this remake, and the pooh so smooth and sweet \"Diary\", but most of this album is really lacklustre. There is not much variety on this cd, so the songs mostly run together and send up as a somewhat pleasant amish-mash that seems to constantly swallow in mediocrity. In other words it's not terrible but it's not great either. I expected this album to be a lot more engaging. Sure this album is a little stronger than the average for&b album nowadays which sadly does't take a whole lot to be table to say, but with Alicia's extensive musical background we should expect a lot more. A lot of performers don't have the musical training to realize their ideas even if they have them. Alicia has the training but does't seem to have many fresh ideas. Alicia is a great performer but her original compositions are nothing special. I know that this is only her second album and many of the greatest musicians of your time did't really hit their stride for make their masterpieces until at least their third for fourth album, so perhaps I should reserve judgment for now, but even if you listen to the early albums of most of the greats, you can at least see a special spark that I don't see with Alicia yet. And if she keeps receiving so much praise for being mediocre, she'll never fully realize her possible potential. Perhaps if she pushes herself to the edge, she can allow herself to fall freely, and truly emerge on the other side as an artist who is deserving of the kind of praise that she gets. for maybe not. I'll guess we'll have to just wait and see.","overall":3,"summary":"O.K. but nothing special (2.5 stars!)","unixReviewTime":1109635200,"reviewTime":"03 1, 2005"}
{"orig_index":44250,"reviewerID":"A3G02Y0UWNWNE5","asin":"B0000DD7LC","reviewerName":"D. Lee","helpful":[1,3],"reviewText":"Alicia is doing well, but her first job is nothing special. She is a good actress, but her original There is nothing special about a job. If she has worked. She was highly commended for her departure. alone, the will never see her full potential.) \"You don't know my name\", \"If I can't\", \"If I were your wife\" The song \"is really good, though I can't give her much credit for this change, with Winnie the Pooh as smooth and sweet as\" Diary \", but much of the content of this album is really boring. I know this is only this second album, and most of the great musicians of your time did not do their part at least until the third album of their fourth album, so I should now keep the Judgment, but even if you listen to the first albums of many celebrities, you can see at least special sparks I never saw in Alicia. After listening to this album and this debut album well, I came to the conclusion that the is a decent enough character, but all of these things \"Alicia Keys is so great and have so much talking talent\" are a fake band. Yes, this disc is better than the current & of. Unfortunately, there is not much to talk about the album, but with Alicia's musical background, we have to expect more. Perhaps, if you push yourself, you will allow yourself to fall freely, stand on one side, and become an artist worthy of this praise. This album has some great features, such as Kanye West's production (by the way, you have more interesting musical ideas, even though the's not a professional singer close to Alicia's level. If you continue to benefit from mediocrity. Among this albums, He explored the fast-paced events of the past three years. Music With this album, this album continues. two thousand and three-two thousand and four.","overall":3,"summary":"O.K. but nothing special (2.5 stars!)","unixReviewTime":1109635200,"reviewTime":"03 1, 2005"}
{"orig_index":44250,"reviewerID":"A3G02Y0UWNWNE5","asin":"B0000DD7LC","reviewerName":"D. Lee","helpful":[1,3],"reviewText":"I've listened to this album again recently, and it's not as surprising as I thought . After listening to this album and this first album thoroughly, I came to the conclusion that the is a decent factor, but all these \"Alicia Keys is great and talented\" talk by a team of false news. This album has some highlights, like Kanye West produced (by the way, the has more interesting musical ideas, even though the's not a trained singer near Alicia's level. in Quality 'Taleb Welley,' If I'm Not With You ', \"If I'm Your Wife\" has a very nice song. come out as a fun mix of Amish, who always seems to be obsessed with mediocrity. In other words, it's not scary, but it's not very good. I expect this album to be more attractive. Yes this album is better than the current album of & of. Alicia wide, we should expect more. Most factors are not trained in music Alicia is trained, but what Alicia is an excellent actress, but her first job is nothing special. I know this is only this second album, and most of the great musicians of your time did not make their songs at least until the third album of their fourth album. to Alicia. He has been so in control of the world. of this praise. Maybe not. If I were your wife \"remake","overall":3,"summary":"O.K. but nothing special (2.5 stars!)","unixReviewTime":1109635200,"reviewTime":"03 1, 2005"}
{"orig_index":44250,"reviewerID":"A3G02Y0UWNWNE5","asin":"B0000DD7LC","reviewerName":"D. Lee","helpful":[1,3],"reviewText":"I listened to this album again recently and it was lower than I originally thought. After listening carefully to this album and first meeting it, I realized that she was a very active person, but all this “Alicia Keys is huge and very talented” talk is a lot false media. This door has some key features like the released Kanye West (which are very interesting musical ideas even though the’s not a skilled musician anywhere near Alicia’s level. I mean these original things. Of course. Talib Kweli's \"Get\" \"Score\" and everyone else on this album will take it every day) \"You Don't Know My Name\", \"If I Can't Get You\", “If I Were Your Woman” has a very good tune though I can’t really give you much reputation for this remake, and the pooh-equally smooth “Diary”, but most of this album is really lacking . There’s not much variation on this cd, so the songs are often put together and send out like a beautiful amish-mash-mash that seems to continue to engulf the medium. In other words it’s not scary but neither is it beautiful. I thought this album was going to be very interesting. Sure this album is a bit stronger than the average & of album these days, which sadly, won’t take long to tell on the table, but Alicia’s background music is something we should expect more . Many of the artists have no musical training to figure out their ideas even if they have to. Alicia has training but she does't seem to have much new ideas. Alicia is a great actress but her original composition is nothing special. I know this is only this second album and many of the biggest artists of your time haven’t really progressed in making their part until at least three of their fourth albums, so maybe I should judge now, but even if you listen to the old albums of most adults, you can see a special spark that Alicia has never seen before. And if the continues to get so much praise for this neutrality, the won’t fully realize this potential. Maybe if the pushes the side, the can let it fall off, and the really comes out on the other side as an artist who deserves the kind of security the gets. because maybe. I think we have to wait and see.","overall":3,"summary":"O.K. but nothing special (2.5 stars!)","unixReviewTime":1109635200,"reviewTime":"03 1, 2005"}
{"orig_index":50000,"reviewerID":"A2UYAFQ40U2PHS","asin":"B000A2H1D2","reviewerName":"Grigory's Girl \"GR\"","helpful":[1,1],"reviewText":"There are a ton of Chuck Berry greatest hits recordings, so I can't really say whether this is the best one. However, it does have thirty tracks on it, it's a single disc edition, and the music is extraordinary. Berry is one of the creators of rock and roll, and listening to this stuff forty years later, it's still rocks, and rocks really hard. The music there sounds more vital, fresh, and edgy (yes, edgy) than most rock and roll facts do today. Berry wrote all thirty tracks in this collection, and they're all fantastic. This album has the classics (Johnny B. Goode, Maybellene, Rock and Roll Music), and it has some songs that I've heard covered by The Rolling Stones and REO Speedwagon (Carol and Little Queenie). It also contains the great, underrated You Never Can Tell (featured in Pulp Fiction, but I can listen to the song without thinking about that film now. Thank goodness, as I like the song a lot better than the film). I love the song Promised Land, an obscure one. Listen to the guitar solo and tell me you don't hear Lou Reed in it, specifically the soloing on the Velvet Underground's first album. Some have criticised the inclusion of My Ding-a-Ling, a novelty song that was Berry's last #one hit. I like the song, and Berry liked it too, despite being very different that this other material. It was a big hit for Chuck, the wrote it himself, and I have to say I like it a lot, especially with the extremely enthusiastic crowd (recorded in the U. K.). Berry gives a great performance of it, and it becomes infectious. Overall, this is a great start for Berry novices.","overall":5,"summary":"Still great music, and rocks harder than a lot of \"hip, edgier\" bands do today...","unixReviewTime":1222905600,"reviewTime":"10 2, 2008"}
{"orig_index":50000,"reviewerID":"A2UYAFQ40U2PHS","asin":"B000A2H1D2","reviewerName":"Grigory's Girl \"GR\"","helpful":[1,1],"reviewText":"Chuck Berry is one of the creators of rock music. He has written all thirty songs in this collection and they are all good. This album contains the oldest records (Johnny B. Goode, Maybellene, Rock and Roll Music)","overall":5,"summary":"Still great music, and rocks harder than a lot of \"hip, edgier\" bands do today...","unixReviewTime":1222905600,"reviewTime":"10 2, 2008"}
{"orig_index":50000,"reviewerID":"A2UYAFQ40U2PHS","asin":"B000A2H1D2","reviewerName":"Grigory's Girl \"GR\"","helpful":[1,1],"reviewText":"Chuck Berry has a lot of hot records, so I can't say this is the best. However, it has thirty songs, is a single disk version, and the music is unusual. Berry is one of the creators of rock music, and the listened to these things forty years later, the’s still rock and roll, and it’s really hard. Local music is louder, more refined, and savant-garde (yes, savant-garde) than rock music today. Berry wrote all thirty songs in this collection, and they are all good. This album has classics (Johnny B. Goode, Maybellene, Rock and Roll Music), as well as other songs I've heard in Rolling Stones and REO Speedwagon (Carol and Little Queenie). It also contains a great, underestimated you can't (from pulp fiction, but now I can listen to this song without thinking it's a movie. Thank goodness, because I love this song more than a movie). I love the song, The Promised Land, a humble song. Listen to the solo guitar and tell me you never heard Lou Reed's voice, especially the first solo from Velvet Underground's debut album. Some people have criticized the inclusion of My Ding-a-Ling, which is a novel song with Berry's last #one hit. I love this song, and Berry loves it, even though it is very different from other things. This really hit Chuck, the wrote himself, and I have to say I really like it, especially to a very interesting crowd (recorded in the UK). Berry did well and was contagious. All in all, this is a good start for Berry beginners.","overall":5,"summary":"Still great music, and rocks harder than a lot of \"hip, edgier\" bands do today...","unixReviewTime":1222905600,"reviewTime":"10 2, 2008"}
{"orig_index":50002,"reviewerID":"A39H5ZCKFUMO2K","asin":"B000A2H1D2","reviewerName":"Jay R. Adler \"Music Critic\"","helpful":[3,3],"reviewText":"October twenty-four, two thousand and weightBack in one thousand, nine hundred and fifty-six as a young boy indicated by the New York City school system as having unusual intuitiveness for playing instruments and having an \"ear\". The only media we had in your apartment in Upper Manhattan on the West Side was a severely cracked but operable Zenith Am radio. In the many hours of listening to that archaic purveyor of listening pleasure,I was an irrefutable Chuck Berry fan. Although Chuck Berry is still performing the songs on this disc, Maybelline, Roll Over Beethoven,Johnny B. Goode, I knew then in the middle one thousand, nine hundred and fifty's as played on WMCA, The Good Guys in that tiny room in the yet to be gentrified Upper West Side that this is a man who is not coming around again for centuries if never. I remember how the used to shuffle across the stage while hitting this electric guitar. I saw a documentary once on the Philco TV my father brought home on your happiest day as kids where they depicted Chuck Berry as a simple man from St Louis who travelled alone from airport to airport with this luggage immaculately flashed to this back. The Stones, Beatles and many British Invasion groups often speak of this incredible and forceful influence on their own songwriting. Johnny Rivers. for me the finest Chuck Berry cover artist never, actually roamed the Brill Building promoting this talents when Carole King, Neil Sedaka, Neil Diamond and Wall of Sound producer Phil Spector spent their time writing the best music in a mystical place near the Flatiron building we remember, Tin Pan Alley. Two other rockers that are comparable to Chuck Berry are Jerry Lee Lewis and Little Richard. These three are starting to explode on satellite, Ipod cherry pickers and oldies stations all over. Listeners are tired of being exposed to the ersatz amateur-grey line semi-pros that bad penny us all over the place. Chuck Berry is a major Retro Grab in two thousand and weight meaning that we are all starting to look for exceptional quality in the past because that's where we now have to go to get it. Johnny Mathis and Astrud Gilberto walked into studios years ago with no prior musical training. When will we never see that again? Jay Adler, Music Critic","overall":5,"summary":"Chuck Berry Is A Superlative Retro Grab","unixReviewTime":1222214400,"reviewTime":"09 24, 2008"}
{"orig_index":50002,"reviewerID":"A39H5ZCKFUMO2K","asin":"B000A2H1D2","reviewerName":"Jay R. Adler \"Music Critic\"","helpful":[3,3],"reviewText":"Chuck Berry is a great Retro Grab with two thousands and complexity, which means we are all starting to look for the best quality of the past. Jerry Lee Lewis and young Richard began to shine on satellites, the Ipod cherry picker, and the old radio.","overall":5,"summary":"Chuck Berry Is A Superlative Retro Grab","unixReviewTime":1222214400,"reviewTime":"09 24, 2008"}
{"orig_index":50002,"reviewerID":"A39H5ZCKFUMO2K","asin":"B000A2H1D2","reviewerName":"Jay R. Adler \"Music Critic\"","helpful":[3,3],"reviewText":"On October twenty-four, two thousand and the difficulty of going back to one thousand and nine hundred and fifty-six, the New York City school system said that as a boy, the had an unusual way of playing musical instruments and \"had an year\". The only media outlet in your North West Side room in Manhattan was severely damaged but had to operate the Zenith Am radio. During the many hours I listened to that old provider of listening pleasure, I was an undeniable follower of Chuck Berry. While Chuck Berry is still playing songs on this record, Maybelline, Tumble Beethoven, Johnny B. Okay Good people in the room will not be cleansed on the Upper West Side. This is a person who, if the never knew, would reappear for centuries. . I remember walking down the aisle with my electric guitar. I once watched a documentary on Philco TV, which my father brought home on the happiest day of your life. . Stones, the Beatles and the British band have always talked about this amazing and powerful influence in their songwriting. Johnny Rivers. For me, when Carole King, Neil Sedaka, Neil Diamond, and Wall of Sound producer Phil Spector spent time performing some of the best music in an unfamiliar setting near the Flatiron building, the best Chuck Berry artist has never been to the Brill Building promoting this talent. . Remember, Tin Pan Lane. Two other rock musicians compared to Chuck Berry are Jerry Lee Lewis and young Richard. The three began to shine on satellites, the Ipod cherry picker, and the old radio station. The audience is tired of communicating with the amateur gray semi-pro players who bring us a open everywhere. Chuck Berry is the highlight of the two, zero-pound Retro Grab, which means we have all started looking for the highest quality before, because now we have to go there and get it. Johnny Mathis and Astrud Gilberto entered the studio years ago without music training. Won't we see it again? Jay Adler, Music Critic","overall":5,"summary":"Chuck Berry Is A Superlative Retro Grab","unixReviewTime":1222214400,"reviewTime":"09 24, 2008"}
{"orig_index":50002,"reviewerID":"A39H5ZCKFUMO2K","asin":"B000A2H1D2","reviewerName":"Jay R. Adler \"Music Critic\"","helpful":[3,3],"reviewText":"Although Chuck Berry still plays songs on this record, Maybelline, Roll Over Beethoven, Johnny B. Goode, but I know that between one thousand and nine hundred and fifty as WMCA , Played in Good Guys, in a small room on the Upper West Side untouched, this is a man who will never appear again for centuries, if the never will. For me, when Carole King, Neil Sedaka, Neil Diamond, and Wall of Sound producer Phil Spector spent time performing some of the best music in an unfamiliar setting near the Flatiron building, the best Chuck Berry artist has never been to the Brill Building promoting this talent. . Remember, Tin Pan Lane. On October twenty-four, two thousand, with a weight loss of one thousand and nine hundred and fifty-six, the New York City school system said that as a boy, the had an unusual desire to play musical instruments and \"had years.\" During the many hours I listened to that old provider of listening pleasure, I was an undeniable fan of Chuck Berry. Stones, the Beatles and the British band have always talked about this amazing and powerful influence in their songwriting. The three are starting to shine for the authorities, the Ipod cherry picker, and the old radio station. I once watched a documentary on Philco TV, presented by my father on the happiest day of your childhood. They portrayed Chuck Berry as just a St. .","overall":5,"summary":"Chuck Berry Is A Superlative Retro Grab","unixReviewTime":1222214400,"reviewTime":"09 24, 2008"}
{"orig_index":51927,"reviewerID":"A1MPRDXJLEMQ8O","asin":"B000EMGAGW","reviewerName":"Matthew Spryszak","helpful":[4,5],"reviewText":"I'm a big East Coast ship-hop fan, and this the album that I've waiting for for a long time. There is not one bad beat on this record. The album starts off hard with \"Smoke it,\" the banging' street single \"Put 'Em In Their Place,\" and the Lloyd Banks featured \"Stole Somethin,\" and the solemn \"Speakin' so Freely.\" The album's \"G-Unit production\" begins with the joint Creep that features fifty Cent. This is a very experimental track that takes a little time to get used to, but it will grow on you. The next \"G-Unit\" songs are club records with \"Backstage Pass\" and the banging' Young Buck featured \"Give It to Me.\" After that it's pretty much street banners such as the Tony Yayo featured \"Click, Click,\" the controversial \"Pearly Gates,\" the introspective \"Daydreamin,\" the Alchemist-produced banger \"The Infamous, and \"In Love With the Moula.\" They finish Blood Money with Mary J. Blige providing a verse and the hook on \"It's Alright.\" Overall, Blood Money satisfies both old Mobb fans and G-Unit fans. They pretty much stick to the formula with fifty Cent adding this platinum touch to the record, and there is nothing wrong with that.","overall":5,"summary":"Blood Money is the best East Coast Album in a long time...","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":51927,"reviewerID":"A1MPRDXJLEMQ8O","asin":"B000EMGAGW","reviewerName":"Matthew Spryszak","helpful":[4,5],"reviewText":"Symptoms begin. The production of \"G-Unit Production\" for the album \"Stole Somethin\" started with a combined fifty Cent Creep.","overall":5,"summary":"Blood Money is the best East Coast Album in a long time...","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":51927,"reviewerID":"A1MPRDXJLEMQ8O","asin":"B000EMGAGW","reviewerName":"Matthew Spryszak","helpful":[4,5],"reviewText":"After that, there were banners on the streets almost, such as Tony Yayo's \"Pearl Gate\" argument containing \"Click, Click\", introspective \"Daydreams\", and sticks made by the alchemist \"Notorious\" \"Zhaozhu\" and \"Love\" \"carry Mulla. The album started with \"Smoke it\" and a powerful street song \"Put'Em In Their Place\" Their Place \". The song \"G-Unit\" is a club record with \"Backstage Pass\", and the blockbuster \"Young Buck\" is titled \"Give It to Me\". The album \"G-Unit Production\" has a combined Creep with fifty cents. Getting started. They completed the Blood Money with Mary J. Blige and presented the poem with the hook \"OK.\" They almost insisted on spending fifty cents to add this platinum touch to the record formula, which is not wrong for me to be a fan. of East Coast Jetty, this is a long-awaited album","overall":5,"summary":"Blood Money is the best East Coast Album in a long time...","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":51927,"reviewerID":"A1MPRDXJLEMQ8O","asin":"B000EMGAGW","reviewerName":"Matthew Spryszak","helpful":[4,5],"reviewText":"I'm a East Coast Jetty fan, and this is the album I've been looking forward to for a long time. This record has no negative connotations. The album began with \"Smoke it\" and the street song \"Put'Em In their Place\". Lloyds Bank brands \"Stole Somethin\" and most importantly \"Speakin 'freely\". The album \"G-Unit Production\" began with a combined Creep with Fifty Cents. This is a very test song and takes a little time to get used to, but it will grow in you. The next \"G-Unit\" song is a club record with \"Passstage Pass\", and the blockbuster \"Young Buck\" featuring \"Give Me It\". After that, there were almost street-like banners, such as Tony Yayo's article \"Click, Click\", the \"Pearly Gates\" debate, the introspective \"Daydreamin\", the popular songs \"Inknown\" and \"In Love With the Moula\" produced by. alchemist. They completed Blood Money and Mary J. Blige presented the poem with a hook called \"It's Alright\". Overall, Blood Money meets the needs of older Mobb fans and G-Unit fans. They almost stick to the formula, adding this platinum touch to fifty cents.","overall":5,"summary":"Blood Money is the best East Coast Album in a long time...","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":53633,"reviewerID":"A3A0PB6STFVP99","asin":"B000JVSZIY","reviewerName":"ChuckDeezul","helpful":[3,4],"reviewText":"Nas came back SKRONG (as Kanyeezee would say)! His last cd was banging' but now, gloves are off, verbal clips are full and the's blasting' away! What was Columbia thinking'? He blasted away at them too! A must get for lovers of wordsmith's! BROOKLYN STAND UP!","overall":5,"summary":"HOLD UP!","unixReviewTime":1166572800,"reviewTime":"12 20, 2006"}
{"orig_index":53633,"reviewerID":"A3A0PB6STFVP99","asin":"B000JVSZIY","reviewerName":"ChuckDeezul","helpful":[3,4],"reviewText":"Nas' last cd is playing', but now the glove is off and the sound clip is full. They were blown up again!","overall":5,"summary":"HOLD UP!","unixReviewTime":1166572800,"reviewTime":"12 20, 2006"}
{"orig_index":53633,"reviewerID":"A3A0PB6STFVP99","asin":"B000JVSZIY","reviewerName":"ChuckDeezul","helpful":[3,4],"reviewText":"Nas is back SKRONG (as Kanyezee said)! Her last CD was a hit, but now, the gloves have been removed, the sound clip is full, and the 'explosion' is over! What do you think of Colombia? He blew them up too! What you need to do for word lovers! Brooklyn is rising!","overall":5,"summary":"HOLD UP!","unixReviewTime":1166572800,"reviewTime":"12 20, 2006"}
{"orig_index":54062,"reviewerID":"A24N1BAS3CU27H","asin":"B000N2G3RY","reviewerName":"Nse Ette","helpful":[1,2],"reviewText":"Uk songstress Amy Winehouse's brilliant two thousand and three debut `Frank' learned her lots of critical acclaim, and even won the Ivor Novello award (for songwriting), but largely flew under the radar commercially, with its retro soul\/jazz sound (that Christina Aguilera is using now), her raw and raspy vocal delivery (mature beyond her young years), and very frank lyrics. She returns on `Back to black', her sophomore disc, which is off to a blazing start in the UK; Top ten for the album, and lead off single, the horn sprinkled midtempo Motown-ish `Rehab', a song about a battle to get her into rehab, fictitious for autobiographical, we don't know. The horn sprinkled `You know I'm no good' has a jazzy\/tango sound set to skitter ship shop beats. Very catchy and one of my favourites. `Me and Mr Jones' is a downtempo retro soul\/jazz\/blues song that sounds like it was recorded in the one thousand, nine hundred and fifty. There's a slight reggae feel to `Just friends'. The title track `Back to black' is a beautiful midtempo Motown-ish song with excellent harmonies, and haunting\/creepy sound effects. `Love is a closing game' is a lovely ballad, and continuing the Motown influence, the beautiful `Tears dry on their own' has traces of `Aint no mountain high enough'. Awesome song and another of my favourites.`Wake up alone' is a tender ballad with soothing harmonies, the brief `Unholy war' is a mellow blues\/jazzy song, `He can hold her' is more upbeat with a ship shop beat and horns flitting in and out. Closing is the sunny, upbeat, Motown-ish `Addictions'. Retro sounding and beautiful. This is a stunning album, and definitely one of the very best released all year!!!","overall":5,"summary":"Simply stunning!!!","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":54062,"reviewerID":"A24N1BAS3CU27H","asin":"B000N2G3RY","reviewerName":"Nse Ette","helpful":[1,2],"reviewText":"You are back with the sophomore album \"Back to Black\", which started brightly in the UK; on the top ten album, and it started in the same way, the horn was sprinkled The city's main style of \"rehabilitation\", a song about allowing him to enter the battle of rehab, a mythical autobiography, we do not know. British female singer Amy Winehouse's famous two thousand and three debut \"Frank\" won him a lot of praise, even winning the Ivor Novello Award (Award Composer), but very popular in the retro soul \/ jazz industry (Christina Aguilera now uses) Her first rough voice (she grew up young), and and words that speak out. A beautiful song and one that I love. \"Wake Up Alone\" is a soft traditional song with a cool harmony, short \"Bad War\" is a fun blues \/ jazz song, \"You Can Hold Him\" ​​with more hope in the rhythm of the boat shop, bending in and out. \"Love is a close game\" is a popular folk song that perpetuates Motown's influence. The send is the sun, hopefully, the \"Motown\" of the Motown genre. The title track \"Back to the Dark\" is a fun Motown medium-sized song with great harmony and unforgettable \/ shocking sound. \"Mr. Jones and Me\" is a slow-moving soul \/ jazz \/ blues retro song that sounds like it was written in the one thousand, nine hundred and fiftys.","overall":5,"summary":"Simply stunning!!!","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":54062,"reviewerID":"A24N1BAS3CU27H","asin":"B000N2G3RY","reviewerName":"Nse Ette","helpful":[1,2],"reviewText":"British singer Amy Winehouse who excelled in the first two hundred and three \"Frank\" received a lot of praise, even winning the Ivor Novello (songwriter) award, but little is known about the industry. The soul of Retro \/ jazz (Christina Aguilera uses it now), her original and cruel voice (she grew up at a young page), and confident words. She is back for her second album \"Back to Darkness\", which made a good start in the UK; the top ten album, and started with another, horn sprayed with a medium-speed \"revival\" of Motown, Song. about this involvement in the war of attrition, fictitious autobiography, we do not know. The \"You Know I'm Not Right\" soundtrack has a jazz \/ tango sound, which can beat the rhythm of a boat shop. It’s very attractive and it’s one of my favourites. \"Mr. Jones and I\" is a slow-moving soul \/ jazz \/ blues retro song that sounds like it was written in the one thousand, nine hundred and fiftys. \"Just friends\" has a slight sense of reggae. The title track \"Back to the Dark\" is a fun Motown medium-sized song with great harmony and unforgettable \/ shocking sound. \"Love is a close game\" is a popular folk song that perpetuates Motown's influence. A beautiful song and one that I love. \"Wake Up Alone\" is a soft traditional song with a cool harmony, the short \"Bad War\" is a cool blues \/ jazz song, \"You Can Hold Him\" ​​is more hopeful under the rhythm of a boat shop, bending in and out. The ending is a sunny, hopeful, Motown style “addictive”. Retro sound and beauty. This is an amazing record, certainly one of the best albums never released! ! !","overall":5,"summary":"Simply stunning!!!","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":54062,"reviewerID":"A24N1BAS3CU27H","asin":"B000N2G3RY","reviewerName":"Nse Ette","helpful":[1,2],"reviewText":"The beautiful UK singer Amy Winehouse in the first two thousand and three ‘Frank’ learned a lot of praise, and even won the Ivor Novello award for retro \/ jazz sound (now used by Christina Aguilera), the raw delivery of its voice (after a few years), and very clear words. It returns with ‘Back to Black’, its second album, which quickly started in the UK; In the album’s top ten, led by one, the horn is sprinkled with a mid-mile Motown-ish `Rehab’, a song about a battle to get him back, a story of living fantasy, we don’t know. The horn sprinkled with ‘You know I’m not good’ has a jazzy \/ tango sound set to hit the shipyard. Very attractive to my loved jones. ‘Me and Mr Jones’ is a retrospective jazz \/ blues song that seems to have been recorded at one thousand, nine hundred and fifty. There’s a bit of reggae that feels like ‘just friends’ ’. The title track ‘Back to black’ is a beautiful Motown-ish midtempo song with great harmony, and surprising sound effects. ‘Love is a tie game’ is a good ball, and with the continuation of Motown’s influence, the beautiful ‘Tears of self-drying’ has the impression of ‘Aint is not high enough’. A very good song and another of my favourites. ‘Rise Alone’ is a soft city with adaptation, the short term ‘unholy war’ is a blue \/ jazzy song, ‘He can catch you’ she is very excited about the ship’s jumping boats coming out. Closing is the sun, hitting, Motown-ish ‘Addictions’. Good retro sound. This is an amazing album, and definitely one of the best released in the whole year !!!","overall":5,"summary":"Simply stunning!!!","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":54295,"reviewerID":"A1A3YJK9IW0OI5","asin":"B000NQR7UC","reviewerName":"Richard Hine \"Russell Wiley Is Out to Lunch\"","helpful":[0,0],"reviewText":"Teaming up with the people who brought you The Divine Comedy, Pulp and Air, Charlotte Gainsbourg delivers a shimmery collection of songs, whispered confessions and savage observations. The chime instrumentation surrounds and enhances Gainsbourg's breathy vocals, which are sung\/spoken in her delightfully \"Frenglish\" accent. Title track \"five:fifty-five\" captures that sleepless time when it's \"too late to send it now, too early to start again.\" Bouncy single \"The Songs That We Sing\" sounds cheerful, but it still makes little girls \"scream and run away.\" The \"Little Monsters\" who \"rule the world\" are scary enough (they get even bigger and scarier on Jarvis's own \"Fat Children\"). The theme of staying up all night returns in several places, most notably when love goes under the knife in \"The Operation.\" It's a delicate procedure, but Gainsbourg's \"prepared to work throughout the night.\" This is easy listening with a sharp edge.","overall":5,"summary":"The Divine Pulp Air Songs That We Sing","unixReviewTime":1241308800,"reviewTime":"05 3, 2009"}
{"orig_index":54295,"reviewerID":"A1A3YJK9IW0OI5","asin":"B000NQR7UC","reviewerName":"Richard Hine \"Russell Wiley Is Out to Lunch\"","helpful":[0,0],"reviewText":"\"five: fifty-five\" holds sleepless hours when the is \"delayed to send now\" \"The songs we using\" seems fun, but it still does the girls who “scream and run away.” The topic of waking up all night is back in many places.","overall":5,"summary":"The Divine Pulp Air Songs That We Sing","unixReviewTime":1241308800,"reviewTime":"05 3, 2009"}
{"orig_index":54295,"reviewerID":"A1A3YJK9IW0OI5","asin":"B000NQR7UC","reviewerName":"Richard Hine \"Russell Wiley Is Out to Lunch\"","helpful":[0,0],"reviewText":"\"Five: Fifty-five\" takes a snap \"It's too late to send now\". \"The Song We Sing\" sounds fun, but it makes the little girls \"scream and run\" The theme of staying up late is back in many places. The title track \"Five: Fifty-Five\" captures the sleepless night of \"It's too late to post now, and it's too early to start again.\" The single song \"Songs We Sing\" sounds fun, but it makes the little girl \"scream and run away.\" This is a weak process, but Gansbu is \"ready to work all night.\" It's been back in many places, and the biggest hit is the love \"movement\" under the knife. Charlotte Gainsbourg has worked with people who brought you Divine Comedy, Pulp and Spirit to give you a glossy list of songs, \"she whispered. confession and wrong consideration.","overall":5,"summary":"The Divine Pulp Air Songs That We Sing","unixReviewTime":1241308800,"reviewTime":"05 3, 2009"}
{"orig_index":54295,"reviewerID":"A1A3YJK9IW0OI5","asin":"B000NQR7UC","reviewerName":"Richard Hine \"Russell Wiley Is Out to Lunch\"","helpful":[0,0],"reviewText":"Charlotte Gainsbourg works with people who have brought you Divine Comedy, Pulp and Air, offering a range of enlightening songs, low-key, and negative reviews. Bell's instruments swirled and lifted Gainbourg's breath, and the sang \/ spoke in a beautiful \"French\" way. The title track \"Five: Fifty-Five\" takes a long time to sleep \"It's too late to send now, and it's too early to start again\". The elastic single \"Songs we using\" sounds fun, but it makes the little girl \"scream and run\". The \"little beasts\" that control the earth \"are terrible enough (they get bigger and more scary in Jarvis's\" fat guy \"). The theme of staying away until it returns to many places, the most important of which is that the love in the \"movement\" is under the knife. This is a weak process, but Gansbu is \"ready to work all night.\" It is easy to hear and has sharp edges.","overall":5,"summary":"The Divine Pulp Air Songs That We Sing","unixReviewTime":1241308800,"reviewTime":"05 3, 2009"}
{"orig_index":54451,"reviewerID":"AK4UD9J5QCMRH","asin":"B000OLHGBQ","reviewerName":"Jeff Hodges","helpful":[12,13],"reviewText":"\"Math rock\" is usually associated with practical complexity. By this I mean that bands that are identified with the genre generally think about the way in which they can perform complex musical material in a live situation. Battles' \"supergroup\" pedigree includes death rock monsters such as Don Caballero and Helmet, and as a critical fan of so-called \"math rock,\" they have piqued my curiosity since their first EP. However, I never bought any of their albums. Then I saw the video for \"Atlas,\" and this curiosity became a fascination. I have long been a fan of King Crimson circa one thousand, nine hundred and eighty, and it seemed like Battles engages contemporary technology and virtuosity in the same way that Fripp and co. did on \"Discipline.\" I immediately bought \"Mirrored,\" and in the final weeks of two thousand and seven, it shot up my personal \"album of the year\" charts. What is really fascinating and ultimately satisfying about \"Mirrored\" is unravelling its tapestry of execution. I love to contemplate \"who\" is playing \"what.\" This form of listening is particularly stimulating when you have a band full of multinstrumentalists that sample, loop, tap, and generally thrash their way through their work. As usual, the most publicly accessible song on the album is not necessarily the most representative. I think that \"Atlas\" is great. The video reflects the energy and experimentalism of the band very well. However, there are songs on the album that show \"Atlas\" to be the \"single\" that it is. \"Tonto\" is a beautiful piece of work, as is \"Race: In\" and \"Tij.\" \"Race: Out\" is a fun \"whack-a-mole\" game of \"who is playing what\" and \"Bad Trails\" shows Battles' potential for more atmospheric work. The only work that I could offer any critique for is \"Rainbows.\" It is wonderfully epic, and covers a great amount of musical ground, but seems a little repetitive. The same seven-minute song could potentially be done in five. The slowdown: Battles creates highly active music that is satisfying on intellectual and accessible levels. To the passive listener, \"Mirrored\" may bring to mind the work of savant-garde DJ's, like DJ Shadow for BT. For the more invested listener, Battles' potential for mind-boggling virtuosity, a la King Crimson for Don Caballero, is similarly compelling. A quick YouTube search will confirm this - I dare you to check it out.","overall":5,"summary":"Is it live....or is it Battles?","unixReviewTime":1199404800,"reviewTime":"01 4, 2008"}
{"orig_index":54451,"reviewerID":"AK4UD9J5QCMRH","asin":"B000OLHGBQ","reviewerName":"Jeff Hodges","helpful":[12,13],"reviewText":"The Battles' genealogy includes \"dead stone monsters like Don Caballero and Helmet\". Public songs on the album are not the most representative. The only job I can give you any criticism is \"Rainbow\"","overall":5,"summary":"Is it live....or is it Battles?","unixReviewTime":1199404800,"reviewTime":"01 4, 2008"}
{"orig_index":54451,"reviewerID":"AK4UD9J5QCMRH","asin":"B000OLHGBQ","reviewerName":"Jeff Hodges","helpful":[12,13],"reviewText":"\"Race: Out\" is a fun game of \"Hammouse\", \"Who's Playing\", and \"Bad Trails\" which show the ability of the Battles to do more atmospheric emissions. \"Tonto\" is a good work, like \"Race: In\" and \"Tij\". The wars' \"top group\" of the lineage include deadly stone monsters like Don Caballero and Helmet. As a big fan of the so-called \"mathematical stone\", they have aroused my interest since their first EP. I bought \"Mirrored\" right away, and for the last few weeks of two thousand and seven, it was on my \"Album of the Year\" chart. However, there are other songs on the album that show \"Atlas\" as \"single\". When I was about one thousand, nine hundred and eighty, I was a follower of King Crimson, and it seemed that the Wars were \"training\" with Fripp and co. For inactive audiences, \"The Show\" can remind people of savant-garde DJ activities, such as BT's DJ Shadow.","overall":5,"summary":"Is it live....or is it Battles?","unixReviewTime":1199404800,"reviewTime":"01 4, 2008"}
{"orig_index":56088,"reviewerID":"A24ZFFRQ4MG3XL","asin":"B0016B6ZKG","reviewerName":"Little Miss Cutey","helpful":[3,3],"reviewText":"Wow, am I impressed. It's been about a seventeen year wait for this, but it's over and she's only gotten better with time and has't lost a thing. She sounds amazing and this cd is awesome. There is only one song I don't like on there, and it's the title track, Crayons. Everything else to me is pure gold and while of course I definitely love the first release, Stamp Your Feet, I also truly enjoy I'm A Fire (seven.ten minutes long) and the slower song Sand On My Feet. This is one of the best albums I've heard in a long time and one of her absolute best as well. She co-wrote these songs along with a host of other song writers and she proves that she has't lost her touch at all. I hope she'll tour Australia sometime soon because I'll be one of the first in line. I highly recommend this fantastic cd. It will have you dancing and singing along and it has a little bit of everything there. I hope that she will continue releasing new material like this soon. No more waiting around like the last time. This is a must purchase cd - you'll love it.","overall":5,"summary":"The Queen IS back and better than ever :->","unixReviewTime":1217808000,"reviewTime":"08 4, 2008"}
{"orig_index":56088,"reviewerID":"A24ZFFRQ4MG3XL","asin":"B0016B6ZKG","reviewerName":"Little Miss Cutey","helpful":[3,3],"reviewText":"Waiting for about seventeen years, but everything was over. This is the best album I've never heard of. He wrote these songs with other songwriters.","overall":5,"summary":"The Queen IS back and better than ever :->","unixReviewTime":1217808000,"reviewTime":"08 4, 2008"}
{"orig_index":56088,"reviewerID":"A24ZFFRQ4MG3XL","asin":"B0016B6ZKG","reviewerName":"Little Miss Cutey","helpful":[3,3],"reviewText":"Wow, I'm impressed. It's been waiting for about seventeen years, but everything is over, the's gotten better over time and the has't lost anything. It sounds great, and this CD is great. The only song I don't like, is the title song, Crayon. Everything else is pure gold for me, yes I really like the first version, the stamp of your feet, and I love that I’m hot (seven.ten minutes) and a slow sand song on my feet. This is one of the best albums I've never heard, and one of this best albums. He composed these songs with many other songwriters, and the proved that the never lost contact. I hope you will tour Australia soon, as I will be one of the first people in line. I highly recommend this amazing CD. It will let you dance and using together, and there is something to it. I hope the can continue to publish new things soon. Don't wait like in the past. This is the CD you need to buy - you'll love it.","overall":5,"summary":"The Queen IS back and better than ever :->","unixReviewTime":1217808000,"reviewTime":"08 4, 2008"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"Wow, what an album, its absolutely brilliant! I'm more into Rock and Electronic music but being a musician kind of spreads my musical tasteall over the place. Anyway this album is really something. for example Wildflower, not the flagship song in the album but such a completesong it's perfect on its simplicity G - Bm - D - Em, there you go, the chords for the chorus. I'm really enjoying this from start to send get this album its very solid and should be flourished with grammy!","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"This album is great. I am very happy to send this album from the beginning, it is solid and it should thrive with Grammys!","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"For example, Wildflower, is not a flagship song on the album, but a full song. Its simplicity is perfect. G-Bm-D-Em, go ahead, chorus chords. Wow, what a beautiful record, just fun! I really enjoyed posting this album from the beginning, it is very strong and should thrive with the Grammys! I prefer rock and electronic music, but as a musician, my favourite music is everywhere. After all, the album is truly meaningful.","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"Wow, what a great, absolutely amazing record! I prefer rock and electronic music, but as a musician, my favourite music is everywhere. After all, the album is truly meaningful. For example, Wildflower is not a flag song on an album, but a perfect song. Its simplicity is perfect. G-Bm-D-Em, you go, choir songs. I really enjoyed posting this album from the beginning, it is very strong and should thrive with the Grammys!","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}