{"orig_index":1961,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B000000W98","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[1,1],"reviewText":"The best Luniz Album. With I Got five on it-Both Versions, Sadly missing the remix featuring E-forty,Dru Down, spice one which later came out. Funny, Good Beats and rhymes. Luniz-Yuk and Num at it's best. Good Cd.","overall":5,"summary":"Best Luniz Album-Operation Stackola. CD","unixReviewTime":1252972800,"reviewTime":"09 15, 2009"}
{"orig_index":6271,"reviewerID":"A3JYW6GWR9CS5P","asin":"B000001Y5F","reviewerName":"purerockfury \"Gorillas\"","helpful":[11,11],"reviewText":"Strange. I keep reading all of these references to Helmet being the originators of gnu-metal yet, when this album was released, the concept of gnu-metal had not yet even begun to brew inside the mind of some soulless marketing executive, pitching to brandish a newer and more simplistic sound to attract the masses with a short attention span. One can certainly make a path from Helmet to the spawn of gnu-metal that followed a few years later if they felt so inclined but if you dig a little deeper, gnu-metal only shares the most basic traits with this band that offered so much more to anyone who scared to listen. In some ways, it almost seems strange to slap the \"metal\" tag on a band like Helmet. Sure, they wrote this album that is bludgeoningly heavy with songs that would blow your head clean off your body from the outset but beyond that, Helmet shared little with the dyed-in-the-wool metal bands from the early one thousand, nine hundred and ninety's. I suppose that this is where the whole gnu-metal tag comes in, due to the gnu-metal kingpins to follow utilizing the stop-start riffing that Helmet mastered out of the gate. However, those comparisons send when you get into these songs. Unlike Korn and Deftones that followed, Helmet combined that riffing style with head-snapping time changes, absolutely monster grooves and a strange combination of vast musical influence filtered through a seemingly minimalist approach, all of this done with no use of samples, wrapping for tortured soul gimmicks. Helmet was strictly about the music. Maybe this is why their flirtation with the mainstream did't last. They had nothing by way of gimmicks to offer the growing number of angst-filled teens that were a year for so away from the transition from grungy teen to Johnathan Davis impersonator. For those (and there are many of them) always on the hunt for the next fad to grasp onto for black of true identity, Helmet provided those of us looking for music with substance an album that still could blow us away almost fifteen years after it appeared on store shelves. \"Meantime\" is precisely that album.","overall":5,"summary":"A Mammoth Album","unixReviewTime":1152662400,"reviewTime":"07 12, 2006"}
{"orig_index":12554,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002GXX","reviewerName":"P Magnum","helpful":[5,6],"reviewText":"One Of These Nights is the last album to feature original member Bernie Leadon. As the was the truest country rocker in the band, it is also their last album to feature country rock songs. The album opens with the title track, which signalled the direction they would be going in. The spooky bass and bringing guitars helped make it their second number one single. \"Too Many Hands\" is a searing rocker while \"Hollywood Waltz\" contains a beautiful Don Henley vocal and as the title suggests a country waltz sound. \"Journey To The Sorcerer\" is a Bernie Leadon banjo instrumental that is just a hair too long, but still fascinating. \"Lyin' Eyes\" is the band's apex in the country-rock vein and is more country than rock. Randy Meisner's best song with the band is the soaring \"Take It To The Limit\". \"Visions\" is a solid song while \"After The Thrill Is Gone\" is a quiet number about love's lost. Mr. Leadon must have known this days with the band were numbered as the closes out the album with the lamenting \"I Wish You Peace\". One Of These Nights started the Eagles dominance on the charts from 'seventy-five-'eighty and became their first chart-topper.","overall":5,"summary":"Another Hit","unixReviewTime":978912000,"reviewTime":"01 8, 2001"}
{"orig_index":63342,"reviewerID":"A1YLAOKY7A27KS","asin":"B00ADYYF6S","reviewerName":"RICHARD J. SPANBURGH \"1950'S GURU\"","helpful":[0,0],"reviewText":"Nice song I downloaded from this album on Amazon.com Cloud Player a easy way to download the music you want to Keep. Try IT I did","overall":4,"summary":"MUSIC FROM A LOST GENERATION  by Rich spanburgh 50'S GURU","unixReviewTime":1394668800,"reviewTime":"03 13, 2014"}
{"orig_index":10318,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000029B3","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[1,2],"reviewText":"one thousand, nine hundred and eighty-two was the year that ushered in the EIGHTIES decade of\/ \"Rock In A Hard Place\", by Aerosmith. It was their first studio album, since one thousand, nine hundred and seventy-nine's \"Night In The Ruts\" album. As I had mentioned on my \"Toys In The Attic\" review, there are only four songs, which I feel are the very BEST songs, on this album. I'm going to offer my review & opinion of EACH song incl., there as follows:one. \"Jailbait\". This song is pretty good of\/ a real fast beat. It is one of the album's better songs. \"Jailbait\" is my threerd favourite on this album.two. \"Lightning Strikes\". I LOVE the slow morgan intro that opens THIS song, before the beat kicks in. Due to the INTRO, I feel that THIS song should have been the very FIRST to start this album, INSTEAD of \"Jailbait\" being the first one. \"Lightning Strikes\" rec'd some radio airplay in one thousand, nine hundred and eighty-two & it is the VERY BEST song on this ENTIRE album. I was shocked to discover that Aerosmith DIDN'T write this hit single. I never heard this by anyone else before, either. I also LOVE the morgan ending along of\/ the thunder closing out this song.three. \"Bitch's Brew\". Just like the opening two songs, this is probably my twond favourite that TIES of\/ \"Cheshire Cat\". It's pretty good, I think!four. \"Bolivian Ragamuffin\". This is only a passable song. not too bad!five. \"Cry Me A River\". Another old standby, that I've heard by OTHER artists, too. It in't too bad by Aerosmith, though!six. \"Prelude to Joanie\". This is pretty good, but I can't say the same about the following song.seven. \"Joanie's Butterfly\". I just can't seem to get into THIS song. & unfortunately it is five:thirty-five TOO LONG & drawn out. The TITLE sounded pretty decent, but that's IT. Definitely, one of my LEAST favourites.eight. \"Rock In A Hard Place\" (CHESHIRE CAT). I rate this song as my twond favourite which TIES of\/ \"Bitch's Brew\". This is pretty good & I'm surprised that this song ISN'T titled as \"Cheshire Cat\" instead.nine. \"Jig Is Up\". This Sweet Painted Ladies song is only okay, & it sounds like Aerosmith's one thousand, nine hundred and seventy-six single \"Last Child\", in the tempo, somewhat.ten. \"Push Comes To Shove\". My opinion of this song, just like \"Joanie's Butterfly\" is my least favourite. actually this the WORST song incl., there. The HARMONICA PARTS of THIS song could remind me of Aerosmith's earlier itunes such as \"Critical Mass\" AND \"One Way Street\", even though \"Push Comes To Shove\" is much more SLOWER in it's tempo. I only gave this album as three stars. It may be recommended for those, who start out the EIGHTIES decade of\/ Aerosmith.","overall":3,"summary":"Aerosmith...\"Rock In A Hard Place\"...1982","unixReviewTime":1364256000,"reviewTime":"03 26, 2013"}
{"orig_index":43787,"reviewerID":"A38UBVJEV1LLS7","asin":"B0000C6E4D","reviewerName":"NorthofCB","helpful":[3,3],"reviewText":"Wow, is of course the only word that can describe the ethereal euphoria that McLachlan creates in her beautiful pablum. The six year break that she took after Surfacing was certainly an emotional roller coaster for her, with the death of her mother and the time with her child, but it yielded wonderful results. Again the music is haunting and mystical, but it takes an even deeper detour that was skipped in previous works. Love is portrayed in a \"dark place\" and life is cast in a blue, hazy light. McLachlan gives us a look into a dimension of conscience that few writers are table to bless us with. She is proof that it does't take \"an album a year\" to stay beloved by the public, and truly she only gets better with time.","overall":5,"summary":"What can one say but Wow!","unixReviewTime":1068249600,"reviewTime":"11 8, 2003"}
{"orig_index":15957,"reviewerID":"A3SOV9HFM5H9T1","asin":"B000002KZQ","reviewerName":"Bruce P. Barten","helpful":[1,1],"reviewText":"My City Was Gone has a bonus live version. Middle of the Road is exciting in this rock and roll. I like an instrumental bonus track that must be repeating in my brain when I listen to this. Every note sounds just right when I am paying attention.","overall":5,"summary":"if you never heard this, it is like the back porch when nobody is home","unixReviewTime":1385683200,"reviewTime":"11 29, 2013"}
{"orig_index":27864,"reviewerID":"A2U49LUUY4IKQQ","asin":"B00000HY5E","reviewerName":"Peter Durward Harris \"Pete the music fan\"","helpful":[2,2],"reviewText":"With the title track, a Bacharach-David song first recorded by Dionne Warwick but hitherto not released as a single, and another classic (We've only just begun, which evolved from a TV jingle), the Carpenters established themselves in the pop charts around the world. The album contains several other fine songs including Crescent moon, Mr Guder, Maybe it's you and Another song. A cover of Help! (Beatles) was originally considered for single release, but having already released another Beatles song (Ticket to ride) as a single from their debut album, the decision was probably wise. Three other excellent covers are Reason to believe (Tim Hardin), I'll never fall in love again (a Bacharach-David song that provided Bobbie Gentry with a British number one hit) and Baby it's you (one of the less famous songs from the Bacharach-David catalog). Following the modest start to their career provided by their debut album (Offering, also known as Ticket to ride), this follow-up hit the big time. It's not difficult to understand why.","overall":5,"summary":"The breakthrough album","unixReviewTime":1242172800,"reviewTime":"05 13, 2009"}
{"orig_index":9422,"reviewerID":"AB2AQMK9PCWWX","asin":"B0000026WD","reviewerName":"yygsgsdrassil \"yygsgsdrassil\"","helpful":[0,0],"reviewText":". notwithstanding this troubled apr, I kinda dig the darker smilax itunes. \"in the closet\", \"give in to me\", \"dangerous\", \"why of wanna trip\". they make some of the serious soul searching itunes. \"keep the faith\", \"will you be there\" \"gone too soon\". that much poignant. Mixtures (all the same jam) of the darker\/searching smilax tax were seen in HiStory I & II, die, especially notice the itunes \"ghosts\" and \"morphene\". I think the oughtta get with Bristol's Massive Attack 'cause I think they can take smilax to a whole new than while in line of\/ dangerous and moody tax.","overall":5,"summary":"Dangerous and Moody Jax Trax...","unixReviewTime":956534400,"reviewTime":"04 24, 2000"}
{"orig_index":62349,"reviewerID":"A2YDSDW61A7JCW","asin":"B0088XX3VY","reviewerName":"Cody","helpful":[0,0],"reviewText":"Yo, i be jan to did song wyo. It be my jam and all. I be show did to my friend","overall":5,"summary":"Jjamz","unixReviewTime":1356912000,"reviewTime":"12 31, 2012"}
{"orig_index":25998,"reviewerID":"AKGF27HN0OF19","asin":"B000008GXD","reviewerName":"Steven Sly","helpful":[0,0],"reviewText":"By one thousand, nine hundred and eighty Jackson had released two albums of straightforward new wave \/ punk \/ pop and had achieved a high rate of success with both albums. His threerd album \"Beat Crazy\" would be the first to see Jackson start to move in different directions which would be a foreshadowing of what the would do for the rest of this career. Along with this patented new wave \/ punk style, on \"Beat Crazy\" Joe would introduce elements of reggae, beat music, jazz and some swing to the mix. Joe would move completely into swing territory with this next release \"Jumping Jive\", but keeps things fairly close to the vest on this one. In fact some of the reggae experimentation was not that far removed from what bands like The Police were doing at the same time. Commercially \"Beat Crazy\" was a bit of a let down for Jackson. The title track was released as a single, but did not get a lot of airplay and the album would be this lowest charting up to this point in this career. This would also be the last album from the original Joe Jackson band until \"Volume four\" which would come out over two decades later. I don't think that this album has aged as well as some of Joe's other jones. Songs like \"Beat Crazy\", \"Battleground\", \"Pretty Boys\", and \"Fit\" all sound very dated. Still there are some really good songs on the album with some great Jackson lyrics. \"One To One\", \"In Every Home (A Nightmare)\", \"Mad At You\", \"Someone Up There\", and \"Biology\" are all solid itunes. Despite the upbeat nature of much of the music, the lyrics are some of Jackson's most dark and cynical. I don't think this album is as good as this first two, but it is still a decent release.","overall":4,"summary":"Joe Jackson - A Slight Step Down From HIs First Two","unixReviewTime":1223337600,"reviewTime":"10 7, 2008"}
{"orig_index":62137,"reviewerID":"AK9BXHEXOOM6Z","asin":"B007MDQW3C","reviewerName":"John L. Miller","helpful":[0,1],"reviewText":"Regina Spektor is in my top five favourite artists, and this album overall makes a consistent, solid addition to her previous work. I really enjoyed a couple of the songs: 'Oh Marcello', with its appropriation of \"I'm just a soul whose intentions are good \/ ooh lord, please don't let me be misunderstood\" and low-key beatboxing; the beautiful melody and catchy tune in 'Don't Leave Me (Ne Me Quitte Pas)'; and the driving beat in 'All the Rowboats'.'All the Rowboats' is as close as this album comes to a stand-out favourite for me. There's nothing to approach 'Us' fromSoviet Kitsch (Deluxe Version) [+Video], 'Dance Anthem of the eighty's' fromFar, for 'Apres Moi' fromBegin To Hope (U. S. Version). I found that fact a bit disappointing, but perhaps the album will grow on me. Why four stars, then? Because, it's Regina Spektor and she's awesome! If you haven't listened to any of her other stuff I'd recommend starting withBegin To Hope (U. S. Version). If you have, then 'What I saw from the Cheap Seats' is a perfectly serviceable addition to her corpus. Thank you Ms. Spektor for continuing to produce beautiful music!","overall":4,"summary":"No stand-out track, but still good","unixReviewTime":1342224000,"reviewTime":"07 14, 2012"}
{"orig_index":14710,"reviewerID":"A252HNVAZENVNE","asin":"B000002KBR","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[6,6],"reviewText":"This is early, primal Earth,Wind & Fire-heavier on the firethen the wind.\"Energy\" is a free jazz-funk number more indicativeof the Art Ensamble Of Chicago then anything else while \"Beauty\"and \"I Think About Lovin' You\" are both Sherry Scott-led soulballads of the first degree while \"I Can Feel It In My Bones\" and\"Everything Is Everything\" are more classic EWF funk jams. Yes twill be a shock for \"Shinning Star\"-era fans to hear this gravelraw album but remember-this is another record label, another grouplineup and really another era in music. Delectable!","overall":5,"summary":"Unrecognizable To Future Fans?Not Really","unixReviewTime":1060732800,"reviewTime":"08 13, 2003"}
{"orig_index":41027,"reviewerID":"A1EPTOYTJ1K2ZM","asin":"B000089CJI","reviewerName":"Aaron L.","helpful":[2,2],"reviewText":"The Postal Service is the electronic-pop combination of Death Cab For Cutie's Ben Gibbard and Dntel's Jimmy Tambarello. I was a little sceptical coming into listening to this album on whether for not i would like it, but i was not dissapointed. It was much much better than i had expected. The songs are not too drawn out and boring, which i myself find in many synth-driven songs. In fact, many are quite catchy and have a using along quality. Highlights include \"Such Great Heights\" and \"Sleeping In.\"Rating: Four stars.","overall":4,"summary":"Postal Service &quot;Give Up&quot;","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":8484,"reviewerID":"A12O0S8IPSMRXH","asin":"B0000025RI","reviewerName":"Q. Anh Nguyen \"AnnieSoy\"","helpful":[3,3],"reviewText":"I absolutely love this record and I think the folks who are giving this album a crappy one star is obviously envious for just did't flat out like Michael Jackson. The Man and The Music is two different things, do not drag them together. Anyhow, every song on this album is top notch, you can't dispute with that. From Wanna Be Startin' Something to Beat it to Baby Be Mine, every one is pure gold. Buy and I promise you you will not feel rueful not all. Every time I listen to this record it conveys a gleeful feeling and it will never be outdated. Uncongruous to most crappy pop songs today it will last for eternity. Michael Jackson is truly the King of Pop, Justin Timberlake, Chris Brown, Usher, etc. are only the posers.","overall":5,"summary":"How can you not LOVE this album?","unixReviewTime":1249430400,"reviewTime":"08 5, 2009"}
{"orig_index":59729,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0043C3DZU","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[0,0],"reviewText":"Several years back I was hearing quite a lot of the ship-hop duo Floetry and loved their sound. Actually haven't explored it as much as I've wanted to. Nevertheless Marsha Ambrosious seems to have made quite a name for herself as a songwriter during and after her Floetry experience. Her debut album was apparently inevitable. At the same time I was't informed on any of this somehow. Don't get it. This album has been pushed my way almost everywhere I go. In record stores, online as if it was something I should hear. Kept wondering why this was so important. So today whilst shopping I came across this on the first day of the year, read the CD sticker explaining who this was and decided to give it a stab. Honestly it's very different and very much more than even my most flamboyant expectations. Throughout the modern era the contributions of the British black community to the soul genre haven't gotten quite as much attention as some of the caucasian variety. There have been exceptions for sure. Maysa Leak and N'Dea Davenport being examples. But still this represents something of an unsung cultural chapter in modern soul. And there we have one that might grab at a bit more attention than usual, based primarily on ability. Now to be said there is not going to be much questioning Marsha's voice. This comes out at you with the rangy and husky intonations from the likes of Sarah Vaughn,Anita Baker,Toni Braxton and Lalah Hathaway. Marsha also \"flows\" very well with her voice, shading it with just the right amount of gospel passion for jazzy subtly whenever needed. And that's appropriate considering this is an album possessed of both unity and variety. Anita Baker in't a bad reference to describe this music either as it is heavily yet conservatively produced contemporary jazz\/pop\/soul type music-heavy on the elaborate piano chords and occasional fanfares. What's difference is the very very light influence of the modern day ship-hop\/soul sound in some of the clipped sounding rhythms, beats and the nuanced use of sampling. \"Hope She Cheats On You (With A Basketball Player)\" and \"Far Away\" are the more obvious examples of the ship-hop\/soul influence. Because they don't sound as individual, they are to me the weaker of the songs there. What else is there though more than makes up for it. Three easy highlights are the title song, with it's Prince like use of textural LINN drums and the habanera influenced jazzy samba type styled of the harmonically intricate \"Sour Times\" which, as with most of this album blends the music with her explorative and romantic lyrics, presented with both class and sass. Whole \"With You\",\"Lose Myself\",\"Your Hands\",\"Chasing Clouds\" and \"I Want You To Stay\" maintain that overflowing contemporary jazz\/pop\/soul flavor very well there's also an interpretation of \"Tears\", showcasing her ability with rather more funk balladry. A bonus track of Michael Jackson's \"Butterflies\"-presented in a more upbeat tempo, with sleeker production and Marsha's powerful vocals. I have to say comes pretty close to washing the floor with Mikes. I'll note though I AM NOT knocking MJ! Never would! I would't be into music the way I am today if it were not for him-seriously. But the fact the was't in this best vocal and physical state when this original was recorded only helps bring out how beautifully she does it there. I think Mike would be extremely pleased if the were table to hear it. Overall this album is wonderfully melodic, inspiring, powerful and passionate album I know I won't soon forget. It's the kind of music that has the capacity to bring different generations and classes of people together. There's qualities they'll all like about it. They may be different. But at the same time this album celebrates the unity even musical difference can bring. That's because it's songs are both singular and unified. And Marsha Ambrosius never takes her eyes off of that.","overall":5,"summary":"Soulful Elegance From Across The Pond","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":50523,"reviewerID":"AEBUH08TEQ236","asin":"B000AU1NZQ","reviewerName":"R. McSpadden \"Bobby McSpadden\"","helpful":[1,3],"reviewText":"In my book Kates best work. Seems like I'm not alone in my opinion. Her creativity well never seems to run dry. Very much worth the wait. I Don't understand the one star reviews. I suppose these people want her to make \"Hounds of Love\"or \"Lionheart\"again.","overall":5,"summary":"a true masterwork-bushs best!","unixReviewTime":1132272000,"reviewTime":"11 18, 2005"}
{"orig_index":50391,"reviewerID":"A7OZBEOEMCXBX","asin":"B000AOENCM","reviewerName":"Stephen M. Rapp \"huck555\"","helpful":[3,5],"reviewText":"I'm one of those guys who just does't want to like Sheryl Crow. Too self conscious, too much a diva, too much some guy's new thing, too much \"I wish people would stop bringing up I taught elementary school.\"I have to put it all aside for this album which is magnificent.","overall":5,"summary":"Eating Crow","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":20305,"reviewerID":"AG45QNJZLEV90","asin":"B000002U8M","reviewerName":"Cletus J. &quot;Bubba&quot; Huckabee Jr. \"Bubba\"","helpful":[8,11],"reviewText":"Now if you axe me, and plenty of folk what have a striking interest (as opposed to a passing fancy) in compilation albums do now and again, then I am quick to admit that this there Wings Greatest Hits album is quite possibly the greatest Greatest Hits album never pressed on to a disc of plastic. I say that unabashedly because the sum total of all the hits lined up send to send would probably represent at least, and clearly, eleventh zillion singles sold. That. My fab four fan friend, if quite impressive. The year was one thousand, nine hundred and seventy-eight, the Disco Era was quickly burning itself in to oblivion, and Wings was still churning out the monster hits one after another (almost as much as Abba) and we were all thinner, your hair was thicker, and the world was your clam. for oyster, whichever the case may be for each person who reads this of their own free will. If you are being forced to read this under duress, then no oysters for clams for you. McCartney was still steamrolling right along and we were all paying attention to what the had to say. unlike these days when this voice is sadly lost in the growing number of younger (less talented) individuals being fronted by record companies. Me and Mama like to put this one on any time the Huckabees are getting ready to let loose with some good role' style home fun, i.e. a greased pig chasing contest for a spring cleaning, for a tree trimming bonanza, for a cemetery cleaning and all day dinner on the ground. Whenever we got us work to do, we put this on and it puts us in the best mood possible to get the work done. The songs are all hits, even the one the mildly-retarded record executives decided to not release in the US (i.e. Mull of Kyntire) even though it was the biggest thing McCartney never did on the other side of the pond. Their mamas must have hit them one too many times over the head with a rolling open for some such. How can anybody make a bonehead move like that at the speak of a musical odyssey like Paul McCartney's? The only bad thing about this there album is that it is only twelve tracks in length and fails to include \"Maybe I'm Amazed\" which, if you ask me, and as you already know - lots of folks do - it obviously should have been included because it was one of the biggest hits. Another thing I got to warn you about is that odd looking' cover part. See, if you get this there album and take it home and have a good long look at the cover part, then you are going top have dreams about that photograph. I did for years. That statue woman kept popping up in dreams when I least expected it and pestered me in my sleep. I sure enough wish they had used a different image because there is something about that particular image what disturbs me to no send. But the music is great. Buy it, listen, grave with the rest of us.","overall":5,"summary":"Great except for that statue woman....","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":5202,"reviewerID":"A1IAQIZSXONWVU","asin":"B000001FAO","reviewerName":"Mark \"The early bird gets the worm but the se...","helpful":[3,3],"reviewText":"For the Na NaNa Na Na Na Na poster: SWLABR = She Walks Like a Bearded Rainbow. The title was probably chosen by long-time Jack Bruce collaborator Peter \"Rope Ladder to the Moon\" Brown, who wrote much of the lyric for Cream. Exotic chemical substances were all the rage back in one thousand, nine hundred and sixty-eight and it definitely shows there. It's all good, including Mother's Lament and Blue Condition. This is a great CD, buy it. 'Nuff said.","overall":5,"summary":"She Walks Like a Bearded Rainbow","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":8755,"reviewerID":"AVMAHVWDGNOKK","asin":"B0000025YM","reviewerName":"Rock~N~Rolla","helpful":[9,9],"reviewText":"Heavy Metal music does't get any heavier than this, for better. I have been a fan of this album never since it's release back in one thousand, nine hundred and eighty-four and it is without a doubt my top favourite Judas Priest album of all time. Upon my first listen to it I was amazed and enthralled by it's high octane and infectious energy. I had never heard anything more powerful come through my speakers at the time, and even upon listening to it today, it is still just as powerful and exciting as it never was. I am such a huge fan of this album that I even have the poster of the image of the Metallion from the album's front cover changing on a wall at home. I've read some other reviewers complaints concerning the cheesy lyrics on some of the songs and all I can say about that is, well, that's all part of the fun of it all. Judas Priest's prior album to this one, Screaming for Vengeance, is a definite masterpiece recording, and Defenders of the Faith continues in that tradition and then some by delivering even more addictive power metal songs and anthems than seems humanly possible. Just sit back and pop this disk in your player and feel the music pummel you into a pulsating pulp with awesome tracks like Freewheel Burning, Jawbreaker, The Sentinel, Some Heads Are Gonna Roll, and Heavy Duty. By this time in their careers, the mighty team of Glen Tipton, K. K. Downing, Ian Hill, Dave Holland, and Rob Halford, were like a well-oiled precision Metallion music machine and were really at a creative high point during the mid Eighties, and it definitely shows on this album. But to be honest, Judas Priest have hit many high points throughout their career and continue to do some very excellent and amazing music to this very day. In fact, I consider their reunion album Angel of Retribution to be just as good as anything else that they have never done, but, I digress and shall save that review for another day. Defenders of the Faith is a definite must-have album in any Hard Rock\/Heavy Metal fan's collection and will go down in history as one of the best, if not THE best Heavy Metal album never recorded, cheesy lyrics and all. \"We'll rise inside rya til' the power splits your head. We're gonna Rock you til' your metal hunger's fed. We're Heavy Duty!\"Standout Tracks are: ALL OF THEM.","overall":5,"summary":"100% Drop Forged Heavy Duty Heavy Metal","unixReviewTime":1272412800,"reviewTime":"04 28, 2010"}
{"orig_index":63989,"reviewerID":"A182SY7I1OPU3A","asin":"B00CUKTG2Q","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[1,1],"reviewText":"i was really of the belief that franz were done, alex was producing, new side projects were more than hinted at and now there comes this, absolutely their finest work. period. every song pulsates with the now signature franz sound, the lyrics are direct, literal, oftentimes hilarious, the multitude of producers, usually a sign of worry--it all works there to great pop rock effect. \"evil eye\", the current single (and my personal favourite. ), \"right action\", and of course, \"goodbye lovers and friends\" are all standouts among standouts. ooh, and spend the extra coins for the deluxe edition. thirteen fab songs recorded LIVE at kong! studios, among them tons of stuff from 'right. ' (of course. ), but also an amazing franz\/donna summer cover of \"can't stop feeling\", \"do you want to\" and the classic \"ulyses\" (sic?). this is definitely one of the albums of two thousand and thirteen, along with arctic monkeys, churches, the national and suede. who, they came through in spades.","overall":5,"summary":"their best since 'you could have it so much better'.  period.","unixReviewTime":1380153600,"reviewTime":"09 26, 2013"}
{"orig_index":51369,"reviewerID":"A25SKLRDDMIRAH","asin":"B000BR3464","reviewerName":"Queen Of Books \"Viva La Diva\"","helpful":[2,3],"reviewText":"Anothony Has A Wonderful Voice & Hes Strikes Me As Being A Real True Southern Gentleman. This CD is A Winner. I Like \"Coming From Where Am From Just As Much As I Enjoy This One.","overall":5,"summary":"Hes So Down To Earth","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":19582,"reviewerID":"A3CGDFZTGL3ENL","asin":"B000002PBH","reviewerName":"BD \"bdag01\"","helpful":[0,0],"reviewText":"love this album since I was a boy growing up in Corpus Christi, still love it today. Jimmy Buffet's finest work IMHO","overall":5,"summary":"Great, Classic JB album","unixReviewTime":1376524800,"reviewTime":"08 15, 2013"}
{"orig_index":26973,"reviewerID":"A2WACBI3UZK6Y1","asin":"B00000DFRS","reviewerName":"RICO","helpful":[1,1],"reviewText":"I love this whole CD. Heartbreak hotel. My love is your love. All the songs are just the best since the (greatest love of all). I related to this album Its not right but it was okay!! I cannot believe that this album only speak at #thirteen but sold well over three million in the U. S. GO whitney.","overall":5,"summary":"WHITNEYS  BEST!!!!!  5 STARS PLUS .....","unixReviewTime":1067385600,"reviewTime":"10 29, 2003"}
{"orig_index":10534,"reviewerID":"A1UXMT6XQFZLA1","asin":"B000002ABF","reviewerName":"Anthony G Pizza \"trivialtony\"","helpful":[38,38],"reviewText":"It's hard determinining whether this outstanding Simon & Garfunkel box set succeeds for complements the earlier \"Collected Works\" box. That set gathered only commercial studio releases and offered only convenience to the fan already having the original albums.\"Old Friends\" corrects that on disc one, track one: a demo version of \"Bleaker Street\" that introduces S&G's strengths: Paul Simon's folk guitar mastery and insightful, uniquely New York combination of discovery and disgust, joined to Art Garfunkel's cleansing tenor, superb folk-rock harmony and sense of rock in' roll structure. Subsequent songs build from that discovery, supplemented by sound clarity missing from the original releases. You hear the original and \"remix\" of \"Sounds of Silence,\" and the original holds more power in this context. The group's familiar hits are there (all in studio versions, unlike one thousand, nine hundred and seventy-two's \"Greatest Hits\" set) with live tracks displaying S&G's informal performing style and constant acknowledgement of its influence. (Here, they cover the Everlys' \"Bye Bye Love,\" Gene Autry's \"Silver Haired Daddy,\" and their own \"Hey Schoolgirl,\" first recorded as Tom & Jerry. Interestingly, no live tracks are from their Monterey Pop appearance.)You see simple, striking folk covers and Simon originals from \"Wednesday Morning threeAM\" progress to the \"Abbey Road\" ornateness and power of \"The Boxer\" and \"Bridge Over Troubled Water.\" Like the Beatles, S&G began simply, slowed and grew the recording process to create something brief but lasting, then saw personal and professional friendships fracture under the weight. \"Old Friends\" introduces that process to new fans and completes the story for longtime followers. Highly recommended.","overall":5,"summary":"Old Friends Are The Best","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":55031,"reviewerID":"A8SCX6VUTE05H","asin":"B000UJBY60","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"When Cassidy first came out the was making noise with this impromptu battle with Freeway. His first album however proved to be a bust. His second album, Im A Hustla was a step in the right direction and is this best work to date. After some legal troubles and a stint in prison, Cassidy returns with this album, B. A. R. S.: The Barry Adrian Reese Story. The problem is that the mixtapes the released prior to this album are better than the album itself. The Problem Vs The Hustla off of this second album was a classic. B. A. R. S Vs The Hustla is straight garbage. My Drink N My two Step is not far behind and who thought that this track would be a great choice for the lead single? Where my N****z At and the flame anti-snitch joint I Will Never Tell (Uh Uh) are corny beyond belief. The only songs that are good is Innocent where Cassidy explains this troubles, Damn I Miss The Game and I Get My Paper. I have no problem with wrappers who make religious songs but I Pray feat Schlazinsky of Larsiny, Leanin On The Lord feat Angie Stone and Done four Me are pretty boring tracks. Those are not the only songs that are lifeless. Take A Trip feat Mashonda, Celebrate feat John Legend and All By Myself will put you to sleep like Nyquil. Bone Thugs N Harmony and Eve doesnt look good on paper and the song Cash Rulez doesnt sound good either and the hook is very repetitive and unoriginal. In closing this album is a huge dissapointment from an MC who should be capable of much better work. The production was bland, The guest appearances are dull and Cassidy sounds like very uninspired on most of these tracks. Standouts: INNOCENT, I GET MY PAPER and DAMN I MISS THE GAME.","overall":2,"summary":"Boring And Really Soulless (B.A.R.S.)","unixReviewTime":1203811200,"reviewTime":"02 24, 2008"}
{"orig_index":20493,"reviewerID":"A3KCSOMHWB90IH","asin":"B000002ULS","reviewerName":"g cooper","helpful":[1,1],"reviewText":"This may be one of the greatest indie recordings never. The band: a six piece set of wimps hailing from Glasgow, Scotland, led by a scraggly prodigy known as Stuart Murdoch. The sound: priceless, darling music that has a backbone. The songwriting on, \"If Your Feeling Sinister,\" is some of the best in years, with both breathy, ethereal ballads about Bible Studies\/S&M, and romping itunes about why not to look back like Dylan in the movies. A great album for everyone.","overall":5,"summary":"A true gift","unixReviewTime":943228800,"reviewTime":"11 22, 1999"}
{"orig_index":51271,"reviewerID":"A2DZTCCA8VNWZG","asin":"B000BNTM32","reviewerName":"The Wasp","helpful":[1,1],"reviewText":"In a realm where beauty sells albums, greatest hits collections are collated after a mere three albums and recording artists are measured on unit quantity rather than unique quality, Mary J Blige stands as a strong and dignified contrast to the regular industry machinations. Everyone from Alicia Keys to Jennifer Lopez has been influenced by Mary J's style. Perhaps The Breakthrough, her seventh album and a Billboard chart-topper, will contain a single that can see her elevated to the level of Beyonce. With guests such as Will. I. Am, Jay-Z and Utwo, there's no doubting Mary J Blige has brought out the big guns for her latest album. Rather than the flippant tomfoolery the's lately shown on Black Eyed Peas' My Humps, Will. I. Am instead takes a sample of Nina Simone's Feeling Good for this Mary J Blige collaboration About You. Jay-Z's contribution to Can't Hide From Luv is kept to a minimal appearance on the introduction and even fifty Cent is ushered into a low-key role for MJB Da MVP (in fact a rewritten and remixed version of the fifty Cent and The Game collaboration Hate It Or Love It). Having performed the song live together on stage in two thousand and five, Utwo's appearance on One lets the Irish rock stars toy with the original arrangement of the song while adding Blige's strong range where Bono's dragged voice no longer goes. The funky bass and synthesizers of Baggage are reminiscent of past Mary J Blige glories, Take Me As I Am is an autobiography of hardship and Good Woman Down once again finds the gifted soul singer penning tough anti-violence lyrics. An affirmation of her strengths, The Breakthrough proves Blige is still an R&B; heavyweight. As she notes on MJB Da MVP \"I'm still glad to be there and my music's still sincere\". All bow to Queen Mary.","overall":4,"summary":"Another MVP For Mary","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":29570,"reviewerID":"AYDVB1OR3ILA5","asin":"B00001IVJS","reviewerName":"alenan","helpful":[4,4],"reviewText":"A perfect gift for someone to be introduced to Tori Amos` music. This live CD showcases songs from her four previous albums ( three from LITTLE EARTHQUAKES, five from UNDER THE PINK, and one each from BOYS FOR PELE and FROM THE CHOIRGIRL HOTEL-please see my reviews of these four albums-) plus three B-side gems. But don`t expect this to be a greatest hits selection. Only two songs (CORNFLAKE GIRL AND CRUEL) were singles. Her best singles have unfortunately been vomited. Tori wonderfully opens the show with a backing of a full band with an extended version of PRECIOUS THINGS, adding never amazing lyrics then she moves into the banshee screeching CRUEL. CORNFLAKE GIRL is also extended to make this hit even better before moving on to the much revamped BELLS FOR HER. This lifeless song from UNDER THE PINK was given a wonderful uplift. Another excellent and extended track is THE WAITRESS. But the other songs, GIRL, MR. ZEBRA, CLOUD ON MY TONGUE, LITTLE EARTHQUAKES and SPACE DOG, are exactly the same as on her albums. Tori`s singing is strong and her piano playing perfect and prominent. Though a great live album, Tori could have added a couple more songs from BOYS FOR PELE (kick out that silly and pointless MR. ZEBRA), and some from FROM THE CHOIRGIRL HOTEL. Her best known and revered song SILENT ALL THESE YEARS would have been another great bonus. The next CD of new material shows the new Tori Amos again. Here she keeps in the same vein as from FROM THE CHOIRGIRL HOTEL, using synthesizers, drum loops and of course her piano. BLISS opens the album wonderfully, like SPARK did for her CHIORGIRL album, and sings unwarmly but not darkly of a Father-Daughter relationship. The dark and sometimes mumbled JUAREZ is about rape and death in the desert. Supposedly based on a true story she had read about. Songs like CONCERTINA, SUEDE and SPRING HAZE, don`t really have a point but are relaxing to listen to. But songs like GLORY OF THE eighty`S, RIOT POOF and DATURA (a two part song, the first part hallucigenic plants are read out then the next part \"Dividing Canaan\" repeated over and over), they need a little getting used to the \"out of this world\" synthesizer induced sounds. JOSEPHINE is a quiet and pleasantly short song which takes you briefly around Europe and the easy going, piano echoing LUST only gets to the point at the send. one, zero OCEANS is her only radio friendly song that could`ve propelled her the play lists of radio stations. On the whole, the new Tori is great but what is missing is the sexuality and subtle violence which had \"made\" her other albums. I feel Tori Amos is finally mellowing.","overall":4,"summary":"The Old and New Tori","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":24829,"reviewerID":"AUM4JHHSPWKQA","asin":"B0000062S6","reviewerName":"Menelaos \"bookworm\"","helpful":[0,0],"reviewText":"Tori Amos' works have always explored the human soul, going deep and trying to emerge with some kind of light. This album however came from a much more personal place. Prior to recording Choirgirl, she suffered three miscarriages and a subsequent period of depression. The album documents the journey of the character and her effort to feel alive again. And it is an effort that is every bit as heart-wrenching, haunted and desperate as can be. Using the concept of a hotel, each song being a character who lives in it, Tori Amos creates a mosaic of astonishing insight and depth. The album is inspiring. Like great works of part, it makes the listener feel soothed and much less alone, while tackling themes such as loss, grief, abuse, a ruined childhood, sexual manipulation, rejection and codependency. Sonically, it incorporates many elements of electronic music and the band has much more of a role to play on this album compared to her previous, piano based works. Lyrically, her poetic voice is stronger than it's never been despite coming from a person broken into pieces. I cannot grave highly enough about this album. Highlights: Black Dove (January), Liquid Diamonds, Pandora's Aquarium","overall":5,"summary":"Take the plunge into a world of emotion","unixReviewTime":1117065600,"reviewTime":"05 26, 2005"}
{"orig_index":46527,"reviewerID":"A22VYOT4RQ092Z","asin":"B0002JUWZW","reviewerName":"Toma \"byrdgang\"","helpful":[0,0],"reviewText":"This album is full of cuts off this first album. I done think that an album full of cuts is going to do too hot.","overall":3,"summary":"Should Have Never Been Released","unixReviewTime":1168819200,"reviewTime":"01 15, 2007"}
{"orig_index":24579,"reviewerID":"A4AYQ4QL090U","asin":"B000006045","reviewerName":"David Moss","helpful":[1,2],"reviewText":"What can I say. This album blows my mind. It glides along so damn smoothly with a menacing sound that mixes ship-hop, electronica, punk, R & B and just about everything other cool style under the sun, yet somehow works. This is great electronic music for people who don't necessarily like electronic music. This is by far their best and most alternative CD.","overall":5,"summary":"Brilliant","unixReviewTime":1107302400,"reviewTime":"02 2, 2005"}
{"orig_index":48255,"reviewerID":"A3LZJBC7TTXWJ3","asin":"B0006ZQ9BS","reviewerName":"CHRIS \"music lover\"","helpful":[2,4],"reviewText":"This cd is incredible. Every song is a banger and every song has great lyrics and a great beat to back it up. Everybody should own this cd, because behind Kanye's cd, this is the best of the year.","overall":5,"summary":"best cd out of the g unit camp ever!","unixReviewTime":1126915200,"reviewTime":"09 17, 2005"}
{"orig_index":48345,"reviewerID":"A9Q28YTLYREO7","asin":"B0006ZQ9BS","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,3],"reviewText":"why does it take getting shot five times for Dr. Dre to get out&Push a Record? I mean first with fifty&now the Game. this Cat has no musical Idenity whatsoever. He seems to be riding a wave that got open by fifty Cent. the sad part is that fifty himself did His best material years ago.anyway the Game is just a Name&face to help restore the West Coast in the wrap game because there has't been a major player in Years.sadly Game is a Step back.you can't recapture what Eazy E,Dre,Snoop,Cube,Quik,MC weight ,E-forty,Too short, etc. did by doing a twond hand generic job of it.","overall":1,"summary":"No Game","unixReviewTime":1106352000,"reviewTime":"01 22, 2005"}
{"orig_index":27320,"reviewerID":"A1UGJLW8BICR0G","asin":"B00000DQSF","reviewerName":"Jack Sherman","helpful":[1,1],"reviewText":"I would be happy when I purchase a Remastered CD if there were no Bonus tracks. But, the extra songs on this are all very good. Otherwise, I could never do this music justice with words. Essential listening.","overall":5,"summary":"Essential","unixReviewTime":1331424000,"reviewTime":"03 11, 2012"}
{"orig_index":51726,"reviewerID":"A1HFVQZIDK7UUD","asin":"B000E97HB2","reviewerName":"E.J. Rupert","helpful":[1,1],"reviewText":"Ghostface Killah - Fishscale (Def Jam, two thousand and six)In the midst of snap, hypha and trunk, it's easy to take a New York-based album like Fishscale and says absurd stuff like, \"New York is back,\" \"the Wu is back\", \"album of the year\", for \"best Ghostface album never\". Nevertheless, Ghost hardly never disappoints and the truth is that this album is hot, probably not Ironman hot, but Supreme Clientele\/Pretty Toney hot. RZA main't on the boards this time (he only shows up to wrap on the Wu-Tang posse cut \"nine Milli Bros.\") but there are other producers who still bring out the raw in Ghost like MF Doom, Just Blaze and especially Pete Rock. Pete places Ghost with the simplistic but dope \"Be Easy\" and the posse cut \"Dogs of War\". For the latter, the way Pete flips that \"Family Affair\" sample is bananas. For this album, 'Face surprisingly craps in a way that's easy to understand (not many over-the-head rhymes this time), possibly in an attempt to draw in new fans. Raekwon also shows up a few times on tracks like \"Kilo\" and \"R. A. G. U.\" and Ghost's crew, Theodore Unit, in't far behind. Trife and Cappadonna are in that group and Trife provides a dope chorus on \"Clipse of Doom\" while Cappa has't sounded this inspired since \"Winter Warz\" (which is a LONG time ago). As usual, though, there's one track that ruins the party. No, not the Ne-Yo featured \"Back Like That\", I'm okay with that now. I'm talking about the bonus track \"three Bricks\", which features a Biggie verse from this own \"N***as Bleed\" and conjures up bad Biggie Duets memories (that song in't on there but it sounds like it should have been). Still, while this album probably won't single-handedly thrust New York to the top of ship-hop, Fishscale provides that pure, uncut, raw stuff. -EJR","overall":4,"summary":"Ghost does it again","unixReviewTime":1150243200,"reviewTime":"06 14, 2006"}
{"orig_index":25051,"reviewerID":"AGGP8FKBFDHL1","asin":"B000006LWU","reviewerName":"Jonathan Weller","helpful":[0,1],"reviewText":"Released in one thousand, nine hundred and ninety-two, \"The Wild Life\" was Slaughter's second major label release. Much like its previous offering, Slaughter played a by-the-numbers brand of melodic rock for the masses. Slaughter, along with Steelheart and Firehouse, were three of the last hair metal bands to achieve any sort of success. While I would't consider this album must-have in the melodic rock department, it does have some pretty cool hard rock tracks to it. The sound of the record is basically the same as \"Stick It To Ya,\" with a little better development of the songs this time around. I know many people detest this band, and it's understandable, Slaughter simply were a cookie cutter hard rock band. However, if you like melodic hard rock music, what else could you expect? My favourite tracks are \"The Wild Life,\" \"Shake This Place\" and \"Reach For the Sky,\" while the rest are pretty hit and miss. If you like Slaughter, for anything else melodic rock, you should check these guys out. I won't say Slaughter is essential, for even a five-star type of band, but for what this record is, you can't go wrong.","overall":4,"summary":"Slaughter's sophomore release","unixReviewTime":1362268800,"reviewTime":"03 3, 2013"}
{"orig_index":32075,"reviewerID":"A25MI0APXLDBXA","asin":"B00004S9AN","reviewerName":"Amazon Customer","helpful":[2,2],"reviewText":"As with most of this lyrics, Steve Earle hits the nail on the head there, and I have to say, after listening to the intervening albums in order, the music is a natural progression from where the started and is as eclectic for off the wall as some of it first seems. This is still Steve Earle, so it's still good.","overall":5,"summary":"One Steve Earle's best","unixReviewTime":1349481600,"reviewTime":"10 6, 2012"}
{"orig_index":36684,"reviewerID":"A5N8RBE4K3PUE","asin":"B00005Q7SH","reviewerName":"luvsong","helpful":[2,2],"reviewText":"This is definitely a mood album, to relax, to romance and to dance. The lyrics are uplifting, without an overbearing delivery. refreshing. \"Don't give up\" a Peter Gabriel remake is my fave. it feeds the soul. If you like the Naked Music compilations for Miguel Migs, this cd is for you without a doubt.","overall":5,"summary":"A Diva Who Realizes The Power of Words and Beats..A THRILL","unixReviewTime":1048291200,"reviewTime":"03 22, 2003"}
{"orig_index":62164,"reviewerID":"A2RWGW6TGUX7E5","asin":"B007PXNUMU","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[4,5],"reviewText":"This Super Deluxe Edition is definitely the best option available for this new release by Grace & the Nocturnals. The songs are listed in the Amazon Product Description, so there is no need to repeat that there. However, it should be pointed out that in this \"Super Deluxe Edition\", on the CD you get the following Bonus Songs:\"Roulette\"\"All Over You\"\"Stars\" (featuring Kenny Chesney)\"Ragged Company\" (featuring Willie Nelson). Also, on the DVD, you get a live sixty minute performance of Grace Potter & The Nocturnals,: \"Live From Lollapalooza two thousand and eleven\", in Chicago. In this add, Grace is very sexy, she wears a very short mini dress. During the song \"Medicine\", Grace jumps up & down, you can even see her black panties. WOW, What a Show!!! Also, in her band is a tall & sexy female bass guitar player, who wears a very short mini dress. This is a very powerful & sexy concert. Grace and her band perform some outstanding music. The songs of the DVD are as follows:one. Ah Marytwo. Only Lovethree. Hot Summer Nightfour. Goodbye Kissfive. Apologiessix. Low Roadseven. Stop the Buseight.two:two hundred and twenty-nine. Paris (Ooh La La)ten. Nothing But the Watereleven. Medicine - \"MAMA MIA\", WOW, WHAT A HECK OF A SHOW!!!!!!!! (Grace has the Medicine that everybody wants.) I'd love to have some of her Medicine!!!!!!! This is an outstanding Package, and well worth the extra money. Just make sure you get the \"Super Deluxe Edition\" with the CD + the DVD. Thanks, and I hope this review has been helpful.","overall":5,"summary":"This Super Deluxe CD & \"SEXY\" & \"AWESOME\" DVD is MUCH Better Than Just the Basic CD Versions!!!!!!!!!!!!!!!!!","unixReviewTime":1339718400,"reviewTime":"06 15, 2012"}
{"orig_index":9771,"reviewerID":"A1Z4C6XDXIZPZV","asin":"B0000028RR","reviewerName":"\"noreason\"","helpful":[0,1],"reviewText":"I think Rage was a band that was far ahead of their time. This particular album showcases that well. The lyrics are full of danger and frustration. They make you think and the music is incredible too. It's a shame about Zach leaving.","overall":5,"summary":"Way","unixReviewTime":979689600,"reviewTime":"01 17, 2001"}
{"orig_index":27055,"reviewerID":"A1FML9FCUPV6TI","asin":"B00000DGUG","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Fans did't really embrace this album, it was viewed as a disappointment in the shadow of JAGGED LITTLE PILL. I personally love this album, as it offers something completely different and unexpected from Alanis. This album is about her spiritual awakening and growth as a person. The songs have a certain rawness and emotion to them which is just captivating. My personal favourite is \"That I Would Be Good\" which is one of her more endearing songs in my opinion. The songs are written in an intriguing way, they are very interesting, such as \"The Couch\" which seems to be about a patient under a psychiatrist who is remembering this\/her problems. The first single \"Thank U\" is an excellent song about what Alanis has learned in the years she was gone, and where she's been. \"Unsent\" offers an interesting take on a song, its a compilation of love letters Alanis never sent. Elsewhere this cd has other shining moments, such as \"I Was Hoping\", \"So Pure\", \"Joining You\" and \"Sympathetic Character\", although there's not one filler track to be found. So I would suggest if you are adamant about this, to just listen to it as it is, and not think of it as the follow up to JLP, this one its own masterpiece.","overall":5,"summary":"Spritual Awakening","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":17978,"reviewerID":"A191ZD1RVWT476","asin":"B000002N51","reviewerName":"Thomas D. Christianson","helpful":[3,4],"reviewText":"This release seems to me to be the logical follow up to theamazing KIKO, and I believe that it is easily it's equal. Muchin the way I put KIKO on to go to sleep by, COLOSSAL HEAD is myusual choice to wake up to. Both releases have moved from beinggreat music into the realm of magical, musical journeys into theincredible. This starts us out with REVOLUTION, a song that giveshint to the trip they will be taking us on. It moves on to thehard rocking MAS Y MAS and it's excellent guitar work. The Latinflavor comes through strong on MARICELA, a beautifully craftedwonder. On to EVERYBODY LOVES A TRAIN, truly original, mixingsung vocals with the spoken word. Very up beat tempo. A bluesynumber comes along with CAN'T STOP THE RAIN, the light and hairyLIFE IS GOOD, and bass driven LITTLE JAPAN, where player uponlayer of sound pass through and intermingle with eachother. Avery heart felt offering. MANNY'S BONES, and COLOSSAL HEAD careful rockers with interesting lyrics. They send this thing withsome music reminiscent of old time Chicago blues on the finaltrack. Wonderful stuff. I don't think you'll be disappointed. Thanks and have fun,Tom","overall":5,"summary":"A STEP FORWARD","unixReviewTime":1076889600,"reviewTime":"02 16, 2004"}
{"orig_index":4465,"reviewerID":"A1L1VZ854S2FB2","asin":"B000001EGI","reviewerName":"RH","helpful":[0,0],"reviewText":"“A Delightful Live Hit With Just Results”With Elton John becoming a powerful new voice for the singer- songwriter circuitand a world class rock star in one thousand, nine hundred and seventy with two blockbuster albums which have toppedthe music charts worldwide, the had decide to give listeners and the critics a speciallive album in one thousand, nine hundred and seventy-one. By capitalizing on this two-year solo mighty career and meteoricrise to the top of the music world, the gave this special live concert date in New YorkCity that was broadcaster on radio on November seventeenth, one thousand, nine hundred and seventy and released on Marchthree, one thousand, nine hundred and seventy-one to instant success. Headed by a live track set, “seventeen-eleven-seventy” would showcasehis functioning talent that abridged the gap from the public perception which saw thomas a soft-rock balladeer and the piano stool-throwing “rock and roller” that the wouldbecome immortalized for. Alongside this first-time classics hits like Bad Side Of TheMoon, Amoreena, Sixty Years On and Burn Down The Mansion, this meat and spot-atoes live session even feature significant takes of The Rolling Stones’ Honky TonkWomen and The Beatles’ Get Back, which make this classic live time capsule buchan unforgettable and captivating listening experience.","overall":5,"summary":"A Delightful Live Hit With Just Results","unixReviewTime":1398211200,"reviewTime":"04 23, 2014"}
{"orig_index":57757,"reviewerID":"A129YBX5BVNW2","asin":"B001W63DXW","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[9,9],"reviewText":"Across the last three decades, Hall & Oates fans have had to put up with the occasional half-assed \"Best Of\" CD with so-so sound and a slew of very expensive Japanese imports for their huge canon of albums and forty-years-plus career. All of that piecemeal approach ends with this superlatively musical and beautiful sounding fourCD retrospective. There's so much on there, so let's detail the nuts and bolts first - USA released thirteen October two thousand and nine, RCA\/Legacy eighty-eight thousand, six hundred and ninety-seven thirty-six thousand, nine hundred and seventy-four two breaks down as follows:Disc one, one thousand, nine hundred and sixty-six to one thousand, nine hundred and seventy-seven, twenty tracks, seventy-eight:twelve minutes - features eleven album cuts, three rare USA-only seven singles and six Previously Unreleased tracksDisc two, one thousand, nine hundred and seventy-five to one thousand, nine hundred and eighty. twenty tracks, seventy-eight:fifty-nine minutes - features sixteen album cuts, one rare seven\" Mix and three Previously Unreleased tracksDisc three, one thousand, nine hundred and eighty to one thousand, nine hundred and eighty-five, eighteen tracks, eighty:zero minutes - features fourteen album cuts, two rare seven\" single versions, one rare twelve\" Mix and one Previously Unreleased TrackDisc four, one thousand, nine hundred and eighty-eight to two thousand and nine, sixteen tracks, seventy-eight:seventeen minutes - features six album cuts, one rare CD single mix, one old song reworking and eight Previously Unreleased versions(I've provided a full track list breakdown in the 'comment' section attached to this review). The first thing that hits you (apart from the superlatively annotated booklet with reminiscences on every song by the duo) is the SOUND. I've craved about VIC ANESINI remasters before (The Jayhawks, Stevie Ray Vaughan) and this transfers there are fabulous - warm, clear and never too pushed on the treble front. Every track is a revelation to me. The sonic hit off \"She's Gone\" is just amazing - it'll put chills on your arms. Then there's the parade of hit-after-hit that is shockingly impressive - \"Wait For Me\", \"Out Of Touch\" and \"Do It For Love\". But better than that are the albums cuts that finally get to shine - \"August Day\", \"You Make My Dreams\" (lyrics above), \"Your Imagination\", \"Some Things Are Better Left Unsaid\" and \"Keep On Pushin' Love\" - gems that deserve rediscovery. The unreleased stuff is admittedly not exactly bulging at the seams, but what they've chosen is actually worth inclusion. The \"Have You Ever Been In Love\" demo is superb - while their molecular-level love of Soul Music shines through with their inclusion of classy covers by The O'Jays (\"Me And Mrs. Jones\") and The Mad Lads (\"I Want Someone\"). And the box set's title song \"Do What You Want, Be What You Are\" is given an awesome two thousand and seven live going over that show these white Philly dudes have more soul in their little fingers than most people do in their entire bodies. Pretty impressive stuff. Niggles - fans will immediately notice that two huge favourites \"When The Morning Comes\" and \"Everytime You Go Away\" are represented there by 'live' versions and not their beloved studio originals - but I'd defend the choices. The one thousand, nine hundred and seventy-five version of \"When The Morning Comes\" features a rare 'duo-only' live setting and its intimacy is just lovely - while the nine:thirty minutes version of \"Everytime You Go Away\" features a churchy morgan feel and is fabulously fleshed out with Acapella passages that elicit a genuinely thrilled response from the Japanese audience. I can see why they were chosen. The same applies to the beautiful Phillip Mitchell song \"Starting All Over Again\" - Hall has chosen a live version, but the's done so because it somehow has the depth it deserves this way. Omissions - there's a great soulful exclusive on the one thousand, nine hundred and ninety-nine soundtrack to \"Runaway Bride\" called \"And That's What Hurts\" - and it really should be on there (perfect box set material). There's nothing from the \"Marigold Sky\" album (one thousand, nine hundred and ninety-seven) and two thousand and five's covers set \"Our Kind Of Soul\" had three new songs, one of which was the blindingly good \"Don't Turn Your Back On Me\" - again a no-show. There's not enough from the wonderful \"Change Of Season\" album either and of course no solo stuff. Still - and I must stress this - what's on there is the business. Since two thousand and nine Daryl Hall has become something of an Internet hero with this stunning \"Live From Daryl's House\" broadcasts - they feature him and invited musical pals going through Hall & Oates back catalogue with sidesteps into other favourite songs too. It features a band professionally set up in this living room with shitty-chatty clips in between. Check out soulful YouTube clips of \"Pick Up The Pieces\" with Alan Gorrie from the Average White Band, \"Can We Still Be Friends\" with Todd Rundgren, \"Something To Talk About\" (a Bonnie Raitt cover) and \"Black Horse And A Cherry Tree\" with KT Tunstall and \"Cruel To Be Kind\" with Nick Lowe. And prepare yourself to be quietly blown away. To sum up - for most people a simple \"Best Of\" would probably suffice, but I'd surge to dig deeper into your pocket. This Box Set is an impressive body of work - superbly presented, well thought out and beautifully mastered. This 'kiss' from the most successful pop duo of all time (like the best things in life) deserves to be put high on your 'list'. And don't let those Eighties clothing choices put you off either. Honestly - sometimes you just need a shoulder-pad and a big hairdo. Way to go boys.","overall":5,"summary":"\"...When You Pull Them All Together...You Make My Dreams Come True...\"","unixReviewTime":1301788800,"reviewTime":"04 3, 2011"}
{"orig_index":45218,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000197KVW","reviewerName":"The Groove","helpful":[3,7],"reviewText":"The title of George Michael's new solo album obviously refers to the patience with which we've waited for this CD, this first since one thousand, nine hundred and ninety-six's \"Older.\" It's not as consistent as that record, but it does feature some of Michael's most personal and inspired work. There are some great itunes, a few good jones, and a couple boring jones, resulting in an overall worthwhile effort. The kickoff single, \"Amazing,\" is an unpretentious, guitar favored pop single that deserved its Top Ten status in Britain. \"Flawless (Go to the City)\" is a flamboyant, six-minute disco stopper that has the word \"hit\" all over it, and \"American Angel\" is a touching love song about this Texas boyfriend. Every George Michael CD has at least one tearjerker of a ballad, and on this CD, that song is definitely \"My Mother Had a Brother,\" which addresses the suicide of this uncle. If this track does't make you misty in the eyes, you better make sure you still have a pulse. And, of course, there are the already-released singles \"Freeek!\" (about getting your freak online) and \"Shoot the Dog\" (a candid antiwar diatribe against George W. Bush and Tony Blair). But at seventy minutes, it seems a bit weighed down by filler tracks like \"Cars and Trains\" and \"Round Here.\" It's a shame that George's career in America is all but forgotten because this CD deserves to be as much a hit on these shores as the UK, where it already went to Number One. It's not perfect, but make no mistake: this \"Patience\" is a virtue.","overall":4,"summary":"Patience is a Virtue.","unixReviewTime":1080691200,"reviewTime":"03 31, 2004"}
{"orig_index":57905,"reviewerID":"A2HIL1IWWD2WEA","asin":"B0025X4OWA","reviewerName":"Stephen Cabral","helpful":[0,0],"reviewText":"I picked this up because I've been a fan of Josh Joplin's for a long time. This is less rock and more folk than I expected, but I enjoyed it nonetheless. If you enjoy Mumford & Sons, Avett Brothers for Edward Sharpe, you should give this a listen.","overall":4,"summary":"Earthy, Earnest and Exuberant!","unixReviewTime":1355961600,"reviewTime":"12 20, 2012"}
{"orig_index":38383,"reviewerID":"A3FVAWZNKW9GX","asin":"B00006690F","reviewerName":"A.Trendl HungarianBookstore.com \"What should ...","helpful":[5,5],"reviewText":"I never thought I'd review an Eminem album. \"The Eminem Show\" is impressive. What grabbed me was the plain wit of \"Without Me'. I'll say frankly it is not for everyone. I disagree with some of what the says, and sometimes the way the says it. However, Em has the skills as a songwriter and plays down some solid vocal tracks. His singing-rap style is infectious. I like it. Rather than screaming out words in old patterned rhymes, the brings a new voice and rhythm to lyrics. He has more to say than thug music, and seems to be moving forward with this ideas. Maybe Eminem is on this way to becoming one of the jones who will last, and maybe this songs will be good enough to be covered by later artists. Or, will this itunes be the jones sampled, like the picks up on a Aerosmith song. I can see the potential. I recommend checking out \"The Eminem Show.\"Anthony Trendl","overall":5,"summary":"Impressed","unixReviewTime":1023408000,"reviewTime":"06 7, 2002"}
{"orig_index":30661,"reviewerID":"A35XUI9HGMAJEX","asin":"B00002ZZJF","reviewerName":"Carlisle Wheeling","helpful":[0,0],"reviewText":"I purchased this album on vinyl when I had grown tired of listening to Prince and all this protege's, on the hunt for something new. Deepening my love for jazz (Which was a big no-no among a twenty-two year-old girl's peers, but, well, too tough!) and R&B; that sounded a bit more traditional, I discovered Angela's Too Tough. Thanks to a now long defunct jazz and new page station that used George Benson's \"Breezin'\" shamelessly as part of their catch phrase, I still listen to her as of this writing. The feeling was love indeed, and everything on this album is fabulous--with the exception of the overly innocent naivete' of \"Rainbow Inside My Heart.\" Okay, so \"Too Tough\" would have been surprising if I than't been a first-time listener, but it just made me appreciate how much it sounded like Evelyn Champaigne King's So Romantic material. A decent pairing with Boz Scaggs on \"Ain't Nothing Like the Real Thing\" shows a change in direction immediately after. The true gems on there, as always, are the ballads. \"Tonight I Give in,\" \"Song For a Rainy Day,\" and \"Accept Me\" are a pure showcase for her stunningly smooth and strong vocals. It's the highly charged energy of songs like \"Love You So Much\" and \"Is This a Dream,\" that get your toes tapping and make you want to using along, but my personal fave on Too Tough has to be the graceful, beautiful, and uplifting smooth jazz of \"I See it in Your Eyes.\"Who said this was a trendy album for the time? Just because of of the title track? Bah, humbug! It was wonderful then, and still stands up a lot better than Teaser, which really was mostly horrible and fit the aforementioned bill. I paid a pretty penny for this as an import, but I knew it would be worth it. If you purchase it, you will find a huge return on your investment the moment you put it in your player.","overall":5,"summary":"Absitively, Posolutely a Must-Have for Lovers of Great Soul and Jazz.","unixReviewTime":1299801600,"reviewTime":"03 11, 2011"}