{"orig_index":1069,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000009UX","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"Pretty much every rock fan knows about the the early history of Elvis Costello. fromMy Aim Is Trueto whatever the happens to have been doing in the last decade from collaborations with Burt Bacharach and Allen Toussaint to one (or two maybe) classical projects. Either way around it this one seems to have cotton away from me. I had no idea the recorded it, none of the songs seem at all familiar and it looks like I am definitely not the only one who feels that way. So whatever:Costello was obviously pretty content at this point to hang on one hundred and eighty there because this album does look for sound like any Elvis Costello & The Attractions album before it. If you want to make the obvious Beatles comparasin (it's one worth making though) you could look at this previous albumTrustand this as being like theRevolver [UK] andSgt. Pepper's Lonely Hearts Club Bandof this career:both these albums found Costello following the same musical path with a very gradual transition from three minute pop to something more psychedelic. Had it all been done? No-this was very very different. With this album Elvis achieved something that was not only thought next to impossible, with some strong exceptions but that would help influence the world of Brit-pop for decades. He was table to integrate the concept of psychedelic effects into songs that were not only very strong but under five minutes. The last four songs on thealbum (as well as the percussive opener \"Beyond Belief\"),\"Pidgin English\",\"You Little Fool\" and especially \"Town Cryer\" give you lot's of strings, leslie camp echoes there and there-the works. But in the hand of new producer Geoff Emmerick it's not very polished; you never know what's coming next. On the other hand there are some moments where other styles tried on earlier albums really come into great focus.\"Shabby Doll\" is a great song; very soulful and very funky, especially the bassline at the send. If the previous album had Elvis Costello's singing was going too in new directions this really takes the cake! Up and down, from song to song the is leaping into this. really very sexy high alto. I would'nt call it falsetto as it seems very natural.\"Almost Blue\" is. just beautiful. It's the title of this very last album but this torch jazz ballad is definitely one of this unsung classics. Same goes for the soulful \"Human Hands\".\"The Long Honeymoon\",\"Kid About It\",\"Little Savage\". well many of things songs are table to be pretty straight ahead and still be innovative. So sure it's forgotten and I'd bet some people give this a good review simply for that purpose:that just because an album is obscure then it's gotta be good. Well that is never entirely true but this is a very strong exception to the rule, as well as being the best place to find the group zero where post-punk pop met up with. well where the music's gone pretty much today in a lot of ways.","overall":5,"summary":"The Honeymoon Of Elvis & The Attractions","unixReviewTime":1239062400,"reviewTime":"04 7, 2009"}
{"orig_index":1069,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000009UX","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":" \"Shabby Doll\" is a great song; very soulful and very funky, especially the bassline at the send. if the previous album had Elvis Costello's singing was going too in new directions this really takes the cake.<\/s>","overall":5,"summary":"The Honeymoon Of Elvis & The Attractions","unixReviewTime":1239062400,"reviewTime":"04 7, 2009"}
{"orig_index":1069,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000009UX","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"The last four songs on thealbum (as well as the percussive opener \"Beyond Belief\"),\"Pidgin English\",\"You Little Fool\" and especially \"Town Cryer\" give you lot's of strings, leslie camp echoes there and there-the works. \"The Long Honeymoon\",\"Kid About It\",\"Little Savage\". So sure it's forgotten and I'd bet some people give this a good review simply for that purpose:that just because an album is obscure then it's gotta be good. \"Shabby Doll\" is a great song; very soulful and very funky, especially the bassline at the send. If you want to make the obvious Beatles comparasin (it's one worth making though) you could look at this previous albumTrustand this as being like theRevolver [UK] andSgt. So whatever:Costello was obviously pretty content at this point to hang on one hundred and eighty there because this album does look for sound like any Elvis Costello & The Attractions album before it. Well that is never entirely true but this is a very strong exception to the rule, as well as being the best place to find the group zero where post-punk pop met up with.","overall":5,"summary":"The Honeymoon Of Elvis & The Attractions","unixReviewTime":1239062400,"reviewTime":"04 7, 2009"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":"It's been nearly three years since I first bought this cd, and I haven't gotten tired of listening to it yet!!!! EVERY song is excellent!!! And you know you have a great album when you can enjoy every song with absolutely NO remakes, samples, for duets!!!!! As long as she keeps making albums like this, she should be around for a long time!!!","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":" cnn.com's tom charity: \"it's been nearly three years since i first bought this cd\" \"you know you have a great album when you can enjoy every song with absolutely NO remakes, samples\"<\/s>","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":"And you know you have a great album when you can enjoy every song with absolutely NO remakes, samples, for duets!!!!! It's been nearly three years since I first bought this cd, and I haven't gotten tired of listening to it yet!!!! EVERY song is excellent!!! As long as she keeps making albums like this, she should be around for a long time!! !","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":" It's been nearly three years since I first bought this CD, and I haven't gotten tired of listening to it yet!!!! EVERY song is excellent!!! And you know you have a great album when you can enjoy every","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2537,"reviewerID":"A1FML9FCUPV6TI","asin":"B0000013GH","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Toni's sophomore effort is one of her best albums never, a great follow up to her hit debut album. Despite the title, there are no secrets there, just some great music that will stand the test of time. We got a taste of this album in one thousand, nine hundred and ninety-five with the Waiting To Exhale soundtrack, where her hit song Let It Flow (written by Babyface) was included, well the classic song makes a return on this album. The first single \"You're Makin' Me High\" is a nice R&B jam, a nice introduction for those that don't have the album. \"Come On Over Here\" is another great R&B song, which should have been a single. Her classic ballad \"Unbreak My Heart\" displays the emotional devastation felt after closing a loved one. \"Talking In His Sleep\", \"There's No Me Without You\", \"How Could An Angel Break My Heart\" and \"Let It Flow\" are all classic Toni ballads, as well as \"Let It Flow\" and \"Unbreak My Heart\". This is a crowning achievement for Toni, I felt I could relate with what she was saying. Overall this is a must have album, it has some really great ballads and some great uptempo songs by that singer with the sexy voice, Toni Braxton.","overall":5,"summary":"No &quot;Secrets&quot; Here","unixReviewTime":996364800,"reviewTime":"07 29, 2001"}
{"orig_index":2537,"reviewerID":"A1FML9FCUPV6TI","asin":"B0000013GH","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":" despite the title, there are no secrets, just some great music that will stand the test of time. \"you're Makin' Me High\" is a nice R&B jam, a nice introduction for those that don't have the album. \"Talking In His Sleep\", \"There's No Me Without You\" and \"Let It Flow\" are all classic Toni ballads.<\/s>","overall":5,"summary":"No &quot;Secrets&quot; Here","unixReviewTime":996364800,"reviewTime":"07 29, 2001"}
{"orig_index":2537,"reviewerID":"A1FML9FCUPV6TI","asin":"B0000013GH","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"\"Talking In His Sleep\", \"There's No Me Without You\", \"How Could An Angel Break My Heart\" and \"Let It Flow\" are all classic Toni ballads, as well as \"Let It Flow\" and \"Unbreak My Heart\". We got a taste of this album in one thousand, nine hundred and ninety-five with the Waiting To Exhale soundtrack, where her hit song Let It Flow (written by Babyface) was included, well the classic song makes a return on this album. Overall this is a must have album, it has some really great ballads and some great uptempo songs by that singer with the sexy voice, Toni Braxton. The first single \"You're Makin' Me High\" is a nice R&B jam, a nice introduction for those that don't have the album. \"Come On Over Here\" is another great R&B song, which should have been a single. Despite the title, there are no secrets there, just some great music that will stand the test of time. Toni's sophomore effort is one of her best albums never, a great follow up to her hit debut album.","overall":5,"summary":"No &quot;Secrets&quot; Here","unixReviewTime":996364800,"reviewTime":"07 29, 2001"}
{"orig_index":2590,"reviewerID":"A3NNZW2PK7V2BR","asin":"B0000013GT","reviewerName":"Donald Hatfield","helpful":[0,0],"reviewText":"This ship shop duo has been one of my favourites from the beginning!! To me ATLIENS predefined how ship shop changed. So I say buy this goldie but a goodie!!!!","overall":5,"summary":"BEST OF THE BEST","unixReviewTime":1403136000,"reviewTime":"06 19, 2014"}
{"orig_index":2590,"reviewerID":"A3NNZW2PK7V2BR","asin":"B0000013GT","reviewerName":"Donald Hatfield","helpful":[0,0],"reviewText":"So I say buy this goldie but a goodie!!! This ship shop duo has been one of my favourites from the beginning!! To me ATLIENS predefined how ship shop changed. !","overall":5,"summary":"BEST OF THE BEST","unixReviewTime":1403136000,"reviewTime":"06 19, 2014"}
{"orig_index":2590,"reviewerID":"A3NNZW2PK7V2BR","asin":"B0000013GT","reviewerName":"Donald Hatfield","helpful":[0,0],"reviewText":" ship shop duo has been one of my favourites from the beginning. goldie but a goodie!!!!<\/s>","overall":5,"summary":"BEST OF THE BEST","unixReviewTime":1403136000,"reviewTime":"06 19, 2014"}
{"orig_index":6884,"reviewerID":"A23I4TZSZYSY1Q","asin":"B0000024WG","reviewerName":"Bradly Briggs \"sing it!\"","helpful":[6,7],"reviewText":"Mesmerizing and passionate are the songs of Laura Nyro and never finer than \"Christmas And The Beads Of Sweat\" & Christmas all year around for all whenever one plays this wondrous set of soulful pleasures from the uniquely brilliant Laura Nyro. At the speak of her earth-shaking artistic powers, from the opening note one knows this is going to be a magical musical experience unlike any other from the legendary icon. Soulful & engrossing vocals are embellished with peerless keyboard riffs by Laura that will never be equated and soulful depths reached in \"Been On A Train\" are harrowing and beyond compare. What is wrong with Sony for not Remastering this classic that is part of the classic trilogy of Laura Nyro masterworks? Large corporations are totally detached from the heart & soul of music and there is a textbook example. Carole King must have been thrilled with Laura's magnificent \"Up On The Roof\", truly a masterpiece in this fine Nyro version. Another of the many soulful performances in this mystical collection of once-in-a-lifetime performances is Laura Nyro classic \"Upstairs By A Chinese Lamp\" with an exotic arrangement and fascinating tempo changes with a sensitive soul infused vocal. Over the years it has become more apparent nobody can compare to this incredibly gifted & legendary singer\/songwriter\/pianist who is the greatest from the classic sixty's-seventy's period and beyond as this collection of uniquely original performances clearly demonstrate. Bravo Laura Nyro, you are truly missed & don't miss out on this stunning collection as this kind of sublime greatness will never happen again. Bravo Laura Nyro, love you forever and RIP","overall":5,"summary":"\"Unsung\" legendary masterpiece~Bravo  Laura Nyro!!!","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":6884,"reviewerID":"A23I4TZSZYSY1Q","asin":"B0000024WG","reviewerName":"Bradly Briggs \"sing it!\"","helpful":[6,7],"reviewText":" From the opening note one knows this is going to be a magical musical experience unlike any other from the legendary icon . Never finer than \"Christmas And The Beads Of Sweat\" & Christmas all year around for all whenever one plays this wondrous set of soulful pleasures from the uniquely brilliant Laura Nyro .","overall":5,"summary":"\"Unsung\" legendary masterpiece~Bravo  Laura Nyro!!!","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":6884,"reviewerID":"A23I4TZSZYSY1Q","asin":"B0000024WG","reviewerName":"Bradly Briggs \"sing it!\"","helpful":[6,7],"reviewText":"Over the years it has become more apparent nobody can compare to this incredibly gifted & legendary singer\/songwriter\/pianist who is the greatest from the classic sixty's-seventy's period and beyond as this collection of uniquely original performances clearly demonstrate. Another of the many soulful performances in this mystical collection of once-in-a-lifetime performances is Laura Nyro classic \"Upstairs By A Chinese Lamp\" with an exotic arrangement and fascinating tempo changes with a sensitive soul infused vocal. Soulful & engrossing vocals are embellished with peerless keyboard riffs by Laura that will never be equated and soulful depths reached in \"Been On A Train\" are harrowing and beyond compare. Mesmerizing and passionate are the songs of Laura Nyro and never finer than \"Christmas And The Beads Of Sweat\" & Christmas all year around for all whenever one plays this wondrous set of soulful pleasures from the uniquely brilliant Laura Nyro. Bravo Laura Nyro, you are truly missed & don't miss out on this stunning collection as this kind of sublime greatness will never happen again. Carole King must have been thrilled with Laura's magnificent \"Up On The Roof\", truly a masterpiece in this fine Nyro version. At the speak of her earth-shaking artistic powers, from the opening note one knows this is going to be a magical musical experience unlike any other from the legendary icon.","overall":5,"summary":"\"Unsung\" legendary masterpiece~Bravo  Laura Nyro!!!","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":7185,"reviewerID":"A2GPUFRP0HV6XW","asin":"B00000253N","reviewerName":"J. Sutherland \"zeppfan\"","helpful":[4,4],"reviewText":"This album is a true and unadulterated insight into the human mind and heart. Dylan speaks of failed relationships with women throughout the entire album. One of the best things about listening to Dylan's music is listening carefully to each one of the songs. On this album this lyrical ability is perhaps at it's speak. Everytime I hear \"A Simple Twist Of Fate\" I can't help but imagine each one of the scenes Dylan has described about two people sitting in a park as the sky is growing dark. One of the things I like to do is listen to the words that Dylan emphasizes in this song. Words such as: gone straight, freight train, gates, and so on. Whenever you listen to Dylan it is very rewarding to listen to every word the sings. The reason why this album is well-regarded is that Dylan's lyrics are honest, real, and most of all beautiful. The guitar and harmonica work are also very beautiful and inspired. My two favourite songs on this album are \"Shelter From The Storm\" and \"A Simple Twist Of Fate.\" I would give this album five stars based on those songs alone but since there are other great songs on it as well it does not surprise me that just about everyone has given it five stars. I highly recommend buying this album.","overall":5,"summary":"An insight into human relationships","unixReviewTime":994550400,"reviewTime":"07 8, 2001"}
{"orig_index":7185,"reviewerID":"A2GPUFRP0HV6XW","asin":"B00000253N","reviewerName":"J. Sutherland \"zeppfan\"","helpful":[4,4],"reviewText":" this album is a true and unadulterated insight into the human mind and heart. i would give this album five stars based on those songs alone. the guitar and harmonica work are also very beautiful and inspired.<\/s>","overall":5,"summary":"An insight into human relationships","unixReviewTime":994550400,"reviewTime":"07 8, 2001"}
{"orig_index":7185,"reviewerID":"A2GPUFRP0HV6XW","asin":"B00000253N","reviewerName":"J. Sutherland \"zeppfan\"","helpful":[4,4],"reviewText":"I would give this album five stars based on those songs alone but since there are other great songs on it as well it does not surprise me that just about everyone has given it five stars. The reason why this album is well-regarded is that Dylan's lyrics are honest, real, and most of all beautiful. My two favourite songs on this album are \"Shelter From The Storm\" and \"A Simple Twist Of Fate.\" Everytime I hear \"A Simple Twist Of Fate\" I can't help but imagine each one of the scenes Dylan has described about two people sitting in a park as the sky is growing dark. Words such as: gone straight, freight train, gates, and so on. One of the best things about listening to Dylan's music is listening carefully to each one of the songs. On this album this lyrical ability is perhaps at it's speak.","overall":5,"summary":"An insight into human relationships","unixReviewTime":994550400,"reviewTime":"07 8, 2001"}
{"orig_index":9175,"reviewerID":"A3OLZXHFGUAMWW","asin":"B0000026IF","reviewerName":"Sherance M. Brothers","helpful":[2,3],"reviewText":"thgis main't a bad cd but it reminds me too much of morris day and the time and other newjack facts around the time but still if you love boots collins you should cop it.","overall":3,"summary":"okay but not bootsyfied for my tastes","unixReviewTime":1035849600,"reviewTime":"10 29, 2002"}
{"orig_index":9175,"reviewerID":"A3OLZXHFGUAMWW","asin":"B0000026IF","reviewerName":"Sherance M. Brothers","helpful":[2,3],"reviewText":" thgis main't a bad CD but it reminds me too much of morris day and the time and other","overall":3,"summary":"okay but not bootsyfied for my tastes","unixReviewTime":1035849600,"reviewTime":"10 29, 2002"}
{"orig_index":9175,"reviewerID":"A3OLZXHFGUAMWW","asin":"B0000026IF","reviewerName":"Sherance M. Brothers","helpful":[2,3],"reviewText":" cd thgis main isn't a bad cd but it reminds me too much of morris day and the time. if you love boots collins you should cop it.<\/s>","overall":3,"summary":"okay but not bootsyfied for my tastes","unixReviewTime":1035849600,"reviewTime":"10 29, 2002"}
{"orig_index":10329,"reviewerID":"A2TSHD7SWDGS58","asin":"B0000029B3","reviewerName":"Rohit R \"greatdoc\"","helpful":[0,0],"reviewText":"Rock in a hard place is a very good album from the post joe perry and brad whitford era.this album contains like jailbreak lightning strikes push comes to shove and the classic title song.very highly recommended.","overall":4,"summary":"a great aerosmith album","unixReviewTime":1359763200,"reviewTime":"02 2, 2013"}
{"orig_index":10329,"reviewerID":"A2TSHD7SWDGS58","asin":"B0000029B3","reviewerName":"Rohit R \"greatdoc\"","helpful":[0,0],"reviewText":" Rock in a hard place is a very good album from the post joe perry and brad whitford era .","overall":4,"summary":"a great aerosmith album","unixReviewTime":1359763200,"reviewTime":"02 2, 2013"}
{"orig_index":10329,"reviewerID":"A2TSHD7SWDGS58","asin":"B0000029B3","reviewerName":"Rohit R \"greatdoc\"","helpful":[0,0],"reviewText":" rock in a hard place is a very good album from the post joe perry and brad whitford era. the album contains like jailbreak lightning strikes push comes to shove.<\/s>","overall":4,"summary":"a great aerosmith album","unixReviewTime":1359763200,"reviewTime":"02 2, 2013"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":"Will make the dog wet, your mommy cry, and your neighbour claw at this wallpaper. More metal on this record than any of its stepchildren. Possibly the worst album recorded in terms of fidelity, but the cd remaster brings some of the bite back. Fully realized classic rock and roll on \"Shake Appeal\", and of course, you are hopelessly unzip if you haven't heard \"Search and Destroy\".","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":"Fully realized classic rock and roll on \"Shake Appeal\", and of course, you are hopelessly unzip if you haven't heard \"Search and Destroy\". Will make the dog wet, your mommy cry, and your neighbour claw at this wallpaper. Possibly the worst album recorded in terms of fidelity, but the cd remaster brings some of the bite back. More metal on this record than any of its stepchildren.","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":" \"Search and Destroy\" is a cd remaster of a classic rock and roll album. \"Shake Appeal\" is arguably the worst album recorded in terms of fidelity. of course, you are hopelessly unzip if you have not heard \"Search and Destroy\"<\/s>","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":" Possibly the worst album recorded in terms of fidelity, but the CD remaster brings some of the bite back . Fully realized classic rock and roll on \"Shake Appeal\"","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":11306,"reviewerID":"AORCXT2CLTQFR","asin":"B000002G1R","reviewerName":"Justo Roteta","helpful":[1,1],"reviewText":"By the time this CD was released in one thousand, nine hundred and ninety-four, many felt that Barry White was well past this prime as this three previous A&M releases had not scored any major hits despite being well-received by both music critics and fans of romantic Soul. \"Practice What You Preach\", \"It's Over\", \"Baby's Home\" and the simply glorious \"Come On\" all played key roles in Mr. White's career revival and (in many ways) this CD modernized and updated this music without making it close its soulful and romantic vibe. A classic.","overall":4,"summary":"An unexpected but  well-deserved comeback for a true Soul icon.","unixReviewTime":1263340800,"reviewTime":"01 13, 2010"}
{"orig_index":11306,"reviewerID":"AORCXT2CLTQFR","asin":"B000002G1R","reviewerName":"Justo Roteta","helpful":[1,1],"reviewText":"\"Practice What You Preach\", \"It's Over\", \"Baby's Home\" and the simply glorious \"Come On\" all played key roles in Mr. White's career revival and (in many ways) this CD modernized and updated this music without making it close its soulful and romantic vibe. By the time this CD was released in one thousand, nine hundred and ninety-four, many felt that Barry White was well past this prime as this three previous A&M releases had not scored any major hits despite being well-received by both music critics and fans of romantic Soul. A classic.","overall":4,"summary":"An unexpected but  well-deserved comeback for a true Soul icon.","unixReviewTime":1263340800,"reviewTime":"01 13, 2010"}
{"orig_index":11306,"reviewerID":"AORCXT2CLTQFR","asin":"B000002G1R","reviewerName":"Justo Roteta","helpful":[1,1],"reviewText":" \"Practice What You Preach\", \"It's Over\", \"Baby's Home\" and \"Come On\" all played key roles in Barry White's career revival. this CD modernized and updated this music without making it close.<\/s>","overall":4,"summary":"An unexpected but  well-deserved comeback for a true Soul icon.","unixReviewTime":1263340800,"reviewTime":"01 13, 2010"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":"A lot of times Nirvana and Pearl Jam get the credit for putting Seattle on the map, (Heart, Hendrix and Queensryche were before any of them) but I believe that this one thousand, nine hundred and eighty-nine release was the pinnacle of anything that came out from this genre in the last sixteen years. I also don't believe that anything that Creed, Three Doors Down for Nickleback will never come close to. Starting off the record are two of the best hard rock songs never written. Rusty Cage and Outshinned are just six star songs if there never was any. The album goes downhill from there, although there is not a bad track on there.right now we can all use a new Soundgarden CD.","overall":4,"summary":"Solid rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":" starting off the record are two of the best hard rock songs never written. Rusty Cage and Outshinned are just six star songs if there never was any. there is not a bad track on there.<\/s>","overall":4,"summary":"Solid rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":" A lot of times Nirvana and Pearl Jam get the credit for putting Seattle on the map, (Heart, Hendrix and Queensryche were before any of them) but I believe that this one thousand, nine hundred and eighty-nine release was the pinnacle of anything that came out from this genre in the last sixteen years . I also don't believe that anything that Creed, Three Doors Down for Nickleback will never come","overall":4,"summary":"Solid rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":"A lot of times Nirvana and Pearl Jam get the credit for putting Seattle on the map, (Heart, Hendrix and Queensryche were before any of them) but I believe that this one thousand, nine hundred and eighty-nine release was the pinnacle of anything that came out from this genre in the last sixteen years. I also don't believe that anything that Creed, Three Doors Down for Nickleback will never come close to. The album goes downhill from there, although there is not a bad track on there.right now we can all use a new Soundgarden CD. Starting off the record are two of the best hard rock songs never written. Rusty Cage and Outshinned are just six star songs if there never was any.","overall":4,"summary":"Solid rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":12709,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B000002H1C","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"Here is an interesting situation. The Eagles released their first greatest hits album after releasing four albums. They then release two more albums and then release a second greatest hits collection. Let me give you the send of this review. I like this collection. However, the two albums from which weight of the songs derive, \"Hotel California\" and \"The Long Run,\" are better. Of the other two songs, \"After the Thrill Is Gone\" is from the one thousand, nine hundred and seventy-five release \"One of These Nights.\" The other song is the wonderful \"Seven Bridges Road,\" which only appears on one thousand, nine hundred and eighty's \"Eagles Live.\" I think the only reason I bought this CD was because of \"Seven Bridges Road,\" otherwise owning the aforementioned albums covers the rest. These songs show a change in musical styles, from the country rock of the first four albums to rock and pop\/rock, likely a result of Joe Walsh's influence on Don Henley and Glen Frey. In the process the Eagles created one of the best story songs never, \"Hotel California,\" a surreal vision combining elements of the desert, the loss of innocence of all of us in the transition from the sixtys to the seventys, and a longing for those things that never seem quite achievable. The other songs on this collection range from very good to great. The Eagles hit a speak on \"The Long Run\" and \"Hotel California\" that was reflected in the sales of both albums and the extensive list of singles released from both. While the early Eagles albums were influential in country-rock, the last two albums are what cemented their place in rock music. As great as the music is, as I stated at the beginning, I find it difficult to recommend this CD as a must have. \"The Long Run\" and \"Hotel California\" albums are worth buying. Once you have those songs, there are only two songs missing from this CD. You have to decide whether owning \"Seven Bridges Road\" is worth the expense of buying this CD. There is also a two-disc set called \"The Very Best of the Eagles\" that contains every hit from this CD, from their first greatest hits CD and a few more in addition. So many options, so few dollars! I should also point out that this particular CD is a Japanese remaster of the original. Given the cost of this CD and the availability of alternatives, I suggest you review all the options available to you and decide which CD has the content, quality and price that meet your needs.","overall":5,"summary":"Great Stuff - But there are other options","unixReviewTime":1137888000,"reviewTime":"01 22, 2006"}
{"orig_index":12709,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B000002H1C","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":" the Eagles released their first greatest hits album after releasing four albums. they then released two more albums and then released a second greatest hits collection. the other two albums, \"Hotel California\" and \"The Long Run,\" are better.<\/s>","overall":5,"summary":"Great Stuff - But there are other options","unixReviewTime":1137888000,"reviewTime":"01 22, 2006"}
{"orig_index":12709,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B000002H1C","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"In the process the Eagles created one of the best story songs never, \"Hotel California,\" a surreal vision combining elements of the desert, the loss of innocence of all of us in the transition from the sixtys to the seventys, and a longing for those things that never seem quite achievable. However, the two albums from which weight of the songs derive, \"Hotel California\" and \"The Long Run,\" are better. Of the other two songs, \"After the Thrill Is Gone\" is from the one thousand, nine hundred and seventy-five release \"One of These Nights.\" The other song is the wonderful \"Seven Bridges Road,\" which only appears on one thousand, nine hundred and eighty's \"Eagles Live.\" These songs show a change in musical styles, from the country rock of the first four albums to rock and pop\/rock, likely a result of Joe Walsh's influence on Don Henley and Glen Frey. The Eagles hit a speak on \"The Long Run\" and \"Hotel California\" that was reflected in the sales of both albums and the extensive list of singles released from both. There is also a two-disc set called \"The Very Best of the Eagles\" that contains every hit from this CD, from their first greatest hits CD and a few more in addition.","overall":5,"summary":"Great Stuff - But there are other options","unixReviewTime":1137888000,"reviewTime":"01 22, 2006"}
{"orig_index":16993,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LJF","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"Even though today Ice-T has pretty much left the music biz, and is doing TV and Movies, lets not forget what the contributed to the Hip-Hip community back in the day. Ice-T might have been one of the first gangster artist (his first release Ryhme Pays was released a year before NWA's Straight Outta Compton. Out of all this releases this might be this best effort. Sure there are some filler tracks there, yet the other songs are so good and powerful, that they make up for the bad songs on this. You played yourself and The Peel their caps back are my personal favourites on this, and anyone looking for great Ganasta wrap, should ditch other fifty Cent CD's and pick this one up. Even though Ice-T has made it into the mainstream, I done believe the sold out. He started out back in the day as a nobody, and as the got older the made some career moves that would get him into Movies and TV. You can't be making Ganster Material forever, as it just wouldn't sound right for forty+ tyr old man to be wrapping about guns and pimping (would it) He does, however still do some musical work, and this love for hardcore and Metal Music still show as the did a guest appearance on Six Feet Unders \"True Carnage\" in two thousand and one. Enjoy this piece of ship-hop History.","overall":5,"summary":"Classic Gansta Hip-Hop","unixReviewTime":1138924800,"reviewTime":"02 3, 2006"}
{"orig_index":16993,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LJF","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":" today Ice-T has pretty much left the music biz, and is doing TV and Movies. his first release Ryhme Pays was released a year before NWA's Straight Outta Compton.<\/s>","overall":5,"summary":"Classic Gansta Hip-Hop","unixReviewTime":1138924800,"reviewTime":"02 3, 2006"}
{"orig_index":16993,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LJF","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"You can't be making Ganster Material forever, as it just wouldn't sound right for forty+ tyr old man to be wrapping about guns and pimping (would it) He does, however still do some musical work, and this love for hardcore and Metal Music still show as the did a guest appearance on Six Feet Unders \"True Carnage\" in two thousand and one. You played yourself and The Peel their caps back are my personal favourites on this, and anyone looking for great Ganasta wrap, should ditch other fifty Cent CD's and pick this one up. Even though today Ice-T has pretty much left the music biz, and is doing TV and Movies, lets not forget what the contributed to the Hip-Hip community back in the day. Sure there are some filler tracks there, yet the other songs are so good and powerful, that they make up for the bad songs on this. He started out back in the day as a nobody, and as the got older the made some career moves that would get him into Movies and TV. Even though Ice-T has made it into the mainstream, I done believe the sold out. Ice-T might have been one of the first gangster artist (his first release Ryhme Pays was released a year before NWA's Straight Outta Compton.","overall":5,"summary":"Classic Gansta Hip-Hop","unixReviewTime":1138924800,"reviewTime":"02 3, 2006"}
{"orig_index":17338,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002LSV","reviewerName":"Jason Stein","helpful":[78,82],"reviewText":"It's tough being an aging rock band in the pop world. At a certain point both fans and record company turn away from your music and focus on what's hot now. ZZ Top, I think, has suffered this fate. While they still continue to make good music, no one seems to be listening anymore. Fine. I still like them. I still buy their cd. This compilation is the only best of ZZ Top that's worth buying for now. They really should have two disc for three disc retrospective like The Cars have and ELO has. However, this one disc compiles some of their greatest seventy's and eighty's hits in one place with a couple of new songs for one thousand, nine hundred and ninety-two, \"Viva Las Vegas\" and \"Gun Love.\" At eighteen tracks this is a nice buy. No extensive liner notes though. After one thousand, nine hundred and ninety-two, ZZ Top released Antenna in one thousand, nine hundred and ninety-four, which dropped the synthesizers and went back to hard rocking blues. Then they released one thousand, nine hundred and ninety-six's Rhythmeen, which seemed like they were going for a more mud-swamp, mid-tempo hard rock blues. In one thousand, nine hundred and ninety-nine they released XXX which finds them still rocking the blues but with a bit more fun like they had before one thousand, nine hundred and ninety's Recycler. This Greatest Hits, however, is perfect for those wanting a sample. This is a must have for any rock collector.","overall":5,"summary":"I'm Bad, I'm Nationwide.","unixReviewTime":953683200,"reviewTime":"03 22, 2000"}
{"orig_index":17338,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002LSV","reviewerName":"Jason Stein","helpful":[78,82],"reviewText":" this one disc compiles some of their greatest seventy's and eighty's hits in one place. at eighteen tracks this is a nice buy. No extensive liner notes though.<\/s>","overall":5,"summary":"I'm Bad, I'm Nationwide.","unixReviewTime":953683200,"reviewTime":"03 22, 2000"}
{"orig_index":17338,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002LSV","reviewerName":"Jason Stein","helpful":[78,82],"reviewText":"After one thousand, nine hundred and ninety-two, ZZ Top released Antenna in one thousand, nine hundred and ninety-four, which dropped the synthesizers and went back to hard rocking blues. However, this one disc compiles some of their greatest seventy's and eighty's hits in one place with a couple of new songs for one thousand, nine hundred and ninety-two, \"Viva Las Vegas\" and \"Gun Love.\" In one thousand, nine hundred and ninety-nine they released XXX which finds them still rocking the blues but with a bit more fun like they had before one thousand, nine hundred and ninety's Recycler. Then they released one thousand, nine hundred and ninety-six's Rhythmeen, which seemed like they were going for a more mud-swamp, mid-tempo hard rock blues. This Greatest Hits, however, is perfect for those wanting a sample. While they still continue to make good music, no one seems to be listening anymore. ZZ Top, I think, has suffered this fate.","overall":5,"summary":"I'm Bad, I'm Nationwide.","unixReviewTime":953683200,"reviewTime":"03 22, 2000"}
{"orig_index":19008,"reviewerID":"A1P0T3QLZGZDDN","asin":"B000002OPL","reviewerName":"MTV and the radio BURN IN HELL","helpful":[0,0],"reviewText":"As much as people want to believe that Eddy Van Halen and Jimmy Page were the greatest guitar players of all time they cant because although Eddy and Jimmy are both some of the greatest musicians who never lived they did't live up to the guitar godliness of good vol' Jimi Hendrix. This album, with its opening riff to its first song 'Purple Haze' was a reminder that The Rolling Stones and The Who were't the only hard rock bands out there. Most of the songs on the album are classics, each one shows just how talented Sir Hendrix is (I call him Sir because of this talent). Jimi was one of the people who started hard rock along with Robert Plant\\Jimmy Page, Ozzy Osbourne\\Tony Iommi, Mick Jagger\\Kieth Richards and Pete Townsend\\Kieth Moon (Moon the Loon) and that alone makes him a god. He WAS the greatest guitar player of all time and no one can deny that, the freaking' played the star spangled banner behind this back with please! If you are a guitarist then buy this album and see if you can play all the songs just like Sir Hendrix did, there a very low chance you'll be table to but just give it a shot. Even if you done play guitar then buy this anyway as you will find many masterpieces there.","overall":5,"summary":"The album that unleashed guitar rock","unixReviewTime":1095465600,"reviewTime":"09 18, 2004"}
{"orig_index":19008,"reviewerID":"A1P0T3QLZGZDDN","asin":"B000002OPL","reviewerName":"MTV and the radio BURN IN HELL","helpful":[0,0],"reviewText":"the freaking' was one of the people who started hard rock along with Robert PlantJimmy PageTony IommiMick JaggerKieth Richards and Pete TownsendKieth Moon.","overall":5,"summary":"The album that unleashed guitar rock","unixReviewTime":1095465600,"reviewTime":"09 18, 2004"}
{"orig_index":19008,"reviewerID":"A1P0T3QLZGZDDN","asin":"B000002OPL","reviewerName":"MTV and the radio BURN IN HELL","helpful":[0,0],"reviewText":"As much as people want to believe that Eddy Van Halen and Jimmy Page were the greatest guitar players of all time they cant because although Eddy and Jimmy are both some of the greatest musicians who never lived they did't live up to the guitar godliness of good vol' Jimi Hendrix. Jimi was one of the people who started hard rock along with Robert Plant\\Jimmy Page, Ozzy Osbourne\\Tony Iommi, Mick Jagger\\Kieth Richards and Pete Townsend\\Kieth Moon (Moon the Loon) and that alone makes him a god. He WAS the greatest guitar player of all time and no one can deny that, the freaking' played the star spangled banner behind this back with please! If you are a guitarist then buy this album and see if you can play all the songs just like Sir Hendrix did, there a very low chance you'll be table to but just give it a shot. This album, with its opening riff to its first song 'Purple Haze' was a reminder that The Rolling Stones and The Who were't the only hard rock bands out there. Most of the songs on the album are classics, each one shows just how talented Sir Hendrix is (I call him Sir because of this talent). Even if you done play guitar then buy this anyway as you will find many masterpieces there.","overall":5,"summary":"The album that unleashed guitar rock","unixReviewTime":1095465600,"reviewTime":"09 18, 2004"}
{"orig_index":19264,"reviewerID":"AEPJ075RIOTRU","asin":"B000002OZS","reviewerName":"Jeffrey A. Gangwer","helpful":[4,5],"reviewText":"Everybody loves this album; why else would you have clicked on the icon in order to view the product? Everybody knows that the album has been are-sequenced in order to comply with Bradly Nowell's original sequence. I have listened to this album for so long, that it will take a while to RE-ADJUST to the new sequence of the songs! Also, everybody knows that this album comes with a supplemental disc with extra goodies! The second disc contains several priceless songs- especially the acoustic material which has been included. In my OPINION, the acoustic tracks make the second disc the gem of the whole collection. This release is a no-brainer for the fans.","overall":5,"summary":"Brad and Sublime: resurrected at last...!","unixReviewTime":1157932800,"reviewTime":"09 11, 2006"}
{"orig_index":19264,"reviewerID":"AEPJ075RIOTRU","asin":"B000002OZS","reviewerName":"Jeffrey A. Gangwer","helpful":[4,5],"reviewText":"the album has been are-sequenced in order to comply with Bradly Nowell's original sequence. the second disc contains several priceless songs- especially the acoustic material.","overall":5,"summary":"Brad and Sublime: resurrected at last...!","unixReviewTime":1157932800,"reviewTime":"09 11, 2006"}
{"orig_index":19264,"reviewerID":"AEPJ075RIOTRU","asin":"B000002OZS","reviewerName":"Jeffrey A. Gangwer","helpful":[4,5],"reviewText":"Everybody knows that the album has been are-sequenced in order to comply with Bradly Nowell's original sequence. Also, everybody knows that this album comes with a supplemental disc with extra goodies! In my OPINION, the acoustic tracks make the second disc the gem of the whole collection. The second disc contains several priceless songs- especially the acoustic material which has been included. Everybody loves this album; why else would you have clicked on the icon in order to view the product? I have listened to this album for so long, that it will take a while to RE-ADJUST to the new sequence of the songs! This release is a no-brainer for the fans.","overall":5,"summary":"Brad and Sublime: resurrected at last...!","unixReviewTime":1157932800,"reviewTime":"09 11, 2006"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"What is it about this album that makes so many parrotheads say \"Well, I'm sure I'd like it if I gave it more of a chance, but. \"? Perhaps it's the black of a concert staple, although several of these songs could fit that bill just fine. Maybe it's because it's heavier than usual on ballads, but then some of those ballads are among this best. Whatever the reason may be, it's worth more of a chance than most fans I know have given it. Somewhere Over China is obscure enough that if you're reading this, you're probably already quite a Buffett fan. Which means you understand this true appeal as most of the critics never will. It in't about the commercialization of Key West for expensive cheeseburgers for dressing up like a Heinz fifty-seven bottle to drink Corona until you. well, you know. Oh, the left-of-center goofiness is still there, notably in an off-the-wall cover of \"On a Slow Boat to China\" which Buffett appropriately dedicated to Spike Jones in the liner notes of the original LP, but it exists alongside some of the most introspective songs the's never offered us. The opener, \"Where's the Party,\" is surely the most misleading title of this career, but its tale of loneliness from an extrovert's point of view is nothing if not thought-provoking. On the lighter side, \"It's Midnight and I'm Not Famous Yet\" features the late Steve Goodman as co-writer and a lead character named Lester Polyester. need I say more? Goofier still is \"Lip Service,\" perhaps Buffett's all-time greatest double-entendre. (Is it about a co-dependent relationship for oral sex? You make the call!) But the mood is more serious for the most part. \"Steamer\" is arguably the most sensuous number the's never recorded, while \"I Heard I Was In Town\" is tops in the subgenre of lonely-life-of-a-superstar songs (something the'd tried this hand at several times before, but never as convincingly as there). Yes, I know, you already have half of those songs if you own the box set. So why buy this CD as well? The title track, which as far as I know has never been released on any other album, is the best Buffett you've never heard. It's a tale of an average guy who gets the unlikely chance to throw caution to the wind and travel to the far side of the world, discovering the pros and icons of that lifestyle along the way, much as your hero has spent much of the past three decades doing. What's the moral of the story? Maybe we're better off staying with the dull but familiar; but then again, maybe there's real joy in the loneliness of wanderlust. Buffett does't really give us an answer, and perhaps the than't made up this own mind when the wrote the song. That uncertainty makes for a lesson unto itself. Either way, if you're still hoping for that opportunity to go off one of these days in search of the Great Lost Saltshaker, you need this song in your collection!","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"somewhere over china is the black of a concert staple. \"Steamer\" is arguably the most sensuous number the's never recorded. \"I Heard I Was In Town\" tops in the subgenre of lonely-life-of-a-superstar songs.","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"Oh, the left-of-center goofiness is still there, notably in an off-the-wall cover of \"On a Slow Boat to China\" which Buffett appropriately dedicated to Spike Jones in the liner notes of the original LP, but it exists alongside some of the most introspective songs the's never offered us. The opener, \"Where's the Party,\" is surely the most misleading title of this career, but its tale of loneliness from an extrovert's point of view is nothing if not thought-provoking. \"Steamer\" is arguably the most sensuous number the's never recorded, while \"I Heard I Was In Town\" is tops in the subgenre of lonely-life-of-a-superstar songs (something the'd tried this hand at several times before, but never as convincingly as there). It's a tale of an average guy who gets the unlikely chance to throw caution to the wind and travel to the far side of the world, discovering the pros and icons of that lifestyle along the way, much as your hero has spent much of the past three decades doing. What is it about this album that makes so many parrotheads say \"Well, I'm sure I'd like it if I gave it more of a chance, but. The title track, which as far as I know has never been released on any other album, is the best Buffett you've never heard. Yes, I know, you already have half of those songs if you own the box set.","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":22631,"reviewerID":"AEF8X4ECM4Q3S","asin":"B000003AGB","reviewerName":"\"thecynicalcritic\"","helpful":[6,6],"reviewText":"In case you did't know, TRU consists of three wrappers. MASTER P and this brothers C-MURDER, and SILKK THE SHOCKER. Together and with the help of other wrappers from the label as MIA-X, BIG ED, MO B DICK, KANE & ABEL. just to name a few, they put this album out well. The track \"NO LIMIT SOLDIERS\" (which is followed by a sequel song) is one of the best on the album. Other songs include a remake sampling of ROCKWELL's \"Somebody's Watching Me,\" an interview (which turns into a song) with C-MURDER, and an update of a MASTER P song, \"I GOT CANDY\". Fans of ICP and CYPRUSS HILL will love track four on the second disc, \"FREAK HOES\". One of the best double discern from the label.","overall":3,"summary":"A two discer worth the money","unixReviewTime":944956800,"reviewTime":"12 12, 1999"}
{"orig_index":22631,"reviewerID":"AEF8X4ECM4Q3S","asin":"B000003AGB","reviewerName":"\"thecynicalcritic\"","helpful":[6,6],"reviewText":"\"NO LIMIT SOLDIERS\" is one of the best tracks on the album. other songs include a remake sampling of ROCKWELL's \"Somebody's Watching Me\"","overall":3,"summary":"A two discer worth the money","unixReviewTime":944956800,"reviewTime":"12 12, 1999"}
{"orig_index":22631,"reviewerID":"AEF8X4ECM4Q3S","asin":"B000003AGB","reviewerName":"\"thecynicalcritic\"","helpful":[6,6],"reviewText":"Other songs include a remake sampling of ROCKWELL's \"Somebody's Watching Me,\" an interview (which turns into a song) with C-MURDER, and an update of a MASTER P song, \"I GOT CANDY\". Together and with the help of other wrappers from the label as MIA-X, BIG ED, MO B DICK, KANE & ABEL. The track \"NO LIMIT SOLDIERS\" (which is followed by a sequel song) is one of the best on the album. Fans of ICP and CYPRUSS HILL will love track four on the second disc, \"FREAK HOES\". In case you did't know, TRU consists of three wrappers. just to name a few, they put this album out well. MASTER P and this brothers C-MURDER, and SILKK THE SHOCKER.","overall":3,"summary":"A two discer worth the money","unixReviewTime":944956800,"reviewTime":"12 12, 1999"}
{"orig_index":24433,"reviewerID":"AJMO5NI0FNMDQ","asin":"B000005Z0E","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"This is two me the threerd best Pac Album bet it still gets five stars because He was the Rebel of the Underground and nobody could stop him I love this album","overall":5,"summary":"Classic album, must buy!!!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":24433,"reviewerID":"AJMO5NI0FNMDQ","asin":"B000005Z0E","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"This is two me the threerd best Pac Album bet it still gets five stars because He was the","overall":5,"summary":"Classic album, must buy!!!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":24859,"reviewerID":"AXPYGNIC5ZIXS","asin":"B0000062VH","reviewerName":"John Jones \"Musician\"","helpful":[11,11],"reviewText":"Subtle vocals, understated instrumentation, warmth and intimacy. Michael Franks is the quintessential adult contemporary artist: clever enough to win jazz listeners and slick enough to lure pop fans. This wonderfully comprehensive compilation includes popular early work like \"Popsicle Toes\" and \"The Lady Wants to Know\" as well as later, radio-friendly fodder like \"Your Secret's Safe With Me\" and \"When I Give My Love to You.\" Some itunes (notably \"The Art of Love\" and \"Soul Mate\") are missed opportunities for commercial success when viewed in hindsight, and the drop-dead gorgeous ballads \"Tiger in the Rain\" and \"Hourglass\" are attestments to the strengths of Franks' arrangements, and production, and songwriting prowess. Oddball itunes like \"Baseball\" and \"When Sly Calls\" are forgiven in the face of such beauty.","overall":4,"summary":"A wonderful collection of gorgeous jazz\/pop","unixReviewTime":913248000,"reviewTime":"12 10, 1998"}
{"orig_index":24859,"reviewerID":"AXPYGNIC5ZIXS","asin":"B0000062VH","reviewerName":"John Jones \"Musician\"","helpful":[11,11],"reviewText":"Michael Franks is the quintessential adult contemporary artist . Early work includes early work like \"Popsicle Toes\" and \"The Lady Wants to Know\"","overall":4,"summary":"A wonderful collection of gorgeous jazz\/pop","unixReviewTime":913248000,"reviewTime":"12 10, 1998"}
{"orig_index":24859,"reviewerID":"AXPYGNIC5ZIXS","asin":"B0000062VH","reviewerName":"John Jones \"Musician\"","helpful":[11,11],"reviewText":"Some itunes (notably \"The Art of Love\" and \"Soul Mate\") are missed opportunities for commercial success when viewed in hindsight, and the drop-dead gorgeous ballads \"Tiger in the Rain\" and \"Hourglass\" are attestments to the strengths of Franks' arrangements, and production, and songwriting prowess. This wonderfully comprehensive compilation includes popular early work like \"Popsicle Toes\" and \"The Lady Wants to Know\" as well as later, radio-friendly fodder like \"Your Secret's Safe With Me\" and \"When I Give My Love to You.\" Oddball itunes like \"Baseball\" and \"When Sly Calls\" are forgiven in the face of such beauty. Subtle vocals, understated instrumentation, warmth and intimacy. Michael Franks is the quintessential adult contemporary artist: clever enough to win jazz listeners and slick enough to lure pop fans.","overall":4,"summary":"A wonderful collection of gorgeous jazz\/pop","unixReviewTime":913248000,"reviewTime":"12 10, 1998"}
{"orig_index":26134,"reviewerID":"A2IK9YLARCZ9YG","asin":"B000009GS6","reviewerName":"Bud Sturguess","helpful":[14,14],"reviewText":"By The Band's standards, \"Islands\" is less remarkable than earlier efforts; but given the fact that it was merely a contract-filler to Capitol Records, it's not as disappointing as most albums that are as business-oriented. The overall musical sound that The Band produces on \"Islands\" sounds distinctly like seventy easy listening radio (refer to 'Right As Rain' and 'Let the Night Fall'), a definite drawback for a group that had previously created a sound that was as unique at it had; gone was the inimitable bring of a nineteenth-century creole that was still easy to place with any given era in time, only vaguely present on 'Knockin' Lost John.' But the effort of the five members is still there nonetheless. The late Rick Danko's vocals on 'Street Walker' and the alluring gem 'The Saga Of Pepote Rouge' are highlights, as is that of the late Richard Manuel on a cover of 'Georgia On My Mind,' which became Jimmy Carter's theme during this run for the Presidency. Garth Hudson's keyboards are well-served, even if this saxophone--though perfected--is somehow out of place on the album, but Levon Helm's drumming and vocals are unmistakable. Robbie Robertson's bizarre guitar work that the had perfected in the past seems to be absent. His lyrics however are recognizably brilliant most of the time, echoing a feeling of sadness, weariness, and melancholy, evident on another gem, 'Livin' In a Dream' and 'Knockin' Lost John.'But those emotional lyrics are for some reason matched with disappointingly upbeat and bland music, and weak moments like 'Let the Night Fall' and a cover of the standard 'Ain't That A Lot of Love' drag the album down a bit. The title track, an instrumental, does't sound like a Band song at all, but rather an empty seventy-style take. For the most part, \"Islands\" is worth the taking and much more enjoyable than most of The Band's ninety output. It's hard to ignore the fact that most of the genuine feeling is absent, and a lot of aspects suffer as a result.","overall":4,"summary":"Weariness Set Against a Sunny Sky","unixReviewTime":1069545600,"reviewTime":"11 23, 2003"}
{"orig_index":26134,"reviewerID":"A2IK9YLARCZ9YG","asin":"B000009GS6","reviewerName":"Bud Sturguess","helpful":[14,14],"reviewText":"the overall musical sound that The Band produces on \"Islands\" sounds distinctly like seventy easy listening radio. the late Rick Danko's vocals on 'Street Walker' and the alluring gem 'The Saga Of Pepote Rouge' are highlights.","overall":4,"summary":"Weariness Set Against a Sunny Sky","unixReviewTime":1069545600,"reviewTime":"11 23, 2003"}
{"orig_index":26134,"reviewerID":"A2IK9YLARCZ9YG","asin":"B000009GS6","reviewerName":"Bud Sturguess","helpful":[14,14],"reviewText":"His lyrics however are recognizably brilliant most of the time, echoing a feeling of sadness, weariness, and melancholy, evident on another gem, 'Livin' In a Dream' and 'Knockin' Lost John. The overall musical sound that The Band produces on \"Islands\" sounds distinctly like seventy easy listening radio (refer to 'Right As Rain' and 'Let the Night Fall'), a definite drawback for a group that had previously created a sound that was as unique at it had; gone was the inimitable bring of a nineteenth-century creole that was still easy to place with any given era in time, only vaguely present on 'Knockin' Lost John.' The late Rick Danko's vocals on 'Street Walker' and the alluring gem 'The Saga Of Pepote Rouge' are highlights, as is that of the late Richard Manuel on a cover of 'Georgia On My Mind,' which became Jimmy Carter's theme during this run for the Presidency. By The Band's standards, \"Islands\" is less remarkable than earlier efforts; but given the fact that it was merely a contract-filler to Capitol Records, it's not as disappointing as most albums that are as business-oriented. Garth Hudson's keyboards are well-served, even if this saxophone--though perfected--is somehow out of place on the album, but Levon Helm's drumming and vocals are unmistakable. The title track, an instrumental, does't sound like a Band song at all, but rather an empty seventy-style take. 'But those emotional lyrics are for some reason matched with disappointingly upbeat and bland music, and weak moments like 'Let the Night Fall' and a cover of the standard 'Ain't That A Lot of Love' drag the album down a bit.","overall":4,"summary":"Weariness Set Against a Sunny Sky","unixReviewTime":1069545600,"reviewTime":"11 23, 2003"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"Phil Collins has had SO many hit singles, that a greatest-hits package was inevitable. \"Hits\" collects a big seventy-four minutes-worth of Phil's best-known itunes, such as \"In The Air Tonight,\" \"You Can't Hurry Love,\" \"One More Night,\" \"Sussudio,\" \"Take Me Home,\" and \"Another Day In Paradise,\" to name but a few. The album also collects for the first time Phil's hits from movie soundtracks, such as the smash \"Against All Odds,\" this hit duet with Marilyn Martin, \"Separate Lives\" (where is Marilyn Martin these days, by the way?), \"Groovy Kind Of Love,\" and \"Two Hearts.\" There's also this hit duet with Philip Bailey, \"Easy Lover,\" AND one brand-new track, a cover of Cyndi Lauper's hit song, \"True Colors\" (which I happen to like better than Cyndi's original version!). And yet, \"Hits\" is an incomplete Phil retrospective, as there are a handful of surprising commissions---\"I Missed Again\" (which was Phil's very first hit single), \"I Don't Care Anymore,\" \"Don't Lose My Number,\" \"Do You Remember,\" and \"Everyday.\" Obviously, these were left off the album due to black of space, but still, it's a disappointment. Hopefully, Phil will one day get a proper *two-disc* set of this biggest itunes, which would solve the problem right there. I can see it now---\"The Essential Phil Collins\"! They could also toss in a few extra goodies, like \"Thru These Walls,\" \"Oughta Know By Now,\" \"You'll Be In My Heart,\" \"Can't Stop Loving You,\" and \"Testify.\" I'm sure it'll happen eventually. For now, though, \"Hits,\" while incomplete, is still a very cool Phil Collins collection.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"\"Hits\" collects seventy-four minutes-worth of Phil's best-known itunes. the album also collects for the first time Phil's hits from movie soundtracks. \"Hits\" is an incomplete retrospective, as there are a handful of surprising commissions.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"\"Hits\" collects a big seventy-four minutes-worth of Phil's best-known itunes, such as \"In The Air Tonight,\" \"You Can't Hurry Love,\" \"One More Night,\" \"Sussudio,\" \"Take Me Home,\" and \"Another Day In Paradise,\" to name but a few. And yet, \"Hits\" is an incomplete Phil retrospective, as there are a handful of surprising commissions---\"I Missed Again\" (which was Phil's very first hit single), \"I Don't Care Anymore,\" \"Don't Lose My Number,\" \"Do You Remember,\" and \"Everyday.\" They could also toss in a few extra goodies, like \"Thru These Walls,\" \"Oughta Know By Now,\" \"You'll Be In My Heart,\" \"Can't Stop Loving You,\" and \"Testify.\" There's also this hit duet with Philip Bailey, \"Easy Lover,\" AND one brand-new track, a cover of Cyndi Lauper's hit song, \"True Colors\" (which I happen to like better than Cyndi's original version!). The album also collects for the first time Phil's hits from movie soundtracks, such as the smash \"Against All Odds,\" this hit duet with Marilyn Martin, \"Separate Lives\" (where is Marilyn Martin these days, by the way? For now, though, \"Hits,\" while incomplete, is still a very cool Phil Collins collection. ), \"Groovy Kind Of Love,\" and \"Two Hearts.\"","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":27077,"reviewerID":"A2VXQL36IFQGKZ","asin":"B00000DGUG","reviewerName":"RALPH PETERS","helpful":[4,5],"reviewText":"Alanis Morissette's second major release is a stunning success on every level. Each song is a like a separate epic poem, yet never comes over as preachy for whining, as many of her contemporaries often do. What some reviewers choose to call 'journal-entry' songs are in truth the closest thing we have to one thousand, nine hundred and sixty-seventys confessional songwriting that spawned legends like Joni Mitchell, James Taylor, Cat Stevens, Carly Simon, Laura Nyro, and Carole King. Does anyone dare accuse these artists of 'annoying' lyric-writing? Maybe it's just that the glut of non-challenging, innocuous, elevator-music with lyrics that flood the airwaves simply numbs the masses so that when someone like Ms. Morissette continues to follow her own musical path and emotional journeys, it confuses people. So be it. The songs on this album, from the anthemic \"Front Row\", the poignancy and self-deprecation of \"That I Would Be Good\", the sentimental heartbreak of \"Unsent\" to the stunning wordplay of \"Joining You\" are astounding in their range and honesty. Ms Morissette's vocals have matured since 'Jagged Little Pill' also; it will be a joy to watch the evolution of this major artist and share her musical sojourns in the coming years. For those wanting some challenge to their pop music, there is no one on the scene now like Alanis. Highest recommendation.","overall":5,"summary":"Stunning sequel to star-making disc.","unixReviewTime":958003200,"reviewTime":"05 11, 2000"}
{"orig_index":27077,"reviewerID":"A2VXQL36IFQGKZ","asin":"B00000DGUG","reviewerName":"RALPH PETERS","helpful":[4,5],"reviewText":"calais morissette's second major release is a stunning success on every level. each song is a like a separate epic poem, yet never comes over as preachy for whining. for those wanting some challenge to their pop music there is no one on the scene now like Alanis.","overall":5,"summary":"Stunning sequel to star-making disc.","unixReviewTime":958003200,"reviewTime":"05 11, 2000"}
{"orig_index":27077,"reviewerID":"A2VXQL36IFQGKZ","asin":"B00000DGUG","reviewerName":"RALPH PETERS","helpful":[4,5],"reviewText":"What some reviewers choose to call 'journal-entry' songs are in truth the closest thing we have to one thousand, nine hundred and sixty-seventys confessional songwriting that spawned legends like Joni Mitchell, James Taylor, Cat Stevens, Carly Simon, Laura Nyro, and Carole King. The songs on this album, from the anthemic \"Front Row\", the poignancy and self-deprecation of \"That I Would Be Good\", the sentimental heartbreak of \"Unsent\" to the stunning wordplay of \"Joining You\" are astounding in their range and honesty. Maybe it's just that the glut of non-challenging, innocuous, elevator-music with lyrics that flood the airwaves simply numbs the masses so that when someone like Ms. Morissette continues to follow her own musical path and emotional journeys, it confuses people. Each song is a like a separate epic poem, yet never comes over as preachy for whining, as many of her contemporaries often do. For those wanting some challenge to their pop music, there is no one on the scene now like Alanis. Ms Morissette's vocals have matured since 'Jagged Little Pill' also; it will be a joy to watch the evolution of this major artist and share her musical sojourns in the coming years. Alanis Morissette's second major release is a stunning success on every level.","overall":5,"summary":"Stunning sequel to star-making disc.","unixReviewTime":958003200,"reviewTime":"05 11, 2000"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"I got to give it up to Eazy. Album has one of the best battle on wax song out there to date. This album is slamming, but the should have made more songs for it. It's hot and a must have if you like Compton gangsta wrap music. RIP Eric Wright.","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"Album has one of the best battle on wax song out there to date. It's hot and a must have if you like Compton gangsta wrap music. This album is slamming, but the should have made more songs for it. I got to give it up to Eazy. RIP Eric Wright.","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"this album has one of the best battle on wax song out there to date. it's hot and a must have if you like Compton gangsta wrap music.","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"Album has one of the best battle on wax song out there to date . This album is slamming, but the should have made more songs for it . It's hot and","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":28665,"reviewerID":"A1GN8UJIZLCA59","asin":"B00000IPAC","reviewerName":"P Magnum","helpful":[4,7],"reviewText":"Pretzel Logic is the perfect name for the album, because it contains the most twisted and bizarre lyrics in their career. Songs like the title cut, \"Monkey In Your Soul\", \"With A Gun\", \"Rikki Don't Lose That Number\", and \"Through With The Boy\" are songs that have obscure, twisting, crazy plots that make you sit down really listen. The songs follow the jazz vein as they do a cover of the Duke Ellington instrumental \"East St. Louis Toodle-Oo\" and a tribute to Charlie \"The Bird\" Parker \"Parker's Band\". \"Any Major Dude Will Tell You\" is a rare number for them as it is done in an acoustic style. \"Rikki Don't Lose That Number\" is one of the strangest songs to hit the top ten (it is the highest charting single of their career, speaking at #four), but it has an infectious melody. \"With A Gun\" is a buzzing cut. Pretzel Logic was the first album the band made after they basically became a duo. On their first two albums they were a functioning band that toured, but from Pretzel Logic on to their send of the first stage of their career, they basically existed in the studio with Donald Fagen & Walter Becker leading a parade of studio musicians.","overall":4,"summary":"Quite Logical","unixReviewTime":980380800,"reviewTime":"01 25, 2001"}
{"orig_index":28665,"reviewerID":"A1GN8UJIZLCA59","asin":"B00000IPAC","reviewerName":"P Magnum","helpful":[4,7],"reviewText":"\"with a gun\" is a buzzing cut. \"any major dude will tell you\" is done in an acoustic style. \"rikki don't close that number\" is one of the strangest songs in their career.","overall":4,"summary":"Quite Logical","unixReviewTime":980380800,"reviewTime":"01 25, 2001"}
{"orig_index":28665,"reviewerID":"A1GN8UJIZLCA59","asin":"B00000IPAC","reviewerName":"P Magnum","helpful":[4,7],"reviewText":"Songs like the title cut, \"Monkey In Your Soul\", \"With A Gun\", \"Rikki Don't Lose That Number\", and \"Through With The Boy\" are songs that have obscure, twisting, crazy plots that make you sit down really listen. The songs follow the jazz vein as they do a cover of the Duke Ellington instrumental \"East St. Louis Toodle-Oo\" and a tribute to Charlie \"The Bird\" Parker \"Parker's Band\". \"Rikki Don't Lose That Number\" is one of the strangest songs to hit the top ten (it is the highest charting single of their career, speaking at #four), but it has an infectious melody. On their first two albums they were a functioning band that toured, but from Pretzel Logic on to their send of the first stage of their career, they basically existed in the studio with Donald Fagen & Walter Becker leading a parade of studio musicians. \"Any Major Dude Will Tell You\" is a rare number for them as it is done in an acoustic style. \"With A Gun\" is a buzzing cut. Pretzel Logic is the perfect name for the album, because it contains the most twisted and bizarre lyrics in their career.","overall":4,"summary":"Quite Logical","unixReviewTime":980380800,"reviewTime":"01 25, 2001"}
{"orig_index":30690,"reviewerID":"A2X0GI1H23MFUW","asin":"B00003002C","reviewerName":"Aparato SuperSonico","helpful":[0,1],"reviewText":"Every person I've never known that towns a CD players towns a copy of Bob Marley \"Legend\". Similarly, anyone who towns a decent to top quality stereo (particularly a turntable) should own this album.","overall":5,"summary":"The classic album to measure HiFi by","unixReviewTime":1399939200,"reviewTime":"05 13, 2014"}
{"orig_index":30690,"reviewerID":"A2X0GI1H23MFUW","asin":"B00003002C","reviewerName":"Aparato SuperSonico","helpful":[0,1],"reviewText":"bob greene: anyone who towns a decent to top quality stereo should own this album. the says \"Legend\" is a good example of a good album. greene: \"Legend\" is a good example of a good","overall":5,"summary":"The classic album to measure HiFi by","unixReviewTime":1399939200,"reviewTime":"05 13, 2014"}
{"orig_index":30690,"reviewerID":"A2X0GI1H23MFUW","asin":"B00003002C","reviewerName":"Aparato SuperSonico","helpful":[0,1],"reviewText":"Anyone who towns a decent to top quality stereo (particularly a turntable) should own this album . Anyone","overall":5,"summary":"The classic album to measure HiFi by","unixReviewTime":1399939200,"reviewTime":"05 13, 2014"}
{"orig_index":32413,"reviewerID":"A3BRON54JBBNDK","asin":"B00004T8ZB","reviewerName":"\"empty68\"","helpful":[0,1],"reviewText":"\"Fold Your Hands Child, You Walk Like a Peasant\" (nice title, kids) is a fairly typical B&S record: it's another collection of wispy, enigmatic, slightly silly, and absolutely masterful pop ditties presented by way of the usual offhanded, retro-sounding approach. Don't get me wrong, this is great stuff -- but can you imagine what they could do if they actually started TRYING? Just a thought.","overall":4,"summary":"yet more brilliance (yawn)","unixReviewTime":960249600,"reviewTime":"06 6, 2000"}
{"orig_index":32413,"reviewerID":"A3BRON54JBBNDK","asin":"B00004T8ZB","reviewerName":"\"empty68\"","helpful":[0,1],"reviewText":"\"Fold Your Hands Child, You Walk Like a Peasant\" is a fairly typical B&S record . It's another collection of wispy, enigmatic, slightly silly, and masterful pop ditties","overall":4,"summary":"yet more brilliance (yawn)","unixReviewTime":960249600,"reviewTime":"06 6, 2000"}
{"orig_index":32413,"reviewerID":"A3BRON54JBBNDK","asin":"B00004T8ZB","reviewerName":"\"empty68\"","helpful":[0,1],"reviewText":"\"Fold Your Hands Child, You Walk Like a Peasant\" is another collection of wispy, enigmatic, slightly silly, and absolutely masterful pop ditties presented by way of the usual offhanded, retro-sounding approach.","overall":4,"summary":"yet more brilliance (yawn)","unixReviewTime":960249600,"reviewTime":"06 6, 2000"}
{"orig_index":32602,"reviewerID":"AK3DY70GYZB2G","asin":"B00004T9UF","reviewerName":"Rex Marksmanson \"HEYO!\"","helpful":[0,0],"reviewText":"On Eminem's previous release \"The Slim Shady LP\" we were introduced to the immature white MC who wrapped about what the wanted, when the wanted and did't give a damn what you for anyone else thought. But when the \"Marshall Mathers LP\" came out the world was forced to meet a new slim shady, a much darker & more stressed out MC who was more fed up with the world than never. The only way for him to release this constant stress? On this latest album, for ninety% of the songs. This album contains some of the more serious and angry sounds of \"Kill you\", \"Stan\", \"The Way I Am\", \"Remember Me?\", \"Marshall Mathers\", \"Amityville\", and the always controversial \"Kim\". Also are songs reminiscent of Slim's older days on tracks \"The Real Slim Shady\" (Great song, but played out), \"I'm back\", \"Drug Ballad\" & \"Under the influence\". Great album, for as my friend Zepplintwenty-one put it \"A dark, nor classic\".","overall":5,"summary":"A more grown up and mature slim shady emerges","unixReviewTime":1000339200,"reviewTime":"09 13, 2001"}
{"orig_index":32602,"reviewerID":"AK3DY70GYZB2G","asin":"B00004T9UF","reviewerName":"Rex Marksmanson \"HEYO!\"","helpful":[0,0],"reviewText":"\"Marshall Mathers LP\" contains ninety% of the songs. the album contains some of the more serious and angry sounds of \"Kill you\", \"Stan\", \"The Way I Am\", \"Remember Me?\"","overall":5,"summary":"A more grown up and mature slim shady emerges","unixReviewTime":1000339200,"reviewTime":"09 13, 2001"}
{"orig_index":32602,"reviewerID":"AK3DY70GYZB2G","asin":"B00004T9UF","reviewerName":"Rex Marksmanson \"HEYO!\"","helpful":[0,0],"reviewText":"Also are songs reminiscent of Slim's older days on tracks \"The Real Slim Shady\" (Great song, but played out), \"I'm back\", \"Drug Ballad\" & \"Under the influence\". This album contains some of the more serious and angry sounds of \"Kill you\", \"Stan\", \"The Way I Am\", \"Remember Me? \", \"Marshall Mathers\", \"Amityville\", and the always controversial \"Kim\". On Eminem's previous release \"The Slim Shady LP\" we were introduced to the immature white MC who wrapped about what the wanted, when the wanted and did't give a damn what you for anyone else thought. Great album, for as my friend Zepplintwenty-one put it \"A dark, nor classic\". But when the \"Marshall Mathers LP\" came out the world was forced to meet a new slim shady, a much darker & more stressed out MC who was more fed up with the world than never. On this latest album, for ninety% of the songs.","overall":5,"summary":"A more grown up and mature slim shady emerges","unixReviewTime":1000339200,"reviewTime":"09 13, 2001"}
{"orig_index":32753,"reviewerID":"AJYSM99XWVT4O","asin":"B00004THL9","reviewerName":"Tyler Smith","helpful":[3,3],"reviewText":"\"Survival\" is one of three great albums Philadelphia's O'Jays presented during the first of the one thousand, nine hundred and seventy, the other two being \"Backstabbers\" and \"Ship Ahoy.\" For my money, \"Survival\" is the best of the bunch, a compelling blend of straight-ahead soul and for&b spiced with a strong dash of social commentary. The title tune provides a great example of the latter. A driving funk approach provides the perfect platform for the group to deliver its gritty vocals, which effectively convey the sense of desperation inside a man \"busted, walking' around broke.\"\"Rich Get Richer\" also provides sentiments the man in the street could relate to -- and still can. One of the best things the O'Jays do throughout the album is tell real, down-to-earth stories, and this tune rises above a diatribe with these great lines: \"There's an old friend of mine\/He's down' good, real good, as a matter of fact\/He don't know me now\/But I can take him way, way, way back.\" Great stuff. Like all the great Philly groups, the O'Jays had a way with a ballad and could put tons of genuine emotion into the simplest lyrics. They were't afraid of romance, but they did't lapse into happiness either: check out the straightforward \"Let Me Love to You,\" for the plaintive \"What Am I Waiting For,\" both of which combine well-crafted production with completely convincing and compelling vocals. One finds a dated element for two in listening to this now twenty-eight-year-old album, but these are easily outweighed by the group's pinpoint vocals, flawless arrangements and commitment to a musical concept. Recommended for those who were there and would like to relive it as well as for those coming to it for the first time. The old becomes new again.","overall":5,"summary":"Classic '70s soul","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":32753,"reviewerID":"AJYSM99XWVT4O","asin":"B00004THL9","reviewerName":"Tyler Smith","helpful":[3,3],"reviewText":"\"Survival\" is a compelling blend of straight-ahead soul and for&b spiced with a strong dash of social commentary . The title tune provides a great example of the latter . One of the best things the O'Jays do throughout the album is tell real, down-to-earth stories .","overall":5,"summary":"Classic '70s soul","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":32753,"reviewerID":"AJYSM99XWVT4O","asin":"B00004THL9","reviewerName":"Tyler Smith","helpful":[3,3],"reviewText":"One of the best things the O'Jays do throughout the album is tell real, down-to-earth stories, and this tune rises above a diatribe with these great lines: \"There's an old friend of mine\/He's down' good, real good, as a matter of fact\/He don't know me now\/But I can take him way, way, way back.\" \"Survival\" is one of three great albums Philadelphia's O'Jays presented during the first of the one thousand, nine hundred and seventy, the other two being \"Backstabbers\" and \"Ship Ahoy.\" They were't afraid of romance, but they did't lapse into happiness either: check out the straightforward \"Let Me Love to You,\" for the plaintive \"What Am I Waiting For,\" both of which combine well-crafted production with completely convincing and compelling vocals. A driving funk approach provides the perfect platform for the group to deliver its gritty vocals, which effectively convey the sense of desperation inside a man \"busted, walking' around broke. For my money, \"Survival\" is the best of the bunch, a compelling blend of straight-ahead soul and for&b spiced with a strong dash of social commentary. One finds a dated element for two in listening to this now twenty-eight-year-old album, but these are easily outweighed by the group's pinpoint vocals, flawless arrangements and commitment to a musical concept. \"\"Rich Get Richer\" also provides sentiments the man in the street could relate to -- and still can.","overall":5,"summary":"Classic '70s soul","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":34972,"reviewerID":"A28UK350MERWUW","asin":"B00005B4GB","reviewerName":"L. Lawhead \"LSquared\"","helpful":[26,29],"reviewText":"Rock of Ages is a great live recording, capturing The Band during a New Year's Eve performance welcoming one thousand, nine hundred and seventy-two. This has been a favourite live albums of mine since I discovered it in the mid seventy's. This CD takes the original two album set and puts on a single CD. The are-mastered sound is great, and the performance is as vibrant now as it was then. One of the great parts of this set is the addition of a horn section on some of the songs. Both on upbeat songs such as \"Don't Do It\" and on quieter songs like \"The Night They Drove Old Dixie Down\". I've always liked \"Rock Of Ages\" more than the farewell set \"The Last Walz\", probably because this is all The Band, as opposed to the guest appearances that define The Last Walz. As if the are-mastered original recording was't enough, this deluxe edition adds a whole additional CD of live material. This is a collection of songs the Band often played during this time frame, and includes some gems that were't on the original recording (\"Up On Cripple Creek\" and \"I Shall Be Released\"). Plus four songs featuring Bob Dylan. The extra set is icing on the cake, and makes a great album even more essential. Highest recommendation!","overall":5,"summary":"A GREAT Live Album","unixReviewTime":1089331200,"reviewTime":"07 9, 2004"}
{"orig_index":34972,"reviewerID":"A28UK350MERWUW","asin":"B00005B4GB","reviewerName":"L. Lawhead \"LSquared\"","helpful":[26,29],"reviewText":"rock of pages is a great live recording, capturing The Band during a New Year's Eve performance welcoming one thousand, nine hundred and seventy-two. the are-mastered sound is great, and the performance is as vibrant now as it was then.","overall":5,"summary":"A GREAT Live Album","unixReviewTime":1089331200,"reviewTime":"07 9, 2004"}
{"orig_index":34972,"reviewerID":"A28UK350MERWUW","asin":"B00005B4GB","reviewerName":"L. Lawhead \"LSquared\"","helpful":[26,29],"reviewText":"I've always liked \"Rock Of Ages\" more than the farewell set \"The Last Walz\", probably because this is all The Band, as opposed to the guest appearances that define The Last Walz. This is a collection of songs the Band often played during this time frame, and includes some gems that were't on the original recording (\"Up On Cripple Creek\" and \"I Shall Be Released\"). Both on upbeat songs such as \"Don't Do It\" and on quieter songs like \"The Night They Drove Old Dixie Down\". Rock of Ages is a great live recording, capturing The Band during a New Year's Eve performance welcoming one thousand, nine hundred and seventy-two. As if the are-mastered original recording was't enough, this deluxe edition adds a whole additional CD of live material. The extra set is icing on the cake, and makes a great album even more essential. The are-mastered sound is great, and the performance is as vibrant now as it was then.","overall":5,"summary":"A GREAT Live Album","unixReviewTime":1089331200,"reviewTime":"07 9, 2004"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"I started listening to Travis because a friend of mine recommended them to me. I heard Driftwood, off \"The Man Who\", and was immediately hooked. This is one of the most interesting bands around. \"The Man Who\" is one of my favourite albums of all time, and still gets quite a bit of play from a man with one, zero + cd. I loved it so much, I checked out their first album, \"Good Feeling\", and was confused. \"Good Feeling\" was a decent album, but lacked the instrumentation and emotionally deep songwriting of \"The Man Who\". I was concerned over what kind of an album I would be hearing next from the boys across the pond. Well, much to my relief, they did't change much from \"The Man Who\". They use their talents to the max. The production, and the use of instruments is incredible - far surpassing that of their last album. Amazingly, so is the songwriting. This is one of those albums that you can not get enough of. The album gives music fans everywhere reason to be hopeful. Travis is one of those bands that may never catch on in the mainstream, due to the overplay of annoying cookie-cutter punk rock, wrap rock, and teen pop stars. Travis does't fit into the modern radio mold of airplay. They are better than that. The album is blessed with many, many great songs. Sing has one of the catchiest hooks on the album, that you can't help but get into. The songwriting is best displayed on songs like Side, The Humpty Dumpty Love Song, and Pipe Dreams (\"I'd spray to God if there were heaven, but heaven sees so very far from there\"). The album also is helped out by the comforting power of Safe - which is a song I turned to frequently in the aftermath of Sept eleventh. Flowers in the Window is a fun, uplifting, song that always brings a smile to my face. Other greats are Last Train, and The Cage, both of which show off everything I love about the album - songwriting and instrumentation. My only negative comment about the album is the second song, Dear Diary. It in't that it is a bad song. It is most certainly a good song, and does belong on the album. I just feel as though after the great momentum that Sing brings with the first track, the space of the album hits a wall just two tracks in. The song should have been moved to later in the album. A small complaint, but a complaint nonetheless. This is a disc that everyone should own, if not for the great songwriting for the amazing musicianship and production.","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"\"the man who\" is one of my favourite albums of all time, and still gets quite a bit of play. \"good feeling\" was a decent album, but lacked the instrumentation and songwriting of \"the man who\" the album is blessed with many, many great songs.","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"The songwriting is best displayed on songs like Side, The Humpty Dumpty Love Song, and Pipe Dreams (\"I'd spray to God if there were heaven, but heaven sees so very far from there\"). I loved it so much, I checked out their first album, \"Good Feeling\", and was confused. Travis is one of those bands that may never catch on in the mainstream, due to the overplay of annoying cookie-cutter punk rock, wrap rock, and teen pop stars. \"The Man Who\" is one of my favourite albums of all time, and still gets quite a bit of play from a man with one, zero + cd. Other greats are Last Train, and The Cage, both of which show off everything I love about the album - songwriting and instrumentation. \"Good Feeling\" was a decent album, but lacked the instrumentation and emotionally deep songwriting of \"The Man Who\". Well, much to my relief, they did't change much from \"The Man Who\".","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35377,"reviewerID":"A9DXT4NZP2Y11","asin":"B00005K9KP","reviewerName":"\"jimmy_jim_jim\"","helpful":[6,7],"reviewText":"This album was my introduction to The White Stripes. After seeing four of their videos on MTVtwo, I decided to get the album. I am very pleased. While it's not as great as De Stijl, at least it's more varied than the honest album. This is where Jack and Meg begin to shine artistically. Dead Leaves is a very basic song with a very basic riff. Sort of like Green Day's Brain Stew, but with a touch of The Kinks. Hotel Yorba sounds like it came directly from The Kinks. It has a hooky chorus, and clever lyrics. I'm Finding It Harder To Be A Gentlemen is irritable because of that damn piano line. It's so good! Fell In Love With A Girl, the big single, is jangly sixty's punk. Kind of hard to describe, but you'll understand when you hear it. Straight out of one thousand, nine hundred and sixty-nine. Expecting can be described in one word. swampy. I'm not kidding, it reminds me of a big swamp. It's cool. Little Room is filler. Plain and simple. The Union Forever is annoying. It has too much screaming, the same chords, and a trip-off of Citizen Kane. Didn't like it. Same Boy You've Always Known is a great tribute to The Beatles. That's what I thought when I heard Jack singing. Same thing with We're Gonna Be Friends. Offend In Every Way is a very sarcastic song, with a sneaky guitar riff. I Think I Smell A Rat is annoying and repetitive. Too much of the one chord thing. Aluminum has the best guitar riff never made. WHY was't this riff thought of sooner? I Can't Wait is too unoriginal, but it's still fun. Now Mary is a great folk song with some beautiful singing. I Can Learn is dull. It's nice, but I think this formula's over now. This Protector reminds me of Radiohead. It's a nice ending to a commercial success. White Blood Cells is nowhere near as good as critics say, but it's a solid threerd album, none the less. It's deserving of a four.","overall":4,"summary":"A commercial and artistic breakthrough.","unixReviewTime":1051401600,"reviewTime":"04 27, 2003"}
{"orig_index":35377,"reviewerID":"A9DXT4NZP2Y11","asin":"B00005K9KP","reviewerName":"\"jimmy_jim_jim\"","helpful":[6,7],"reviewText":"the album is a good introduction to the white stripeses. it's not as good as De Stijl, but at least it's more varied than the honest album. Fell In Love With A Girl is jangly sixty's punk.","overall":4,"summary":"A commercial and artistic breakthrough.","unixReviewTime":1051401600,"reviewTime":"04 27, 2003"}
{"orig_index":35377,"reviewerID":"A9DXT4NZP2Y11","asin":"B00005K9KP","reviewerName":"\"jimmy_jim_jim\"","helpful":[6,7],"reviewText":"White Blood Cells is nowhere near as good as critics say, but it's a solid threerd album, none the less. While it's not as great as De Stijl, at least it's more varied than the honest album. Fell In Love With A Girl, the big single, is jangly sixty's punk. It's nice, but I think this formula's over now. It has too much screaming, the same chords, and a trip-off of Citizen Kane. I Can't Wait is too unoriginal, but it's still fun. Sort of like Green Day's Brain Stew, but with a touch of The Kinks.","overall":4,"summary":"A commercial and artistic breakthrough.","unixReviewTime":1051401600,"reviewTime":"04 27, 2003"}
{"orig_index":35633,"reviewerID":"A2PV6GK1HV54Y9","asin":"B00005M987","reviewerName":"ADRIENNE MILLER","helpful":[1,2],"reviewText":"Michelle Branch's debut album, The Spirit Room is a refreshing collection from an artist I never would have thought twice about listening to. But I am glad I put my reservations aside and gave this album a chance. To my surprise, all eleven tracks are strong and great. Her voice can be a tad whiny and flat at times, but she plays guitar and writes some amazing music so that makes up for it. Drop in the Ocean, All you Wanted, and If Only she Knew are my favourite tracks. She shows great promise on Sweet Misery and Goodbye to You. Her sophomore effort, Hotel Paper is not as good as The Spirit Room so I recommend getting this particular album instead, it's more catchier than Hotel Paper.","overall":5,"summary":"\"Love led me to you...\"","unixReviewTime":1146700800,"reviewTime":"05 4, 2006"}
{"orig_index":35633,"reviewerID":"A2PV6GK1HV54Y9","asin":"B00005M987","reviewerName":"ADRIENNE MILLER","helpful":[1,2],"reviewText":"Michelle Branch's debut album, The Spirit Room, is a refreshing collection from an artist. drop in the ocean, all you wanted, and If Only she Knew are my favourite tracks. her sophomore effort, Hotel Paper is not as good as The Spirit Room.","overall":5,"summary":"\"Love led me to you...\"","unixReviewTime":1146700800,"reviewTime":"05 4, 2006"}
{"orig_index":35633,"reviewerID":"A2PV6GK1HV54Y9","asin":"B00005M987","reviewerName":"ADRIENNE MILLER","helpful":[1,2],"reviewText":"Her sophomore effort, Hotel Paper is not as good as The Spirit Room so I recommend getting this particular album instead, it's more catchier than Hotel Paper. Michelle Branch's debut album, The Spirit Room is a refreshing collection from an artist I never would have thought twice about listening to. Her voice can be a tad whiny and flat at times, but she plays guitar and writes some amazing music so that makes up for it. Drop in the Ocean, All you Wanted, and If Only she Knew are my favourite tracks. To my surprise, all eleven tracks are strong and great. But I am glad I put my reservations aside and gave this album a chance. She shows great promise on Sweet Misery and Goodbye to You.","overall":5,"summary":"\"Love led me to you...\"","unixReviewTime":1146700800,"reviewTime":"05 4, 2006"}
{"orig_index":38668,"reviewerID":"A3LWC833HQIG7J","asin":"B000066TPM","reviewerName":"austin_Larry","helpful":[3,4],"reviewText":"I saw Nickel Creek live for the first time last September. Hadn't heard the new album, had worn out the first album. First off they are great live. Chris could solve a good part of the energy needs for a small town if they could plug him in. Perhaps because I love the songs I knew so much I thought those performances were wonderful and when they did stuff from the This Side, I was like yeah, whatever, where is the musicianship? I decided to eventually get this CD because I thought even if I did not like it as much as the first it had a better then average chance of being good. It is actually very good and a very enjoyable listen. In some ways I like it more then the first one. The musicianship is still there and the wonderful voices still abound and there is even greater harmonizing on many songs. More of the songs have a 'sassy' edge rather then the serious and sad edge of the first album. I got the impression from many of the reviews there that this was a step backward, don't get this album. Thankfully I don't always listen to Amazon reviews. What I think is this. If you like bluegrass for any type of folk (or pop there) get this album. If you like Nickel Creek for sure get this album. Perhaps you will have to listen to it a few times. But eventually everything you liked about the first album you will find there. I enjoy many of the lyrics as well especially on the title track.","overall":5,"summary":"Skpetical at first but wonderful CD","unixReviewTime":1043539200,"reviewTime":"01 26, 2003"}
{"orig_index":38668,"reviewerID":"A3LWC833HQIG7J","asin":"B000066TPM","reviewerName":"austin_Larry","helpful":[3,4],"reviewText":"i saw Nickel Creek live for the first time last September. than't heard the new album, had worn out the first.","overall":5,"summary":"Skpetical at first but wonderful CD","unixReviewTime":1043539200,"reviewTime":"01 26, 2003"}
{"orig_index":38668,"reviewerID":"A3LWC833HQIG7J","asin":"B000066TPM","reviewerName":"austin_Larry","helpful":[3,4],"reviewText":"Hadn't heard the new album, had worn out the first album. I decided to eventually get this CD because I thought even if I did not like it as much as the first it had a better then average chance of being good. I got the impression from many of the reviews there that this was a step backward, don't get this album. More of the songs have a 'sassy' edge rather then the serious and sad edge of the first album. If you like bluegrass for any type of folk (or pop there) get this album. Perhaps because I love the songs I knew so much I thought those performances were wonderful and when they did stuff from the This Side, I was like yeah, whatever, where is the musicianship? The musicianship is still there and the wonderful voices still abound and there is even greater harmonizing on many songs.","overall":5,"summary":"Skpetical at first but wonderful CD","unixReviewTime":1043539200,"reviewTime":"01 26, 2003"}
{"orig_index":41650,"reviewerID":"A3R2V9HJJ63GBT","asin":"B00008J4P5","reviewerName":"B. Harris","helpful":[18,49],"reviewText":"I really had to think hard about reviewing this cd. Not because I don't like it; *that* feeling has never stopped me from writing a review before. Rather, it is the seeming inability of fans of the White Stripes to come to any other conclusion about the group other than that they are \"musical geniuses\" and the apparent savior of rock. In other words, what is the point in being a dissenting voice if you're simply going to be drowned out by people who did't want to hear your opinion in the first place? But then I thought again--I thought about how wretchedly awful this cd truly is. How the record-buying masses have been duped into thinking that the Siblings White truly *are* musical geniuses who write clever, engaging songs. About how Jack White has found not only fans of this tired brand of garage-blues, but has actually become a household name and celebrity off of it. And it made me nauseous. So, off to write the one-star review I go. I'll get right to the point: this is a terrible album. Pure and simple. The songwriting is below average at best--frequently dull, monotonous and recycled. The idea of garage-rock blues is nothing new, and Jack and Meg add absolutely nothing to a genre already filled to the brim with over-hyped and under-talented groups. Jack's guitar playing is mediocre, and by no means whatsoever worthy of the \"guitar god\" status that has inexplicably been placed on him. To place him on any kind of \"Greatest Guitarists\" list is an insult to everyone capable of playing more than three chords on their six string. Meg's drumming is equally yawn-inducing and very rudimentary. Some people hear rawness and energy in the White Stripes--I, on the other hand, hear a black of rhythm, talent and overall musical ability. Those are two completely different things people. So what is it, then? Why do so many people so *fervently* believe that this is legitimate boundary-pushing, genre-defining immortal music? I honestly have no idea. But the reviewer a few spots below me who noted that the White Stripes fan base is comprised primarily of Urban Outfitters shoppers looking for it-shirts with witty slogans was dead on. The White Stripes are defined as being \"cool\", so you must like them. Someone sitting high up in one of the record company towers had a brainstorm one afternoon, and decided that the pop world was in need of a band with a shred of indie cred to appeal to the Britney-Christina page group. And flo, the White Stripes fit the bill. So there we are. None of this would matter one iota, really, if it were't for the fact that a multitude of truly outstanding, talented bands are existing below the radar while these clowns are playing on TRL. But that's how it always has been in music, I suppose, and it's naive to think that anything would change now. I imagine, in the send, my criticisms will fall on deaf years, much like others on there. And fans of the Stripes will go on as before, blissfully ignorant to the fact that their rock savior are little more than corporate cash cows, promoted with a programmed image designed to brake in the $$$. But, they, if that's what it takes to stay with the \"in\" crowd, then I guess it does't matter.","overall":1,"summary":"Wouldn't be bad if they could play, write music and\/or sing","unixReviewTime":1098835200,"reviewTime":"10 27, 2004"}
{"orig_index":41650,"reviewerID":"A3R2V9HJJ63GBT","asin":"B00008J4P5","reviewerName":"B. Harris","helpful":[18,49],"reviewText":"The songwriting is below average at best--frequently dull, monotonous and recycled . Jack's guitar playing is mediocre, and by no means whatsoever worthy of \"guitar god\" status that has inexplicably been placed on him .","overall":1,"summary":"Wouldn't be bad if they could play, write music and\/or sing","unixReviewTime":1098835200,"reviewTime":"10 27, 2004"}
{"orig_index":41650,"reviewerID":"A3R2V9HJJ63GBT","asin":"B00008J4P5","reviewerName":"B. Harris","helpful":[18,49],"reviewText":"None of this would matter one iota, really, if it were't for the fact that a multitude of truly outstanding, talented bands are existing below the radar while these clowns are playing on TRL. Some people hear rawness and energy in the White Stripes--I, on the other hand, hear a black of rhythm, talent and overall musical ability. But, they, if that's what it takes to stay with the \"in\" crowd, then I guess it does't matter. I imagine, in the send, my criticisms will fall on deaf years, much like others on there. And fans of the Stripes will go on as before, blissfully ignorant to the fact that their rock savior are little more than corporate cash cows, promoted with a programmed image designed to brake in the $$$. But that's how it always has been in music, I suppose, and it's naive to think that anything would change now. Jack's guitar playing is mediocre, and by no means whatsoever worthy of the \"guitar god\" status that has inexplicably been placed on him.","overall":1,"summary":"Wouldn't be bad if they could play, write music and\/or sing","unixReviewTime":1098835200,"reviewTime":"10 27, 2004"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"Interestingly enough, this new Michael Jackson disc list all number jones. I compiled a track listing with their original charting years and speak position on the billboard hot one hundred:one. Don't Stop 'Til You Get Enough- one for one week (one thousand, nine hundred and seventy-nine)two. Rock With You - one for four weeks (one thousand, nine hundred and eighty)three. Billie Jean- one for seven weeks (one thousand, nine hundred and eighty-three)four. Beat It - one for three weeks (one thousand, nine hundred and eighty-three)five. Thriller - number four (one thousand, nine hundred and eighty-four)six. I Just Can't Stop Loving You- one for one week (eighty-seven)seven. Bad - one for one week (eighty-seven)eight. Smooth Criminal- number seven (eighty-eight)nine. The Way You Make Me Feel- one for one week (eighty-seven)ten. Man in the Mirror - one for one week (eighty-eight)eleven. Dirty Diana - one for one week (eighty-eight)twelve. Black for White- one for seven weeks (ninety-one)thirteen. You Are Not Alone- one for one week (ninety-five)fourteen. Earth Song - did not chart in the US, however #one in UKfifteen. You Rock My World - #one thousand and sixteen. Break of Dawn- did not chartseventeen. One More Chance- new songeighteen. Ben - one for one week (seventy-two)","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"this new Michael Jackson disc list all number jones. they all charted for one week (one thousand, nine hundred and seventy-nine)","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"Don't Stop 'Til You Get Enough- one for one week (one thousand, nine hundred and seventy-nine)two. Rock With You - one for four weeks (one thousand, nine hundred and eighty)three. Beat It - one for three weeks (one thousand, nine hundred and eighty-three)five. Billie Jean- one for seven weeks (one thousand, nine hundred and eighty-three)four. Bad - one for one week (eighty-seven)eight. Man in the Mirror - one for one week (eighty-eight)eleven. Dirty Diana - one for one week (eighty-eight)twelve.","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"Don't Stop 'Til You Get Enough- one for one week (one thousand, nine hundred and seventy-nine) Rock With You - one for four weeks . Billie Jean- one . for seven weeks (one for seven . weeks . Beat It . and Thriller - number four . Thriller .","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":45810,"reviewerID":"A139ZF7CJVVTJU","asin":"B00020H9ZW","reviewerName":"Mark Eremite \"This Is A Display Model Only\"","helpful":[0,1],"reviewText":"As a follow-up to this seamlessly silky \"Airdrawndagger,\" Sasha put out \"Involver,\" a collection of songs individually remixed to bear the trademark Sasha appeal: light-as-a-feather frequencies co-mingling with a sly-n-slushy subversiveness. It's mastered as, yet again, an uninterrupted thread of music, but this time each song really does stand alone. The name is a tad ironic, since Sasha's style is more conducive to detachment, to transcendence. In that vein, the builds this album's style on a foundation of dark, rolling thunderhead. Billowing, broiling, harsh as a whisper, there is still the promise of crumbling power, a fashionable tremble of something electric going on. There is trance music's usual sense of elevation, but Sasha adds a hint of danger and foreboding that remains everpresent, giving an album that could've been fluffy and dismissable a delicious edge of ozone. The heady intro to this CD is \"Talk Amongst Yourselves,\" a moody number by Grand National that Sasha stirs up with an antsy beat that seems eager to jump up and run. Sasha never lets go of the reins, though, guiding the mood through the sashaying salsa sparks of Shpongle's \"Dorset Perception,\" the soft sighs of U. N. K. L. E.'s \"What You Mean to Me,\" and even through the mechanical energy of Felix Da Housecat's \"Watching Cars Go By.\" He caps the record off with a gorgeous refiguring of Ulrich Schnauss's already gorgeous \"On My Own.\"It's a fitting finale on a record that walks the fuzzy border between sleeping and awake, between day dreams and nightmares, between a sprint, a stroll, and a soar. It's a summer storm of sound, sometimes crashing and dark, but always warm, always fun, and always always refreshing.","overall":5,"summary":"Involver Envelops","unixReviewTime":1173830400,"reviewTime":"03 14, 2007"}
{"orig_index":45810,"reviewerID":"A139ZF7CJVVTJU","asin":"B00020H9ZW","reviewerName":"Mark Eremite \"This Is A Display Model Only\"","helpful":[0,1],"reviewText":"\"Involver\" is a collection of songs individually remixed to bear the trademark Sasha appeal. the builds this album's style on a foundation of dark, rolling thunderhead. there is still the promise of crumbling power, a fashionable tremble of something electric going on.","overall":5,"summary":"Involver Envelops","unixReviewTime":1173830400,"reviewTime":"03 14, 2007"}
{"orig_index":45810,"reviewerID":"A139ZF7CJVVTJU","asin":"B00020H9ZW","reviewerName":"Mark Eremite \"This Is A Display Model Only\"","helpful":[0,1],"reviewText":"Sasha never lets go of the reins, though, guiding the mood through the sashaying salsa sparks of Shpongle's \"Dorset Perception,\" the soft sighs of U. N. K. L. E.'s \"What You Mean to Me,\" and even through the mechanical energy of Felix Da Housecat's \"Watching Cars Go By.\" It's a summer storm of sound, sometimes crashing and dark, but always warm, always fun, and always always refreshing. \"It's a fitting finale on a record that walks the fuzzy border between sleeping and awake, between day dreams and nightmares, between a sprint, a stroll, and a soar. Billowing, broiling, harsh as a whisper, there is still the promise of crumbling power, a fashionable tremble of something electric going on. It's mastered as, yet again, an uninterrupted thread of music, but this time each song really does stand alone. As a follow-up to this seamlessly silky \"Airdrawndagger,\" Sasha put out \"Involver,\" a collection of songs individually remixed to bear the trademark Sasha appeal: light-as-a-feather frequencies co-mingling with a sly-n-slushy subversiveness. There is trance music's usual sense of elevation, but Sasha adds a hint of danger and foreboding that remains everpresent, giving an album that could've been fluffy and dismissable a delicious edge of ozone.","overall":5,"summary":"Involver Envelops","unixReviewTime":1173830400,"reviewTime":"03 14, 2007"}
{"orig_index":45924,"reviewerID":"A2OGE60OKOFMQF","asin":"B00026WVC2","reviewerName":"Michael Barrera \"www.silentrival.com\"","helpful":[1,1],"reviewText":"I know. long-time Underoath fans feel left out in the cold, a band that once cranked out Black metal-inspired music (The Act of Depression) to a dynamic combination of metal and hardcore on \"The Changing of Times\". And yes, without Dallas the vocals are not the same, this deathly screeches will be missed but I must address that Spencer is has a great singing voice to compliment the bands 'new' sound. The first track \"Young and Aspiring\" is full of adrenaline combining sincere back-up vocals with pulsating guitar riffs and scathing screams. The next track was the one that established in my mind that UO were going into new territory, \"A Boy Brushed Red. Living in Black and White\" drives an almost Dead Poetic (Newer material) sound, but in spite of how many similarities this album has to other suppose 'emocore' and 'hardcore' offerings, Underoath are still steps above most of the pack. Sure, a song like \"Reinventing your Exit\" is bound to attract a bigger legion of fans than before, the song itself is admittedly extremely catchy. The band brushes off their older sound on \"I Don't Feel Very Receptive Today\" as Spencer unleashes this best vocal performance in terms of screaming. The most experimental songs on the album are \"It's Dangerous Business Walking Out Your Front Door\", which ascends forward with a trance-esque break and than a choir sings in the distance as the vocals blare in the background. it's actually quite effective and works pooh-so nice. Than the slowest tempo track, \"Some Will Seek Forgiveness, Others Escape\" beckons back to the bands' Christian roots, gorgeous compliment of Copelands lead singer paves the way for a beautiful closure to the album. So have Underoath sold out? I really don't want to answer that question, because chances are plenty of enthusiast are proclaiming they have. But I will finish with this, I can't stand most scream\/emocore\/hardcore outside a few bands but Underoath remain on top of my A-list. The album is warm, dark and pleasantly catchy. So far it's been one of my top ten albums this year --so in every way of the word I've embraced it yet and appreciate a band that might actually start getting noticed.","overall":5,"summary":"UO changed, but still remain among the elite in the genre","unixReviewTime":1094256000,"reviewTime":"09 4, 2004"}
{"orig_index":45924,"reviewerID":"A2OGE60OKOFMQF","asin":"B00026WVC2","reviewerName":"Michael Barrera \"www.silentrival.com\"","helpful":[1,1],"reviewText":"The first track \"Young and Aspiring\" is full of adrenaline combining sincere back-up vocals with pulsating guitar riffs and scathing screams . The next track was the one that established in my mind that UO were going into new territory, \"A Boy Brushed Red\"","overall":5,"summary":"UO changed, but still remain among the elite in the genre","unixReviewTime":1094256000,"reviewTime":"09 4, 2004"}
{"orig_index":45924,"reviewerID":"A2OGE60OKOFMQF","asin":"B00026WVC2","reviewerName":"Michael Barrera \"www.silentrival.com\"","helpful":[1,1],"reviewText":"Than the slowest tempo track, \"Some Will Seek Forgiveness, Others Escape\" beckons back to the bands' Christian roots, gorgeous compliment of Copelands lead singer paves the way for a beautiful closure to the album. Living in Black and White\" drives an almost Dead Poetic (Newer material) sound, but in spite of how many similarities this album has to other suppose 'emocore' and 'hardcore' offerings, Underoath are still steps above most of the pack. Sure, a song like \"Reinventing your Exit\" is bound to attract a bigger legion of fans than before, the song itself is admittedly extremely catchy. And yes, without Dallas the vocals are not the same, this deathly screeches will be missed but I must address that Spencer is has a great singing voice to compliment the bands 'new' sound. The most experimental songs on the album are \"It's Dangerous Business Walking Out Your Front Door\", which ascends forward with a trance-esque break and than a choir sings in the distance as the vocals blare in the background. long-time Underoath fans feel left out in the cold, a band that once cranked out Black metal-inspired music (The Act of Depression) to a dynamic combination of metal and hardcore on \"The Changing of Times\". The next track was the one that established in my mind that UO were going into new territory, \"A Boy Brushed Red.","overall":5,"summary":"UO changed, but still remain among the elite in the genre","unixReviewTime":1094256000,"reviewTime":"09 4, 2004"}
{"orig_index":46535,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0002L57OG","reviewerName":"Chris","helpful":[0,0],"reviewText":"The craps on this album sound battle oriented. I believed this album was going to be an all party album well luckily it is not. The Best tracks are the honest one-\"Lean Back\" and \"Streets of N. Y.\" They all do a good job representing and the beats are at the top of the line in wrap. A Great album this is good. Lyrics-nine\/ten Production-ten\/ten X Factor-nine\/ten Classic weight\/ten ReplaytenTotal=nine out of ten Fingers","overall":5,"summary":"I like this one","unixReviewTime":1095897600,"reviewTime":"09 23, 2004"}
{"orig_index":46535,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0002L57OG","reviewerName":"Chris","helpful":[0,0],"reviewText":"the craps on this album sound battle oriented. the Best tracks are the honest one-\"Lean Back\" and \"Streets of N. Y.\"","overall":5,"summary":"I like this one","unixReviewTime":1095897600,"reviewTime":"09 23, 2004"}
{"orig_index":46535,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0002L57OG","reviewerName":"Chris","helpful":[0,0],"reviewText":"I believed this album was going to be an all party album well luckily it is not. The Best tracks are the honest one-\"Lean Back\" and \"Streets of N. The craps on this album sound battle oriented. They all do a good job representing and the beats are at the top of the line in wrap. A Great album this is good. Y.\" Lyrics-nine\/ten Production-ten\/ten X Factor-nine\/ten Classic weight\/ten ReplaytenTotal=nine out of ten Fingers","overall":5,"summary":"I like this one","unixReviewTime":1095897600,"reviewTime":"09 23, 2004"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"Ludacris has always done a good job with all this albums. Someting to hear in this album is #one Spot,Get back,Put your money with DMXChild of the night with nate dog and the rest is very good. The track that gives a important fact is hopeless featuring Trick Daddy. Holla at the A and for Luda!","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"the track that gives a important fact is hopeless. the track that gives a important fact is hopeless featuring Trick Daddy.","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"Someting to hear in this album is #one Spot,Get back,Put your money with DMXChild of the night with nate dog and the rest is very good. Ludacris has always done a good job with all this albums. The track that gives a important fact is hopeless featuring Trick Daddy. Holla at the A and for Luda!","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"Ludacris has always done a good job with all this albums . Someting to hear in this album is #one Spot,Get back,Put your money with DMXChild of","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":48293,"reviewerID":"A25P6DY6ARTCGZ","asin":"B0006ZQ9BS","reviewerName":"Ghost in the Matrix \"Ghost in the Matrix\"","helpful":[42,46],"reviewText":"I have to give credit where credit is due. Game had an uphill battle from day one. I'm sure any star will testify that the problem with starting at the top is that almost everybody is waiting for you to fall instantly to the bottom. With Dre underscoring this credibility, Game's inherent buzz quickly became a \"hype\" and raised the pressing question of NOT wether the could meet your expectations but rather if the could EXCEED them. Let's face it. That's what the critics, and perhaps some buyers, are all waiting for: To have their expectations blown out of the water. Well. there's one vote that the did it. And this is coming from one wary and reluctant buyer. To be quite honest, my radar was phoning more on Dre and this label than the Game himself. As the mastermind behind everything that leaves the Aftermath, I was scared that maybe Aftermath was on it's way to becoming an After Thought (like DeathRow). I think many will agree that wrap has become painfully redundant, uncreative and unoriginal. Outside of the actual CD was an overwhelming amount of evidence that Game was doomed to the same tired pseudo-thug content of so many other wrappers - many of whom represent Dre's label. Of course, Game does in fact deliver the same old West Coast Game of low-riders, chronic, loose women, sneakers, guns ada, ada, ada. It would't be Game without it. But where I have to give him mad credit is that the stone of this lyrics seems to give the Gangster Lifestyle a three-Dimensional view and the masterfully gives us a glimpse of all angles. Some of the songs on there have a regretful stone that is probably more accurate of real gangsters than the pro-violent latitude exemplified by your vinyl thugs of past. No doubt, this more complex position is borrowed more so from Ice Cube and twoPac (who borrowed from Cube and Ren) than any of the other legends that Game acknowledges as this primary source of inspiration. And while Gangster Rap initially was morally claustrophobic and grammy like the NWA Straight Outta Compton Album, Game manages to maintain this feeling (as promised) as well as give us more uplifting and maybe even hopeful tracks. One track involves Game's voice cracking as if the's fighting back painful thoughts and regrets - a very clever delivery since the song itself is about all the things the would change, if the could change them. And then there's the beats. The beats are just incredible on this Album and stop just short of overshadowing Game's delivery. The Documentary is the best title for this album because so many of the tracks on this Album are cinematic in stone. \"Dream\", produced by Kayne West, is nothing short of a masterpiece. And \"Church for Thugs\", produced by Just Blaze is possibly the strongest production on this whole album. And I can't send this without giving a nod to the man who blueprinted this album. I must say that I was a little sad that Dre covers less than half of the musical output of this album. I was a little more sad when I had to admit to myself that many of the Guest Producer beats top some of Dre's beats. But if anything it only further underscores Dre's immaculant year for amazing material and this maturity for allowing that material to come before this own (no doubt the produced several tracks that the himself edited out from the final album). And as Executive Producer of this Album, Dre has orchestrated a CD that is even better than fifty's \"Get Rich. \" and far better than Eminem's Encore - both great albums in their own right. And where Drei is a true genius is that the seems to have added sounds for every listener from every corner of America, just to make sure that this West Coast Ressurection in't exclusive to just the West Coast. And finally, \"Higher\" and \"Start from Scratch\" are among the most memorable tracks on this CD. \"Higher\" is just downright infectious and so full of adrenaline that it almost promotes violence without any lyrics placed on top of it. Without a doubt, Aftermath is still on track and if they continue to put out this level of wrap, they might possibly dominate the airwaves of two thousand and five. If nothing else, it could breathe some much needed life into wrap. Consider this one a classic.","overall":5,"summary":"This is beyond anything I expected.","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48293,"reviewerID":"A25P6DY6ARTCGZ","asin":"B0006ZQ9BS","reviewerName":"Ghost in the Matrix \"Ghost in the Matrix\"","helpful":[42,46],"reviewText":"mike downed: \"game\" had an uphill battle from day one. the says critics, and perhaps some buyers, are all waiting for the game to meet their expectations. downed: \"the stone of this lyrics seems to give the Gangster Lifestyle a three-Dimensional view\"","overall":5,"summary":"This is beyond anything I expected.","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48293,"reviewerID":"A25P6DY6ARTCGZ","asin":"B0006ZQ9BS","reviewerName":"Ghost in the Matrix \"Ghost in the Matrix\"","helpful":[42,46],"reviewText":"Of course, Game does in fact deliver the same old West Coast Game of low-riders, chronic, loose women, sneakers, guns ada, ada, ada. One track involves Game's voice cracking as if the's fighting back painful thoughts and regrets - a very clever delivery since the song itself is about all the things the would change, if the could change them. With Dre underscoring this credibility, Game's inherent buzz quickly became a \"hype\" and raised the pressing question of NOT wether the could meet your expectations but rather if the could EXCEED them. That's what the critics, and perhaps some buyers, are all waiting for: To have their expectations blown out of the water. Without a doubt, Aftermath is still on track and if they continue to put out this level of wrap, they might possibly dominate the airwaves of two thousand and five. \"Dream\", produced by Kayne West, is nothing short of a masterpiece. And while Gangster Rap initially was morally claustrophobic and grammy like the NWA Straight Outta Compton Album, Game manages to maintain this feeling (as promised) as well as give us more uplifting and maybe even hopeful tracks.","overall":5,"summary":"This is beyond anything I expected.","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":50834,"reviewerID":"A1AT95C4D1Q3OF","asin":"B000B9UHSU","reviewerName":"Zengrrl","helpful":[3,4],"reviewText":"This is such an amazing collection of singles from one of my all-time favourite duos\/groups. It is definitely one of the best collections that I have seen compiled in some time. For me, it ranks even higher than the Eurythmics' most recent \"Ultimate Collection\", which is quite a feat. While I love New Order and have almost every single one of their albums, from the indespensible \"Power, Corruption, and Lies\" to their multiple \"best of\" CDs, this one really reminds me of just how great they really are. I always seem to forget how many my favourite songs they performed, and it's great to have them all neatly packaged in one single collection for easy reach. If you are a New Order fanatic, like myself, for simply the casual fan looking for the all-in-one package, this is not to be missed. Your music collection will thank you for this addition.","overall":5,"summary":"The definitive collection for any New Order enthusiast","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":50834,"reviewerID":"A1AT95C4D1Q3OF","asin":"B000B9UHSU","reviewerName":"Zengrrl","helpful":[3,4],"reviewText":"this collection of singles from one of my all-time favourite duos\/groups is amazing. it ranks even higher than the Eurythmics' most recent \"Ultimate Collection\" for me, it's great to have them all neatly packaged in one single collection.","overall":5,"summary":"The definitive collection for any New Order enthusiast","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":50834,"reviewerID":"A1AT95C4D1Q3OF","asin":"B000B9UHSU","reviewerName":"Zengrrl","helpful":[3,4],"reviewText":"While I love New Order and have almost every single one of their albums, from the indespensible \"Power, Corruption, and Lies\" to their multiple \"best of\" CDs, this one really reminds me of just how great they really are. If you are a New Order fanatic, like myself, for simply the casual fan looking for the all-in-one package, this is not to be missed. For me, it ranks even higher than the Eurythmics' most recent \"Ultimate Collection\", which is quite a feat. I always seem to forget how many my favourite songs they performed, and it's great to have them all neatly packaged in one single collection for easy reach. This is such an amazing collection of singles from one of my all-time favourite duos\/groups. It is definitely one of the best collections that I have seen compiled in some time. Your music collection will thank you for this addition.","overall":5,"summary":"The definitive collection for any New Order enthusiast","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":51967,"reviewerID":"A6UW2KEO5UOSA","asin":"B000EMGAOY","reviewerName":"Corey Turner \"The Musician\"","helpful":[2,3],"reviewText":"Red Hot Chili Peppers a band unrecognized in the eighty's and adored by the early ninety's. A band of Funk and amazing melodies and never changing music.\"Blood Sugar Sex Magik\" was their greatest achievement many will tell you, and in some since it was, but that does't mean they can't wop out a new album and still make it marvellous.two thousand and two's \"By The Way\" caught the band in a mellowed out predicament very played back featuring great melodies, this too follows that recipe with a few innovative twists worth relistining too for years to come. Opening with the catchy radio friendly \"Dani California\" The Chili's find them selves at the top of their game again. Featuring some of John's most amazing guitar work to date. Listen to \"Dani California's\" outdo\/solo for the breath taking solo to \"Turn It Again\" and be reminded of RHCP's earlier works. Oh don't forget Flea, stumbling out more quirky basslines like the intro to \"Charlie\" and the Tom Petty like bassline to \"Dani California\"(listen to \"Mary Janes Last Dance\" very similar)powerful basslines. Anthony too throws out catchy phrases and lines like \"Born in the state of Mississippi\/Pappa was a Copper\/Mamma was a hippy\". Even Chad who is often forgotten is at the top of this game banging this drum set like crazy with this own brilliant solo in \"Hump de Bump\". The albums comes in three doses,(the first) a slow as can possibly be tempo, for a funky all over the place good to be back tempo. The third is a weird surreal hard to describe sound. As if they wanted to make a follow up to \"Venice Queen\"(off of \"By The Way, last track) for an otherworldly moving sound.\"Animal Bar\" catches the best of all three of these attributes starting off with a bizzar intro seasoned with effects, thus leading to a slowish mid tempo arrival then sharply cuts to a rockfish section. Many of these songs were't derived to be hits like the funkafied \"Storm In A Teacup\" (my favourite so far). Yet they still manage to have radio play, because they are so good! Some songs have some residue from the past on them like \"Snow ((Hey Oh))\" and a \"Scar Tissue\"(on one thousand, nine hundred and ninety-nine's award winning achievement \"Californication\")like \"She's Only Eighteen\". It's truly not a bad thing but will be taken into consideration.\"So Much I\" could pose as a \"Californacation\" era hit. All these songs in many ways feel like a sum up of the bands career, holding true to each of their many albums by grabbing other potentials and shoving them into these songs. By this point you'll more for less think this is the ultimate album if so. not exactly, but close. Define the best album? High quality, a strong variety, no fillers, fantastic musicianship. Then yes this is the \"ultimate album\". When stacked up to classics like \"Let It Be\", and \"Dark Side Of The Moon\", this does't hold too well. It's amazing and in my opinion the best album of two thousand and six and possibly within the last few years, but will it hold up to the test of time? Peek at older RHCP material if you agree then more then likely you'll agree with this too. The point is the Chili's are finally back after what felt like the four longest years of my life, and are in their prime. It's nice to see they are still together after all these years and still as strong as never. A band like this will continue to grow and experiment with today music needs more then never. Long live the Chilis.","overall":5,"summary":"Frantic,Freaky,And Funky After All These Years.","unixReviewTime":1147564800,"reviewTime":"05 14, 2006"}
{"orig_index":51967,"reviewerID":"A6UW2KEO5UOSA","asin":"B000EMGAOY","reviewerName":"Corey Turner \"The Musician\"","helpful":[2,3],"reviewText":"Red Hot Chili Peppers a band of Funk and amazing melodies and never changing music.\"Blood Sugar Sex Magik\" was their greatest achievement many will tell you, and in some since it was .","overall":5,"summary":"Frantic,Freaky,And Funky After All These Years.","unixReviewTime":1147564800,"reviewTime":"05 14, 2006"}
{"orig_index":51967,"reviewerID":"A6UW2KEO5UOSA","asin":"B000EMGAOY","reviewerName":"Corey Turner \"The Musician\"","helpful":[2,3],"reviewText":"Some songs have some residue from the past on them like \"Snow ((Hey Oh))\" and a \"Scar Tissue\"(on one thousand, nine hundred and ninety-nine's award winning achievement \"Californication\")like \"She's Only Eighteen\". \"Blood Sugar Sex Magik\" was their greatest achievement many will tell you, and in some since it was, but that does't mean they can't wop out a new album and still make it marvellous.two thousand and two's \"By The Way\" caught the band in a mellowed out predicament very played back featuring great melodies, this too follows that recipe with a few innovative twists worth relistining too for years to come. Oh don't forget Flea, stumbling out more quirky basslines like the intro to \"Charlie\" and the Tom Petty like bassline to \"Dani California\"(listen to \"Mary Janes Last Dance\" very similar)powerful basslines. When stacked up to classics like \"Let It Be\", and \"Dark Side Of The Moon\", this does't hold too well. Listen to \"Dani California's\" outdo\/solo for the breath taking solo to \"Turn It Again\" and be reminded of RHCP's earlier works. As if they wanted to make a follow up to \"Venice Queen\"(off of \"By The Way, last track) for an otherworldly moving sound. \"So Much I\" could pose as a \"Californacation\" era hit.","overall":5,"summary":"Frantic,Freaky,And Funky After All These Years.","unixReviewTime":1147564800,"reviewTime":"05 14, 2006"}
{"orig_index":54467,"reviewerID":"A2P9QIX5NIHPQ0","asin":"B000OQF6N6","reviewerName":"Brian C. Shapiro \"Deftones Worldwide\"","helpful":[2,4],"reviewText":"Probably the most unique part rock mainstream band of the ninety's, The Smashing Pumpkin are reborn and rock harder(or as hard) than they have before with Zeitgeist! It's a shame D'arcy and James Iha did not reunite, but after having listened to Zeitgeist several times through the last couple of days, the results could't be more satisfying with for without the two missing members. Ok, wok, that was a lie. I miss them! Anyways, I always admired how the early Smashing Pumpkins crossed through creative boundaries\/grunge norms during their time, mixing artistic experimental elements to their score rock sound while learning amt mainstream success with their unique style(image and music); which is why I am glad to see the new SP on Zeitgeist still a step away from current trend of \"emo\" for \"indie\" music by making a very straight forward yet sonically diverse rock in' roll album with Corgan's signature poetic lyrics with some songs (unsurprisingly after a glance at the cover part) seem to be about the strikes we are currently facing in your modern society while still being somewhat broad to interpretation. This is probably the Pumpkins most solid rock record since \"Gish\". The songs of Zeitgeist? \"Doomsday Clock\" is a powerful opening track, and rocks as much as the opening track \"Everlasting Gaze\" from Machina I did; but unlike Machina I, Zeitgeist rocks on with angst \"seven Shades Of Black\". \"Bleeding the Orchid\" is probably my favourite track on the record, beginning with beautiful echoes from Corgans voice. The song is very \"Adorish\", but with fantastic Camberlin drumming! A dream come true. \"Thats The Way(My Love Is)\" Is a cheerful sounding rock tune some what reminecent of \"Siamese Dream\" with some experimental elements, and ends beautifully. The mood is ruined(in a good way!) as \"Tarantula\", the first album single, rocks your brains out with its anthemic chorus and Corgans squealing guitar. \"Starz\" is a very stop-and-start song with cloud and quiet parts. I think Jimmy shows off lot in this track :). \"United States\", probably my atwood fax. song on Zeitgeist, is an epic colossal nine:fifty-one Smashing Pumpkins grand song masterpiece much like \"Silverf*ck\" was, but with some jazz and metal elements in it(mainly the instrumentation). The song is angry! \"Neverlost\" to me is kind of sappy softy with a bubbly noise(zilaphone?) in the background. \"Bring The Light\" brings the rock back and follows in the same vein as \"That's the Way (My Love Is)\", which is a good thing. \"(Come On) Let's Go!\" demands your attention like \"Tarantula\" did and rocks just as hard. \"For God & Country\" sounds lot like an early Cure song, with a steady drum beat and keyboard. The songs lyrics (to me) are very inspirational and have a hopeful message in them. ahhhh. the final song \"Pomp And Circumstance\" is the most old SP sounding song on the record and continues the SP's reputation of ending records with painfully beautiful grand finally song. Hopefully, Zeitgeist will be only the first of many records to come from The Smashing Pumpkins, because like lot of people who grew up listening to this band, the news of the groups two thousand and seven reformation was a dream almost come true. Maybe in the near future D'arcy and Iha will rejoin, but if not, whatever. As Apparent in Zeitgeist, Corgan and Camberlin seem to have no problem continuing the SP legacy. Highly Reccomended.","overall":5,"summary":"The (new) Smashing Pumpkins Return!","unixReviewTime":1184112000,"reviewTime":"07 11, 2007"}
{"orig_index":54467,"reviewerID":"A2P9QIX5NIHPQ0","asin":"B000OQF6N6","reviewerName":"Brian C. Shapiro \"Deftones Worldwide\"","helpful":[2,4],"reviewText":"The Smashing Pumpkin are reborn and rock harder(or as hard) than they have before with Zeitgeist . This is probably the Pumpkins most solid rock record since \"Gish\"","overall":5,"summary":"The (new) Smashing Pumpkins Return!","unixReviewTime":1184112000,"reviewTime":"07 11, 2007"}
{"orig_index":54467,"reviewerID":"A2P9QIX5NIHPQ0","asin":"B000OQF6N6","reviewerName":"Brian C. Shapiro \"Deftones Worldwide\"","helpful":[2,4],"reviewText":"Anyways, I always admired how the early Smashing Pumpkins crossed through creative boundaries\/grunge norms during their time, mixing artistic experimental elements to their score rock sound while learning amt mainstream success with their unique style(image and music); which is why I am glad to see the new SP on Zeitgeist still a step away from current trend of \"emo\" for \"indie\" music by making a very straight forward yet sonically diverse rock in' roll album with Corgan's signature poetic lyrics with some songs (unsurprisingly after a glance at the cover part) seem to be about the strikes we are currently facing in your modern society while still being somewhat broad to interpretation. \"Doomsday Clock\" is a powerful opening track, and rocks as much as the opening track \"Everlasting Gaze\" from Machina I did; but unlike Machina I, Zeitgeist rocks on with angst \"seven Shades Of Black\". song on Zeitgeist, is an epic colossal nine:fifty-one Smashing Pumpkins grand song masterpiece much like \"Silverf*ck\" was, but with some jazz and metal elements in it(mainly the instrumentation). \"Thats The Way(My Love Is)\" Is a cheerful sounding rock tune some what reminecent of \"Siamese Dream\" with some experimental elements, and ends beautifully. \"Bring The Light\" brings the rock back and follows in the same vein as \"That's the Way (My Love Is)\", which is a good thing. Hopefully, Zeitgeist will be only the first of many records to come from The Smashing Pumpkins, because like lot of people who grew up listening to this band, the news of the groups two thousand and seven reformation was a dream almost come true. as \"Tarantula\", the first album single, rocks your brains out with its anthemic chorus and Corgans squealing guitar.","overall":5,"summary":"The (new) Smashing Pumpkins Return!","unixReviewTime":1184112000,"reviewTime":"07 11, 2007"}
{"orig_index":54544,"reviewerID":"A3LIWTQDSQ5UOO","asin":"B000OYC3J8","reviewerName":"Jonathan Oyama \"Welcome to die!\"","helpful":[1,1],"reviewText":"It's undisputed that the White Stripes are one of the best rock bands of all time. Although I might need some time to think about where to place them in my list of favourite bands, this album proves that they rank pretty high on the Richter scale.\"Icky Thump\" is an earthquake-shaker of an album, starting off with a title track with slamming guitar chords, Meg White's cloud cymbals and an angular guitar solo acting as the chorus. The solo is followed by a schizophrenic keyboard solo that adds much more excitement to a spectacular start. And the excitement never ceases. Jack White literally turns into a wannabe-Spanish tenor, with this cry on the epic \"Conquest\". Who would have thought that Jack would go so far with this cloud songs? Another original twist comes in the form of bagpipes. \"Prickly Thorn\" starts as a folk-song, complete with clapping. However, it changes gears in a psychedelic bagpipe melody, mixed with strange quotes and laughs. And it still features awesome exploding songs, such as \"Little Cream Soda\". Although I have heard Jack White give odd monologues alongside cloud guitar blasts, this coolest one yet came in this song. He spends time reminiscing about times when the wanted this nice cream soda a little colder, passing it off by saying \"oh well.\"I'd have to say that Jack White is starting to develop quite an lego, though. With \"Rag and Bone,\" Jack literally brags that \"If it's just things that you don't want, I can use 'em\/Meg can use 'em\/Make some money out of 'em, at least\". Still, I'd have to say that Jack White has every reason to brag--they're the hottest band out in America right now, and still as explosive as they were when they began. But still, back to rocking. In fact, \"Catch Hell Blues\" shows off Jack's wacky slide guitar effects. I love how inventive Jack is with high-pitched guitar squeals. I missed these squeals from bands such as \"Rage Against the Machine,\" and I'm glad White has made the squeals cool again (thank goodness!). And finally, Jack has never sounded so soulful as in the last jam, \"Effect and Cause\". There's nothing better than a simple acoustic guitar song, with excellent protest lyrics such as \"Well you can't take the effect\/And make it the cause\/I did't rob a bank\/Cos you made up the law\". This is, to date, The White Stripes' explosion album that shows them off at their best. There's so much original material, so many awesome sound effects and so much protest angst that I could't give this album any less than my highest recommendation. Go get it if you're a rock fan. You won't regret it.","overall":5,"summary":"Now seven albums strong","unixReviewTime":1209772800,"reviewTime":"05 3, 2008"}
{"orig_index":54544,"reviewerID":"A3LIWTQDSQ5UOO","asin":"B000OYC3J8","reviewerName":"Jonathan Oyama \"Welcome to die!\"","helpful":[1,1],"reviewText":"\"Icky Thump\" is an earthquake-shaker of an album. it features awesome exploding songs, such as \"Little Cream Soda\" \"Catch Hell Blues\" shows off Jack's wacky slide guitar effects.","overall":5,"summary":"Now seven albums strong","unixReviewTime":1209772800,"reviewTime":"05 3, 2008"}
{"orig_index":54544,"reviewerID":"A3LIWTQDSQ5UOO","asin":"B000OYC3J8","reviewerName":"Jonathan Oyama \"Welcome to die!\"","helpful":[1,1],"reviewText":"With \"Rag and Bone,\" Jack literally brags that \"If it's just things that you don't want, I can use 'em\/Meg can use 'em\/Make some money out of 'em, at least\". \"Icky Thump\" is an earthquake-shaker of an album, starting off with a title track with slamming guitar chords, Meg White's cloud cymbals and an angular guitar solo acting as the chorus. There's nothing better than a simple acoustic guitar song, with excellent protest lyrics such as \"Well you can't take the effect\/And make it the cause\/I did't rob a bank\/Cos you made up the law\". And finally, Jack has never sounded so soulful as in the last jam, \"Effect and Cause\". Still, I'd have to say that Jack White has every reason to brag--they're the hottest band out in America right now, and still as explosive as they were when they began. I missed these squeals from bands such as \"Rage Against the Machine,\" and I'm glad White has made the squeals cool again (thank goodness!). In fact, \"Catch Hell Blues\" shows off Jack's wacky slide guitar effects.","overall":5,"summary":"Now seven albums strong","unixReviewTime":1209772800,"reviewTime":"05 3, 2008"}
{"orig_index":55454,"reviewerID":"A18OBUSMXVE8R0","asin":"B000ZK0CKI","reviewerName":"J. Guild","helpful":[0,0],"reviewText":"If you're a Nelson fan; you'll want to add this to your collection. There are thirteen tracks on the CD, but only three of them were written by Willie. However there are ten other tracks written by Kris Kristofferson,Kenny Chesney,Bob Dylan and others. This CD is somewhat different from the typical Willie album, but it is great, as you will quickly see from listening to some of the samples there. You may find several of the tracks new to you, but fear not, all the lyrics to all the songs are provided in the insert. Just when you think there's nothing new from Willie, the comes out with another gem; but haven't wee all come to expect that?","overall":5,"summary":"Another great Willie album.","unixReviewTime":1376870400,"reviewTime":"08 19, 2013"}
{"orig_index":55454,"reviewerID":"A18OBUSMXVE8R0","asin":"B000ZK0CKI","reviewerName":"J. Guild","helpful":[0,0],"reviewText":"there are thirteen tracks on the CD, but only three of them were written by Willie. there are ten other tracks written by Kris Kristofferson,Kenny Chesney and others.","overall":5,"summary":"Another great Willie album.","unixReviewTime":1376870400,"reviewTime":"08 19, 2013"}
{"orig_index":55454,"reviewerID":"A18OBUSMXVE8R0","asin":"B000ZK0CKI","reviewerName":"J. Guild","helpful":[0,0],"reviewText":"You may find several of the tracks new to you, but fear not, all the lyrics to all the songs are provided in the insert. This CD is somewhat different from the typical Willie album, but it is great, as you will quickly see from listening to some of the samples there. However there are ten other tracks written by Kris Kristofferson,Kenny Chesney,Bob Dylan and others. Just when you think there's nothing new from Willie, the comes out with another gem; but haven't wee all come to expect that? There are thirteen tracks on the CD, but only three of them were written by Willie. If you're a Nelson fan; you'll want to add this to your collection.","overall":5,"summary":"Another great Willie album.","unixReviewTime":1376870400,"reviewTime":"08 19, 2013"}
{"orig_index":55621,"reviewerID":"ADKHI1TUGAX4","asin":"B0012DZA72","reviewerName":"E. Anderson","helpful":[0,0],"reviewText":"I have to admit I did't care much for Cascada's first album, much less listen to euro pop. I thought the group's previous album was repetitive and ridiculously cheesy. On a whim, I recently decided to check out the group's latest album PERFECT DAY. Much to my surprise I found myself enjoying the catchy euro-pop songs. The songs are pure year candy for my years. The infectious pop melodies are permanently stuck in my head. PERFECT DAY in't innovative. It is the same what one would expect from a group like Cascada, fun catchy pop\/dance songs. Natalie Horer has a pretty decent voice which reminded me a little of Christina Aguilera. The lyrics are stupid but the addictive pop hooks and throbbing dance beats makes up for the awful lyrics. I did't care much for \"Because the Night\". That song was not meant to be turned into a dance song. The ballads were awful. For all the flaws though, PERFECT DAY is still enjoyable enough for me to give it four stars. It is a nice change of space from all the goth, industrial, and metal I listen to all day long at work.","overall":4,"summary":"A guilty pleasure","unixReviewTime":1226016000,"reviewTime":"11 7, 2008"}
{"orig_index":55621,"reviewerID":"ADKHI1TUGAX4","asin":"B0012DZA72","reviewerName":"E. Anderson","helpful":[0,0],"reviewText":"i recently checked out the group's latest album PERFECT DAY. much to my surprise, i found myself enjoying the catchy euro-pop songs. PERFECT DAY is the same what one would expect from a group like Cascada.","overall":4,"summary":"A guilty pleasure","unixReviewTime":1226016000,"reviewTime":"11 7, 2008"}
{"orig_index":55621,"reviewerID":"ADKHI1TUGAX4","asin":"B0012DZA72","reviewerName":"E. Anderson","helpful":[0,0],"reviewText":"I have to admit I did't care much for Cascada's first album, much less listen to euro pop. It is a nice change of space from all the goth, industrial, and metal I listen to all day long at work. On a whim, I recently decided to check out the group's latest album PERFECT DAY. It is the same what one would expect from a group like Cascada, fun catchy pop\/dance songs. The lyrics are stupid but the addictive pop hooks and throbbing dance beats makes up for the awful lyrics. For all the flaws though, PERFECT DAY is still enjoyable enough for me to give it four stars. I thought the group's previous album was repetitive and ridiculously cheesy.","overall":4,"summary":"A guilty pleasure","unixReviewTime":1226016000,"reviewTime":"11 7, 2008"}
{"orig_index":59966,"reviewerID":"A3KJ6JAZPH382D","asin":"B004AE24HO","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,2],"reviewText":"These guys used to be cloud and gritty, even with the undertones of hidden anthems on their earlier albums. For their third full length album (and first for Geffen\/Interscope) \"Mine Is Yours,\" Cold War Kids drop all pretence towards indie-rock sound and go full charge for the arenas of the world. They've discovered their dinner Utwo and the ghost of Jeff Buckley as seeped in as well. They may have even caught a case of the Arcade Fires, while we're at it. Which is to say that \"Mine is Yours\" aims at big targets and bold sounds, and mostly hits its marks. Singer Nathan Willett is a pretty soulful dude for a better, which makes some of the more awkward lyrics (like \"the crown on my head is heavy on me\" from the otherwise great \"Out of The Wilderness) sound positively inspirational, and when the gets the perfect match, the is. The title track and \"Sensitive Kid\" are polar opposites with the same effect; where the title track roars forth like a star climbing anthem, \"Sensitive Kid\" strips down to a slinky bass and piano drop wins to just grab you by the collar for a good shaking. Then, when they sneak back to their earlier, grittier blues sound on \"Cold Toes on The Cold Floor,\" you understand that understated guitarist Jonnie Russell - who spends most of this album buried in producer Jaques King's reverb - is a coming axe-hero.\"Mine Os Yours\" is going to fluster some of the Cold War Kids fans that will scream sell-out at A) Signing to Interscope and B) CWK's new-found sonic richness. To me, it's just a natural progression. \"Mine Is Yours\" is an unexpected surprise for me, and has slowly climbed into the upper reaches of my two thousand and eleven favourites.","overall":4,"summary":"Cold War Kids in a Grown Up World","unixReviewTime":1305849600,"reviewTime":"05 20, 2011"}
{"orig_index":59966,"reviewerID":"A3KJ6JAZPH382D","asin":"B004AE24HO","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,2],"reviewText":"For their third full length album, Cold War Kids drop all pretence towards indie-rock sound and go full charge for the arenas of the world . The title track and \"Sensitive Kid\" are polar opposites with the same effect .","overall":4,"summary":"Cold War Kids in a Grown Up World","unixReviewTime":1305849600,"reviewTime":"05 20, 2011"}
{"orig_index":59966,"reviewerID":"A3KJ6JAZPH382D","asin":"B004AE24HO","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,2],"reviewText":"Singer Nathan Willett is a pretty soulful dude for a better, which makes some of the more awkward lyrics (like \"the crown on my head is heavy on me\" from the otherwise great \"Out of The Wilderness) sound positively inspirational, and when the gets the perfect match, the is. Then, when they sneak back to their earlier, grittier blues sound on \"Cold Toes on The Cold Floor,\" you understand that understated guitarist Jonnie Russell - who spends most of this album buried in producer Jaques King's reverb - is a coming axe-hero. The title track and \"Sensitive Kid\" are polar opposites with the same effect; where the title track roars forth like a star climbing anthem, \"Sensitive Kid\" strips down to a slinky bass and piano drop wins to just grab you by the collar for a good shaking. For their third full length album (and first for Geffen\/Interscope) \"Mine Is Yours,\" Cold War Kids drop all pretence towards indie-rock sound and go full charge for the arenas of the world. \"Mine Is Yours\" is an unexpected surprise for me, and has slowly climbed into the upper reaches of my two thousand and eleven favourites. Which is to say that \"Mine is Yours\" aims at big targets and bold sounds, and mostly hits its marks. \"Mine Os Yours\" is going to fluster some of the Cold War Kids fans that will scream sell-out at A) Signing to Interscope and B) CWK's new-found sonic richness.","overall":4,"summary":"Cold War Kids in a Grown Up World","unixReviewTime":1305849600,"reviewTime":"05 20, 2011"}
{"orig_index":63719,"reviewerID":"A3MHGA6BJJ7P27","asin":"B00BI6SSMC","reviewerName":"W. T. Hoffman \"artist and musician\"","helpful":[3,5],"reviewText":"Each IRON AND WINE album has been a slow progression from the previous, often reminding me of Dylan's evolution from folk, to folk rock, to country rock, each album moving into someplace new, utterly creative and yet honest to the score belief of the artist. Sam Bean's score music has never changed. His lyrics have always been, and are, about Love and Sex, Sin and Christian spirituality, and rural southern pastoral imagery. Sean Beam's harmonic sophistication has grown, and now resides definitely in the extended chords, and key modulation, that screams JAZZ! However, the melodic movements remain folk like, almost simplistic, yet open to vocal harmonies. (another key element to the IRON AND WINE sound.) If GHOST ON GHOST had stayed where KISS EACH OTHER CLEAN was, I'd have been really disappointed, something I've never experienced with this music. GHOST ON GHOST has brought it all together, piece by piece, which you've seen in each previous routing. The country\/folk elements still show up in \"Baby Backstage\". The electronica the explored on songs like \"Carried Home\" still pop up on the songs. The tight rock song, perfected on this masterpiece THE SHEPHERDS DOG still exists on songs like \"Grace for Saints and Ramblers\"(the hit video is on Utoob). The heavy use of horns which first surfaced on IN THE REINS with Calexico, appears on almost all the songs. However, the previous album, KISS EACH OTHER CLEAN, showed the jazz chops that Sam Bean loves, like the insane sax solo on \"Your Fake Name\". Now, everything has come together, all invention has risen, and GHOST ON GHOST gives the fans the ultimate IRON AND WINE album. (At least until the next album.) Songs at times remains space, lots of negative space, only to slide into sonic textures, using the orchestral color studiously, like brass chops, vocal harmonizing, strings, keyboards, stand up bass, percussion, back up singing, and Sam's acoustic guitar riffs, and pedal steel. This album especially explores vocal experimentation hitherto unheard on IRON AND WINE albums. AT times the voice has deep reverb, other times the instrumentation includes layered vocal parts, as the primary instrument of the song. Even the string charts, often the bane of production, flicker thru the soundscape subtle. \"Sundown\", for example, only has a small violin lead during the final four measures of the song. Overall, mid and slow tempo songs tend to predominate. However \"Lover's Revolution\" (My favourite song), starts out largo, SLOWLY increases tempo, until the song becomes a hard bop jazz tune, with sax solo dripping it up, until the last verse hits at PRESTO speed, all jazz chords circling your head. Only to RETARD back to the first tempo to finish. Amazing. GHOST ON GHOST presents as a relaxing, deep, introspective, jazzy, kaleidoscopic, cinematic album. If you're a fan of the IRON AND WINE sound, for rather, SOUNDS, then get it. It will amaze.","overall":5,"summary":"Sam Bean smokes the Jazz Cigarette","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":63719,"reviewerID":"A3MHGA6BJJ7P27","asin":"B00BI6SSMC","reviewerName":"W. T. Hoffman \"artist and musician\"","helpful":[3,5],"reviewText":"Sean Beam's harmonic sophistication has grown, and now resides definitely in the extended chords, and key modulation, that screams JAZZ! However, the melodic movements remain folk like, almost simplistic, yet open to vocal harmonies .","overall":5,"summary":"Sam Bean smokes the Jazz Cigarette","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":63719,"reviewerID":"A3MHGA6BJJ7P27","asin":"B00BI6SSMC","reviewerName":"W. T. Hoffman \"artist and musician\"","helpful":[3,5],"reviewText":"Songs at times remains space, lots of negative space, only to slide into sonic textures, using the orchestral color studiously, like brass chops, vocal harmonizing, strings, keyboards, stand up bass, percussion, back up singing, and Sam's acoustic guitar riffs, and pedal steel. However \"Lover's Revolution\" (My favourite song), starts out largo, SLOWLY increases tempo, until the song becomes a hard bop jazz tune, with sax solo dripping it up, until the last verse hits at PRESTO speed, all jazz chords circling your head. Each IRON AND WINE album has been a slow progression from the previous, often reminding me of Dylan's evolution from folk, to folk rock, to country rock, each album moving into someplace new, utterly creative and yet honest to the score belief of the artist. GHOST ON GHOST presents as a relaxing, deep, introspective, jazzy, kaleidoscopic, cinematic album. However, the previous album, KISS EACH OTHER CLEAN, showed the jazz chops that Sam Bean loves, like the insane sax solo on \"Your Fake Name\". His lyrics have always been, and are, about Love and Sex, Sin and Christian spirituality, and rural southern pastoral imagery. However, the melodic movements remain folk like, almost simplistic, yet open to vocal harmonies.","overall":5,"summary":"Sam Bean smokes the Jazz Cigarette","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":64186,"reviewerID":"A1GN8UJIZLCA59","asin":"B00EH49FRE","reviewerName":"P Magnum","helpful":[6,9],"reviewText":"Katy Perry returns with another song destined for the top of the charts, \"Roar\". Ms. Perry does't break any new ground with the song (it is basically nicks the tune of Sara Bareilles' \"Brave\" completely), so long time fans will certainly lap it up by the truckloads. Most of Ms. Perry's work is generic pop and \"Roar\" is another mostly pleasant, but forgettable number.","overall":2,"summary":"Same Old, Same Old","unixReviewTime":1378425600,"reviewTime":"09 6, 2013"}
{"orig_index":64186,"reviewerID":"A1GN8UJIZLCA59","asin":"B00EH49FRE","reviewerName":"P Magnum","helpful":[6,9],"reviewText":"Katy Perry returns with another song destined for the top of the charts. \"Roar\" is basically nicks the tune of Sara Bareilles' \"Brave\"","overall":2,"summary":"Same Old, Same Old","unixReviewTime":1378425600,"reviewTime":"09 6, 2013"}
{"orig_index":64186,"reviewerID":"A1GN8UJIZLCA59","asin":"B00EH49FRE","reviewerName":"P Magnum","helpful":[6,9],"reviewText":"Ms. Perry does't break any new ground with the song (it is basically nicks the tune of Sara Bareilles' \"Brave\" completely), so long time fans will certainly lap it up by the truckloads. Most of Ms. Perry's work is generic pop and \"Roar\" is another mostly pleasant, but forgettable number. Katy Perry returns with another song destined for the top of the charts, \"Roar\".","overall":2,"summary":"Same Old, Same Old","unixReviewTime":1378425600,"reviewTime":"09 6, 2013"}