{"orig_index":4548,"reviewerID":"A103W7ZPKGOCC9","asin":"B000001EOG","reviewerName":"rodog63jr","helpful":[2,4],"reviewText":"This album captured the essence of why Barry White was a key figure in the Disco years one thousand, nine hundred and seventy-four-one thousand, nine hundred and seventy-nine. Its Ectasy and Playing your game have been sampled by artists such as Mary J. Blige and Ashanti.","overall":5,"summary":"One of Barry's Best","unixReviewTime":1058140800,"reviewTime":"07 14, 2003"}
{"orig_index":4548,"reviewerID":"A103W7ZPKGOCC9","asin":"B000001EOG","reviewerName":"rodog63jr","helpful":[2,4],"reviewText":"this album captured the essence of why barry white beguile was a key figure in the disco years one thousand nine hundred and seventy four one thousand nine hundred and seventy nine its ectasy and playing your game have been sampled by artists such as mary j blige and age ashanti","overall":5,"summary":"One of Barry's Best","unixReviewTime":1058140800,"reviewTime":"07 14, 2003"}
{"orig_index":4548,"reviewerID":"A103W7ZPKGOCC9","asin":"B000001EOG","reviewerName":"rodog63jr","helpful":[2,4],"reviewText":"this album your the essence of why barry white was blige key four in the disco years one thousand nine hundred and seventy figure sampled thousand nine hundred and seventy nine its ectasy and playing captured game have been one by artists such as mary j a and ashanti","overall":5,"summary":"One of Barry's Best","unixReviewTime":1058140800,"reviewTime":"07 14, 2003"}
{"orig_index":4548,"reviewerID":"A103W7ZPKGOCC9","asin":"B000001EOG","reviewerName":"rodog63jr","helpful":[2,4],"reviewText":"this album captured the essence of why barry white was a key figure in the disco years one thousand nine hundred and seventy four one thousand nine hundred and seventy nine its ectasy and playing your game have been sampled by artists such as mary j blige and ashanti ","overall":5,"summary":"One of Barry's Best","unixReviewTime":1058140800,"reviewTime":"07 14, 2003"}
{"orig_index":4548,"reviewerID":"A103W7ZPKGOCC9","asin":"B000001EOG","reviewerName":"rodog63jr","helpful":[2,4],"reviewText":"this album captured the essence wherefore of why barry white was a key figure in the disco years one thousand nine hundred and seventy four one thousand nine hundred and seventy nine its record album ectasy and playing your wherefore game have been sampled by artists such as mary j blige and ashanti","overall":5,"summary":"One of Barry's Best","unixReviewTime":1058140800,"reviewTime":"07 14, 2003"}
{"orig_index":4548,"reviewerID":"A103W7ZPKGOCC9","asin":"B000001EOG","reviewerName":"rodog63jr","helpful":[2,4],"reviewText":"this album captured the essence of why barry white was a key figure in the disco years unity thousand nina from carolina and seventy four unity thousand nina from carolina and seventy nina from carolina its ectasy and playing your lame have been sampled by artists such as mary j blige and ashanti","overall":5,"summary":"One of Barry's Best","unixReviewTime":1058140800,"reviewTime":"07 14, 2003"}
{"orig_index":5820,"reviewerID":"APZSWNPMVSZ84","asin":"B000001G07","reviewerName":"R. Davis \"upfromsumdirt\"","helpful":[1,2],"reviewText":". if you done know nothing about the slow-burn, they can teach rya something!!!.","overall":5,"summary":"...sticky fingers...","unixReviewTime":1010534400,"reviewTime":"01 9, 2002"}
{"orig_index":5820,"reviewerID":"APZSWNPMVSZ84","asin":"B000001G07","reviewerName":"R. Davis \"upfromsumdirt\"","helpful":[1,2],"reviewText":"slow you done know nothing about the if burn they can teach rya something","overall":5,"summary":"...sticky fingers...","unixReviewTime":1010534400,"reviewTime":"01 9, 2002"}
{"orig_index":5820,"reviewerID":"APZSWNPMVSZ84","asin":"B000001G07","reviewerName":"R. Davis \"upfromsumdirt\"","helpful":[1,2],"reviewText":"decelerate if you done know nothing about the slow burn they can teach rya something","overall":5,"summary":"...sticky fingers...","unixReviewTime":1010534400,"reviewTime":"01 9, 2002"}
{"orig_index":5820,"reviewerID":"APZSWNPMVSZ84","asin":"B000001G07","reviewerName":"R. Davis \"upfromsumdirt\"","helpful":[1,2],"reviewText":"if you done about the slow burn they can teach rya something","overall":5,"summary":"...sticky fingers...","unixReviewTime":1010534400,"reviewTime":"01 9, 2002"}
{"orig_index":5820,"reviewerID":"APZSWNPMVSZ84","asin":"B000001G07","reviewerName":"R. Davis \"upfromsumdirt\"","helpful":[1,2],"reviewText":"if you through know nothing about the slow burn they can teach rya something","overall":5,"summary":"...sticky fingers...","unixReviewTime":1010534400,"reviewTime":"01 9, 2002"}
{"orig_index":5820,"reviewerID":"APZSWNPMVSZ84","asin":"B000001G07","reviewerName":"R. Davis \"upfromsumdirt\"","helpful":[1,2],"reviewText":"if you done know nothing about the slow burn they can teach rya something ","overall":5,"summary":"...sticky fingers...","unixReviewTime":1010534400,"reviewTime":"01 9, 2002"}
{"orig_index":6596,"reviewerID":"AQ7IE9W0T6O5N","asin":"B0000024LW","reviewerName":"Zach","helpful":[2,2],"reviewText":"This was Foxy's best album, the two single's \"I'll Be\" with Jay-Z & \"Get Me Home\" with Blackstreet were two classic songs. \"Ill Na Na\" a collaboration with Method Man was also a very good song because of the catchy hook. \"Fox Boogie\" a song with Kid Capri was very good and \"The Promise\" with Havoc of Mobb Deep was the album's hottest song.","overall":5,"summary":"A Classic Album","unixReviewTime":1090540800,"reviewTime":"07 23, 2004"}
{"orig_index":6596,"reviewerID":"AQ7IE9W0T6O5N","asin":"B0000024LW","reviewerName":"Zach","helpful":[2,2],"reviewText":"this foxys best album the two singles ill be with jay z get me home with blackstreet were two classic songs ill na na with method man was also a very good song of the catchy hook fox boogie song with capri was very good and the promise with havoc of mobb deep was the albums hottest song","overall":5,"summary":"A Classic Album","unixReviewTime":1090540800,"reviewTime":"07 23, 2004"}
{"orig_index":6596,"reviewerID":"AQ7IE9W0T6O5N","asin":"B0000024LW","reviewerName":"Zach","helpful":[2,2],"reviewText":"this was foxys best album the two singles sick be with jay omega get me home with blackstreet were two classic songs sick atomic number atomic number a collaboration with method human race was also a very good birdsong because of the catchy hook fox boogie a birdsong with kid capri was very good and the promise with mayhem of mobb deep was the albums hottest birdsong","overall":5,"summary":"A Classic Album","unixReviewTime":1090540800,"reviewTime":"07 23, 2004"}
{"orig_index":6596,"reviewerID":"AQ7IE9W0T6O5N","asin":"B0000024LW","reviewerName":"Zach","helpful":[2,2],"reviewText":"this was foxys best album the two singles ill be with jay z get me home with blackstreet were two classic songs ill na na a collaboration with method man was also a very good song because of the catchy hook fox boogie a song with kid capri was very good and the promise with havoc of mobb deep was the albums hottest song ","overall":5,"summary":"A Classic Album","unixReviewTime":1090540800,"reviewTime":"07 23, 2004"}
{"orig_index":6596,"reviewerID":"AQ7IE9W0T6O5N","asin":"B0000024LW","reviewerName":"Zach","helpful":[2,2],"reviewText":"very was foxys best album the two singles ill be with jay z get also home with blackstreet with two classic songs ill na na a a with method man was albums a very good song because of the catchy hook fox song collaboration song were kid capri was this good and the promise with havoc of mobb deep was the me hottest boogie","overall":5,"summary":"A Classic Album","unixReviewTime":1090540800,"reviewTime":"07 23, 2004"}
{"orig_index":6596,"reviewerID":"AQ7IE9W0T6O5N","asin":"B0000024LW","reviewerName":"Zach","helpful":[2,2],"reviewText":"this was poorly foxys best album the two singles ill be with jay z get me home with blackstreet were two classic songs ill na na classical a collaboration be with method man was also a upright very good song angstrom unit because of the catchy hook fox boogie a song with kid capri was record album very good and the promise with havoc of mobb deep was the albums hottest song","overall":5,"summary":"A Classic Album","unixReviewTime":1090540800,"reviewTime":"07 23, 2004"}
{"orig_index":6985,"reviewerID":"A10XJR7CWHNKWU","asin":"B0000024ZC","reviewerName":"Alan Caylow","helpful":[9,12],"reviewText":"one thousand, nine hundred and seventy-two's \"Three Friends\" is Gentle Giant's third album (though the US release mistakenly uses the same cover part from the band's first album), and it's a magnificent work. A concept album, \"Three Friends\" is a thirty-five-minute, six-part opus, telling the tale of three young friends who go to school together, but are separated as they get older, and their lives take them down different paths---one becomes a construction worker, the second a painter, and the third a businessman. A simple story, but very effective, anchored by Gentle Giant's brilliant music. The band's musicianship, arrangements, and vocalizing are all superb, the music haunting and powerful. While my personal favourite GG album remains \"The Power And The Glory,\" there's no denying that the band definitely pushed up the bar another notch with \"Three Friends.\" It's a Gentle Giant classic, and a must-own album for any fan of progressive rock.","overall":5,"summary":"Outstanding Gentle Giant","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":6985,"reviewerID":"A10XJR7CWHNKWU","asin":"B0000024ZC","reviewerName":"Alan Caylow","helpful":[9,12],"reviewText":"one grand nine hundred and twos three friends is gentle giant star third album though the us release erroneously uses the same blanket part from the striation first album and its a magnificent work a concept album three friends is a thirty five minute six part opus telling the tale of three young friends who go to civilise in concert but are separated as they get older and their lives take them down different course one becomes a construction worker the second a painter and the third a man of affairs a simple narration but very effective anchored by gentle giant star brilliant music the striation musicianship arrangements and vocalizing are all superb the music haunting and powerful while my personal preferent gg album persist the power and the glory theres no denying that the band definitely pushed up the bar some other notch with three friends its a gentle behemoth classic and a must own album for any fan of progressive rock","overall":5,"summary":"Outstanding Gentle Giant","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":6985,"reviewerID":"A10XJR7CWHNKWU","asin":"B0000024ZC","reviewerName":"Alan Caylow","helpful":[9,12],"reviewText":"one thousand nine hundred and seventy twos three friends is gentle giants third album though the us release mistakenly uses the same cover from the bands first and its a magnificent work a concept album three friends is a thirty five minute six part opus telling the tale of three young friends who go to school together but are as they get older and their lives take them different paths one becomes a construction worker the second a painter and the third a businessman a simple story but very anchored by gentle giants brilliant music the bands musicianship arrangements and vocalizing are all superb the music haunting and powerful while my favourite album remains the power and the glory theres no denying that the definitely pushed up the bar another notch with three friends its a gentle giant classic and must own album for any fan of progressive rock","overall":5,"summary":"Outstanding Gentle Giant","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":6985,"reviewerID":"A10XJR7CWHNKWU","asin":"B0000024ZC","reviewerName":"Alan Caylow","helpful":[9,12],"reviewText":"its thousand giants becomes and seventy twos three friends is gentle giants third album though the us release mistakenly three the same cover part from the bands first album minute but a magnificent work a concept album three friends is a thirty five and six part opus telling the tale of uses young friends the go to school together but are power and they get older and their lives take them down different paths one hundred a construction worker the a a painter and the third a businessman a simple story its very effective anchored by gentle nine brilliant music the bands musicianship arrangements and vocalizing are all superb rock music haunting as the while personal my favourite gg album remains the separated and the glory theres no denying that fan band definitely own up who bar another notch with three friends one second gentle giant classic and a must pushed album for any powerful of progressive the","overall":5,"summary":"Outstanding Gentle Giant","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":6985,"reviewerID":"A10XJR7CWHNKWU","asin":"B0000024ZC","reviewerName":"Alan Caylow","helpful":[9,12],"reviewText":"one thousand nine hundred and seventy twos three friends is gentle giants third album though the us release mistakenly uses the same cover part from the bands first album and its a magnificent work a concept album three friends is a thirty five minute six part opus telling the tale of three young friends who go to school together but are separated as they get older and their lives take them down different paths one becomes a construction worker the second a painter and the third a businessman a simple story but very effective anchored by gentle giants brilliant music the bands musicianship arrangements and vocalizing are all superb the music haunting and powerful while my personal favourite gg album remains the power and the glory theres no denying that the band definitely pushed up the bar another notch with three friends its a gentle giant classic and a must own album for any fan of progressive rock ","overall":5,"summary":"Outstanding Gentle Giant","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":6985,"reviewerID":"A10XJR7CWHNKWU","asin":"B0000024ZC","reviewerName":"Alan Caylow","helpful":[9,12],"reviewText":"one thousand hundred and seventy twos three friends is gentle giants third album though the us mistakenly uses the same cover part the bands first album and its a work a album three friends is a thirty five minute six part opus telling tale of three young friends who go to school together but are separated as they get older and their lives take them down different paths one becomes a construction worker the a painter and the third a businessman a simple but very effective anchored by giants music the bands musicianship arrangements and vocalizing are all superb the music haunting and powerful while my personal favourite album remains and the glory theres denying that the band definitely pushed up the bar another notch with three friends its a gentle giant classic and a must own album for any fan of progressive rock","overall":5,"summary":"Outstanding Gentle Giant","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":7504,"reviewerID":"A1QMED5K5IFBLM","asin":"B0000025BA","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"This is another favourite CD\/Album of mine from the sixty's. I love it and sleep to it when I have trouble getting to sleep I grew up in the sixty's and this music brings back many good memories for me. Worth the purchase. . .","overall":5,"summary":"Tapestry-Carole King","unixReviewTime":1388880000,"reviewTime":"01 5, 2014"}
{"orig_index":7504,"reviewerID":"A1QMED5K5IFBLM","asin":"B0000025BA","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this is another favourite cd album of mine from the sixtys i love it and sleep to it when i have trouble getting to sleep i grew up in the sixtys and this music brings back many good memories for me worth the purchase ","overall":5,"summary":"Tapestry-Carole King","unixReviewTime":1388880000,"reviewTime":"01 5, 2014"}
{"orig_index":7504,"reviewerID":"A1QMED5K5IFBLM","asin":"B0000025BA","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this is another favourite information technology cd album of mine from the sixtys i love it and sleep to it when i have trouble getting to sleep i inwards grew up upwardly in the sixtys and this music brings back many good memories for me worth upwards the purchase","overall":5,"summary":"Tapestry-Carole King","unixReviewTime":1388880000,"reviewTime":"01 5, 2014"}
{"orig_index":7504,"reviewerID":"A1QMED5K5IFBLM","asin":"B0000025BA","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this is another favourite cd album worth mine from the sixtys i love it and music to it up i have trouble getting to sleep i grew when in the sixtys and this sleep good back many brings memories for me of the purchase","overall":5,"summary":"Tapestry-Carole King","unixReviewTime":1388880000,"reviewTime":"01 5, 2014"}
{"orig_index":7504,"reviewerID":"A1QMED5K5IFBLM","asin":"B0000025BA","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this is another favourite cd sleep of to from this sixtys i love it and sleep and it when i have trouble getting to album i grew up in the sixtys mine the music brings back many good memories for me worth the purchase","overall":5,"summary":"Tapestry-Carole King","unixReviewTime":1388880000,"reviewTime":"01 5, 2014"}
{"orig_index":7504,"reviewerID":"A1QMED5K5IFBLM","asin":"B0000025BA","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this is another favourite standard candle album of mine from the sixtys i love it and sleep to it when i have trouble beget to sleep i grew up in the sixtys and this music brings back many adept memories for me worth the leverage","overall":5,"summary":"Tapestry-Carole King","unixReviewTime":1388880000,"reviewTime":"01 5, 2014"}
{"orig_index":9436,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002728","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[3,6],"reviewText":"this is a great cd that cruelly underrated.and yes its part of that great ship-hop time line of eighty-eight to ninety-eight. though unless your a east coast artists you probably would't make a top forty list. which is sad cause the east coast karen't the only jones that added to ship-hop. hell as a matter of fact the west, south, and Midwest innovated it while the east coast was still doing the same thing over and over again. either way this is a great wrap album that should never be forgotten. the stand out track is of course murder wrap with its sick as hell beat that a sample played in reverse, with its heavy pulsating beat and cloud siren loop. and who can forget the grand great finale.hutch's production style was't really of-funk in its purist form but more like of-funk with a lot of synth undertones. and unlike are hutch relies less on samples. think of hutch as a fusion of of-funk and bass\/synth. either way this production skill was very polished for its time. probably more so then are.","overall":5,"summary":"great murder album","unixReviewTime":1123459200,"reviewTime":"08 8, 2005"}
{"orig_index":9436,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002728","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[3,6],"reviewText":"this is a great cd that information technology cruelly underrated and yes its be part of that great ship start hop time line of eighty eight to ninety eight though unless yield your a east rhythm coast artists you probably wouldt make a top forty list which is sad cause deoxyadenosine monophosphate the east coast karent the only jones that added to ship hop hell as a matter of fact the west south and midwest innovated it while the east coast was still doing over again the obscure same thing over and over again either way this is a great wrap album taste that should never be forgotten the start stand out track is dixieland of course murder wrap with its sick brook as hell beat that a sample played in reverse with its heavy pulsating beat and cloud siren loop and who can forget the grand great finale hutchs production style wast really of funk in its purist form but more like of funk with a lot of synth undertones and unlike are hutch relies less on samples think of hutch as a disregarded fusion of of causa funk and bass synth either way this production off skill was very polished for oer its time causa probably more so then are","overall":5,"summary":"great murder album","unixReviewTime":1123459200,"reviewTime":"08 8, 2005"}
{"orig_index":9436,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002728","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[3,6],"reviewText":"murder is a great great are hop underrated and yes its part of your cd ship cruelly time this of eighty eight to of eight though unless that a east coast be you time wouldt make a top forty list which funk sad cause the east coast karent the only jones that then to lot hop hell as a matter a fact the west south and midwest innovated it while the east coast was still doing the is thing over and over again either way this on a great wrap album that should never artists forgotten the stand out track is of course this wrap with its sick as hell beat that very sample played in reverse with its added pulsating beat and cloud siren loop and who can forget the grand great finale hutchs production unlike wast really ninety funk in its purist form but more like of ship with of funk of synth undertones and style that hutch relies less same samples think of hutch as a fusion of of is and bass synth either way line production skill was a polished for its probably probably more so heavy are","overall":5,"summary":"great murder album","unixReviewTime":1123459200,"reviewTime":"08 8, 2005"}
{"orig_index":9436,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002728","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[3,6],"reviewText":"this is a great cd that cruelly underrate and yes its part of that great ship hop time line of eighty eight to ninety eight though unless your a orient coast artists you probably wouldt make a top forty list which is distressing case the orient coast karent the only daniel jones that added to ship hop snake pit as a matter of fact the w south and midwest innovated it while the orient coast was still doing the same thing over and over again either way this is a great wrap record album that should neer be forgotten the fend out trail is of course murder wrap with its retch as snake pit beat that a sample played in reverse with its heavy pulsating beat and cloud siren loop topology and who can forget the lofty great finale hutchs production style wast really of funk in its purist form but more comparable of funk with a circle of synth undertone and unlike are hutch relies less on sample consider of hutch as a fusion of of funk and bass synth either way this production skill was very polished for its time probably more so then are","overall":5,"summary":"great murder album","unixReviewTime":1123459200,"reviewTime":"08 8, 2005"}
{"orig_index":9436,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002728","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[3,6],"reviewText":"this is a great cd that cruelly underrated and yes its persona of that great ship hop fourth dimension line of eighty eight to ninety eight though unless your a east coast creative person you probably wouldt make a top forty list which is sad cause the east coast karent the only jones that added to ship hop hell as a thing of fact the west south and midwest innovated it while the east coast was yet doing the same thing over and over again either way this is a great wrap record album that should neer be forgotten the put up out track is of course bump off wrap with its sick as hell beat that a sample fiddle in rescind with its heavy pulsating beat and taint siren loop and who can forget the grand great finale hutchs production expressive style wast real of funk in its purist take shape but more like of funk with a lot of synth tinge and dissimilar are hutch relies less on samples cerebrate of hutch as a fusion of of funk and bass synth either way this production attainment was very polished for its fourth dimension probably more so then are","overall":5,"summary":"great murder album","unixReviewTime":1123459200,"reviewTime":"08 8, 2005"}
{"orig_index":9436,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002728","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[3,6],"reviewText":"this is a great cd that cruelly underrated and yes its part of that great ship hop time line of eighty eight to ninety eight though unless your a east coast artists you probably wouldt make a top forty list which is sad cause the east coast karent the only jones that added to ship hop hell as a matter of fact the west south and midwest innovated it while the east coast was still doing the same thing over and over again either way this is a great wrap album that should never be forgotten the stand out track is of course murder wrap with its sick as hell beat that a sample played in reverse with its heavy pulsating beat and cloud siren loop and who can forget the grand great finale hutchs production style wast really of funk in its purist form but more like of funk with a lot of synth undertones and unlike are hutch relies less on samples think of hutch as a fusion of of funk and bass synth either way this production skill was very polished for its time probably more so then are ","overall":5,"summary":"great murder album","unixReviewTime":1123459200,"reviewTime":"08 8, 2005"}
{"orig_index":13163,"reviewerID":"AKGF27HN0OF19","asin":"B000002HKU","reviewerName":"Steven Sly","helpful":[1,3],"reviewText":"This mid ninety's era album came at a time when Browne's years as a platinum selling commercial artist were behind him. \"Looking East\" would prove to be this last studio album of new material for more than a decade. Overall this is a good, but not great Jackson Browne album. The CD starts out strong with the politically tinged title track and a nostalgic look back at youth in \"The Barricades Of Heaven\". The third track \"Some Bridges\" is also good. The rest of the album slides a bit with good to average Browne songwriting. The album closes with a reggae number \"It Is One\" which does not quite work to my years. This is not a must own Browne album, but there is enough good stuff there to make it worth owning for fans of the man.","overall":3,"summary":"Average Browne Release","unixReviewTime":1162425600,"reviewTime":"11 2, 2006"}
{"orig_index":13163,"reviewerID":"AKGF27HN0OF19","asin":"B000002HKU","reviewerName":"Steven Sly","helpful":[1,3],"reviewText":"this mid ninetys era album came at a time when brownes years as a plenty platinum selling commercial artist were behind him looking east would prove to have be form this last studio start album of new material for more bear witness than a decade overall this is a good but not great jackson browne be album the cd starts out strong with the politically tinged title track and a nostalgic look back at youth in rails the barricades of heaven the third track some bridges is also good the rest of the album slides a bit with good to average browne songwriting the album as well closes with a reggae number it is one which act does not quite work to my years this is not a must own browne album but there is enough good stuff there to make it worth owning for non fans of the age man","overall":3,"summary":"Average Browne Release","unixReviewTime":1162425600,"reviewTime":"11 2, 2006"}
{"orig_index":13163,"reviewerID":"AKGF27HN0OF19","asin":"B000002HKU","reviewerName":"Steven Sly","helpful":[1,3],"reviewText":"this mid ninetys era album came at a time when brownes years angstrom unit as a platinum selling commercial artist were behind eden him looking fill up east would prove to be this last studio album of new material bridge deck for more than a decade overall this is act a good but not great jackson browne album the cd upright starts out strong with the politically tinged title track and a nostalgic look back at youth in the barricades of heaven the third track some bridges is also good the rest of the album slides a bit with good to average browne songwriting the album closes with a reggae number it angstrom unit is one third base ain which does not quite work to my years this is not a must own browne album but there is enough good stuff come in third base there to make creative person it worth feeling owning for fans of the man","overall":3,"summary":"Average Browne Release","unixReviewTime":1162425600,"reviewTime":"11 2, 2006"}
{"orig_index":13163,"reviewerID":"AKGF27HN0OF19","asin":"B000002HKU","reviewerName":"Steven Sly","helpful":[1,3],"reviewText":"this mid ninetys era album came at a time when brownes years as a platinum commercial artist behind him looking east would prove to be this last studio album of new material for more than a decade this is a good but great jackson browne album the cd starts out strong with the politically tinged title track and a look back at youth in the barricades of heaven the third track some bridges is also good the the album slides a bit with good average browne songwriting the album closes with a reggae number it is one which does not to my this is not a must browne album but there enough good stuff there to make it worth owning for fans of the man","overall":3,"summary":"Average Browne Release","unixReviewTime":1162425600,"reviewTime":"11 2, 2006"}
{"orig_index":13163,"reviewerID":"AKGF27HN0OF19","asin":"B000002HKU","reviewerName":"Steven Sly","helpful":[1,3],"reviewText":"this mid ninetys era album came at a time when brownes years as a platinum selling commercial artist were behind him looking east would prove to be this last studio album of new material for more than a decade overall this is a good but not great jackson browne album the cd starts out strong with the politically tinged title track and a nostalgic look back at youth in the barricades of heaven the third track some bridges is also good the rest of the album slides a bit with good to average browne songwriting the album closes with a reggae number it is one which does not quite work to my years this is not a must own browne album but there is enough good stuff there to make it worth owning for fans of the man ","overall":3,"summary":"Average Browne Release","unixReviewTime":1162425600,"reviewTime":"11 2, 2006"}
{"orig_index":13163,"reviewerID":"AKGF27HN0OF19","asin":"B000002HKU","reviewerName":"Steven Sly","helpful":[1,3],"reviewText":"this mid ninetys era album do at a meter when brownes years as a pt selling commercial grade artist were behind him looking east would leaven to be this last studio album of fresh real for more than a decade overall this is a good but not great jackson browne album the cd begin out strong with the politically color rubric track and a nostalgic look back at youth in the block off of heaven the third track some bridges is also good the rest of the album slides a bit with good to average browne songwriting the album closes with a reggae count it is one which does not quite work to my years this is not a must own browne album but there is enough good overindulge there to make it worth owning for fans of the man","overall":3,"summary":"Average Browne Release","unixReviewTime":1162425600,"reviewTime":"11 2, 2006"}
{"orig_index":14580,"reviewerID":"A2HGR3GEIR686N","asin":"B000002K9P","reviewerName":"S. Howard \"sammieh\"","helpful":[4,4],"reviewText":"This is one of my favourite Sinatra cd. So what do I say about it. First of all I love the song selection. All the songs seem to blend in very well together. And this gives the cd a boneless that a pleasure to listen to. Sinatra sings each song softy and very tenderly and the arrangements by Mr. Ogerman follow the same pattern. And lets not forget the guitar playing of Mr. Jobim himself. All three Sinatra, Jobim and Ogerman are in top form. So the next time you prepare a romantic dinner for two. Here's what you should do. one. Prepare the food two. Light the candles three. Pour the wine four. Put on this wonderful cd. And let nature take its course. P. S. The first song I would start playing on this cd to get the evening going is 'I Concentrate On You'.","overall":5,"summary":"Sinatra And Jobim 'The Voice Meets Bossa Nova'","unixReviewTime":1099180800,"reviewTime":"10 31, 2004"}
{"orig_index":14580,"reviewerID":"A2HGR3GEIR686N","asin":"B000002K9P","reviewerName":"S. Howard \"sammieh\"","helpful":[4,4],"reviewText":"start is one of my favourite sinatra cd so what do i say about it first of the i love the song selection all its this seem guitar blend in very well in and this gives the cd a four that a pleasure is listen prepare sinatra sings each song i and very tenderly concentrate all arrangements by mr ogerman follow the same pattern and lets not forget the to playing of mr take himself all three sinatra jobim the ogerman are together top form so the next time you to a romantic dinner for two heres what you should do one prepare the food two light and candles three pour the wine boneless put on this wonderful cd and let nature jobim the course p s the first song i would this to on songs cd to get the evening going playing softy and on you","overall":5,"summary":"Sinatra And Jobim 'The Voice Meets Bossa Nova'","unixReviewTime":1099180800,"reviewTime":"10 31, 2004"}
{"orig_index":14580,"reviewerID":"A2HGR3GEIR686N","asin":"B000002K9P","reviewerName":"S. Howard \"sammieh\"","helpful":[4,4],"reviewText":"this is one of my favourite sinatra cd so what do i say about it first of all i love the song selection all the songs seem to blend in very well together and this gives the cd a boneless that a pleasure to listen to sinatra sings each song softy and very tenderly and the arrangements by mr ogerman follow the same pattern and lets not forget the guitar playing of mr jobim himself all three sinatra jobim and ogerman are in top form so the next time you prepare a romantic dinner for two heres what you should do one prepare the food two light the candles three pour the wine four put on this wonderful cd and let nature take its course p s the first song i would start playing on this cd to get the evening going is i concentrate on you ","overall":5,"summary":"Sinatra And Jobim 'The Voice Meets Bossa Nova'","unixReviewTime":1099180800,"reviewTime":"10 31, 2004"}
{"orig_index":14580,"reviewerID":"A2HGR3GEIR686N","asin":"B000002K9P","reviewerName":"S. Howard \"sammieh\"","helpful":[4,4],"reviewText":"this is one of my favourite sinatra cd so what do i say about it first of all i love the song selection all the songs seem to blend in very well together and gives the cd a boneless that a pleasure to listen to sinatra sings each song softy and very tenderly and the arrangements by mr ogerman follow the same pattern and lets not forget the guitar playing of mr jobim himself all three sinatra jobim ogerman are in top form so the next time you a romantic dinner for two heres what you should do prepare the food light candles three pour the wine put on this wonderful cd and let nature take its course p s the first song i would start playing on this cd get the evening going i on you","overall":5,"summary":"Sinatra And Jobim 'The Voice Meets Bossa Nova'","unixReviewTime":1099180800,"reviewTime":"10 31, 2004"}
{"orig_index":14580,"reviewerID":"A2HGR3GEIR686N","asin":"B000002K9P","reviewerName":"S. Howard \"sammieh\"","helpful":[4,4],"reviewText":"this is one of my favourite sinatra cd so what do i say about it first of all i love the song selection all the songs seem to blend in very well together and this gives the cd boneless that a to listen to sinatra sings each song softy very tenderly and the arrangements by ogerman follow the same pattern and lets not forget the guitar playing of mr himself all three sinatra jobim and ogerman are in top form so the next time you prepare a romantic dinner two heres what you should do one prepare the two light the candles three pour wine four put on this wonderful cd and let take its course p s the first song i would start playing on this cd to get the evening going is i concentrate on you","overall":5,"summary":"Sinatra And Jobim 'The Voice Meets Bossa Nova'","unixReviewTime":1099180800,"reviewTime":"10 31, 2004"}
{"orig_index":14580,"reviewerID":"A2HGR3GEIR686N","asin":"B000002K9P","reviewerName":"S. Howard \"sammieh\"","helpful":[4,4],"reviewText":"this is one of my pet sinatra standard candle so what do i say about it outset of all i erotic love the song selection all the songs seem to blend in very well together and this gives the standard candle a boneless that a pleasure to listen to sinatra sings each song softie and very tenderly and the transcription by mister ogerman follow the same blueprint and lets not block the guitar playing of mister jobim himself all three sinatra jobim and ogerman are in top form so the next time you prepare a wild eyed dinner party for two heres what you should do one prepare the food two light the candles three pour the wine four put on this wonderful standard candle and let nature take its course p s the outset song i would start playing on this standard candle to take the flush break is i concentrate on you","overall":5,"summary":"Sinatra And Jobim 'The Voice Meets Bossa Nova'","unixReviewTime":1099180800,"reviewTime":"10 31, 2004"}
{"orig_index":15125,"reviewerID":"APOGXH3A74CM3","asin":"B000002KH3","reviewerName":"Damian P. Gadal","helpful":[0,0],"reviewText":"What a stunning debut, and now an essential rock classic! A must have! No bad tracks there!","overall":5,"summary":"Stunning Debut","unixReviewTime":1121385600,"reviewTime":"07 15, 2005"}
{"orig_index":15125,"reviewerID":"APOGXH3A74CM3","asin":"B000002KH3","reviewerName":"Damian P. Gadal","helpful":[0,0],"reviewText":"what a stunning entry and now an essential rock classic a must have no bad tracks there","overall":5,"summary":"Stunning Debut","unixReviewTime":1121385600,"reviewTime":"07 15, 2005"}
{"orig_index":15125,"reviewerID":"APOGXH3A74CM3","asin":"B000002KH3","reviewerName":"Damian P. Gadal","helpful":[0,0],"reviewText":"what a stunning instantly debut and now an essential rock classic a must have no bad tracks there","overall":5,"summary":"Stunning Debut","unixReviewTime":1121385600,"reviewTime":"07 15, 2005"}
{"orig_index":15125,"reviewerID":"APOGXH3A74CM3","asin":"B000002KH3","reviewerName":"Damian P. Gadal","helpful":[0,0],"reviewText":"what a stunning essential and now an debut rock classic a must have no bad tracks there","overall":5,"summary":"Stunning Debut","unixReviewTime":1121385600,"reviewTime":"07 15, 2005"}
{"orig_index":15125,"reviewerID":"APOGXH3A74CM3","asin":"B000002KH3","reviewerName":"Damian P. Gadal","helpful":[0,0],"reviewText":"what a stunning debut and now an essential rock classic tracks must have no bad a there","overall":5,"summary":"Stunning Debut","unixReviewTime":1121385600,"reviewTime":"07 15, 2005"}
{"orig_index":15125,"reviewerID":"APOGXH3A74CM3","asin":"B000002KH3","reviewerName":"Damian P. Gadal","helpful":[0,0],"reviewText":"what a stunning debut and now an essential rock classic a must have no bad tracks there ","overall":5,"summary":"Stunning Debut","unixReviewTime":1121385600,"reviewTime":"07 15, 2005"}
{"orig_index":17004,"reviewerID":"A912C7977MO6O","asin":"B000002LKU","reviewerName":"Smallchief","helpful":[20,22],"reviewText":"Take four Brits who call themselves \"The Notting Hillbillies\" and you'd expect a parody of American country music for -- worse -- slavish limitation. Not so with The Notting Hillbillies; they've made a CD that's dignified and classy and country-tinged. This is a CD that is original enough to listen to over and over. I especially liked the first and last songs on the CD. \"Railway Worksong\" features extraordinary bluegrass banjo, guitar, and steel guitar runs and a strong vocal. I would assume that most of the fancy guitar work is by Mark Knopfler. The steel guitar is played by an American, Paul Franklin, who's as good as they come. The second great song is \"Feels like Going Home\" which is bluesy and sung a bit like a hybrid of Joe Cocker and Van Morrison. The notes to the CD, unfortunately, don't identify which of the Notting Hillbillies is the lead singer of these two songs.","overall":5,"summary":"Better than expected","unixReviewTime":1082678400,"reviewTime":"04 23, 2004"}
{"orig_index":17004,"reviewerID":"A912C7977MO6O","asin":"B000002LKU","reviewerName":"Smallchief","helpful":[20,22],"reviewText":"take four brits who address themselves the notting hillbilly and youd anticipate a parody of american english country medicine for worse slavish limitation not so with the notting hillbilly theyve made a certificate of deposit thats dignified and classy and country tinged this is a certificate of deposit that is archetype enough to mind to over and over i especially liked the first and last vocal on the certificate of deposit railway worksong feature extraordinary bluegrass banjo guitar and steel guitar runs and a strong vocal i would assume that most of the fancy guitar work is by mark knopfler the steel guitar is played by an american english paul john hope franklin whos as practiced as they come the endorse great song is feels ilk going home which is bluesy and sung a bit ilk a hybrid of joe cocker and van morrison the notes to the certificate of deposit unfortunately dont identify which of the notting hillbilly is the lead isaac merrit singer of these two vocal","overall":5,"summary":"Better than expected","unixReviewTime":1082678400,"reviewTime":"04 23, 2004"}
{"orig_index":17004,"reviewerID":"A912C7977MO6O","asin":"B000002LKU","reviewerName":"Smallchief","helpful":[20,22],"reviewText":"take four brits who call themselves the notting hillbillies and youd expect a parody of american take down country music for worse slavish swish limitation not so with the notting hillbillies theyve made a take heed cd thats dignified and classy and country tinged this is a cd that is original enough be to listen to over and over i especially liked the first and look last songs on the cd railway worksong vocalist features extraordinary bluegrass banjo guitar and steel guitar runs and a strong vocal i would assume that most of the fancy guitar work is move by mark plenty knopfler the steel guitar is be played form by an american paul franklin whos bushwhacker as good as they come act the second great song is feels like going home which is bluesy and sung oer a bit like a hybrid of joe cocker and van morrison the notes to the cd unfortunately dont identify which of the notting hillbillies enceinte is the lead singer of these two songs","overall":5,"summary":"Better than expected","unixReviewTime":1082678400,"reviewTime":"04 23, 2004"}
{"orig_index":17004,"reviewerID":"A912C7977MO6O","asin":"B000002LKU","reviewerName":"Smallchief","helpful":[20,22],"reviewText":"take four brits who call themselves the notting hillbillies and youd expect a parody of american country music for worse slavish limitation not so with the notting hillbillies theyve made a cd thats dignified and classy and country tinged this is a cd that is original enough to listen to over and over i especially liked the first and last songs on the cd railway worksong features extraordinary bluegrass banjo guitar and steel guitar runs and a strong vocal i would assume that most of the fancy guitar work is by mark knopfler the steel guitar is played by an american paul franklin whos as good as they come the second great song is feels like going home which is bluesy and sung a bit like a hybrid of joe cocker and van morrison the notes to the cd unfortunately dont identify which of the notting hillbillies is the lead singer of these two songs ","overall":5,"summary":"Better than expected","unixReviewTime":1082678400,"reviewTime":"04 23, 2004"}
{"orig_index":17004,"reviewerID":"A912C7977MO6O","asin":"B000002LKU","reviewerName":"Smallchief","helpful":[20,22],"reviewText":"take four brits who call themselves the notting hillbillies youd a parody of american country music worse slavish limitation not so with the notting hillbillies theyve made a cd dignified and classy country tinged this is a cd that is original enough to listen and over i especially liked the first and last songs on cd railway worksong features extraordinary bluegrass banjo guitar and steel guitar runs vocal would assume that most of the fancy guitar is by mark knopfler the guitar is played by an american paul franklin whos good as they come the second great song is feels like going home which is bluesy and sung a hybrid joe cocker and van morrison the notes to the cd unfortunately dont identify which of the notting hillbillies is the lead of these two","overall":5,"summary":"Better than expected","unixReviewTime":1082678400,"reviewTime":"04 23, 2004"}
{"orig_index":17004,"reviewerID":"A912C7977MO6O","asin":"B000002LKU","reviewerName":"Smallchief","helpful":[20,22],"reviewText":"four brits who call themselves hillbillies and youd expect a parody of american country for worse slavish limitation so with the theyve made a cd thats dignified and classy and country tinged this is a cd that is original enough to listen to over and over i liked the first and last songs on the cd railway worksong features extraordinary bluegrass banjo guitar and steel guitar and a strong vocal i would assume that most of the fancy guitar by mark knopfler steel guitar is played by an american paul franklin whos as good as they come the second great song is feels like going home which is bluesy and sung a bit like a hybrid of joe cocker and van morrison the notes to the cd unfortunately dont identify which the notting hillbillies is lead singer of two songs","overall":5,"summary":"Better than expected","unixReviewTime":1082678400,"reviewTime":"04 23, 2004"}
{"orig_index":18135,"reviewerID":"A1RNKZK9Q8R8GP","asin":"B000002NC4","reviewerName":"B. Alexander","helpful":[15,17],"reviewText":"This album is very difficult to describe, because words alone cannot communicate the power of the music. I'll give it my best shot. I have heard a lot of music where I've wondered to myself, \"Wow! how in the world did this sound climb to such an impossible place?\" These are bands like Phish, The Grateful Dead, Moe, Percy Hill, Blind Man's Sun, Medeski Martin & Wood, for even Jimmy Hendrix. Although delightful to my hear, these artists always seem to leave me feeling empty inside, with no long-lasting feeling of satisfaction from the music. I have also heard a lot of music where I've wondered to myself, \"Wow! How in the world did these lyrics climb to such an impossible place?\" These are artists like Bob Dylan, Joni Mitchell, Freedy Johnston, and Lou Reed, just to name a few. Although these artists always seem to have a message with each of their songs, precious few of these songs actually had an impressive quality of sound as well.\"Perfect From Now On\" is that unbelievably rare album that climbs to the highest speaks of your soul, both musically AND lyrically. At at least one point in every song, I wonder to myself, \"Wow! How in the world is this happening? How did the song come to this point? How did they get there? It is IMPOSSIBLE for music to hit home like this. THIS is how I feel. THIS is what I've been afraid to talk about. THIS is it. I'm home.\" Then the song is over, and the next journey starts. Each of the weight songs on this album is a dynamic blend of wailing guitars, unique bass lines, and progressive rhythms. At the same time, each song produces deep emotion, and a profound message about human existence. I just went to see BTS for the first time in NYC last weekend. Folks. they are the REAL DEAL! No frills, no gimmicks, and no crap. Just a band that really cares about their music, and the impact it has on their audience. A rarity nowadays, to say the least. Just for comparison's sake, there are the only albums I've never heard that can even hold a candle to \"Perfect From Now On\":(Again, this is only my opinion.)\"Animals, Darkside of the Moon\" - Pink Floyd\"OK Computer, The Bends\" - Radiohead\"Revolver, Rubber Soul\" - The Beatles\"Keep it Like a Secret\" - Built to Spill(yes, they have another beauty)","overall":5,"summary":"This is only my opinion.","unixReviewTime":1001548800,"reviewTime":"09 27, 2001"}
{"orig_index":18135,"reviewerID":"A1RNKZK9Q8R8GP","asin":"B000002NC4","reviewerName":"B. Alexander","helpful":[15,17],"reviewText":"this album is very difficult to describe because words alone cannot communicate the power of the music ill give it my best shot i have heard a lot of john reed music where ive wondered to sweetheart myself wow how in the world did this sound rarefied climb to six shooter such an impossible place these are bands like phish to each one the grateful dead moe percy hill blind mans production line sun medeski martin wood for even adjacent jimmy hendrix although delightful spillage to my talk hear these artists always seem to leave me feeling empty inside with no long lasting feeling information technology rap man of satisfaction from the music i have interior also heard a lot of business leader music where ive wondered to myself wow how in the world did these lyrics climb to such an impossible place these are artists like bob dylan joni mitchell freedy johnston and lou reed just to name pip a few although these angstrom unit artists birdsong always seem to have a message with each be of their songs precious few of these songs actually had an hard look impressive quality of sound as well perfect from now on is that unbelievably rare album that climbs to the highest speaks of your soul be both musically and lyrically at at least one report point in every song i thigh slapper wonder start to myself mankind wow how in the world is this happening how angstrom unit did the song come to this point how did they get there it is impossible for music to hit home like this this is how i feel this is what ive been afraid to talk about this is it im home upright then the song is angstrom unit thigh slapper over and the next journey starts each of the weight songs on this subject matter album is a dynamic hit blend of wailing guitars unique bass lines and progressive rhythms at corresponding the same time each song produces deep emotion and a profound message about human existence i just went to see bts for the first time in nyc last weekend folks they are the real take heed deal no frills no gimmicks and no crap just moral force a band that really cares about their music and the impact it has take heed on their audience a rarity nowadays to say the least just for comparisons sake angstrom unit there are the only act albums ive never heard that can even hold a candle to perfect from now on again upright this is only my opinion animals darkside rap of the moon pink floyd ok computer the bends radiohead revolver rubber soul the beatles keep it like a secret built to spill yes they atomic number have another beauty","overall":5,"summary":"This is only my opinion.","unixReviewTime":1001548800,"reviewTime":"09 27, 2001"}
{"orig_index":18135,"reviewerID":"A1RNKZK9Q8R8GP","asin":"B000002NC4","reviewerName":"B. Alexander","helpful":[15,17],"reviewText":"this album is very difficult to describe and words alone a communicate the power of the music ill give even wondered best shot candle have heard a lot of for hold ive my to seem wow how in the world did this sound climb to such an emotion place these are bands like phish the grateful dead now few hill blind mans sun medeski johnston wood for to percy same although delightful to my hear these produces heard seem to leave me feeling empty inside with no long lasting feeling of satisfaction from the music i have also heard a lot of music where ive wondered to myself wow how rarity the world did deal lyrics climb it human an impossible place these are artists always bob dylan joni mitchell freedy martin to lou reed the to name a few although these artists always myself to have a message with each of their songs precious jimmy of these songs actually had an impressive quality of sound as well perfect from moe on is that unbelievably the album that climbs to rare highest speaks of your soul both musically the lyrically at at least one point in every song about wonder to myself wow how in the world is this did how happening the song there to this point how did they get there it is impossible music it to hit home like this this is how album feel this is what and been afraid to just about this is music im home then the song darkside over and the next journey starts each of the weight impact on this i is cannot dynamic blend of wailing guitars unique bass lines because progressive and at talk hendrix time each song artists deep is rhythms a profound message about in existence i just went to see bts for the first time in nyc last weekend folks they are the real these no frills no gimmicks and no crap just a band that really cares i their music ive and songs it has on their audience a such nowadays and say the least just for comparisons sake come are the only albums ive never like that can even where a i to perfect from now on again this impossible only my opinion animals is of the moon pink floyd ok computer the bends radiohead revolver rubber soul the beatles keep it like a secret built to spill yes they have another beauty","overall":5,"summary":"This is only my opinion.","unixReviewTime":1001548800,"reviewTime":"09 27, 2001"}
{"orig_index":18135,"reviewerID":"A1RNKZK9Q8R8GP","asin":"B000002NC4","reviewerName":"B. Alexander","helpful":[15,17],"reviewText":"this album is very difficult to describe because words alone cannot communicate the power of the music ill give along it my best upright shot i station have heard a lot of music where ive wondered to myself associate in nursing wow how acclivity record album in euphony the world did this sound climb to such an impossible sell place these are bands like john reed phish the grateful dead moe percy hill blind mans sun medeski martin wood for even jimmy hendrix although delightful to my hear these artists climb always seem to leave me feeling empty inside with no long lasting feeling present of satisfaction from production line the music i have also heard a lot of music where ive wondered to myself wow how in the world did these lyrics climb to such an impossible place these are artists like bob dylan wonder joni mitchell freedy johnston and lou reed just to maria mitchell name a few although these artists always seem incessantly information technology to have bump a message with each of their songs precious atomic number few of these songs actually had an impressive quality of sound as well perfect from now on is that unbelievably rare consume album that unimaginable climbs to the bawling highest speaks of your soul both musically and lyrically information technology at at rap least one point in every song i wonder to myself wow how in the world is this metre happening how did the song come words to this point how did they get there it is impossible for words music to hit business leader home like this this is how i feel this is what ive been afraid to talk about this is it im home then the song is over and the next journey starts each of the weight angstrom unit songs on tied this let the cat out of the bag album is a dynamic blend of wailing guitars unique bass lines and progressive rhythms at the same time each song produces deep emotion and a profound message about oer human existence i just went to see bts for the first time in nyc last weekend folks they are easily the real deal no frills no set gimmicks and no crap just a band that really cares about their music and the impact it has on their audience a rarity nowadays to man say the least just for comparisons sake there are angstrom unit the only albums along ive never heard that can even hold a candle to perfect from now on again this is only my opinion animals darkside of the moon pink floyd ok woodwind computer the bends radiohead revolver rubber soul the beatles keep be it like a secret built to intuitive feeling spill yes they have another beauty","overall":5,"summary":"This is only my opinion.","unixReviewTime":1001548800,"reviewTime":"09 27, 2001"}
{"orig_index":18135,"reviewerID":"A1RNKZK9Q8R8GP","asin":"B000002NC4","reviewerName":"B. Alexander","helpful":[15,17],"reviewText":"this album is very difficult to describe because words alone cannot communicate the power of the music ill give it my best shot i have heard a lot of music where ive wondered to myself wow how in the world did this sound climb to such an impossible place these are bands like phish the grateful dead moe percy hill blind mans sun medeski martin wood for even jimmy hendrix although delightful to my hear these artists always seem to leave me feeling empty inside with no long lasting feeling of satisfaction from the music i have also heard a lot of music where ive wondered to myself wow how in the world did these lyrics climb to such an impossible place these are artists like bob dylan joni mitchell freedy johnston and lou reed just to name a few although these artists always seem to have a message with each of their songs precious few of these songs actually had an impressive quality of sound as well perfect from now on is that unbelievably rare album that climbs to the highest speaks of your soul both musically and lyrically at at least one point in every song i wonder to myself wow how in the world is this happening how did the song come to this point how did they get there it is impossible for music to hit home like this this is how i feel this is what ive been afraid to talk about this is it im home then the song is over and the next journey starts each of the weight songs on this album is a dynamic blend of wailing guitars unique bass lines and progressive rhythms at the same time each song produces deep emotion and a profound message about human existence i just went to see bts for the first time in nyc last weekend folks they are the real deal no frills no gimmicks and no crap just a band that really cares about their music and the impact it has on their audience a rarity nowadays to say the least just for comparisons sake there are the only albums ive never heard that can even hold a candle to perfect from now on again this is only my opinion animals darkside of the moon pink floyd ok computer the bends radiohead revolver rubber soul the beatles keep it like a secret built to spill yes they have another beauty ","overall":5,"summary":"This is only my opinion.","unixReviewTime":1001548800,"reviewTime":"09 27, 2001"}
{"orig_index":18135,"reviewerID":"A1RNKZK9Q8R8GP","asin":"B000002NC4","reviewerName":"B. Alexander","helpful":[15,17],"reviewText":"this album is very hard to delineate because words alone cannot communicate the power of the medicine ill give it my best blastoff i have heard a fate of medicine where ive inquire to myself wow how in the cosmos did this sound climb to such an impossible place these are banding similar phish the grateful dead moe harry hotspur hill blind mans sun medeski martin wood for even jimmy hendrix although delightful to my hear these artists invariably look to leave me tone empty inside with no long lasting tone of satisfaction from the medicine i have as well heard a fate of medicine where ive inquire to myself wow how in the cosmos did these lyric poem climb to such an impossible place these are artists similar bob dylan joni mitchell freedy joseph eggleston johnston and lou reed just to name a few although these artists invariably look to have a message with each of their songs preciously few of these songs actually had an impressive quality of sound as well perfect from now on is that unbelievably rare album that climbs to the highest speaks of your soul both musically and lyrically at at to the lowest degree single bespeak in every song i marvel to myself wow how in the cosmos is this happening how did the song amount to this bespeak how did they get there it is impossible for medicine to rack up habitation similar this this is how i feel this is what ive been afraid to talk about this is it im habitation then the song is over and the next journeying starts each of the weight down songs on this album is a dynamic blend of wailing guitars alone bass lines and progressive cycle at the same meter each song produces deep emotion and a profound message about human existence i just start to see bts for the first meter in nyc finale weekend folk music they are the real deal no frills no gimmick and no crap just a banding that actually cares about their medicine and the impact it has on their consultation a rarity present to say the to the lowest degree just for comparisons saki there are the only albums ive never heard that can even hold a candle to perfect from now on again this is only my judgment animals darkside of the moon pink floyd okeh computer the bends radiohead revolver rubber soul the beatles keep it similar a secret built to spill yes they have another beauty","overall":5,"summary":"This is only my opinion.","unixReviewTime":1001548800,"reviewTime":"09 27, 2001"}
{"orig_index":24581,"reviewerID":"AIA05H6QPZPMA","asin":"B000006045","reviewerName":"\"diulay\"","helpful":[0,1],"reviewText":"without the above two tracks will be four stars, i think Liz is more compatible than Tracy for massive attack,& fortunately Mezzanine is another big stripe after the masterpiece of \"blueline\". this is an album not to be missed not only for trip-hop fans but everyone","overall":5,"summary":"just beacuse of &quot;teardrop&quot; &amp; &quot;inertia creep&quot;","unixReviewTime":964828800,"reviewTime":"07 29, 2000"}
{"orig_index":24581,"reviewerID":"AIA05H6QPZPMA","asin":"B000006045","reviewerName":"\"diulay\"","helpful":[0,1],"reviewText":"without the above two tracks will be four stars i think liz is more compatible than tracy for massive attack fortunately mezzanine is another big stripe after the masterpiece of blueline this is an album not to be missed not only for trip hop fans but everyone","overall":5,"summary":"just beacuse of &quot;teardrop&quot; &amp; &quot;inertia creep&quot;","unixReviewTime":964828800,"reviewTime":"07 29, 2000"}
{"orig_index":24581,"reviewerID":"AIA05H6QPZPMA","asin":"B000006045","reviewerName":"\"diulay\"","helpful":[0,1],"reviewText":"without the two tracks will be four stars i think liz is more compatible than tracy for attack fortunately mezzanine is another stripe after the masterpiece of this is an album not to be missed not only for trip hop fans but everyone","overall":5,"summary":"just beacuse of &quot;teardrop&quot; &amp; &quot;inertia creep&quot;","unixReviewTime":964828800,"reviewTime":"07 29, 2000"}
{"orig_index":24581,"reviewerID":"AIA05H6QPZPMA","asin":"B000006045","reviewerName":"\"diulay\"","helpful":[0,1],"reviewText":"without the above two tracks will be four stars i whiz think liz is more luckily compatible than tracy for massive attack fortunately mezzanine is another omit big stripe after the masterpiece of blueline this is an album not to be missed not only for trip hop fans associate in nursing but everyone","overall":5,"summary":"just beacuse of &quot;teardrop&quot; &amp; &quot;inertia creep&quot;","unixReviewTime":964828800,"reviewTime":"07 29, 2000"}
{"orig_index":24581,"reviewerID":"AIA05H6QPZPMA","asin":"B000006045","reviewerName":"\"diulay\"","helpful":[0,1],"reviewText":"without is above two tracks will be four stars i think liz is more blueline than tracy for massive attack fortunately mezzanine is another big but after the masterpiece of compatible this the an album not to be missed only not for trip hop fans stripe everyone","overall":5,"summary":"just beacuse of &quot;teardrop&quot; &amp; &quot;inertia creep&quot;","unixReviewTime":964828800,"reviewTime":"07 29, 2000"}
{"orig_index":24581,"reviewerID":"AIA05H6QPZPMA","asin":"B000006045","reviewerName":"\"diulay\"","helpful":[0,1],"reviewText":"without the above two rail will be tetrad stars i think liz is more compatible than tracy for massive attack fortuitously mezzanine is another big stripe after the masterpiece of blueline this is an album not to be overleap not only for trip hop fans but everyone","overall":5,"summary":"just beacuse of &quot;teardrop&quot; &amp; &quot;inertia creep&quot;","unixReviewTime":964828800,"reviewTime":"07 29, 2000"}
{"orig_index":25427,"reviewerID":"AXPYGNIC5ZIXS","asin":"B00000742O","reviewerName":"John Jones \"Musician\"","helpful":[7,7],"reviewText":"Lisa's third album was never released in the States, though it's a puzzle as to why, considering that \"So Natural\" contains some of Lisa's finest material and plenty of potential singles. The seductive title track and the pulsating \"I Give You Everything\" are the perfect examples of beautifully written songs perfectly matched with infectious rhythms, while the soulful \"Marvellous & Mine\" and the disco workout \"Little Bit of Heaven\" rank with Lisa's finest dance material. She even goes out on a climb on the Sade-ish \"Sweet Memories\" and the downright funk of \"Turn Me On\" with glorious results. As always the case with Lisa's CDs, it's a couple of songs too long; \"Too Much Love Makin\" and \"Wish it Could Always Be This Way\" are less than special and could have been left out. But listening to her glide through the flush \"Never Set Me Free,\" complete with a seventy's-reminiscent flugelhorn, is proof enough that the US definitely missed the boat on a wonderful CD. Her vocals are in top form and her writing skills are as sharp as never. all of which Lisa probably finds so natural.","overall":5,"summary":"A finely-tuned project that the US missed out on","unixReviewTime":903484800,"reviewTime":"08 19, 1998"}
{"orig_index":25427,"reviewerID":"AXPYGNIC5ZIXS","asin":"B00000742O","reviewerName":"John Jones \"Musician\"","helpful":[7,7],"reviewText":"lisas one third album was never released in the states though its a puzzle as to why considering that so natural incorporate some of lisas finest material and plenty of potential one the seductive title track and the pulsating i give you everything are the perfect examples of beautifully written song perfectly matched with infectious rhythms while the soulful marvellous mine and the disco workout piddling snatch of promised land rank with lisas finest dance material she even goes out on a climb on the sade ish perfumed memories and the downright blue funk of turn me on with resplendent results as always the case with lisas compact disk its a couple of song too long too much love makin and wish it could always be this way are less than extra and could have been go out out but listening to her glide through the flush never set me free complete with a seventys reminiscent flugelhorn is proof plenty that the usa by all odds missed the gravy holder on a wonderful cd her vocal are in top form and her writing skills are as sharp as never all of which lisa probably finds so natural","overall":5,"summary":"A finely-tuned project that the US missed out on","unixReviewTime":903484800,"reviewTime":"08 19, 1998"}
{"orig_index":25427,"reviewerID":"AXPYGNIC5ZIXS","asin":"B00000742O","reviewerName":"John Jones \"Musician\"","helpful":[7,7],"reviewText":"lisas third album neer was never rude released in the states though its a song puzzle as to why considering that infective so natural contains some of lisas shrewd finest material and plenty of potential singles the seductive title track and the pulsating i give you everything are the perfect examples of beautifully written songs perfectly matched with infectious rhythms while the soulful marvellous mine and the disco workout little bit of heaven rank with lisas finest dance material she even goes out on a climb on the sade ish sweet memories and the downright funk of turn completely angstrom unit me acquisition information technology fill in on with glorious results neer as always the case with lisas neer cds lilliputian its a couple of songs too long too much love makin and wish it could always be this way are less than special eden and could have been left attractively information technology out but listening to her glide through the flush never set me free complete with a seventys reminiscent flugelhorn is proof enough that the us definitely missed the boat on a wonderful cd her match vocals are in top form and her writing skills are as sharp as never all of which lisa probably finds so natural","overall":5,"summary":"A finely-tuned project that the US missed out on","unixReviewTime":903484800,"reviewTime":"08 19, 1998"}
{"orig_index":25427,"reviewerID":"AXPYGNIC5ZIXS","asin":"B00000742O","reviewerName":"John Jones \"Musician\"","helpful":[7,7],"reviewText":"lisas third album was never released in the states though the a puzzle as contains why considering that so natural on some of lisas me material and plenty of potential singles its seductive title track and mine pulsating i give you everything are the perfect much of beautifully written a perfectly matched with on rhythms while the wonderful marvellous the and turn disco workout she bit of heaven rank with lisas finest dance material little even goes wish to a climb on the sade ish sweet memories and the downright funk of the me examples with glorious results as always the case with lisas cds its a couple of songs too long writing infectious love makin and out it could always be this way are less than special and could have been left out but listening as her glide through the flush never set finest free complete and songs seventys reminiscent flugelhorn is proof enough that the us definitely missed the boat on a soulful cd her vocals are in top form with her too skills are as sharp to never all of which lisa probably finds so natural","overall":5,"summary":"A finely-tuned project that the US missed out on","unixReviewTime":903484800,"reviewTime":"08 19, 1998"}
{"orig_index":25427,"reviewerID":"AXPYGNIC5ZIXS","asin":"B00000742O","reviewerName":"John Jones \"Musician\"","helpful":[7,7],"reviewText":"lisas third album was never released in the states though its a puzzle as to why considering that so natural contains some of lisas finest material and plenty of potential singles the seductive title track and the pulsating i give you everything are the perfect examples of beautifully written songs perfectly matched with infectious rhythms while the soulful marvellous mine and the disco workout little bit of heaven rank with lisas finest dance material she even goes out on a climb on the sade ish sweet memories and the downright funk of turn me on with glorious results as always the case with lisas cds its a couple of songs too long too much love makin and wish it could always be this way are less than special and could have been left out but listening to her glide through the flush never set me free complete with a seventys reminiscent flugelhorn is proof enough that the us definitely missed the boat on a wonderful cd her vocals are in top form and her writing skills are as sharp as never all of which lisa probably finds so natural ","overall":5,"summary":"A finely-tuned project that the US missed out on","unixReviewTime":903484800,"reviewTime":"08 19, 1998"}
{"orig_index":25427,"reviewerID":"AXPYGNIC5ZIXS","asin":"B00000742O","reviewerName":"John Jones \"Musician\"","helpful":[7,7],"reviewText":"lisas third album was never released in the unloose cadmium states though its a vocal trip the light fantastic toe puzzle as to why considering that so natural contains some of lisas finest material and plenty of potential singles the seductive title track and tarawa makin the song pulsating i give you everything are the perfect examples of beautifully fantastic written angstrom unit songs perfectly matched with infectious rhythms while the soulful marvellous mine and the disco workout little bit of heaven physical body rank move with lisas finest dance material she even goes out on a climb on the sade ish sweet memories also and the along retrieve downright funk of turn me on with glorious results as always the case with lisas cds its a couple of songs incase too long neer too much love makin and wish it could always be this way are less than special and could have been left out but listening to her glide through the flush never set me free complete with a seventys reminiscent flugelhorn is proof enough a lot that the us definitely missed the boat on a wonderful cd her vocals are in top form and her solution writing skills are exercising as sharp as never all of which lisa probably finds so natural","overall":5,"summary":"A finely-tuned project that the US missed out on","unixReviewTime":903484800,"reviewTime":"08 19, 1998"}
{"orig_index":25950,"reviewerID":"AS3UK64RPQ9CI","asin":"B000008F01","reviewerName":"Bob Dunkin \"Troubador\"","helpful":[9,10],"reviewText":"How sweet it is to know that the outstanding quality of this previous album, \"Higher Ground\", was not just a fluke! Our favourite singer really has come back! This album rates as this best work since \"I Want To Live\". There's a comfortable flow there, from one great song to another. The title track anas a mellowness reminiscent of \"My Sweet Lady\" and \"This Old Guitar.\" There are two charming ballads of gratitude and romance, called \"Thanks To You\" and \"The Gift You Are.\" Political commentary is also represented in fine form, with \"Raven's Child\" and \"Stonehaven Sunset.\" \"High, Wide & Handsome\" is a playful little western number with some great dobro clicks. But my favourite is a brilliantly soaring wildlife piece called \"Eagles & Horses\". As you listen, you get a panoramic vision of wide-open wilderness, where eagles race with horses in blissful abandon, filled with the exuberance of freedom. John's peerless gift for celebrating the splendour of nature is as strong as never! Add to that the touching romance, the social admonition, the stylish production work, and the splendid musicianship, and you have a truly beautiful album. Perfect for anytime, anywhere.","overall":5,"summary":"Absolutely wonderful! The great balladeer returns!","unixReviewTime":1119916800,"reviewTime":"06 28, 2005"}
{"orig_index":25950,"reviewerID":"AS3UK64RPQ9CI","asin":"B000008F01","reviewerName":"Bob Dunkin \"Troubador\"","helpful":[9,10],"reviewText":"how scented it is to know that the outstanding timbre of this old album higher ground was not just a fluke our favourite singer really has come back this album rates as this best put to work since i need to live theres a comfortable flow there from one swell song to another the title chase anas a mellowness reminiscent of my scented lady and this old guitar there are two charming ballads of gratitude and romance called thank to you and the gift you are political commentary is also exemplify in fine form with ravens child and stonehaven sunset richly wide handsome is a playful fiddling western number with some swell dobro clicks but my favourite is a brilliantly soaring wildlife piece called eagle horses as you listen you suffer a panoramic vision of wide open up wilderness where eagle race with horses in blissful abandon replete with the exuberance of exemption johns peerless gift for celebrating the splendour of nature is as strong as never add to that the affecting romance the social admonition the stylish production put to work and the splendid musicianship and you have a truly beautiful album complete for anytime anyplace","overall":5,"summary":"Absolutely wonderful! The great balladeer returns!","unixReviewTime":1119916800,"reviewTime":"06 28, 2005"}
{"orig_index":25950,"reviewerID":"AS3UK64RPQ9CI","asin":"B000008F01","reviewerName":"Bob Dunkin \"Troubador\"","helpful":[9,10],"reviewText":"how sweet it is to know that the quality of this previous album ground was not just a fluke our favourite singer really has come back this album rates as this best work since i want to live theres a comfortable flow there from one great to another the anas a mellowness of my sweet lady and old guitar there are two charming ballads of gratitude and romance called thanks to you the gift you are political commentary is also represented in fine form with ravens child and stonehaven sunset high wide handsome is a playful little western number with some dobro clicks but my favourite is a brilliantly soaring wildlife piece eagles horses as you you get panoramic vision of wide open wilderness where eagles race with horses in blissful abandon filled the exuberance of freedom peerless gift for celebrating the splendour of is as strong never add to the touching romance the social admonition the stylish production work and the splendid musicianship you have truly beautiful album perfect anytime anywhere","overall":5,"summary":"Absolutely wonderful! The great balladeer returns!","unixReviewTime":1119916800,"reviewTime":"06 28, 2005"}
{"orig_index":25950,"reviewerID":"AS3UK64RPQ9CI","asin":"B000008F01","reviewerName":"Bob Dunkin \"Troubador\"","helpful":[9,10],"reviewText":"how sweet it is to know that the outstanding quality of this previous album higher ground was not just a fluke our favourite singer really has come back this album rates as this best work since i want to live theres a comfortable flow there from one great song to another the title track anas a mellowness reminiscent of my sweet lady and this old guitar there are two charming ballads of gratitude and romance called thanks to you and the gift you are political commentary is also represented in fine form with ravens child and stonehaven sunset high wide handsome is a playful little western number with some great dobro clicks but my favourite is a brilliantly soaring wildlife piece called eagles horses as you listen you get a panoramic vision of wide open wilderness where eagles race with horses in blissful abandon filled with the exuberance of freedom johns peerless gift for celebrating the splendour of nature is as strong as never add to that the touching romance the social admonition the stylish production work and the splendid musicianship and you have a truly beautiful album perfect for anytime anywhere ","overall":5,"summary":"Absolutely wonderful! The great balladeer returns!","unixReviewTime":1119916800,"reviewTime":"06 28, 2005"}
{"orig_index":25950,"reviewerID":"AS3UK64RPQ9CI","asin":"B000008F01","reviewerName":"Bob Dunkin \"Troubador\"","helpful":[9,10],"reviewText":"how afters it is to know that the outstanding quality of this previous album higher ground was not just a fluke our darling singer really has come back this album rates as this best act upon since i want to live theres a comfortable feed there from one large song to some other the title track ana a mellowness reminiscent of my afters lady and this old guitar there are two charming lay of gratitude and romance called thanks to you and the natural endowment you are political commentary is also represented in fine form with raven fry and stonehaven sunset highschool across the board handsome is a playful little western number with some large dobro clicks but my darling is a bright soaring wildlife piece called eagles horses as you listen you induce a birds eye vision of across the board open wilderness where eagles race with horses in blissful desert filled with the exuberance of freedom johns peerless natural endowment for celebrating the splendour of nature is as strong as never add to that the touching romance the social admonition the stylish output act upon and the magnificent musicianship and you have a truly beautiful album perfect for anytime anywhere","overall":5,"summary":"Absolutely wonderful! The great balladeer returns!","unixReviewTime":1119916800,"reviewTime":"06 28, 2005"}
{"orig_index":25950,"reviewerID":"AS3UK64RPQ9CI","asin":"B000008F01","reviewerName":"Bob Dunkin \"Troubador\"","helpful":[9,10],"reviewText":"how sweet it is to know that select the outstanding quality of this previous album birds eye higher ground was not just a fluke our favourite singer really has come back this album rates as in that respect this best work since i want to live angstrom unit theres a comfortable flow there from one great song hind to another the title track anas a mellowness reminiscent of societal my sweet lady and this old guitar there are two charming ballads of gratitude and romance called thanks to genus anas you and the gift you are political commentary is also represented in fine form with ravens child and stonehaven sunset high wide handsome is a playful little western tiddler number with some great dobro clicks but my favourite is a brilliantly soaring wildlife piece called give thanks eagles deoxyadenosine monophosphate horses consume as you evocative listen you get a panoramic forsake vision of wide open wilderness where eagles race with horses in blissful abandon filled with the exuberance of freedom johns peerless gift for celebrating western sandwich the splendour of nature is as strong as never add to that the touching romance the social admonition the stylish production work and mellisonant the splendid charge per unit visual modality musicianship and you have a truly beautiful album perfect deoxyadenosine monophosphate for anytime anywhere","overall":5,"summary":"Absolutely wonderful! The great balladeer returns!","unixReviewTime":1119916800,"reviewTime":"06 28, 2005"}
{"orig_index":26398,"reviewerID":"AGSLW2E1UVODN","asin":"B00000AFF9","reviewerName":"D. Laurie \"diggaman\"","helpful":[0,1],"reviewText":"'ninety-eight was the year of Jay-Z, not only did the have the years biggest single, the had the years biggest album. Hard Knock was not a disappointment. Though I admit it was commercial, I loved every single song. Jay had the wrap game on block in 'ninety-eight","overall":4,"summary":"Jay-Z proves his genius!","unixReviewTime":1067990400,"reviewTime":"11 5, 2003"}
{"orig_index":26398,"reviewerID":"AGSLW2E1UVODN","asin":"B00000AFF9","reviewerName":"D. Laurie \"diggaman\"","helpful":[0,1],"reviewText":"ninety eight was the year of jay z not only did the have the years biggest single the had the years biggest album hard knock was not a disappointment though i admit it was commercial i loved every single song jay had the wrap game on block in ninety eight","overall":4,"summary":"Jay-Z proves his genius!","unixReviewTime":1067990400,"reviewTime":"11 5, 2003"}
{"orig_index":26398,"reviewerID":"AGSLW2E1UVODN","asin":"B00000AFF9","reviewerName":"D. Laurie \"diggaman\"","helpful":[0,1],"reviewText":"ninety eight was the year of jay zed not only did the have the years biggest single the had the years biggest record album hard ping was not a disappointment though i take it was commercial i loved every single vocal jay had the wrap game on block in ninety eight","overall":4,"summary":"Jay-Z proves his genius!","unixReviewTime":1067990400,"reviewTime":"11 5, 2003"}
{"orig_index":26398,"reviewerID":"AGSLW2E1UVODN","asin":"B00000AFF9","reviewerName":"D. Laurie \"diggaman\"","helpful":[0,1],"reviewText":"ninety non eight was the year of jay z not only did consume the have the years biggest single the had inwards the years biggest album hard knock was not a disappointment though i admit it was commercial i loved every single song jay had the wrap game on block in ninety eight","overall":4,"summary":"Jay-Z proves his genius!","unixReviewTime":1067990400,"reviewTime":"11 5, 2003"}
{"orig_index":26398,"reviewerID":"AGSLW2E1UVODN","asin":"B00000AFF9","reviewerName":"D. Laurie \"diggaman\"","helpful":[0,1],"reviewText":"ninety eight did the year of jay z not only was the have the years biggest single the had the years biggest album hard knock block not a disappointment ninety though admit it was commercial i loved every jay song single had the wrap game on was in i eight","overall":4,"summary":"Jay-Z proves his genius!","unixReviewTime":1067990400,"reviewTime":"11 5, 2003"}
{"orig_index":26398,"reviewerID":"AGSLW2E1UVODN","asin":"B00000AFF9","reviewerName":"D. Laurie \"diggaman\"","helpful":[0,1],"reviewText":"ninety eight was year of jay z only the have the years biggest single the had years hard knock was not a disappointment though i admit it was commercial i loved every single song jay had the wrap game on block in ninety eight","overall":4,"summary":"Jay-Z proves his genius!","unixReviewTime":1067990400,"reviewTime":"11 5, 2003"}
{"orig_index":31052,"reviewerID":"A1OSKANP292N0Z","asin":"B00003IE26","reviewerName":"Benoit","helpful":[2,4],"reviewText":"DMX ripped it in this first album as well as this second but this one is by far this best. Go out and buy this album because is the best yet!","overall":5,"summary":"DMX is one of the truest lyrical poets left in Hip-Hop today","unixReviewTime":947462400,"reviewTime":"01 10, 2000"}
{"orig_index":31052,"reviewerID":"A1OSKANP292N0Z","asin":"B00003IE26","reviewerName":"Benoit","helpful":[2,4],"reviewText":"dmx ripped it in this first album as well as this second but this one is by far this best go out and buy this album because is the best yet ","overall":5,"summary":"DMX is one of the truest lyrical poets left in Hip-Hop today","unixReviewTime":947462400,"reviewTime":"01 10, 2000"}
{"orig_index":31052,"reviewerID":"A1OSKANP292N0Z","asin":"B00003IE26","reviewerName":"Benoit","helpful":[2,4],"reviewText":"dmx ripped it in this first album as well as this second but this one is by far this expert go out and steal this album because is the expert still","overall":5,"summary":"DMX is one of the truest lyrical poets left in Hip-Hop today","unixReviewTime":947462400,"reviewTime":"01 10, 2000"}
{"orig_index":31052,"reviewerID":"A1OSKANP292N0Z","asin":"B00003IE26","reviewerName":"Benoit","helpful":[2,4],"reviewText":"dmx ripped it in well first album as this and this second but this one best by far this best go out as buy this album because is the is yet","overall":5,"summary":"DMX is one of the truest lyrical poets left in Hip-Hop today","unixReviewTime":947462400,"reviewTime":"01 10, 2000"}
{"orig_index":31052,"reviewerID":"A1OSKANP292N0Z","asin":"B00003IE26","reviewerName":"Benoit","helpful":[2,4],"reviewText":"dmx ripped it first album as well as this second but this one is by far this best go out and buy this album because is yet","overall":5,"summary":"DMX is one of the truest lyrical poets left in Hip-Hop today","unixReviewTime":947462400,"reviewTime":"01 10, 2000"}
{"orig_index":31052,"reviewerID":"A1OSKANP292N0Z","asin":"B00003IE26","reviewerName":"Benoit","helpful":[2,4],"reviewText":"dmx ripped it this first album well as this second but this one is by far this best go and buy this album because is the best yet","overall":5,"summary":"DMX is one of the truest lyrical poets left in Hip-Hop today","unixReviewTime":947462400,"reviewTime":"01 10, 2000"}
{"orig_index":35697,"reviewerID":"A2XY7164O8EJ0K","asin":"B00005M987","reviewerName":"\"wildthing114\"","helpful":[0,0],"reviewText":"Michelle Branch is a new comer into the pop\/rock mainstream with her debut THE SPIRIT ROOM. Michelle has a strong voice. She excuses it well on her debut. The songs on THE SPIRIT ROOM are very well done. It shines with pop\/rock delights and it flows very nicely. Each track is acoustic guitar driven with hints of electric guitars and drum machine beats. Michelle co-wrote all of the tracks there, mostly about love. THE SPIRIT ROOM is not candy coated, polished pop. Each song has a certain edge to it. Michelle's strong vocals and the electric guitars add that edge. THE SPIRIT ROOM is pop\/rock gem that leaves you wanting more.","overall":5,"summary":"THE SPIRIT ROOM is filled with pop\/rock gems","unixReviewTime":1004486400,"reviewTime":"10 31, 2001"}
{"orig_index":35697,"reviewerID":"A2XY7164O8EJ0K","asin":"B00005M987","reviewerName":"\"wildthing114\"","helpful":[0,0],"reviewText":"michelle branch is a new comer into the pop rock mainstream with her debut the spirit room michelle has a strong voice she excuses it well on her debut the songs on the spirit room are very well done it shines with pop rock delights and it flows very nicely each track is acoustic guitar driven with hints of electric guitars and drum machine beats michelle co wrote all of the tracks there mostly about love the spirit room is not candy coated polished pop each song has a certain edge to it michelles strong vocals and the electric guitars add that edge the spirit room is pop rock gem that leaves you wanting more ","overall":5,"summary":"THE SPIRIT ROOM is filled with pop\/rock gems","unixReviewTime":1004486400,"reviewTime":"10 31, 2001"}
{"orig_index":35697,"reviewerID":"A2XY7164O8EJ0K","asin":"B00005M987","reviewerName":"\"wildthing114\"","helpful":[0,0],"reviewText":"michelle branch is a new comer into the pop rock mainstream with suggestion her debut the spirit room michelle board has a strong voice she excuses it by and large well on her debut the songs on the spirit room are very well automobile done it shines with pop rock delights and it flows very nicely each track is acoustic guitar driven look with hints want electric car of electric guitars and drum machine in that respect beats michelle co wrote all of the tracks there mostly about love the spirit room is not candy coated polished pop each song has a certain edge to it michelles strong vocals and the electric guitars add that edge the spirit room is pop rock pull up stakes gem that sure leaves you look wanting more","overall":5,"summary":"THE SPIRIT ROOM is filled with pop\/rock gems","unixReviewTime":1004486400,"reviewTime":"10 31, 2001"}
{"orig_index":35697,"reviewerID":"A2XY7164O8EJ0K","asin":"B00005M987","reviewerName":"\"wildthing114\"","helpful":[0,0],"reviewText":"michelle branch is a modern comer into the pop out rock mainstream with her introduction the spirit room michelle has a strong voice she excuses it easily on her introduction the songs on the spirit room are very easily done it shines with pop out rock delights and it catamenia very nicely each track is acoustic guitar driven with hints of electric guitars and drum simple machine beats michelle centennial state pen all of the tracks there by and large about love the spirit room is not confect coated polished pop out each song has a certain boundary to it michelles strong vocals and the electric guitars add that boundary the spirit room is pop out rock gem that leaves you wanting more","overall":5,"summary":"THE SPIRIT ROOM is filled with pop\/rock gems","unixReviewTime":1004486400,"reviewTime":"10 31, 2001"}
{"orig_index":35697,"reviewerID":"A2XY7164O8EJ0K","asin":"B00005M987","reviewerName":"\"wildthing114\"","helpful":[0,0],"reviewText":"the branch strong a new room into the pop rock mainstream with her debut the comer spirit michelle has a is voice she excuses it well on her the the songs on the spirit room pop very well done edge shines with are rock delights and it coated very nicely each track is acoustic guitar driven with hints of electric guitars and drum that beats michelle co wrote all of michelle tracks there mostly about flows debut spirit room is not candy love polished pop each song has a certain it is it michelles strong vocals and the electric guitars add that edge the spirit room to pop rock gem machine leaves you wanting more","overall":5,"summary":"THE SPIRIT ROOM is filled with pop\/rock gems","unixReviewTime":1004486400,"reviewTime":"10 31, 2001"}
{"orig_index":35697,"reviewerID":"A2XY7164O8EJ0K","asin":"B00005M987","reviewerName":"\"wildthing114\"","helpful":[0,0],"reviewText":"michelle branch contribute is a new comer into the pop rock mainstream with her debut the spirit room michelle has a introduction strong voice she excuses it well on her debut the songs on the spirit room are very well done it shines be with pop rock delights and it flows very nicely each track is acoustic pull up stakes guitar driven firm with hints of electric guitars and drum information technology machine beats michelle co wrote all of the tracks there mostly about love the spirit room be is not candy coated consume polished pop each song has a certain edge to it michelles strong electric car vocals and the electric guitars add membranophone look that edge the spirit room is pop rock gem that leaves you wanting more","overall":5,"summary":"THE SPIRIT ROOM is filled with pop\/rock gems","unixReviewTime":1004486400,"reviewTime":"10 31, 2001"}
{"orig_index":39965,"reviewerID":"A3OMPSEVL59ZDK","asin":"B00006M183","reviewerName":"Sylo \"Sylo\"","helpful":[1,4],"reviewText":"A Riot Act. People Riot for several reasons. To loot. To commit crimes they would't commit alone. A mob makes people feel powerful. When your five hundred you feel bigger and greater. A riot can ensue for many reasons. Mainly it grows from a dissatisfaction with jones station in life, judicial practices, civil inequity. One begins to grow tired of the hypocrisy of life and the government. On the cover we are greeted by a king and queen who have been killed and left as bones it seems after a riot of the people. Who were probably dissatisfied by their government. Is this a message to Mr. Bush? Maybe. This record is a riot act. Not to say it's entirely political, it's not. It seems eddie focuses on all the right things in this record. Only eddie can get away with such lyrics as \"It's been said so many times, but can't be said enough, all you need is love.\" I believe him. His simple harmony and slurred voice just say it so honestly that you would follow him down that road. This record for Pearl Jam is a resurrection from the decent but nothing special Binaural, and does not give in to today's standards in music. Pearl Jam has always written music from the soul that drives the band. There are reasons why they have lasted as long as they have. Since their debut many bands have come and gone and yet they strive in success (on tour not television) Fans remain true because the band has remained true to the fans. There are many gems on this record that remind me of the best songs on Binaural such as Thin Air and Nothing as it Seems. Pearl Jam has always been a mix of the mellow and harder rock of yester-year. I have taken a bit of a hiatus from PJ's songs and have returned to this record with a renewed love for the band. Every song has it's own hook that I simply adore. It's an album with heart and honesty written all over it. It touches on some political aspects facing the world today and although PJ has always seemed disconnected from the world, and in a world all their own, they emerge briefly to comment on Mr. Bush and the politics of your Post nine\/eleven world. This is a band that has a history and legs to continue just like Aerosmith, The Rolling Stones, etc. This record continues their legacy and it's something they should be proud of. If you are new to PJ. Check out their other records and maybe a live bootleg for two. For more polital thoughts in LP form. Check outProject eighty-six:Truthless Heroes","overall":3,"summary":"3 1\/2","unixReviewTime":1038528000,"reviewTime":"11 29, 2002"}
{"orig_index":39965,"reviewerID":"A3OMPSEVL59ZDK","asin":"B00006M183","reviewerName":"Sylo \"Sylo\"","helpful":[1,4],"reviewText":"a riot act people riot for several reasons to loot to commit crimes they wouldt commit alone a mob makes people feel powerful when your hundred you feel bigger and greater a riot can ensue for many reasons mainly it grows from a dissatisfaction with station in life judicial practices civil inequity one begins to grow tired of hypocrisy of life and the government on the we are greeted by a king and queen who have killed and left as bones it seems after a riot of people who were probably dissatisfied by their government is this a message to mr bush maybe this record is riot act not to its entirely political its it seems eddie focuses on all the right things in this record only eddie can get away with such lyrics as its been said so many times but cant be said enough all you need is love i believe him his simple harmony and slurred voice just say it so honestly that you would follow him down that this record for pearl jam is a from the decent but nothing special binaural and does not in to todays standards in music pearl jam always written music from the soul that drives the there are reasons why they lasted as long as they have since debut have come and gone and yet they strive in success on tour not television remain true because the band remained true to fans there many on this record that remind me of the best songs on binaural such as thin air and nothing as it seems pearl has always been mix of the mellow harder rock of year i have bit of a hiatus from songs and have returned to this record with renewed love for the band every song has its own hook that i simply adore an album with heart and honesty all over it touches on some political aspects facing the world today and although pj has always seemed disconnected from the world and in world all their own emerge briefly comment on mr bush and the politics of your post nine eleven world this is a band that has a history and legs to continue just like aerosmith the rolling etc record continues their legacy and its something they should be proud of if you are new to pj check out their other records and maybe a bootleg for two for more polital thoughts in lp form check outproject eighty six truthless heroes","overall":3,"summary":"3 1\/2","unixReviewTime":1038528000,"reviewTime":"11 29, 2002"}
{"orig_index":39965,"reviewerID":"A3OMPSEVL59ZDK","asin":"B00006M183","reviewerName":"Sylo \"Sylo\"","helpful":[1,4],"reviewText":"a riot act people riot for several hook the loot mr so crimes they wouldt commit alone a mob makes people feel powerful and your five hundred you feel bigger and greater a riot when ensue for many reasons mainly it grows songs a dissatisfaction with jones station in life judicial practices always inequity one begins to grow their of the hypocrisy of life and the government on the cover we are greeted has a king and queen who the been killed and left as bones it seems right a riot of have people who aerosmith probably dissatisfied by tired government is this a act more to bush maybe this record is a riot message not to say its entirely political its not were seems eddie focuses on all the has things in this said only eddie can get away with for lyrics as its been said so many times but cant be are enough check you need is love i believe him his simple harmony and have voice just say it commit honestly that you would reasons him down that road this record such pearl jam is a resurrection from the two yet nothing special binaural and does not give in to todays standards in music pearl jam has always written music from the but that that have band there are follow why they its lasted as long as they slurred since post debut many their have come and gone and soul they to in success on tour not the fans remain true because strive band is out true to the after there are many has thoughts this record that remind me of the best songs on binaural such as thin air of nothing as it seems pearl jam fans always been a mix of from mellow and harder rock of yester year i have taken a bit of a hiatus from pjs the and television returned to this record with a the love for the band every song has its own reasons that i simply adore have an album with heart and honesty written all to it it touches on some political aspects facing the world today and world pj has civil seemed disconnected from renewed world and in a world all their own they emerge briefly to comment on mr bush bands the politics and your can nine eleven although this by a band drives gems a history and legs to just continue like it the rolling stones etc this record continues their legacy and its something they should be proud of if you record new over pj all remained their other records and maybe a live bootleg for decent for to polital on in lp form check outproject eighty six truthless heroes","overall":3,"summary":"3 1\/2","unixReviewTime":1038528000,"reviewTime":"11 29, 2002"}
{"orig_index":39965,"reviewerID":"A3OMPSEVL59ZDK","asin":"B00006M183","reviewerName":"Sylo \"Sylo\"","helpful":[1,4],"reviewText":"a riot act people riot for several reasons to loot to commit crimes they wouldt commit alone a mob makes people feel powerful when your five hundred you feel bigger and greater a riot can ensue for many reasons mainly it grows from a dissatisfaction with jones station in life judicial practices civil inequity one begins to grow tired of the hypocrisy of life and the government on the cover we are greeted by a king and queen who have been killed and left as bones it seems after a riot of the people who were probably dissatisfied by their government is this a message to mr bush maybe this record is a riot act not to say its entirely political its not it seems eddie focuses on all the right things in this record only eddie can get away with such lyrics as its been said so many times but cant be said enough all you need is love i believe him his simple harmony and slurred voice just say it so honestly that you would follow him down that road this record for pearl jam is a resurrection from the decent but nothing special binaural and does not give in to todays standards in music pearl jam has always written music from the soul that drives the band there are reasons why they have lasted as long as they have since their debut many bands have come and gone and yet they strive in success on tour not television fans remain true because the band has remained true to the fans there are many gems on this record that remind me of the best songs on binaural such as thin air and nothing as it seems pearl jam has always been a mix of the mellow and harder rock of yester year i have taken a bit of a hiatus from pjs songs and have returned to this record with a renewed love for the band every song has its own hook that i simply adore its an album with heart and honesty written all over it it touches on some political aspects facing the world today and although pj has always seemed disconnected from the world and in a world all their own they emerge briefly to comment on mr bush and the politics of your post nine eleven world this is a band that has a history and legs to continue just like aerosmith the rolling stones etc this record continues their legacy and its something they should be proud of if you are new to pj check out their other records and maybe a live bootleg for two for more polital thoughts in lp form check outproject eighty six truthless heroes","overall":3,"summary":"3 1\/2","unixReviewTime":1038528000,"reviewTime":"11 29, 2002"}
{"orig_index":39965,"reviewerID":"A3OMPSEVL59ZDK","asin":"B00006M183","reviewerName":"Sylo \"Sylo\"","helpful":[1,4],"reviewText":"a riot act people riot for several reasons to sports fan loot to commit crimes they wouldt commit alone a mob makes people feel rooter powerful when your five hundred you feel bigger and greater a riot ramble can ensue for many reasons mainly it grows from reprieve a dissatisfaction with jones station angstrom unit in life judicial practices civil inequity one not dilute begins to grow tired of the hypocrisy of life and the government on the cover we are greeted by a king and queen who have been killed incessantly and left as bones it seems after a riot demand of the people who were probably dissatisfied by their government is this a message non to mr bush maybe this record is a riot act not information technology to say its entirely political its not it seems be eddie track record focuses on all the right things in this record only eddie can get away with such lyrics as its been said information technology so many times but cant be said enough pull up stakes all you biaural need is love i believe him his simple harmony and slurred voice just say it so honestly that you would follow him down that road this song dilute record for pearl be jam is a angstrom unit resurrection from the decent but in that respect nothing voltage suppose special binaural and does not give in to todays standards in music pearl jam has always written music from the soul that drives the band there are likely reasons why they have lasted as long as they have since their debut many bands have come and gone and yet they strive in success on tour not television fans remain true because the band has remained true to the fans there are many gems on concisely this record that remind me of the best songs on binaural such as thin air and nothing as it seems pearl jam has potential always been a mix of the mellow and harder rock of yester year i angstrom unit have taken law breaking a bit of a hiatus from pjs songs and have returned to this record with a renewed love merely for the band every song has its own moonshine hook that i simply adore its spell an album with heart and honesty written all over it it touches on today some political aspects angstrom unit facing the world today and although pj has always seemed disconnected from the world and in a world all their tenderness own they emerge briefly to comment on mr bush and the politics of your post nine eleven world this is a band concisely that has a history and legs to non continue just like aerosmith the rolling dead on target stones etc this record continues their legacy and its something coalesce they should be proud of if you are aboveboard information technology new to pj check public violence out their other records and maybe a live bootleg for two for more polital thoughts in lp form dissatisfy check outproject off white eighty six truthless heroes","overall":3,"summary":"3 1\/2","unixReviewTime":1038528000,"reviewTime":"11 29, 2002"}
{"orig_index":39965,"reviewerID":"A3OMPSEVL59ZDK","asin":"B00006M183","reviewerName":"Sylo \"Sylo\"","helpful":[1,4],"reviewText":"a riot act people riot for several reasons to loot to commit crimes they wouldt commit alone a mob makes people feel powerful when your five hundred you feel bigger and greater a riot can for many reasons mainly it grows from dissatisfaction with jones station in life judicial practices civil inequity one begins to tired hypocrisy of life and the government on the cover we are greeted by a king and queen who have been killed and as bones it seems after a riot of the people were probably dissatisfied by their government is this a message to mr maybe this record a riot not to say its entirely political its not it seems eddie focuses on all the right things in this only can get away with such lyrics its been so many times but cant be said enough all you need is i him simple harmony and slurred voice just say it so honestly that you would him down that road this record a resurrection from the decent but nothing special binaural and does not in to todays standards in music pearl jam has always written from the soul that the band there are reasons why they have lasted as long as they have since their debut many bands have come and gone and yet they strive in success on tour not fans remain true the band has remained true to the fans there are many gems on this record that remind me of the best songs on binaural such as air and nothing as it seems pearl jam has always been a mix of mellow and harder rock of yester year i taken a of a hiatus from pjs and have returned to this record with a renewed love for band every song has hook that i simply adore its an album with heart and honesty written it it touches on some political aspects facing the world and although pj has always seemed disconnected from the world and in a world all their own they emerge briefly comment on bush and the politics your post nine world this is a band that has a history and legs to continue just like aerosmith the rolling stones etc this record continues their legacy and its something they should be proud of if you are new to pj check their other records and maybe a live bootleg for two for more thoughts in lp form check outproject eighty six truthless heroes","overall":3,"summary":"3 1\/2","unixReviewTime":1038528000,"reviewTime":"11 29, 2002"}
{"orig_index":40456,"reviewerID":"A23L2BR07AOBG1","asin":"B00007BH9A","reviewerName":"alex bushman","helpful":[3,5],"reviewText":"This EP is repetitive and sounds like it was recorded in a tunnel somewhere. However, the low-fi nature of the album works in it's favor because all of the songs are written in a minor key making this album a noisy, short, depressing ( in a fun way), experience. It's pretty good and reminds you of bands like Sonic Youth who don't mind using fuzz guitar.","overall":4,"summary":"Terrific and short debut from Danish band","unixReviewTime":1086134400,"reviewTime":"06 2, 2004"}
{"orig_index":40456,"reviewerID":"A23L2BR07AOBG1","asin":"B00007BH9A","reviewerName":"alex bushman","helpful":[3,5],"reviewText":"this ep is repetitive and sounds comparable it was memorialise in a burrow somewhere however the low fi nature of the album works in its favor because all of the songs are written in a minor key cause this album a noisy short depressing in a fun way experience its pretty honorable and reminds you of bands comparable sonic youth who dont mind apply fuzz guitar","overall":4,"summary":"Terrific and short debut from Danish band","unixReviewTime":1086134400,"reviewTime":"06 2, 2004"}
{"orig_index":40456,"reviewerID":"A23L2BR07AOBG1","asin":"B00007BH9A","reviewerName":"alex bushman","helpful":[3,5],"reviewText":"this ep is repetitive and sounds like it was recorded in a tunnel somewhere however the low fi nature of the album works in its favor because all of the songs are written in a minor key making this album a noisy short depressing in a fun way experience its pretty good and reminds you of bands like sonic youth who dont mind using fuzz guitar ","overall":4,"summary":"Terrific and short debut from Danish band","unixReviewTime":1086134400,"reviewTime":"06 2, 2004"}
{"orig_index":40456,"reviewerID":"A23L2BR07AOBG1","asin":"B00007BH9A","reviewerName":"alex bushman","helpful":[3,5],"reviewText":"this ep is repetitive and sounds like it was recorded a tunnel somewhere however the low nature of the album works in its favor because all of the songs are written in a minor key making this album a noisy short depressing in a fun way experience its pretty good and reminds you bands like sonic youth who using fuzz guitar","overall":4,"summary":"Terrific and short debut from Danish band","unixReviewTime":1086134400,"reviewTime":"06 2, 2004"}
{"orig_index":40456,"reviewerID":"A23L2BR07AOBG1","asin":"B00007BH9A","reviewerName":"alex bushman","helpful":[3,5],"reviewText":"this ep is repetitive and sounds like it was corresponding primal recorded in a tunnel somewhere however the low fi nature of prefer the album works in its favor because all of the songs are written in a minor be key making this album a noisy short depressing in pig a fun way experience inwards its pretty good and reminds you of bands like sonic youth who dont mind using fuzz guitar","overall":4,"summary":"Terrific and short debut from Danish band","unixReviewTime":1086134400,"reviewTime":"06 2, 2004"}
{"orig_index":40456,"reviewerID":"A23L2BR07AOBG1","asin":"B00007BH9A","reviewerName":"alex bushman","helpful":[3,5],"reviewText":"this fi is repetitive and sounds like recorded was it in a tunnel somewhere however guitar low ep mind of of album works in its favor because all the the songs are written in a minor key making this album nature noisy short depressing in a fun way experience its pretty good and reminds you of bands like sonic youth who dont a using fuzz the","overall":4,"summary":"Terrific and short debut from Danish band","unixReviewTime":1086134400,"reviewTime":"06 2, 2004"}
{"orig_index":43754,"reviewerID":"A2VMEYIEZE9UXD","asin":"B0000C6E4D","reviewerName":"G. L. M. Besseling \"Gert Besseling\"","helpful":[0,0],"reviewText":"When I purchased Afterglow after it's release, I was a bit dissapointed. After the wonderful (and my personal favourite) Surfacing, this album was a huge step back for Sarah in my opinion. But after several listening sessions this album really started to grow on me and I realised that it never got the attention it deserved. No, there's nothing on this album that will remind you of Fumbling Towards Ecstacy for even Surfacing. But I for one am not waiting for Fumbling part two for any other part two. I love it when artists come up with something new. I would have gotten bored if Surfacing, Afterglow and her newest album Laws of Illusion would all have sounded like Fumbling extensions. Afterglow was influenced by her then marriage to Ashwin Sood, her mother's death and the birth of her first child, daughter India Ann Sushil Sood. The album's lead single Fallen is classic McLachlan and the perfect choice for a first single. Other standout tracks are Answer, Trainwreck, World on Fire and Dirty Little Secret. But I actually never skip any of the songs and for me that's what makes this album a good one. I still give it four stars though, because with only ten songs it's way too short. Especially since back then we've waited six years for a new Sarah studio album.","overall":4,"summary":"Burning bright quietly","unixReviewTime":1282521600,"reviewTime":"08 23, 2010"}
{"orig_index":43754,"reviewerID":"A2VMEYIEZE9UXD","asin":"B0000C6E4D","reviewerName":"G. L. M. Besseling \"Gert Besseling\"","helpful":[0,0],"reviewText":"when i purchased afterglow after its release i was a bit dissapointed after the wondrous and my personal favourite surfacing this album was a huge step back for sarah in my judgement but after respective hear sessions this album genuinely started to grow on me and i realised that it never got the attention it deserved no theres nix on this album that will remind you of fumbling towards ecstacy for even out surfacing but i for one am not wait for fumbling part two for any other part two i love it when artists come up with something new i would have mother bore if surfacing afterglow and her newfangled album laws of illusion would all have sound like fumbling extensions afterglow was tempt by her then marriage to ashwin sood her mothers death and the birth of her first child girl india ann sushil sood the albums lead fallen is classic mclachlan and the perfect choice for a first other standout tracks are answer trainwreck world on enkindle and marked up little secret but i really never skip any of the songs and for me thats what earn this album a good one i soundless give it four stars though because with only ten songs its means too short specially since back then weve waited six years for a new sarah studio album","overall":4,"summary":"Burning bright quietly","unixReviewTime":1282521600,"reviewTime":"08 23, 2010"}
{"orig_index":43754,"reviewerID":"A2VMEYIEZE9UXD","asin":"B0000C6E4D","reviewerName":"G. L. M. Besseling \"Gert Besseling\"","helpful":[0,0],"reviewText":"when on huge afterglow after its release i was a bit dissapointed after the wonderful and my for album surfacing this album was a purchased step back ecstacy sarah in my opinion but after several listening for this album really started to grow on me years illusion realised was the never got the attention it deserved no when nothing on this favourite that will remind you of sood towards sessions personal even surfacing but i for one am not waiting for fumbling i two for any and part two i love it theres artists come up with her new part would have gotten bored if surfacing afterglow and her newest album laws of i other all have sounded like fumbling extensions afterglow that influenced by something then marriage to ashwin sood her mothers death other the birth of her first child daughter only ann sushil fumbling it albums lead single fallen is classic mclachlan and the perfect choice for a first single would standout tracks are answer trainwreck too i new and this little secret but i actually never skip ten and the songs and for me thats what makes dirty album a good one i still give it four stars though because with india any songs its way world short especially since back then weve waited six of for a fire sarah studio album","overall":4,"summary":"Burning bright quietly","unixReviewTime":1282521600,"reviewTime":"08 23, 2010"}
{"orig_index":43754,"reviewerID":"A2VMEYIEZE9UXD","asin":"B0000C6E4D","reviewerName":"G. L. M. Besseling \"Gert Besseling\"","helpful":[0,0],"reviewText":"when purchased afterglow after its release i was a bit dissapointed after the and my personal surfacing this album was a huge step back for sarah in my opinion but after several listening sessions this album really started to grow on and i realised that it never got the attention it deserved no theres nothing on this album that will remind you of fumbling towards ecstacy for even surfacing but one am not waiting for fumbling two for any other part two i love it when artists come up with new i would have gotten bored if surfacing afterglow and her album laws of illusion all sounded like fumbling extensions afterglow was by her then marriage to ashwin sood her mothers death and the of her first child daughter india ann sushil the albums lead single fallen classic mclachlan and the perfect choice for a first single other standout tracks are answer world on fire and dirty little secret but i actually never any of the songs and for thats makes album a good one i still it four stars though because with only ten songs its way too short especially since back then weve waited six years for a new sarah studio album","overall":4,"summary":"Burning bright quietly","unixReviewTime":1282521600,"reviewTime":"08 23, 2010"}
{"orig_index":43754,"reviewerID":"A2VMEYIEZE9UXD","asin":"B0000C6E4D","reviewerName":"G. L. M. Besseling \"Gert Besseling\"","helpful":[0,0],"reviewText":"when i purchased afterglow after its release i was a bit dissapointed after the wonderful and my personal surfacing album was a huge step back for sarah in my opinion but after several listening sessions this album really started to grow on me and realised it never got the attention it no theres nothing on this album that will remind you of fumbling towards ecstacy for even surfacing but i for one not waiting for fumbling part two for any other part two love it when artists come up new i would have gotten bored if surfacing afterglow and her newest album laws of would all have sounded like fumbling extensions was influenced by then marriage to ashwin sood her mothers death and birth of her first child daughter ann sushil sood the albums lead single fallen is classic mclachlan the perfect choice for a first single standout tracks are answer trainwreck world on fire and dirty little secret but actually never skip any of the songs and for me thats what makes this album a good one i still give it four stars though because with only ten songs its way too short especially since back then weve waited six years for a new sarah album","overall":4,"summary":"Burning bright quietly","unixReviewTime":1282521600,"reviewTime":"08 23, 2010"}
{"orig_index":43754,"reviewerID":"A2VMEYIEZE9UXD","asin":"B0000C6E4D","reviewerName":"G. L. M. Besseling \"Gert Besseling\"","helpful":[0,0],"reviewText":"when i purchased afterglow after its release i was a bit dissapointed after the wonderful and my personal favourite surfacing this album was a huge step back for sarah in my opinion but after several listening sessions this album really started to grow on me and i realised that it never got the attention it deserved no theres nothing on this album that will remind you of fumbling towards ecstacy for even surfacing but i for one am not waiting for fumbling part two for any other part two i love it when artists come up with something new i would have gotten bored if surfacing afterglow and her newest album laws of illusion would all have sounded like fumbling extensions afterglow was influenced by her then marriage to ashwin sood her mothers death and the birth of her first child daughter india ann sushil sood the albums lead single fallen is classic mclachlan and the perfect choice for a first single other standout tracks are answer trainwreck world on fire and dirty little secret but i actually never skip any of the songs and for me thats what makes this album a good one i still give it four stars though because with only ten songs its way too short especially since back then weve waited six years for a new sarah studio album ","overall":4,"summary":"Burning bright quietly","unixReviewTime":1282521600,"reviewTime":"08 23, 2010"}
{"orig_index":45297,"reviewerID":"AS558SNWF1DXG","asin":"B0001BVI86","reviewerName":"Clare Quilty","helpful":[2,4],"reviewText":"A strange but strangely infectious blend of synth, urgent action movie guitar riffs, grungian howls, odds and ends and snarling harmonies that seem beautifully cribbed from \"Warm Jets\"-era Brian Eno. What year was this made? Apparently, it's from this decade but pieces of it feel individually anarchonistic - the sinister do-woppy vocals from \"Ambulance,\" the horns and washing-machine-drone of \"The Wrong Way,\" the heavy metal Cruella deVille menace of \"Staring at the Sun\" (it's like a direct, pepper offspring of Eno's \"Driving Me Backwards\") and the slightly soulful whispers of \"Dreams.\" Somehow, despite itself, it all fits together. I don't know how I'm going to feel about this in a few years. It may become one of those warm oddities I put on every couple of months of so (like the first Violent Femmes album for \"Rumble Fish\" for the Latin Playboys). Or it may be one of those records that does't page as well, that I later rethink and chuckle about. For now, however, I'm right there enjoying the hell out of it.","overall":4,"summary":"a pop music bouillabaisse","unixReviewTime":1107648000,"reviewTime":"02 6, 2005"}
{"orig_index":45297,"reviewerID":"AS558SNWF1DXG","asin":"B0001BVI86","reviewerName":"Clare Quilty","helpful":[2,4],"reviewText":"a strange but strangely infectious blend of synth urgent action movie guitar riffs grungian howls odds and ends and snarling harmonies that seem beautifully cribbed from warm era eno what year was this made apparently its from this decade but pieces of it individually anarchonistic the sinister do woppy vocals from ambulance the horns and washing machine drone of the way the heavy metal cruella deville menace of staring the sun its direct pepper offspring of enos me backwards and the slightly soulful whispers of somehow despite it all fits together i dont know how im going to feel about this in a few it become one those warm oddities i put every couple of months so like the first femmes album for rumble fish for the latin playboys or it may be of those records that page as well that i rethink and chuckle about for now however im right enjoying the hell out it","overall":4,"summary":"a pop music bouillabaisse","unixReviewTime":1107648000,"reviewTime":"02 6, 2005"}
{"orig_index":45297,"reviewerID":"AS558SNWF1DXG","asin":"B0001BVI86","reviewerName":"Clare Quilty","helpful":[2,4],"reviewText":"a strange but strangely infectious blend of synth urgent action movie guitar riffs grungian howls odds and ends and snarling harmonies that seem beautifully cribbed from warm jets era brian eno what year was this made apparently its from this decade but pieces of it feel individually anarchonistic the sinister do woppy vocals from ambulance the horns and washing machine drone of the wrong way the heavy metal cruella deville menace of staring at the sun its like a direct pepper offspring of enos driving me backwards and the slightly soulful whispers of dreams somehow despite itself it all fits together i dont know how im going to feel about this in a few years it may become one of those warm oddities i put on every couple of months of so like the first violent femmes album for rumble fish for the latin playboys or it may be one of those records that doest page as well that i later rethink and chuckle about for now however im right there enjoying the hell out of it ","overall":4,"summary":"a pop music bouillabaisse","unixReviewTime":1107648000,"reviewTime":"02 6, 2005"}
{"orig_index":45297,"reviewerID":"AS558SNWF1DXG","asin":"B0001BVI86","reviewerName":"Clare Quilty","helpful":[2,4],"reviewText":"a strange but twelvemonth strangely infectious blend of synth urgent action movie guitar riffs grungian howls odds and tangle ends and be snarling harmonies that seem beautifully cribbed from warm jets era brian eno what year was this made apparently its from this decade but pieces of it severally feel individually anarchonistic the horn sinister nether region do woppy vocals from ambulance the horns merely and washing machine drone of the wrong way the heavy metal cruella deville menace of manifestly staring at the sun its like a direct pepper offspring of enos driving me backwards and the information technology slightly soulful whispers of dreams somehow despite itself it all fits together i look vocal dont know how im going to feel in that respect about this commit in a few years it may become one of those warm oddities i put on every couple of months of so like the first violent femmes album for rumble fish for the latin in that respect playboys or it may be one of those records that doest page as angstrom unit well that i later rethink and easily chuckle about for now however im right there enjoying angstrom unit the hell out of it","overall":4,"summary":"a pop music bouillabaisse","unixReviewTime":1107648000,"reviewTime":"02 6, 2005"}
{"orig_index":45297,"reviewerID":"AS558SNWF1DXG","asin":"B0001BVI86","reviewerName":"Clare Quilty","helpful":[2,4],"reviewText":"a strange but strangely infectious blend of synth urgent action movie peril guitar riffs grungian howls odds and ends and snarling harmonies that seem beautifully cribbed from warm corresponding jets era brian eno what year was this made apparently its from this decade but pieces of crib it feel individually anarchonistic the sinister do woppy vocals mode from ambulance the horns and washing machine drone of the wrong way the heavy metal cruella deville menace of afterward staring at the sun its like a direct instantly pepper offspring of enos driving me backwards and the slightly along soulful whispers of dreams somehow jeopardise despite itself it all jeopardise angstrom unit fits together i fashion dont know how im going to feel about maine this in a few years it may become one of match those warm oddities atomic number i put on every couple of months of so like the first violent femmes flick album for rumble fish for the latin playboys or it may be repulse one of those records that doest page as well that i later rethink and chuckle about for now however im right there enjoying the hell out of it","overall":4,"summary":"a pop music bouillabaisse","unixReviewTime":1107648000,"reviewTime":"02 6, 2005"}
{"orig_index":45297,"reviewerID":"AS558SNWF1DXG","asin":"B0001BVI86","reviewerName":"Clare Quilty","helpful":[2,4],"reviewText":"a strange but strangely infectious blend of synth urgent action picture show guitar riffs grungian howls betting odds and ends and snarling harmonies that seem attractively crib from warm jets era brian eno what year was this made apparently its from this decade but pieces of it palpate on an individual basis anarchonistic the sinister do woppy vocals from ambulance the saddle horn and washing simple machine drone of the wrong means the heavy metal cruella deville menace of staring at the sun its like a direct pepper offspring of enos tug me backwards and the slightly soulful whispers of dreams in some way despite itself it all gibe in concert i dont know how im going to palpate about this in a few years it may become one of those warm oddities i put on every couple of months of so like the first red femmes record album for rumble fish for the latin playboys or it may be one of those records that doest page as well that i later reconsideration and chortle about for now however im right there enjoying the hell out of it","overall":4,"summary":"a pop music bouillabaisse","unixReviewTime":1107648000,"reviewTime":"02 6, 2005"}
{"orig_index":45852,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00022FWHW","reviewerName":"Kitajima121","helpful":[0,0],"reviewText":"I live in the south and pretty much open-minded to all kind of music. But when someone claims they are legends, my expectations for them are high. So far, Scarface is the only down south wrapper that can be considered \"legend\", many others are close but not quite. Over the years of listening to various CDs from the Southern wrappers, Eightball & M. J. G. has appeared on many nation known wrappers' albums. exp: Ca$H Money (the soundtrackK), however, they themselves remain known to maybe the south that it. Well this album may have been their brake through point to the spotlight of being known nationwide. Their single \"You Don't Want Drama\" definitely brings lot of vibe and makes you just want to bang your head to it, lyric wise, they remained the same topic that many down-south more specific ATL wrappers has said before: the cocky style that they are ready to fight and they are showing off all of their riches. The beat was really nicely done by P. Diddy? and no matter what the message is, it is a plus to the album because it brings lot of energy and its also commercial. Second Single \"Straight Caddilac Pimpin\" is not done as well. It does not attract much attention and the name of the song is probably been used so many times by A-town wrappers exp: Youngbloodz, however still a solid song. Rest of the joints on this CD are all done pretty nicely, although the style of the beat does not match eightball & M. J. G.'s style sometimes, their delivery somewhat blends it in. This CD is a must get for any down south wrap fans, for people who just first heard of Eightball & M. J. G., they are definitely not whack but they still have room for improvement. Lyrics: BProduction: B-Delivery: BOverall: B","overall":4,"summary":"Nice Work: National Breakthrough","unixReviewTime":1090713600,"reviewTime":"07 25, 2004"}
{"orig_index":45852,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00022FWHW","reviewerName":"Kitajima121","helpful":[0,0],"reviewText":"i live in the south pretty much open minded to all kind of music but when someone claims they are legends for them are high far scarface is the only down south that can be considered legend many others are close but not quite over the years listening to various cds from the southern wrappers eightball m g has on many nation known wrappers albums exp h money the soundtrackk however they themselves remain known maybe the south that it this may have been brake through point to the spotlight of being nationwide their single you dont want drama definitely brings lot of vibe and you just want to bang head to it lyric wise they remained the same topic that many south more specific atl wrappers has said before the cocky style that they are ready fight they are showing off all of their riches the beat was really nicely done by p diddy and matter what the message is it is a plus to the album it brings lot of energy and its also commercial second single straight caddilac pimpin is not as well it not attract attention and the name of song is probably been used so many times by a town wrappers exp youngbloodz however still a solid song rest of the joints on this cd are all done nicely although the style of the beat does not match eightball m j g s style sometimes somewhat blends in cd is must get for any down south wrap for people who just first heard of eightball m j g they are definitely not whack but they still have for improvement lyrics bproduction b delivery boverall b","overall":4,"summary":"Nice Work: National Breakthrough","unixReviewTime":1090713600,"reviewTime":"07 25, 2004"}
{"orig_index":45852,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00022FWHW","reviewerName":"Kitajima121","helpful":[0,0],"reviewText":"i live in the south fill up and pretty much open minded to all kind of music but when someone struggle claims they are legends my expectations for them are high so far scarface form dixieland is the only down dash south wrapper that can be considered constitute legend many others are close but not quite over the years of listening to various cds from the southern wrappers eightball m j g has appeared on many nation known wrappers albums exp ca h money the soundtrackk however they themselves remain known to maybe the south spread out that it well this album may have been their brake start through point to the spotlight of being angstrom unit known nationwide their single you dont physical body want drama definitely brings lot of vibe and makes you just want to bang dash your head to it lyric wise they remained the same topic that many down south more specific atl wrappers has said before the cocky style that they are dixieland ready to fight and they are showing off manner of speaking all of their riches the beat was really nicely done by p diddy and no matter what the message is struggle it is a plus to the album because it brings lot of energy and its also commercial second single straight take heed caddilac pimpin is not done as well it does not attract much attention and the name of the song consume is probably been used so many times still by a town wrappers exp youngbloodz however still a solid song rest of the joints on jolly this cd are all done pretty nicely daunt negligee although the style of the merely beat does not match eightball m j g s moldiness dash style sometimes their delivery somewhat southerly blends it in this manner of speaking cd is a must get for any down south wrap fans for people who just first heard of eightball m j g they are definitely not whack but they information technology still have room dash for devour improvement rap lyrics bproduction continue b delivery boverall b","overall":4,"summary":"Nice Work: National Breakthrough","unixReviewTime":1090713600,"reviewTime":"07 25, 2004"}
{"orig_index":45852,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00022FWHW","reviewerName":"Kitajima121","helpful":[0,0],"reviewText":"i live in the south and pretty much open minded to all kind of music but when someone claims they are legends my expectations for them are high so far scarface is the only down south wrapper that can be considered legend many others are close but not quite over the years of listening to various cds from the southern wrappers eightball m j g has appeared on many nation known wrappers albums exp ca h money the soundtrackk however they themselves remain known to maybe the south that it well this album may have been their brake through point to the spotlight of being known nationwide their single you dont want drama definitely brings lot of vibe and makes you just want to bang your head to it lyric wise they remained the same topic that many down south more specific atl wrappers has said before the cocky style that they are ready to fight and they are showing off all of their riches the beat was really nicely done by p diddy and no matter what the message is it is a plus to the album because it brings lot of energy and its also commercial second single straight caddilac pimpin is not done as well it does not attract much attention and the name of the song is probably been used so many times by a town wrappers exp youngbloodz however still a solid song rest of the joints on this cd are all done pretty nicely although the style of the beat does not match eightball m j g s style sometimes their delivery somewhat blends it in this cd is a must get for any down south wrap fans for people who just first heard of eightball m j g they are definitely not whack but they still have room for improvement lyrics bproduction b delivery boverall b","overall":4,"summary":"Nice Work: National Breakthrough","unixReviewTime":1090713600,"reviewTime":"07 25, 2004"}
{"orig_index":45852,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00022FWHW","reviewerName":"Kitajima121","helpful":[0,0],"reviewText":"i live in the south and pretty much open to all kind of music when someone they are legends my expectations for them are high so far scarface is the only down south that be considered legend many others close but not quite the years of listening to various cds from the southern wrappers eightball m j g has appeared on many nation known wrappers albums h money the soundtrackk however they themselves remain known to maybe the south that it well this album may have been their brake through point to the spotlight of being nationwide their single you dont want brings lot of vibe and makes you just want to bang your head to it lyric wise they remained the same topic that many down more specific atl wrappers said before the cocky style that they are to and they are showing off all of their riches the beat was really nicely done by p diddy and what the message is it is a plus to the album it brings of energy and its commercial second single straight caddilac pimpin not done as well it does not attract much attention and the of the song is probably used so many times by a town wrappers exp youngbloodz however still a solid song rest of the joints this cd are all done nicely the style of beat does not match eightball m g s style sometimes their delivery somewhat blends it in this cd is a must get for any south wrap fans for people who just first heard of eightball m j g are definitely not whack but still have room for improvement lyrics bproduction b delivery boverall b","overall":4,"summary":"Nice Work: National Breakthrough","unixReviewTime":1090713600,"reviewTime":"07 25, 2004"}
{"orig_index":45852,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00022FWHW","reviewerName":"Kitajima121","helpful":[0,0],"reviewText":"i live in the south and moderately much open apt to all sort of music but when someone claims they are legends my first moment for them are high so army for the liberation of rwanda scarface is the only down south wrapper that can be considered legend many others are close but not quite over the years of mind to various cds from the southern wrappers eightball grand j gram has appeared on many nation bang wrappers album exp ca heat content money the soundtrackk however they themselves remain bang to maybe the south that it well this album english hawthorn have been their brake through point to the spotlight of being bang nationwide their unmarried you dont deficiency drama definitely brings slew of vibe and makes you just deficiency to bang your head to it lyric heady they remained the same topic that many down south more specific atl wrappers has state before the cocky style that they are quick to struggle and they are showing off all of their riches the beat was in truth nicely done by p diddy and no matter what the message is it is a positive to the album because it brings slew of energy and its also commercial grade instant unmarried straight caddilac pimpin is not done as well it does not draw much attending and the name of the song is probably been practice so many times by a town wrappers exp youngbloodz however silence a solid song rest of the joints on this are all done moderately nicely although the style of the beat does not match eightball grand j gram s style sometimes their delivery more or less combine it in this is a must get for any down south wrap fans for people who just first heard of eightball grand j gram they are definitely not belt but they silence have room for improvement lyrics bproduction b delivery boverall b","overall":4,"summary":"Nice Work: National Breakthrough","unixReviewTime":1090713600,"reviewTime":"07 25, 2004"}
{"orig_index":47559,"reviewerID":"A2JDIX1X3JH8S8","asin":"B000641A2C","reviewerName":"Steve Dossey","helpful":[6,11],"reviewText":"I have seen Lucinda in concert five times in the last four years. The songs on this recording with the exception of about a handful, do not capture her great live performances nor studio recordings. A couple exceptions are \"Are You Down\" (really a great interpretation), \"Words Fell\" is soulful. The problem with this recording is multifold: one)her attempts at hard score rock are a vocal stretch and seemed forced (Atonement, Joy, Pineola (this should been slowed way down), Change the Locks, Joy, I lost It, etc.) two) The song selection: Sweetside, American Dream, and Real Live Bleeding Fingers are all a drag and a million other great Lucinda itunes could been included there instead of these. three)Song arrangements: Essence (out of groove), Exchange the Locks (every live version I have heard is better than this one). She does justice to the good songs from World Without Tears: Ventura, Reason to Cry, Overtime,Righteously--all great. The first cd is a slow dance groove for the most part, the second cd is more rock oriented. Also this recording showcases a good band,I like the steal guitar and sharp. In closing, Lucinda is always great to hear. but this is a mixed bag.","overall":3,"summary":"Lucinda Live--I have heard much better","unixReviewTime":1116201600,"reviewTime":"05 16, 2005"}
{"orig_index":47559,"reviewerID":"A2JDIX1X3JH8S8","asin":"B000641A2C","reviewerName":"Steve Dossey","helpful":[6,11],"reviewText":"i have seen upright lucinda angstrom unit in concert five times in the last four start years the songs on this recording with the exception of about a handful do not capture her great live performances nor studio recordings a couple exceptions are are you pleasure down really a great inwards shut up interpretation words fell is soulful the problem with this recording is multifold one rock and roll her attempts at hard score rock are a commemorate vocal stretch and seemed forced atonement joy pineola this should been slowed way down change take heed the information technology begin locks joy i lost it etc two the song selection sweetside american dream and real live bleeding fingers are all a drag and a million other great lucinda witness itunes pleasure could been included there instead birdsong of these three song arrangements essence out of groove exchange the locks every live version i merely have heard is better mixed up unrecorded than this one she does justice to the good songs from world without tears ventura reason to cry overtime righteously all great the first cd is a slow dance groove for the most part the second cd is more rock oriented also intemperately this recording showcases a good band i like the steal guitar and sharp in closing lucinda thumb is always great to hear but this is a mixed bag","overall":3,"summary":"Lucinda Live--I have heard much better","unixReviewTime":1116201600,"reviewTime":"05 16, 2005"}
{"orig_index":47559,"reviewerID":"A2JDIX1X3JH8S8","asin":"B000641A2C","reviewerName":"Steve Dossey","helpful":[6,11],"reviewText":"i have seen lucinda in concert five times in the last four years the songs mixed this recording with the exception of about a handful do not bag her great live one songs studio recordings a couple exceptions are are you down is live great interpretation words fell is soulful the problem with this recording really multifold performances her attempts at hard score rock are a vocal stretch part groove forced atonement good pineola this should reason slowed way down change the locks joy first lost it etc two the song selection sweetside american dream and real a bleeding fingers are this a drag and a million itunes great lucinda other could been included there instead of these three song arrangements essence out live seemed exchange the locks every of version i without heard is better than this one she does justice to the good nor from the have tears more is to cry overtime righteously all great world i cd is a slow dance groove for the most and the second cd is ventura rock oriented also this recording closing a joy band i like the steal guitar and sharp in showcases lucinda been always great but hear to all is a on capture","overall":3,"summary":"Lucinda Live--I have heard much better","unixReviewTime":1116201600,"reviewTime":"05 16, 2005"}
{"orig_index":47559,"reviewerID":"A2JDIX1X3JH8S8","asin":"B000641A2C","reviewerName":"Steve Dossey","helpful":[6,11],"reviewText":"i have seen lucinda in concert thumb five times in the last four years the songs on this recording with the exception of about a handful do come out of the closet not capture her great live performances nor studio recordings a couple exceptions are are you down really a song great interpretation words fell incessantly be is soulful the problem with this recording is multifold one her attempts at hard score rock are a vocal stretch and seemed forced atonement joy pineola this should been slowed shout way down change the locks joy i lost it etc age two the song selection sweetside american dream and real live bleeding fingers are all a drag and a million other great lucinda itunes could devour shut up been angstrom unit included there instead of these three song coalesce arrangements essence out of groove exchange job the locks every live version i have job heard is angstrom unit better than commemorate this one she does justice to the good songs from world without organisation tears ventura reason to cry overtime righteously all great the first cd jurist is a slow dance groove for the most part the second cd is more rock oriented also this recording showcases a survival of the fittest gaining control good commemorate band i like the steal guitar and sharp in closing lucinda is always great to hear but this is a mixed bag","overall":3,"summary":"Lucinda Live--I have heard much better","unixReviewTime":1116201600,"reviewTime":"05 16, 2005"}
{"orig_index":47559,"reviewerID":"A2JDIX1X3JH8S8","asin":"B000641A2C","reviewerName":"Steve Dossey","helpful":[6,11],"reviewText":"i have reckon lucinda in concert five times in the last four year the songs on this recording with the exception of about a handful do not capture her great live performances nor studio recordings a couple exclusion are are you down really a great interpretation words cut down is soulful the problem with this recording is multifold ace her attempts at tough score rock are a vocal stretch and seemed forced atonement joy pineola this should been slowed manner down change the locks joy i baffled it etc two the song selection sweetside american dream and real live hemorrhage fingers are all a drag and a million other great lucinda itunes could been included there instead of these three song arrangements essence out of groove exchange the locks every live interlingual rendition i have discover is better than this ace she does justice to the respectable songs from world without displume ventura reasonableness to cry overtime righteously all great the low gear compact disc is a slow saltation groove for the most part the indorse compact disc is more rock oriented also this recording showcases a respectable band i like the buy guitar and sharp in closing lucinda is always great to hear but this is a assorted bag","overall":3,"summary":"Lucinda Live--I have heard much better","unixReviewTime":1116201600,"reviewTime":"05 16, 2005"}
{"orig_index":47559,"reviewerID":"A2JDIX1X3JH8S8","asin":"B000641A2C","reviewerName":"Steve Dossey","helpful":[6,11],"reviewText":"i have seen lucinda in concert five times in the last four years the songs on this recording with the exception of about a handful do not capture her great live performances nor studio recordings a couple exceptions are are you down really a great interpretation words fell is soulful the problem with this recording is multifold one her attempts at hard score rock are a vocal stretch and seemed forced atonement joy pineola this should been slowed way down change the locks joy i lost it etc two the song selection sweetside american dream and real live bleeding fingers are all a drag and a million other great lucinda itunes could been included there instead of these three song arrangements essence out of groove exchange the locks every live version i have heard is better than this one she does justice to the good songs from world without tears ventura reason to cry overtime righteously all great the first cd is a slow dance groove for the most part the second cd is more rock oriented also this recording showcases a good band i like the steal guitar and sharp in closing lucinda is always great to hear but this is a mixed bag ","overall":3,"summary":"Lucinda Live--I have heard much better","unixReviewTime":1116201600,"reviewTime":"05 16, 2005"}
{"orig_index":56637,"reviewerID":"AM3FNVNAKXAF6","asin":"B001C3KCSY","reviewerName":"Brian","helpful":[0,0],"reviewText":"This is the best Kings of Leon album - period. We own them all and have seen them in concert. The hipsters will point to their more raw earlier work which they liked before they became famous. The rest of us can simply enjoy this masterpiece. Just like there is Christmas music, we have summer music. With the tops down and the sun out, Kings of Leon is the most perfect summer album I have never heard. We have listened to this album literally over one hundred times and it remains one of your halftime favourites. It's so good I already have the CD, but bought the album just to send a little more money their way (and I also have a stack of two hundred+ CDs to trip into Amazon Cloud Player)","overall":5,"summary":"The best Kings of Leon Album","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":56637,"reviewerID":"AM3FNVNAKXAF6","asin":"B001C3KCSY","reviewerName":"Brian","helpful":[0,0],"reviewText":"of is the best kings have leon album period we own them all and have seen them in famous the hipsters will point to their more raw earlier work which they album before they became concert the rest of us can simply enjoy this masterpiece just like there is christmas music we have summer music amazon the tops down and the sun out kings two leon is the most perfect summer a i have never have we heard way to this album the over one hundred times and it remains one of your halftime favourites its so good i already have literally cd this bought the album just to send liked little more money their listened and to also of a stack of but hundred cds i trip into with cloud player","overall":5,"summary":"The best Kings of Leon Album","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":56637,"reviewerID":"AM3FNVNAKXAF6","asin":"B001C3KCSY","reviewerName":"Brian","helpful":[0,0],"reviewText":"this is the best kings of leon album period we own them all and have seen them in concert the hipsters will point to their more raw earlier work which they liked before they became famous the rest of us can simply enjoy this masterpiece just like there is christmas music we have summer music with the tops down and the sun out kings of leon is the most perfect summer album i have never heard we have listened to this album literally over one hundred times and it remains one of your halftime favourites its so good i already have the cd but bought the album just to send a little more money their way and i also have a stack of two hundred cds to trip into amazon cloud player ","overall":5,"summary":"The best Kings of Leon Album","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":56637,"reviewerID":"AM3FNVNAKXAF6","asin":"B001C3KCSY","reviewerName":"Brian","helpful":[0,0],"reviewText":"this is the best kings of leon album period we own them all have them in concert the hipsters will point to their more raw earlier work which they before they became famous the rest of us can simply enjoy masterpiece just like there is christmas music we have summer music with the tops down and the sun out kings of leon is the most perfect summer album i never heard we have listened to this album literally over one hundred times and it remains one of your halftime favourites its good i already have the cd but bought the album just to send a little more money their way and i stack of two hundred cds to trip into amazon cloud player","overall":5,"summary":"The best Kings of Leon Album","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":56637,"reviewerID":"AM3FNVNAKXAF6","asin":"B001C3KCSY","reviewerName":"Brian","helpful":[0,0],"reviewText":"this is the best kings of leon album period we own them all devour and christmastide have seen in that respect them in concert the hipsters will devour point to their more raw earlier work which they liked before they became famous the rest of us can simply enjoy this masterpiece just like there is christmas workplace music we have summer music with the tops down and the sun out kings of leon is the most perfect summer album i have never witness heard information technology we have listened to this album literally over one early hundred times and it remains one of your angstrom unit halftime favourites its so good i already have the cd but bought the histrion album just to send a little more money their early in that respect way information technology and i also have a stack of two hundred cds to trip into amazon cloud player","overall":5,"summary":"The best Kings of Leon Album","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":56637,"reviewerID":"AM3FNVNAKXAF6","asin":"B001C3KCSY","reviewerName":"Brian","helpful":[0,0],"reviewText":"this is the best kings of leon album period we own them perfective tense all and pet have seen them in concert the hipsters will point to their more raw earlier work which they liked before they became famous the record album rest of us can simply be enjoy this masterpiece just like there is christmas music we have summer music with the tops down and the sun out kings of leon is the most earlier perfect summer barely album i have balance never heard we have listened to chef doeuvre this album literally over one hundred times summertime and it remains one of your halftime favourites its so good i already have the cd but bought the album just to send a angstrom unit little more money their way and i also have a stack of two hundred cds to in that respect trip into amazon cloud player","overall":5,"summary":"The best Kings of Leon Album","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":58430,"reviewerID":"APOGXH3A74CM3","asin":"B002HQWQB6","reviewerName":"Damian P. Gadal","helpful":[0,1],"reviewText":"I've listened to this a few times, and while it's enjoyable, it's not something I see myself dying to listen to years from now. It's more like pleasing ambient driving music, and I find that it blacks inspiration. I'm not saying it's bad, it's just missing that of'ne said quot to make it stand out.","overall":3,"summary":"Needs some inspiration","unixReviewTime":1253750400,"reviewTime":"09 24, 2009"}
{"orig_index":58430,"reviewerID":"APOGXH3A74CM3","asin":"B002HQWQB6","reviewerName":"Damian P. Gadal","helpful":[0,1],"reviewText":"ive to this a few and while its enjoyable its not something see dying to listen to years from now its like pleasing ambient driving music and i find that it blacks inspiration im not saying its bad its just missing that ofne said quot to make it stand out","overall":3,"summary":"Needs some inspiration","unixReviewTime":1253750400,"reviewTime":"09 24, 2009"}
{"orig_index":58430,"reviewerID":"APOGXH3A74CM3","asin":"B002HQWQB6","reviewerName":"Damian P. Gadal","helpful":[0,1],"reviewText":"ive listened to this a few times and while its enjoyable its not something i see myself dying to listen to years from now its more like pleasing ambient driving music and i find that it blacks inspiration im not saying its bad its just missing that ofne said quot to make it stand out ","overall":3,"summary":"Needs some inspiration","unixReviewTime":1253750400,"reviewTime":"09 24, 2009"}
{"orig_index":58430,"reviewerID":"APOGXH3A74CM3","asin":"B002HQWQB6","reviewerName":"Damian P. Gadal","helpful":[0,1],"reviewText":"ive out to saying a this times and while its enjoyable its not something i myself see dying to listen years to from now its more like pleasing ambient driving music and i find that it blacks inspiration im not few its bad its just missing that ofne said quot to make it stand listened","overall":3,"summary":"Needs some inspiration","unixReviewTime":1253750400,"reviewTime":"09 24, 2009"}
{"orig_index":58430,"reviewerID":"APOGXH3A74CM3","asin":"B002HQWQB6","reviewerName":"Damian P. Gadal","helpful":[0,1],"reviewText":"ive listen to this a few clip and while its enjoyable its not something i see myself dying to listen to years from now its more like pleasing ambient driving music and i come up that it blacks inspiration im not tell its bad its just wanting that ofne said quot to make it stand out","overall":3,"summary":"Needs some inspiration","unixReviewTime":1253750400,"reviewTime":"09 24, 2009"}
{"orig_index":58430,"reviewerID":"APOGXH3A74CM3","asin":"B002HQWQB6","reviewerName":"Damian P. Gadal","helpful":[0,1],"reviewText":"ive listened to this a few information technology times and while its information technology enjoyable its not something i see corresponding myself dying to listen to years from now its more like pleasing ambient driving music and i find that it blacks inspiration im not saying its bad its just missing that ofne said quot to come out of the closet make it stand barely out","overall":3,"summary":"Needs some inspiration","unixReviewTime":1253750400,"reviewTime":"09 24, 2009"}