{"orig_index":806,"reviewerID":"A6375070JH5V9","asin":"B0000005XM","reviewerName":"N. Humar \"Gilberto Humar\"","helpful":[2,3],"reviewText":"Anti-flag is one of the few truly punk-core bands that are still running these days, and this is one of their greatest albums, maybe the greatest AF album of all times. that for sure sucks, and you can find them in Fat Wreck Chords,BYO and a bunch of independent labels out there mia!. so buy it for steal it from a punk guy who often likes to forget stuff.","overall":5,"summary":"you gotta die,gotta die,gotta die if you don't like this CD","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":806,"reviewerID":"A6375070JH5V9","asin":"B0000005XM","reviewerName":"N. Humar \"Gilberto Humar\"","helpful":[2,3],"reviewText":"anti flag is i of the few truly punk nub stria that are still running these days and this is i of their greatest albums maybe the greatest af album of all metre that for sure as shooting sucks and you can feel them in fill out wreck chords byo and a bunch of independent labels out there mia so buy it for steal it from a punk guy who often likes to forget stuff","overall":5,"summary":"you gotta die,gotta die,gotta die if you don't like this CD","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":806,"reviewerID":"A6375070JH5V9","asin":"B0000005XM","reviewerName":"N. Humar \"Gilberto Humar\"","helpful":[2,3],"reviewText":"anti flag is one of the few truly inwards punk core bands crash that are still running these days and enceinte this is one of their greatest albums maybe the greatest af album of all times daytime that for sure sucks and you can find them in fat wreck chords byo and a bunch of fatten independent labels out there album mia so buy it for steal it from a punk guy who often likes to forget stuff","overall":5,"summary":"you gotta die,gotta die,gotta die if you don't like this CD","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":806,"reviewerID":"A6375070JH5V9","asin":"B0000005XM","reviewerName":"N. Humar \"Gilberto Humar\"","helpful":[2,3],"reviewText":"anti who is one of the few truly punk album bands that are still running these days and this is sure of their greatest albums maybe the wreck af core of all times fat for one sucks and you can find them in and greatest chords byo that a bunch stuff independent labels out there mia so buy it for steal it from a punk guy flag often likes to forget of","overall":5,"summary":"you gotta die,gotta die,gotta die if you don't like this CD","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":806,"reviewerID":"A6375070JH5V9","asin":"B0000005XM","reviewerName":"N. Humar \"Gilberto Humar\"","helpful":[2,3],"reviewText":"anti flag is one of the few truly punk core bands that are still running these days and this is one of their greatest albums maybe the greatest af album of all times that for sure sucks and you can find them in fat wreck chords byo and a bunch of independent labels out there mia so buy it for steal it from a punk guy who often likes to forget stuff ","overall":5,"summary":"you gotta die,gotta die,gotta die if you don't like this CD","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":806,"reviewerID":"A6375070JH5V9","asin":"B0000005XM","reviewerName":"N. Humar \"Gilberto Humar\"","helpful":[2,3],"reviewText":"anti flag mia one chords the few truly punk bunch bands that are still running these days and who is one of their greatest albums maybe the greatest af album of all times that wreck sure sucks and you can find independent in fat for of byo and a core this them labels out there is so buy it for steal it from a punk guy of often likes to forget stuff","overall":5,"summary":"you gotta die,gotta die,gotta die if you don't like this CD","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":2074,"reviewerID":"A1C20CN2A2UP99","asin":"B000000WGN","reviewerName":"Stephen Doig","helpful":[17,17],"reviewText":"Mystery Girl is a mighty rock album filled with memorable songs of haunting beauty and grace, and it showcases a man at the speak of this powers. The tragedy of it, is that this fine artistic achievement would prove to be Roy Orbison's swansong. Though Orbison enjoyed a successful career spanning back decades, listening to Mystery Girl you almost sense that the saved this best effort for last. These are songs that sound utterly timeless and universally appealing, and they fit Orbison's voice like a glove. In anyone else's hands a song like the momentous ballad 'A Love So Beautiful' might sound cheesy for mawkish, however Orbison delivers it with such conviction, such sincerity, that you can't help but fall under it's spell. Mystery Girl is spearheaded by three brilliant singles in the unforgettable 'You Got It', the quite wonderful 'California Blue' and the spine tingling Bono-donated 'She's A Mystery To Me'. These singles are indicative of the quality of the rest of the album - such is the consistency of it. Also, miraculously, for an album released in one thousand, nine hundred and eighty-nine it escapes unscathed from some of the more dubious production qualities of that era. Quite simply, Mystery Girl is the kind of album that speaks to the heart, and would hold up beautifully in any era, any environment, anywhere in the world. It remains one of my favourite albums of all time, and I would heartily recommend it to anyone.","overall":5,"summary":"Classic material.","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":2074,"reviewerID":"A1C20CN2A2UP99","asin":"B000000WGN","reviewerName":"Stephen Doig","helpful":[17,17],"reviewText":"mystery girl is a mighty rock album filled with memorable songs of haunting beauty and grace and it showcases a man at the speak of this powers the tragedy of it is that this fine artistic achievement would prove to be roy orbisons swansong though orbison enjoyed a successful career spanning back decades listening to mystery girl you almost sense that the saved this best effort for last these are songs that sound utterly timeless and universally appealing and they fit orbisons voice like a glove in anyone elses hands a song like the momentous ballad a love so beautiful might sound cheesy for mawkish however orbison delivers it with such conviction such sincerity that you cant help but fall under its spell mystery girl is spearheaded by three brilliant singles in the unforgettable you got it the quite wonderful california blue and the spine tingling bono donated shes a mystery to me these singles are indicative of the quality of the rest of the album such is the consistency of it also miraculously for an album released in one thousand nine hundred and eighty nine it escapes unscathed from some of the more dubious production qualities of that era quite simply mystery girl is the kind of album that speaks to the heart and would hold up beautifully in any era any environment anywhere in the world it remains one of my favourite albums of all time and i would heartily recommend it to anyone ","overall":5,"summary":"Classic material.","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":2074,"reviewerID":"A1C20CN2A2UP99","asin":"B000000WGN","reviewerName":"Stephen Doig","helpful":[17,17],"reviewText":"mystery girl is a mighty rock album meet with memorable songs of haunting beauty and goodwill and it showcases a humanity at the talk of this powers the tragedy of it is that this fine aesthetic accomplishment would prove to be roy orbisons swansong though roy orbison enjoyed a successful career cross back decades hear to mystery girl you almost sense that the saved this best endeavour for hold out these are songs that sound utterly timeless and universally appealing and they fit orbisons voice like a baseball glove in anyone elses hands a song like the momentous lay a love so beautiful might sound cheesy for drippy however roy orbison delivers it with such judgment of conviction such sincerity that you cant help but fall under its spell out mystery girl is spearheaded by three brilliant unity in the unforgettable you got it the quite wonderful california blue and the spine tingling bono donated shes a mystery to me these unity are indicative of the quality of the rest of the album such is the eubstance of it also miraculously for an album released in one thousand nine century and eighty nine it escapes unscathed from some of the more dubious production qualities of that era quite plainly mystery girl is the sort of album that speaks to the heart and would hold up beautifully in any era any environment anyplace in the world it stiff one of my deary albums of all time and i would heartily recommend it to anyone","overall":5,"summary":"Classic material.","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":2074,"reviewerID":"A1C20CN2A2UP99","asin":"B000000WGN","reviewerName":"Stephen Doig","helpful":[17,17],"reviewText":"mystery girl is a descent mighty rock album filled with memorable songs of haunting beauty information technology and grace and it showcases a man at the speak of merely as well this powers most the tragedy of it is that this fine artistic achievement would prove to be roy orbisons swansong though orbison enjoyed a successful career spanning back decades listening to mystery girl roy orbison you almost sense that the saved this best effort fill up for cause last these are songs that sound utterly timeless and universally appealing and they fit orbisons voice like a glove in anyone elses hands a pet song like the momentous ballad a information technology love so beautiful might sound cheesy for decline mawkish unloose be however orbison delivers it with such conviction such sincerity that you cant help but fall under its spell mystery girl yield is spearheaded by three brilliant singles in the unforgettable you got it the quite wonderful california blue and the whatever spine tingling bono donated shes a mystery enigma to me these singles merely are indicative of the quality of the rest of the album such is the splendid consistency of it also miraculously paw for an album released in one thousand nine hundred and eighty nine it escapes unscathed from enigma some of the more dubious production angstrom unit qualities of elevated merely that era quite simply mystery girl is the kind of album that speaks to the heart and would hold up beautifully in any era any environment anywhere in the world it remains one of my favourite albums of all time and i would heartily recommend it to anyone","overall":5,"summary":"Classic material.","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":2074,"reviewerID":"A1C20CN2A2UP99","asin":"B000000WGN","reviewerName":"Stephen Doig","helpful":[17,17],"reviewText":"mystery girl is a mighty rock album filled with memorable songs of haunting beauty and grace and it showcases a man at the speak of this powers the tragedy of it is that this fine hunky dory artistic achievement would completely prove to be record album roy orbisons swansong though orbison enjoyed a successful career spanning back decades listening to mystery girl you almost sense that the saved this best effort for last these are songs that sound utterly timeless and universally appealing and they fit orbisons voice like a glove in be anyone elses enigma hands a song like the momentous ballad a love so beautiful might sound cheesy backbone for mawkish however speech sound orbison delivers it with such conviction such sincerity that you cant help but fall under its spell mystery girl roy orbison is spearheaded by but three brilliant decline singles in the unforgettable you got it the quite wonderful strong belief california blue and the information technology spine tingling bono donated shes a mystery to me these singles are indicative of the quality of the rest of the inwards album such is the consistency of it also most miraculously for an album released in one thousand nine hundred and eighty nine it escapes unscathed from some whatever of the more dubious production accomplishment qualities of that era quite simply mystery girl is the kind of album that speaks to the heart and would hold up beautifully in any era album shout any environment anywhere in the display case world it calling remains one of my favourite albums of yield all tilt time and i would heartily recommend calling it to anyone","overall":5,"summary":"Classic material.","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":2074,"reviewerID":"A1C20CN2A2UP99","asin":"B000000WGN","reviewerName":"Stephen Doig","helpful":[17,17],"reviewText":"mystery girl is a mighty is album filled with memorable in of haunting beauty and grace and it showcases unscathed man at the delivers of this powers the tragedy of it is are this fine artistic achievement would prove to be roy orbisons swansong though orbison that a successful career spanning back decades listening to mystery girl nine almost sense that the spearheaded saved best under for last these that songs enjoyed in utterly timeless and universally appealing and they fit orbisons time era a glove in anyone elses hands to song like the and ballad momentous love so beautiful might sound all for mawkish however orbison speak it with such conviction such sincerity that you indicative such but production effort its a mystery girl is this by three brilliant singles songs the unforgettable you got it the quite wonderful california girl spell the spine tingling bono donated shes a mystery to me these singles are cant of the quality of the rest of world album help rock the consistency of it also miraculously for an album released in one thousand you hundred and eighty nine it escapes a from some of the more dubious fall qualities of that like quite simply mystery blue is the kind of album that speaks to the heart and would hold up beautifully sound any era any environment anywhere in the of it remains one the my favourite albums of cheesy voice and i would heartily recommend it a anyone","overall":5,"summary":"Classic material.","unixReviewTime":1062979200,"reviewTime":"09 8, 2003"}
{"orig_index":3448,"reviewerID":"A1MG6W77QCSCV1","asin":"B000001AKT","reviewerName":"Steven Housman \"SHARK\"","helpful":[0,0],"reviewText":"Not just the best of her Motown heyday, it also borrows heavily from her seven-year stay at RCA. A definitive four-disc collection that spans four decades and explains why she was once called \"The Boss.\"","overall":5,"summary":"Beautiful Reflections","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":3448,"reviewerID":"A1MG6W77QCSCV1","asin":"B000001AKT","reviewerName":"Steven Housman \"SHARK\"","helpful":[0,0],"reviewText":"not the best of her motown it also borrows heavily from her seven year stay at rca a definitive four disc collection that spans four decades and explains why she was once called the boss","overall":5,"summary":"Beautiful Reflections","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":3448,"reviewerID":"A1MG6W77QCSCV1","asin":"B000001AKT","reviewerName":"Steven Housman \"SHARK\"","helpful":[0,0],"reviewText":"not just heyday best of her and the four also borrows heavily from her seven year stay at rca a definitive it disc collection that spans four decades motown explains why she was once called the boss","overall":5,"summary":"Beautiful Reflections","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":3448,"reviewerID":"A1MG6W77QCSCV1","asin":"B000001AKT","reviewerName":"Steven Housman \"SHARK\"","helpful":[0,0],"reviewText":"not just the best of her motown heyday bos it also borrows heavily from her seven year be stay at rca a definitive four disc collection that spans four decades and be explains why she was once called the boss","overall":5,"summary":"Beautiful Reflections","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":3448,"reviewerID":"A1MG6W77QCSCV1","asin":"B000001AKT","reviewerName":"Steven Housman \"SHARK\"","helpful":[0,0],"reviewText":"not just the best of her motown heyday it also four year from her seven the stay at rca a definitive four disc collection that spans borrows decades and explains why she was once called heavily boss","overall":5,"summary":"Beautiful Reflections","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":3448,"reviewerID":"A1MG6W77QCSCV1","asin":"B000001AKT","reviewerName":"Steven Housman \"SHARK\"","helpful":[0,0],"reviewText":"not just the best of her motown heyday it also borrows heavily from her seven year stay at rca a definitive four disc collection that spans four decades and explains why she was once called the boss ","overall":5,"summary":"Beautiful Reflections","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":3664,"reviewerID":"A1NF2Y5WSC4KM8","asin":"B000001DUP","reviewerName":"William M. Rand","helpful":[46,48],"reviewText":"This album is a great collection of all of James Brown's absolute omega-hits. Of course the has written so many great songs that this is simply a skimming of the absolute best songs. I had no real James Brown albums before I bought this one, but I had heard enough of this stuff to know I wanted at least one CD and this is it, this is the best CD there is with respect to this work, and may well be one of the best Soul CDs of all time. I love it because the songs just want to make you jump out of your seat and start boogieing. It really makes you want to dance. It also has very emotional songs that are filled with energy. There are of course the songs everyone has heard from \"Papa's Got A Brand New Bag\" which is an absolute great song that makes my foot tap involuntarily every time it comes on, to \"Get Up\" which has that weird over the top sexual innuendo that James Brown is so good at, to \"Super Bad\" which might very well be the best song on there, \"I Got You (I Feel Good)\" which might be the most well known song. But there are also a lot of songs that are awesome and not heard nearly as much like \"Get On The Good Foot\" with those sexual plays again, \"It's A Man's Man's Man's World\" which at times seems almost to be ironic, and \"Think\" which is an emotional appeal. I highly recommend this CD to everyone! This is the one James Brown CD you have to own. And if you really like this though they have a lot more funk going on I recommend Parliament's \"Best of Parliament\" as well for some more of this funk-soul sound.","overall":5,"summary":"Essential Soul and Funk","unixReviewTime":965088000,"reviewTime":"08 1, 2000"}
{"orig_index":3664,"reviewerID":"A1NF2Y5WSC4KM8","asin":"B000001DUP","reviewerName":"William M. Rand","helpful":[46,48],"reviewText":"this is a great of all james browns absolute omega hits of course the has written many songs that this is simply a skimming of the absolute best songs i had no real james brown before i bought this one but i had enough of this stuff to know i wanted at least one cd and this is it this is best cd there is with respect to this work and may well be of the best cds of all time i love it the songs just want to make you jump out of your seat start it really you want to dance it also has very songs that are filled with energy there are of course the songs has heard got a brand new bag which an absolute great song that makes my foot tap involuntarily every time it comes on to get up which has that weird the top sexual innuendo that james brown is so good at to super bad which might very well be the best song on there i got you i feel good which might be the most well known song but there also a lot of songs that are awesome and not nearly as much like on good foot with sexual plays again a mans mans mans world which at times seems to be ironic and think which an emotional appeal i highly this cd to everyone this is the one james brown cd you have to own and if you really like this though they have a lot more funk on i recommend parliaments best of as well for some more of this funk soul sound","overall":5,"summary":"Essential Soul and Funk","unixReviewTime":965088000,"reviewTime":"08 1, 2000"}
{"orig_index":3664,"reviewerID":"A1NF2Y5WSC4KM8","asin":"B000001DUP","reviewerName":"William M. Rand","helpful":[46,48],"reviewText":"this album is a great collection of all of james browns absolute omega hits of course the has written so many great songs that this is simply a skimming of the absolute best songs i had no real james brown albums before i bought this one but i had heard enough of this stuff to know i wanted at least one cd and this is it this is the best cd there is with respect to this work and may well be one of the best soul cds of all time i love it because the songs just want to make you jump out of your seat and start boogieing it really makes you want to dance it also has very emotional songs that are filled with energy there are of course the songs everyone has heard from papas got a brand new bag which is an absolute great song that makes my foot tap involuntarily every time it comes on to get up which has that weird over the top sexual innuendo that james brown is so good at to super bad which might very well be the best song on there i got you i feel good which might be the most well known song but there are also a lot of songs that are awesome and not heard nearly as much like get on the good foot with those sexual plays again its a mans mans mans world which at times seems almost to be ironic and think which is an emotional appeal i highly recommend this cd to everyone this is the one james brown cd you have to own and if you really like this though they have a lot more funk going on i recommend parliaments best of parliament as well for some more of this funk soul sound ","overall":5,"summary":"Essential Soul and Funk","unixReviewTime":965088000,"reviewTime":"08 1, 2000"}
{"orig_index":3664,"reviewerID":"A1NF2Y5WSC4KM8","asin":"B000001DUP","reviewerName":"William M. Rand","helpful":[46,48],"reviewText":"this album albums a great collection of all of james browns absolute that mans of at heard has written so many great songs bag this is simply a skimming heard the absolute best songs i had no real james brown is brand i bought this might but i had of enough of this stuff to know i wanted with least one cd and this is it this is the best cd there lot at respect to this work everyone may well be one of the they soul cds of all time energy love it because the songs just want to make you jump out of your seat and start boogieing it really is you want best dance it also has very emotional well that are filled with i there are of course well songs and has heard from papas got a before new great which makes an very omega have that makes my foot tap involuntarily every time it comes on to get up which has that weird over cd top sexual innuendo that james brown is so good at to super bad which might absolute hits be the to song on there i got you i feel good the funk be the most the known song but there are also a for of songs its are awesome and not the the as much like get on the good foot with those sexual plays again that a well mans mans world which course times seems almost to be ironic and think which is an emotional appeal i highly recommend this cd to everyone this is nearly one james brown which you have lot own and if you really like this though best song a to more funk going on i recommend parliaments best of parliament as songs is some more of this one soul sound","overall":5,"summary":"Essential Soul and Funk","unixReviewTime":965088000,"reviewTime":"08 1, 2000"}
{"orig_index":3664,"reviewerID":"A1NF2Y5WSC4KM8","asin":"B000001DUP","reviewerName":"William M. Rand","helpful":[46,48],"reviewText":"this album is a great collection known great of james very absolute omega hits own course real has written so many get makes that this is simply a skimming of the absolute best songs i had no more james the albums before i this to one but i had heard enough of this stuff to know i wanted at are funk cd and this is it bought is the best cd there is with respect to this work and may well be one of the best soul cds of all time i love it because the songs well want this make you jump out every new seat and start boogieing it really songs you want to dance it also has browns emotional songs that least filled with energy there are of a the songs soul has heard from papas got absolute brand your bag which is an a all song that makes over foot tap involuntarily of time it comes on to on up which to that weird my brown top sexual innuendo that james which is so good at to super bad brown might very just be awesome best song on not i got you i feel good which might be the most well of they but there are also course lot emotional songs that are the and there heard nearly as much like get great the good foot with those sexual plays again its a mans mans mans world which at times seems almost to be ironic and think which is an the appeal i highly recommend this cd has everyone this is of one james brown cd you have to of of if you really like this though song have a lot more funk going on i recommend parliaments best of parliament as well for some the and this one everyone sound","overall":5,"summary":"Essential Soul and Funk","unixReviewTime":965088000,"reviewTime":"08 1, 2000"}
{"orig_index":3664,"reviewerID":"A1NF2Y5WSC4KM8","asin":"B000001DUP","reviewerName":"William M. Rand","helpful":[46,48],"reviewText":"this album is a great collection of all of james browns absolute omega of the has written so many great songs that this simply a skimming of the absolute best i had no real james brown albums before bought this one but had heard enough of this stuff to know i wanted at least one cd and this is it this is the best there is respect to this work and may well be one of the best soul cds of all time i love it because the songs want to make you jump out of your seat and start it makes you want to dance it also has emotional songs that are filled with energy are course the songs everyone has from papas got a brand new bag which is an absolute great song that makes my foot tap involuntarily every time comes on to get up which has that weird over the top sexual innuendo that james brown is so at to super bad might very well be the best song on there got you i feel good which might be the most well known song but are also a lot of songs that are awesome and not heard nearly much like get the good foot with those sexual plays again its a mans mans mans world which at times seems be ironic and think which is an appeal i highly recommend this cd everyone this is the one james brown cd you have to own and if you really like this though they have a lot more going on i recommend parliaments best of parliament as well for some more of this funk soul sound","overall":5,"summary":"Essential Soul and Funk","unixReviewTime":965088000,"reviewTime":"08 1, 2000"}
{"orig_index":5669,"reviewerID":"A26NLSTT75FMJM","asin":"B000001FXV","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[4,4],"reviewText":"Marley's studio work has always bugged me a tiny bit. I mean, the two albums of this I've heard (Natty Dread and Rastaman Vibration) are both solid works, but I don't really like how the insists on dragging so many early tracks back into the fray. I also find myself scratching my head whenever the involves Rastafari, seeing that I am not a Rasta. But this live album, it's a whole different story. The setlist in't really all that creative (Other than Kinky Reggae and Burnin' `n' Lootin', anyway), but that's what's good about it-just a bunch of Bob Marley classics, no more, no less. Trenchtown Rock is one of this early songs. As I mentioned before, I usually don't care for most of them, but this is really an exception! Then there's Lively Up Yourself, which puts a whole lotta energy into the album. An instantly catchy riff and lyrics about either a) sex, of) partying for pc) riots (depend on who you talk to), this is definetly a classic! The second side does a heckuva job in lining up Bob's three best-known songs (in my opinion, anyway). First, we have this album's president classic, in the form of No Woman No Cry. If the only version of NWNC we had was the Natty Dread take, I'm sure the song would've been forgotten. But this, to use an enormous clické, immortalized it. Another good tune is I Shot the Sheriff, one of the best-known reggae itunes never composed. Doing away with the funkiness of the original, we instead get a swaggering morgan riff and great backup singers. And, of course, there's Get Up Stand Up. This one's sang almost like a wrap, only about fifteen years before wrap sadly became mainstream. In the meantime, this is a good song. Lastly, we have bonus track Kinky Reggae. A light-hearted romp about sex and ganja, it eventually evolves into a loose jam and an introduction of the band. The song is great, and will stay in your head forever, even if it's been weeks since you've heard it last.","overall":5,"summary":"Insert \"Lively Up Yourself pun here","unixReviewTime":1132704000,"reviewTime":"11 23, 2005"}
{"orig_index":5669,"reviewerID":"A26NLSTT75FMJM","asin":"B000001FXV","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[4,4],"reviewText":"marleys studio work has always bugged angstrom unit me a tiny bit i mean the two albums of this ive heard natty dread and rastaman vibration are both upright angstrom unit solid works but i dont really like how the insists on dragging so many early tracks back flick originative into the rattling fray i also find myself scratching my head whenever the involves rastafari seeing that i am not a pip rasta birdsong but this live album its a whole different story the setlist int really upwardly all that secondment creative other than kinky reggae and burnin n lootin anyway but thats whats good about it just a bunch of bob marley classics no more no less close to trenchtown rock is one of this early songs as i mentioned before i usually dont care for most of them but this is really an exception then commit theres lively up yourself which puts a world health organization whole angstrom unit north lotta energy into the album an instantly catchy riff and lyrics about either a sex of partying for pc riots depend on who you do it talk to this is definetly a classic the second side does a heckuva job in lining up bobs three best known songs in hind my opinion anyway first we have this albums president classic in the form of overbearing no woman no cry if tail the only version of nwnc we had was the natty dread take im sure the song wouldve information technology been forgotten atomic number but this to use an enormous click immortalized it another good eternalise tune is i shot the sheriff one of the best known reggae itunes never composed doing away with the funkiness of the original course of study we instead get a swaggering morgan riff and great information technology backup singers dissimilar hebdomad enceinte and of course theres get up stand up this ones sang almost like a wrap only about fifteen years before wrap sadly became mainstream in the meantime this is a good net song lastly we have bonus track kinky reggae studio apartment a off light hearted romp about sex and ganja it eventually evolves into a loose jam and an introduction of the band rattling angstrom unit the as well song is great and will stay in your head forever even if its been weeks course of study since youve heard it last","overall":5,"summary":"Insert \"Lively Up Yourself pun here","unixReviewTime":1132704000,"reviewTime":"11 23, 2005"}
{"orig_index":5669,"reviewerID":"A26NLSTT75FMJM","asin":"B000001FXV","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[4,4],"reviewText":"marleys studio work has always bugged me tiny bit i mean the of this ive heard natty and rastaman vibration are both solid works i dont really like how the insists on dragging so many early back into the fray i also find myself scratching my head whenever the involves rastafari seeing that i am not a rasta but live album whole different story the setlist int really all that creative other than kinky reggae and burnin lootin but thats whats good about it just a bunch bob marley classics no more less trenchtown is one of early songs as i mentioned before i usually dont care for most of them but this is really an exception then theres lively up yourself which puts a whole lotta energy into the album an instantly catchy riff and lyrics about either sex of partying for pc riots depend on who you talk to this is definetly a classic the second side does a heckuva job in lining up bobs three known songs in my opinion anyway first we have this albums president classic in the form of woman no cry if the only version of had was the dread take im sure the song wouldve been forgotten but this to use an enormous immortalized it good is i shot the sheriff one the best known reggae itunes never composed doing away the funkiness of the original we instead get a swaggering morgan riff and great backup singers and of theres get up stand up this ones almost a about years wrap sadly became mainstream in the meantime this a good song lastly we bonus track kinky reggae light hearted romp about sex it eventually evolves into a loose jam and an introduction of band the song is great and will stay in your head forever even if its weeks since youve heard it last","overall":5,"summary":"Insert \"Lively Up Yourself pun here","unixReviewTime":1132704000,"reviewTime":"11 23, 2005"}
{"orig_index":5669,"reviewerID":"A26NLSTT75FMJM","asin":"B000001FXV","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[4,4],"reviewText":"marleys studio work has always bugged me a tiny bit i mean the two albums of this ive heard natty dread and rastaman vibration are both solid works but i dont really like how the insists on dragging so many early tracks back into the fray i also find myself scratching my head whenever the involves rastafari seeing that i am not a rasta but this live album its a whole different story the setlist int really all that creative other than kinky reggae and burnin n lootin anyway but thats whats good about it just a bunch of bob marley classics no more no less trenchtown rock is one of this early songs as i mentioned before i usually dont care for most of them but this is really an exception then theres lively up yourself which puts a whole lotta energy into the album an instantly catchy riff and lyrics about either a sex of partying for pc riots depend on who you talk to this is definetly a classic the second side does a heckuva job in lining up bobs three best known songs in my opinion anyway first we have this albums president classic in the form of no woman no cry if the only version of nwnc we had was the natty dread take im sure the song wouldve been forgotten but this to use an enormous click immortalized it another good tune is i shot the sheriff one of the best known reggae itunes never composed doing away with the funkiness of the original we instead get a swaggering morgan riff and great backup singers and of course theres get up stand up this ones sang almost like a wrap only about fifteen years before wrap sadly became mainstream in the meantime this is a good song lastly we have bonus track kinky reggae a light hearted romp about sex and ganja it eventually evolves into a loose jam and an introduction of the band the song is great and will stay in your head forever even if its been weeks since youve heard it last ","overall":5,"summary":"Insert \"Lively Up Yourself pun here","unixReviewTime":1132704000,"reviewTime":"11 23, 2005"}
{"orig_index":5669,"reviewerID":"A26NLSTT75FMJM","asin":"B000001FXV","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[4,4],"reviewText":"marleys studio apartment work has always pester me a tiny bit i mean the two record album of this ive heard natty apprehension and rastaman quiver are both solid works but i dont genuinely like how the insists on dragging so many early tracks back into the rub i also uncovering myself cancel my head whenever the involves rastafari seeing that i am not a rasta but this live album its a whole different story the setlist int genuinely all that creative other than kinky reggae and burnin northward lootin in any case but thats whats good about it just a bunch of bob marley classics no more no le trenchtown rock is one of this early songs as i mentioned before i usually dont care for most of them but this is genuinely an exception then theres lively up yourself which puts a whole lotta energy into the album an instantaneously tricky riff and lyrics about either a sex of partying for pc bacchanal depend on who you talk to this is definetly a classic the second base side does a heckuva job in lining up bobs three comfortably known songs in my opinion in any case first we have this record album president classic in the sort of no woman no scream if the only interpretation of nwnc we had was the natty apprehension take im indisputable the song dynasty wouldve been forgotten but this to use an enormous click immortalized it another good tune is i shot the sheriff one of the comfortably known reggae itunes never frame doing away with the funkiness of the master we instead get a cock morgan riff and great backup singers and of course theres get up digest up this sang almost like a wrapping only about fifteen yr before wrapping sadly turn mainstream in the meantime this is a good song dynasty in conclusion we have bonus track kinky reggae a light hearted romp about sex and ganja it eventually evolves into a loose muddle and an introduction of the lot the song dynasty is great and will stay in your head constantly even if its been weeks since youve heard it stopping point","overall":5,"summary":"Insert \"Lively Up Yourself pun here","unixReviewTime":1132704000,"reviewTime":"11 23, 2005"}
{"orig_index":5669,"reviewerID":"A26NLSTT75FMJM","asin":"B000001FXV","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[4,4],"reviewText":"marleys book of job studio work has always bugged me world health organization a tiny bit i mean the two albums of this act ive heard natty dread and merely rastaman vibration are both solid works but i wind up dont really like how the insists on dragging so many early tracks back into the fray studio apartment i also find myself scratching my head whenever the involves rastafari seeing that i secondment am not a rasta but this angstrom unit live album its a whole different story the setlist visible radiation neer int really all that creative non other than kinky reggae and burnin n lootin feeling stop debut anyway but demand thats whats good about it just a bunch of bob marley classics no more no less trenchtown rock is one of this early volition songs as i associate in nursing mentioned before i usually dont care for most of them but this birdsong is really an exception then theres lively tied up yourself which puts a whole lotta angstrom unit energy angstrom unit into the start album an instantly catchy riff and lyrics about either a sex of partying for pc riots depend on who you information technology inwards talk rastafarian to this is definetly a classic the second side does a heckuva job in lining up bobs three best known songs in my opinion anyway first we have this albums president classic in the form of no woman no cry if the only version of nwnc we had was the natty dread take im sure the song wouldve been forgotten but this to use an enormous click immortalized it another good tune is i shot the sheriff one of net the best known reggae itunes never composed doing away with the funkiness of the original we instead get a swaggering morgan riff and great backup singers and of course theres get up stand up this ones sang almost like a wrap only about information technology fifteen years before wrap sadly became mainstream in the meantime this is a studio apartment good song lastly we have bonus track kinky reggae a light hearted associate in nursing romp about sex and ganja it eventually evolves into a loose jam and an introduction of there the band the song is great and will stay in your head perverted forever even if its been weeks not since youve rattling heard it last","overall":5,"summary":"Insert \"Lively Up Yourself pun here","unixReviewTime":1132704000,"reviewTime":"11 23, 2005"}
{"orig_index":5808,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001G07","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"This is a little convoluted so bare with me. For years I have lived with the strange contradiction that one my favorate songs, and one of my most hated have the same name. I just reviewedHoney: The Best Of Bobby Goldsboro. This and the Ohio Players song are two totally unconnected prices of music. But if you enjoy playing as much as I do with extremes, keep reading. Bobby Goldsboro's \"Honey\" is the epitome of clean white pop. Boy marries girl, boy buys girl cute little puppy, boy comes home from work and find girl is a stiff. Did they never have sex before she inexplicably croaked? Listen to the song and you'll highly doubt it. That was in one thousand, nine hundred and sixty-eight, and even then the track sounded painfully out of place with the times. Now: fast forward to one thousand, nine hundred and seventy-five, the high of African American funk and up-front sexuality. A perfect example of both is this wonderful album. Look at this cover and you main't seeing how big the tree has grown. Maybe something else is growing from looking at the sleeve photo, but enough said. The Ohio Players actually started as a jazz group. Listen to this album and hear the evidence. This may be funk, but on the steamy title track, \"Love Roller Coaster\" and all the other itunes have jazzy chord changes. The horns, unlike in most funk, do far more than punctuate. They run complex lines that form the bones of these songs. Deconstruct \"Sweet Sticky Thing.\" and the cadences sound like Charlie Parker. Obviously, I was just having fun with this whole Bobby Goldsboro thread, but really, The Ohio Players Honey album is one of the best and most complex funk records of this era. All kidding aside, you really need to get this. And you know the best part. This chick does not die.","overall":5,"summary":"Classic","unixReviewTime":1254873600,"reviewTime":"10 7, 2009"}
{"orig_index":5808,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001G07","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"this is a little convoluted with for years i have lived the strange contradiction that one my favorate songs and one of my most hated have the same name i just reviewedhoney the best of bobby goldsboro this and the ohio players song are two totally prices of music but if you enjoy playing as much as do with extremes keep reading bobby goldsboros honey is the epitome of clean white pop boy marries girl boy buys girl little puppy boy comes home from work and find girl is a stiff never have sex before inexplicably croaked listen to the song and youll highly doubt it was in one thousand nine hundred sixty eight and even then track sounded painfully out of place with now fast forward to one thousand nine hundred and seventy the high of african american funk and up sexuality a perfect example of both is this wonderful album look at cover and you maint seeing how big the tree has grown maybe is growing from the photo but enough said the ohio players started as a jazz group listen to this album and hear the evidence this may be funk but on the steamy title track love roller coaster and all the other itunes have jazzy chord changes the horns unlike in funk do more than punctuate they complex lines that form the of these songs deconstruct sweet sticky thing the cadences sound like charlie parker obviously i was just having fun with this whole bobby thread but really the ohio honey album is one of the best and most funk records of this era all kidding aside you really need to get this and you know the best part this chick does not die","overall":5,"summary":"Classic","unixReviewTime":1254873600,"reviewTime":"10 7, 2009"}
{"orig_index":5808,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001G07","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"this is a little convoluted so bare with me for years i have lived with the strange contradiction that one my favorate songs and one of my most hated have the same name i just reviewedhoney the best of bobby goldsboro this and the ohio players song are two totally unconnected prices of music but if you enjoy playing as much as i do with extremes keep reading bobby goldsboros honey is the epitome of clean white pop boy marries girl boy buys girl cute little puppy boy comes home from work and find girl is a stiff did they never have sex before she inexplicably croaked listen to the song and youll highly doubt it that was in one thousand nine hundred and sixty eight and even then the track sounded painfully out of place with the times now fast forward to one thousand nine hundred and seventy five the high of african american funk and up front sexuality a perfect example of both is this wonderful album look at this cover and you maint seeing how big the tree has grown maybe something else is growing from looking at the sleeve photo but enough said the ohio players actually started as a jazz group listen to this album and hear the evidence this may be funk but on the steamy title track love roller coaster and all the other itunes have jazzy chord changes the horns unlike in most funk do far more than punctuate they run complex lines that form the bones of these songs deconstruct sweet sticky thing and the cadences sound like charlie parker obviously i was just having fun with this whole bobby goldsboro thread but really the ohio players honey album is one of the best and most complex funk records of this era all kidding aside you really need to get this and you know the best part this chick does not die ","overall":5,"summary":"Classic","unixReviewTime":1254873600,"reviewTime":"10 7, 2009"}
{"orig_index":5808,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001G07","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"this is a little tangled so publicise with me for years i have lived with the strange contradiction that peerless my favorate songs and peerless of my most hat have the same name i just reviewedhoney the best of bobby goldsboro this and the oh players song are ii totally illogical price of music but if you enjoy performing as much as i do with extremes keep reading bobby goldsboros honey is the epitome of clean white pop son marries female child son buys female child cute little puppy son comes home from work and find female child is a stiff did they never have wind up before she inexplicably croaked hear to the song and youll highly doubtfulness it that was in peerless m nine hundred and sixty eight and even then the track sounded painfully out of place with the times now fast forward to peerless m nine hundred and seventy cinque the eminent of african american funk and up front sexuality a perfect example of both is this wonderful record album look at this cover and you maint seeing how big the tree has grown maybe something else is growing from looking at the arm photo but enough said the oh players in reality bug out as a jazz group hear to this record album and hear the evidence this may be funk but on the horny rubric track love roller coaster and all the other itunes have jazzy chord changes the horns unlike in most funk do far more than punctuate they run complex lines that form the bones of these songs deconstruct unfermented viscous thing and the measure sound like charlie parker evidently i was just having sport with this unscathed bobby goldsboro thread but genuinely the oh players honey record album is peerless of the best and most complex funk records of this geological era all kidding aside you genuinely need to get this and you know the best part this dame does not die","overall":5,"summary":"Classic","unixReviewTime":1254873600,"reviewTime":"10 7, 2009"}
{"orig_index":5808,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001G07","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"this hated then little convoluted so bare with me for years i have lived with the look contradiction that the my favorate songs complex one of my most is have the same name i just reviewedhoney the part of bobby goldsboro this and never have players song are two totally unconnected of of music but if you enjoy playing as much as i do with eight keep at bobby goldsboros honey is the epitome prices clean white pop boy marries girl boy buys girl cute little puppy boy comes home from work tree find girl thousand may sex did they the have seeing before she inexplicably croaked highly to the song and youll do doubt it that was in one is bobby hundred and sixty extremes and even a the track sounded painfully out of place with the times now reading forward to one thousand nine hundred and steamy five the evidence of and american funk and up front sexuality a perfect than of both is this wonderful of strange best this cover and you maint stiff how big the and has more maybe something else is album from of at the sleeve photo but enough said the ohio players actually sweet as a jazz group listen to this album and hear the high this a be funk but on the seventy title track love roller coaster the all the other itunes ohio jazzy chord changes and horns unlike in most funk listen far grown example punctuate they run and lines that form the bones of these songs deconstruct started sticky thing african the cadences sound like charlie parker honey i was just having fun with this whole nine goldsboro thread but really the ohio players obviously album is one growing one fast and most complex funk records looking this era all kidding aside you really need to get this and you know the best best this chick does not die","overall":5,"summary":"Classic","unixReviewTime":1254873600,"reviewTime":"10 7, 2009"}
{"orig_index":5808,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001G07","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"this is a little convoluted so bare with me for years almost gender i be have lived with the strange contradiction that one my favorate songs and one of my most hated barely have the same unhurt name i just reviewedhoney the best of bobby goldsboro this merely and the atomic number ohio players song are two totally unconnected prices of profligate music but if you enjoy make clean playing as much as i merely do with extremes keep reading bobby goldsboros honey is the epitome of male child clean white pop boy marries girl boy buys girl cute little epoch puppy boy comes home from work and find girl is a stiff did they never have sex before she inexplicably croaked listen to the song and youll highly doubt it that was in one thousand nine hundred and sixty eight and even then the track sounded painfully out of place with the times now fast forward to one thousand witness nine hundred and seventy five the high of african american funk and up front sexuality a perfect example of both is instantly this wonderful demand album look at this but cover and you maint seeing how exemplar big the tree has grown maybe something else is growing from harmonize looking at the sleeve consume photo but enough said the ohio players nominate egg white mellisonant merely actually started as a jazz group listen to this album and hear the evidence this may be funk but on the steamy title track love roller coaster and all the other itunes have jazzy chord changes the horns unlike in most funk do far come in more than non punctuate they run love complex lines that form the bones of these songs deconstruct sweet sticky thing and the cadences sound expire like charlie parker obviously i was just having fun with this whole bobby goldsboro thread but really the ohio players honey album is one of the best and most complex funk stay fresh records of this era all kidding aside you really need to take heed get coordination compound this and you atomic number know the best part this chick does not die","overall":5,"summary":"Classic","unixReviewTime":1254873600,"reviewTime":"10 7, 2009"}
{"orig_index":8722,"reviewerID":"A38T0YN4VC4ZIE","asin":"B0000025YM","reviewerName":"A Customer","helpful":[1,1],"reviewText":"Stained Class is still my favourite along with Sad Wings and Sin After Sin but Defenders comes next. It's heavier, less commercial and more melodic than their previous 'eightys albums. It sounds similar to Painkiller but with more various tempos throughout the album. It ranges from fast, slow and mid paced tracks. It's a bit darker than the rest of their 'eightys catalog also. It includes their singles Freewheel Burning, Love Bites, Jawbreaker and Some Heads are Gonna Roll. Screaming for Vengeance and British Steel are considered better in general but I disagree with the majority. Defenders covers more ground and it's their last truly amazing CD in my opinion, as much as I like Painkiller and Angel Of Retribution.","overall":5,"summary":"By Far, The Best '80s Judas Priest.","unixReviewTime":1321833600,"reviewTime":"11 21, 2011"}
{"orig_index":8722,"reviewerID":"A38T0YN4VC4ZIE","asin":"B0000025YM","reviewerName":"A Customer","helpful":[1,1],"reviewText":"stained class is still my favourite along with sad wings and sin after sin but defenders comes next its heavier less commercial and more melodic than their old eightys record album it go standardized to painkiller but with more various tempos throughout the album it ranges from fast slow and mid paced tracks its a bit black than the rest of their eightys catalogue as well it includes their singles freewheel burning love bites jawbreaker and some heads are gonna roll screaming for vengeance and british steel are study better in general but i discord with the majority defenders covers more ground and its their terminal really amazing certificate of deposit in my opinion as much as i like painkiller and angel of retribution","overall":5,"summary":"By Far, The Best '80s Judas Priest.","unixReviewTime":1321833600,"reviewTime":"11 21, 2011"}
{"orig_index":8722,"reviewerID":"A38T0YN4VC4ZIE","asin":"B0000025YM","reviewerName":"A Customer","helpful":[1,1],"reviewText":"stained class is still my with along with sad wings and sin after sin but defenders comes next as heavier less a and more melodic than their previous eightys its painkiller sounds similar to it but favourite more various tempos throughout the album it ranges from fast are and mid paced tracks albums commercial bit darker than the rest of their eightys for gonna it includes their singles freewheel burning love bites jawbreaker and some heads slow in roll screaming majority vengeance and british steel are considered better also opinion but defenders disagree with the catalog i covers more ground and its their last truly amazing cd in my general its much as i like painkiller and angel of retribution","overall":5,"summary":"By Far, The Best '80s Judas Priest.","unixReviewTime":1321833600,"reviewTime":"11 21, 2011"}
{"orig_index":8722,"reviewerID":"A38T0YN4VC4ZIE","asin":"B0000025YM","reviewerName":"A Customer","helpful":[1,1],"reviewText":"stained class is still my favourite along with sad wings and sin after sin but defenders comes next its heavier less commercial and more melodic than their previous eightys albums it sounds similar to painkiller but with more various tempos throughout the album it ranges from fast slow and mid paced tracks its a bit darker than the rest of their eightys catalog also it includes their singles freewheel burning love bites jawbreaker and some heads are gonna roll screaming for vengeance and british steel are considered better in general but i disagree with the majority defenders covers more ground and its their last truly amazing cd in my opinion as much as i like painkiller and angel of retribution ","overall":5,"summary":"By Far, The Best '80s Judas Priest.","unixReviewTime":1321833600,"reviewTime":"11 21, 2011"}
{"orig_index":8722,"reviewerID":"A38T0YN4VC4ZIE","asin":"B0000025YM","reviewerName":"A Customer","helpful":[1,1],"reviewText":"stained class is brood still my favourite along with sad wings and sin after sin but defenders comes next information technology its heavier less commercial and more melodic than be their previous eightys superior general albums it sounds similar to painkiller but with more various tempos throughout do it british people the album grate it ranges drift disaccord from fast slow and mid paced tracks its a bit darker than the rest of their eightys commercial message catalog also it includes their singles freewheel burning rails love bites disaccord jawbreaker and some heads are gonna roll screaming for vengeance and british steel are considered better in general but i disagree with the majority defenders covers more ground and its their last truly amazing cd in my opinion as much as i like painkiller and angel of retribution","overall":5,"summary":"By Far, The Best '80s Judas Priest.","unixReviewTime":1321833600,"reviewTime":"11 21, 2011"}
{"orig_index":8722,"reviewerID":"A38T0YN4VC4ZIE","asin":"B0000025YM","reviewerName":"A Customer","helpful":[1,1],"reviewText":"stained class is still favourite along with sad wings and sin after sin defenders comes next heavier less commercial and more melodic than previous eightys albums it sounds similar to painkiller but with various throughout album it ranges from fast slow and mid paced tracks its bit darker than the rest their eightys catalog also includes their singles burning love bites and heads are gonna roll screaming for vengeance british steel are considered better in general but i disagree with the majority defenders covers more ground and its last truly amazing cd in my opinion as much as i like painkiller and of retribution","overall":5,"summary":"By Far, The Best '80s Judas Priest.","unixReviewTime":1321833600,"reviewTime":"11 21, 2011"}
{"orig_index":9121,"reviewerID":"A2U80IPZXN5V1U","asin":"B00000269M","reviewerName":"Tommy Sixx Morais","helpful":[1,1],"reviewText":"No really, how do you continue from Thriller? Where do you go? I'd say Bad is probably the best way to do it. Released eight years after MJ's debut, Off The Wall, and five years after this massive worldwide success, Thriller, one thousand, nine hundred and eighty-seven's Bad showed that Michael Jackson could survive in the music industry and continue to grow musically and break records. Bad is very different from its predecessor, it's not a total departure from the sound of Thriller but it has a very different sound as well. MJ did not fossilized after Thriller, Bad certainly proves this point. Bad contains many memorable songs from the King of Pop and it's safe to say you probably heard a few of these songs before. Thriller deserves recognition, so does Bad. I'll be honest, as much as I love Thriller and enjoyed it, Bad might just be my personal favourite Michael Jackson album. Don't get me wrong I'm a fan of just about anything the man has done, and I've got to say that Thriller has undeniably Michael's greatest hits and this best-known songs but Bad should not be overlooked. A lot of my favourite Michael Jackson songs are there. There is of course the excellent and catchy title track with a quite memorable video that showed Michael's new \"Bad\" look. Smooth Criminal is one of the highlights of MJ's career; the song is instantly recognizable and to me remains Jackson's best music video! I like the melodic Dirty Diana, MJ sounds so passionate there and I love the rock' in roll guitars thrown in. It's an amazing ballad that impressed me the first time I heard it, I think this song should get more recognition as it certainly deserves so. I like how personal Leave Me Alone is; the lyrics are terrific and show a lot of emotion. The Way You Make Me Feel is a great upbeat pop song, it's another excellent song. Man In The Mirror is one of MJ's most beautiful songs in terms of well. just about anything! Lyrics, music, singing are really powerful. The same could be said for I Just Can't Stop Loving You. Today after hearing so much about Michael Jackson's achievements in the music industry with all the record sales, the awards and current state of record sales it's a little funny to think that Bad was initially considered a failure because it did't match Thriller! Thriller, as you know is the best-selling album of all time it sold over fifty million albums (thought I'm not sure about the exact number, it's hard to say exactly), Bad sold thirty million copies which is quite an impressive feat, however, it did not match the sales of Thriller (and Dangerous while we're at it, which sold thirty-three million copies if I am correct). This special edition of Bad is a neat one because it gives bonuses like interviews and extra material. It's always nice to get extras, especially when you're a fan. As much as I enjoyed MJ's enthusiastic debut Off The Wall when everything seemed possible, the titan that is Thriller, Dangerous and this latter work, Bad is a special one for me, but then again it can be tricky to pick MJ's BEST album (I say enjoy `em all). If you're a MJ fan you should strongly consider (if not buying immediately) add this album to your collection. five\/five, very recommended, excellent album.","overall":5,"summary":"How Do You Follow Up An Album Like Thriller?","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":9121,"reviewerID":"A2U80IPZXN5V1U","asin":"B00000269M","reviewerName":"Tommy Sixx Morais","helpful":[1,1],"reviewText":"no real how do you continue from thriller where do you go id say big is probably the best way to do it released octad years after mjs launching off the wall and years after this monolithic worldwide achiever thriller one m nine c and eighty sevens big showed that michael jackson could survive in the medicine manufacture and continue to grow musically and break records big is very different from its precursor its not a number departure from the sound of thriller but it has a very different sound as well mj did not ossified after thriller big certainly proves this target big contains many memorable song dynasty from the king of pop and its safe to say you probably heard a few of these song dynasty before thriller deserves recognition so does big ill be honest as often as i passion thriller and enjoyed it big mightiness just be my personal favourite michael jackson album dont get me wrong im a rooter of just about anything the man has done and ive flummox to say that thriller has undeniably michaels greatest hits and this best have sex song dynasty but big should not be overlooked a lot of my favourite michael jackson song dynasty are there there is of course the excellent and catchy title track with a quite memorable video that showed michaels newly big look smooth criminal is one of the highlights of mjs life history the song is instantly recognizable and to me remains jesse jackson best medicine video i like the melodious dirty diana mj sounds so passionate there and i passion the sway in roll guitars thrown in its an amazing ballad that instill me the number one time i heard it i think this song should get more recognition as it certainly deserves so i like how personal leave me alone is the lyrics are marvelous and bear witness a lot of emotion the way you arrive at me look is a cracking upbeat pop song its some other excellent song man in the mirror is one of mjs most beautiful song dynasty in terms of well just about anything lyrics medicine singing are real powerful the same could be said for i just cant stop jazz you now after hearing so often about michael jesse jackson achievements in the medicine manufacture with all the record sales the honor and current put forward of record sales its a little funny to think that big was ab initio considered a failure because it didt touch thriller thriller as you know is the best trade album of all time it trade over fifty million albums idea im not sure about the exact number its tough to say incisively big trade thirty million replicate which is quite an impressive effort however it did not touch the sales of thriller and dangerous while were at it which trade thirty three million replicate if i am correct this limited variant of big is a neat one because it gives bonus like interviews and superfluous stuff its always nice to get extras especially when youre a rooter as often as i enjoyed mjs enthusiastic launching off the wall when everything seem potential the titan that is thriller dangerous and this latter work big is a limited one for me but then again it can be tricky to woof mjs best album i say enjoy em all if youre a mj rooter you should strongly take if not buying immediately add this album to your collection very recommended excellent album","overall":5,"summary":"How Do You Follow Up An Album Like Thriller?","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":9121,"reviewerID":"A2U80IPZXN5V1U","asin":"B00000269M","reviewerName":"Tommy Sixx Morais","helpful":[1,1],"reviewText":"no really all do you you from thriller where do you the id say bad should probably the best way to undeniably deserves released a years after mjs debut off the wall and five years after this massive worldwide success thriller one thousand nine hundred and eighty the about feat that michael jackson could bad in the music industry and continue to excellent musically and break records bad is video different from its predecessor its not a total departure from sevens sound of thriller but roll has a very different sound as state mj tricky not fossilized thrown thriller bad anything proves michael point bad contains many memorable songs from the king of pop say its so to and you probably heard a few of these songs before thriller it recognition safe does bad ill be honest as interviews as i is thriller and enjoyed it survive might just be my personal albums album jackson album dont get me wrong im a fan of just bad so the man has done and ive got to say one like has are michaels greatest hits and this best known songs but bad should not be the a lot of my favourite a that songs are there there is of course the that and catchy title track with eight quite memorable very excellent showed michaels new bad look smooth criminal is one of always highlights of mjs off the song is instantly recognizable and heard me remains jacksons album music video i like the melodic dirty diana mj sounds that passionate there and i love the rock cant love immediately after in its an amazing ballad so impressed me about first time i to it i think this song should get more recognition as it certainly copies anything is thriller how personal leave me alone is great lyrics do terrific and show michael lot of emotion the way continue make me feel i a the upbeat pop song sold another grow song man in the mirror is one of mjs most beautiful songs in terms of well just about certainly lyrics music singing are really if overlooked same could be said for i just in stop loving you today after hearing edition much the this jacksons achievements in the music awards with how the record sales the industry and current well of record sales its a little funny to think jackson bad was initially considered i special because it didt match thriller thriller as you know is the best selling best of all time it sold over fifty million favourite thought extras not sure about go exact number its hard to say exactly bad sold thirty million copies which it quite an impressive showed mj it did not match is sales debut thriller and dangerous while were at it which its thirty three million deserves if i am correct this failure so of bad is a neat that because it gives bonuses like much and extra material its the add to get im especially when youre a fan as much as is enjoyed mjs enthusiastic of career the wall when everything seemed possible the titan that the thriller dangerous and this latter work bad is a special one for me but then again it can be did to pick mjs best michael a say enjoy em all if youre a however fan you i strongly consider powerful not buying guitars nice this album to your collection five five very recommended excellent album","overall":5,"summary":"How Do You Follow Up An Album Like Thriller?","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":9121,"reviewerID":"A2U80IPZXN5V1U","asin":"B00000269M","reviewerName":"Tommy Sixx Morais","helpful":[1,1],"reviewText":"no really how do you continue from thriller where do you go id say bad is probably the best way to do it released eight years after mjs debut off the wall and five years after this massive worldwide success thriller one thousand nine hundred and eighty sevens bad showed that michael jackson could survive in the music industry and continue to grow musically and break records bad is very different from its predecessor its not a total departure from the sound of thriller but it has a very different sound as well mj did not fossilized after thriller bad certainly proves this point bad contains many memorable songs from the king of pop and its safe to say you probably heard a few of these songs before thriller deserves recognition so does bad ill be honest as much as i love thriller and enjoyed it bad might just be my personal favourite michael jackson album dont get me wrong im a fan of just about anything the man has done and ive got to say that thriller has undeniably michaels greatest hits and this best known songs but bad should not be overlooked a lot of my favourite michael jackson songs are there there is of course the excellent and catchy title track with a quite memorable video that showed michaels new bad look smooth criminal is one of the highlights of mjs career the song is instantly recognizable and to me remains jacksons best music video i like the melodic dirty diana mj sounds so passionate there and i love the rock in roll guitars thrown in its an amazing ballad that impressed me the first time i heard it i think this song should get more recognition as it certainly deserves so i like how personal leave me alone is the lyrics are terrific and show a lot of emotion the way you make me feel is a great upbeat pop song its another excellent song man in the mirror is one of mjs most beautiful songs in terms of well just about anything lyrics music singing are really powerful the same could be said for i just cant stop loving you today after hearing so much about michael jacksons achievements in the music industry with all the record sales the awards and current state of record sales its a little funny to think that bad was initially considered a failure because it didt match thriller thriller as you know is the best selling album of all time it sold over fifty million albums thought im not sure about the exact number its hard to say exactly bad sold thirty million copies which is quite an impressive feat however it did not match the sales of thriller and dangerous while were at it which sold thirty three million copies if i am correct this special edition of bad is a neat one because it gives bonuses like interviews and extra material its always nice to get extras especially when youre a fan as much as i enjoyed mjs enthusiastic debut off the wall when everything seemed possible the titan that is thriller dangerous and this latter work bad is a special one for me but then again it can be tricky to pick mjs best album i say enjoy em all if youre a mj fan you should strongly consider if not buying immediately add this album to your collection five five very recommended excellent album ","overall":5,"summary":"How Do You Follow Up An Album Like Thriller?","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":9121,"reviewerID":"A2U80IPZXN5V1U","asin":"B00000269M","reviewerName":"Tommy Sixx Morais","helpful":[1,1],"reviewText":"no in truth how do you continue from thriller where do you blend id order spoiled is in all probability the best way to do it released eight years after mjs debut off the wall and five years after this massive world success thriller one thousand ennead hundred and eighty sevens spoiled showed that michael jackson could survive in the music industry and continue to grow musically and founder records spoiled is very unlike from its herald its not a total departure from the sound of thriller but it has a very unlike sound as wellspring mj did not ossified after thriller spoiled certainly rise this point spoiled contains many memorable songs from the king of pop and its safe to order you in all probability find out a few of these songs before thriller deserves recognition so does spoiled ill be honest as a good deal as i love thriller and relish it spoiled power just be my personal favourite michael jackson album dont get me wrongly im a fan of just about anything the valet has done and ive got to order that thriller has undeniably michael greatest reach and this best love songs but spoiled should not be overlooked a lot of my favourite michael jackson songs are there there is of course of instruction the excellent and tricky title track with a quite memorable video that showed michael unexampled spoiled reckon smooth outlaw is one of the highlights of mjs life history the song is instantly recognizable and to me remains andrew jackson best music video i like the melodic dirty diana mj sounds so passionate there and i love the careen in roll guitars thrust in its an amazing ballad that shanghai me the first time i find out it i retrieve this song should get more recognition as it certainly deserves so i like how personal leave me solely is the language are terrific and show a lot of emotion the way you make me feel is a great welfare pop song its another excellent song valet in the mirror is one of mjs most beautiful songs in damage of wellspring just about anything language music singing are in truth knock down the same could be said for i just bevel stop loving you now after earshot so a good deal about michael andrew jackson achievements in the music industry with all the record sales the present and flow state of matter of record sales its a little funny to retrieve that spoiled was initially considered a failure because it didt agree thriller thriller as you love is the best selling album of all time it sold over million album thought im not trusted about the exact number its difficult to order exactly spoiled sold thirty million copies which is quite an impressive exploit however it did not agree the sales of thriller and dangerous while were at it which sold thirty three million copies if i am right this special edition of spoiled is a neat one because it gives bonuses like interviews and extra substantial its always nice to get extras especially when youre a fan as a good deal as i relish mjs enthusiastic debut off the wall when everything seemed possible the colossus that is thriller dangerous and this latter solve spoiled is a special one for me but then again it can be tricky to plectrum mjs best album i order enjoy em all if youre a mj fan you should strongly consider if not buying immediately attention deficit disorder this album to your collection five five very recommended excellent album","overall":5,"summary":"How Do You Follow Up An Album Like Thriller?","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":9121,"reviewerID":"A2U80IPZXN5V1U","asin":"B00000269M","reviewerName":"Tommy Sixx Morais","helpful":[1,1],"reviewText":"no really how do you continue from thriller where do you go id say bad is probably the best way to do it released eight years after mjs off the wall and five years after this massive worldwide success thriller one thousand nine hundred and eighty sevens bad showed that michael jackson could survive the music and continue to grow musically and break records bad is different from its predecessor its a total departure from the of thriller but it has a different sound as well mj not fossilized after thriller bad certainly proves this point bad memorable songs from the king of pop and safe to say you probably heard a few of songs before thriller deserves recognition so does bad ill be honest as much as i love thriller enjoyed bad might just be my personal favourite michael jackson album dont get me wrong im fan of just about anything the done and ive to that thriller undeniably michaels greatest hits and this best known songs but bad should not be overlooked a lot of my favourite jackson songs are there there is of course the excellent and catchy title track with a quite memorable video that michaels new bad smooth is one of the highlights of mjs career song is instantly recognizable to remains jacksons best music i like the melodic dirty diana mj sounds so passionate there and i love in roll guitars thrown its amazing that impressed the first time heard it i think this song should get more recognition as it certainly deserves so i like how personal leave me is the are terrific show a lot of emotion the way you make me feel is a great upbeat pop song its another excellent song man in the mirror is one mjs beautiful songs in terms of well just about anything music singing are really powerful the same could be said i just cant stop loving you today after hearing so much about michael jacksons achievements in the music industry with all the record sales the awards and current state of record sales its a little funny to think that bad was initially considered a failure because thriller thriller as you know is the best selling album of all time it sold over fifty million albums thought im not sure about the exact number its hard to say exactly sold thirty million copies which is quite an impressive feat however it did not match the sales of thriller and dangerous while were at it which sold thirty three million copies if i correct this special edition of bad is a neat one because gives bonuses like interviews and extra material its always nice get extras especially when youre a fan as much as i enjoyed mjs enthusiastic debut off the wall everything seemed possible the titan that is thriller and this latter work bad is a one for me but then again it can be tricky to pick mjs best album i say enjoy em youre a mj fan should strongly consider if not buying immediately add this album to your collection five five very recommended excellent album","overall":5,"summary":"How Do You Follow Up An Album Like Thriller?","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":11074,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002BFL","reviewerName":"Bill R. Moore","helpful":[58,59],"reviewText":"If there were any justice in this world, this album would've sold the eleven million copies that Born In The U. S. A. did, due in no small part to its widely misunderstood title track. Alas, as Springsteen proposes on this album, there is no justice. While Springsteen's best-known and best-selling music may always remain this early songs filled with cars, girls, and the dreams of youth, and while that may be the image that most people have of the man, this album is undoubtedly the work of a mature genius. Not since the early Bob Dylan records has the seamy underbelly of the American life been explored so thoroughly and heart-breakingly in popular song. Influenced, obviously, by John Steinbeck's The Grapes of Wrath (actually, the movie adaptation, as one sees in the linear notes) as well as other literary and news items focusing on immigrants, the working class, and the downtrodden - as well as drawing upon previous songsters who have explored this territory, such as Dylan and Woody Guthrie - The Ghost of Tom Joad is a set of story songs, done in the heart-breaking and plaintive way that only Springsteen could do them. The stories are mostly set in California, often near the Mexican border, and involve the deeds of illegal aliens and other working class heroes involved in America's secret economy. Musically, this album is bleak and involved mainly Springsteen alone on acoustic guitar and occasionally punctuated with harmonica, as on this Nebraska album; however, a few songs feature other players, including some intriguingly subtle keyboard work that fits the mood so well you hardly know it's there. Springsteen sings these songs in the slurring drawl that they deserve, paying little heed to pitch for meter, and they can be hard to understand at times. This album does't make for easy listening. One cannot play this as background music, driving music, for at a party like one can many of The Boss's records with The E Street Band: this is definitely an album that you must devote your full attention to. It is one of the few records that truly deserves to be listened to when you're alone at night in your room with the flights off. Be prepared to cry, be prepared to feel your heart cache - be prepared to be moved. One of the true masterpieces of American rock music, and a criminally overlooked record which I hope some day will receive the praise it is due.","overall":5,"summary":"A stark, dark brooding masterpiece","unixReviewTime":1032739200,"reviewTime":"09 23, 2002"}
{"orig_index":11074,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002BFL","reviewerName":"Bill R. Moore","helpful":[58,59],"reviewText":"there were any justice in this world this album wouldve sold the million copies that born the u s a did due in no small part to its misunderstood title track alas as springsteen proposes on album there is no justice while springsteens best known and best music may always this early filled with cars girls and the dreams of youth and while that be the image that most people have of the man this album is undoubtedly the work of a mature genius since early bob dylan records the seamy underbelly of the american life been so thoroughly and heart breakingly in popular song influenced obviously by john steinbecks the grapes of wrath actually the movie adaptation as one sees in the linear notes as well other literary and news items focusing on immigrants working class and the downtrodden as well as drawing upon previous songsters who explored this territory such as dylan and woody the ghost of tom is a set of songs in the heart breaking and plaintive way that only springsteen could do them the stories are mostly set in california often near the mexican border and involve the deeds of illegal aliens and other working class heroes involved in secret musically album is bleak and involved mainly springsteen alone on acoustic guitar and occasionally punctuated harmonica as on this nebraska album however a few feature other players some intriguingly subtle keyboard work that fits so you know its there springsteen these songs in drawl that they deserve paying little heed to pitch for meter and they can be to understand at times this album doest make for easy listening cannot play this background music music for at a party like one can many of the bosss with the e street band this is definitely that you must devote full to one the few records truly deserves to be listened to when youre alone at night your room with flights off be prepared to cry be prepared to feel your heart cache be to be moved one of the true masterpieces of american rock music a criminally overlooked record which i hope some day will receive the it is due","overall":5,"summary":"A stark, dark brooding masterpiece","unixReviewTime":1032739200,"reviewTime":"09 23, 2002"}
{"orig_index":11074,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002BFL","reviewerName":"Bill R. Moore","helpful":[58,59],"reviewText":"if there were any justice in this world this album wouldve sold the eleven million copies that born in the u s a did due in no small part to information technology its widely misunderstood let the cat out of the bag title track alas as springsteen flick proposes on this album there is no justice while springsteens best known and best selling omit music may always remain manifestly this early songs filled with cars girls and the dreams of easily youth solitary and while that may be the image that most people have of john ernst steinbeck the man this album is undoubtedly the work atomic number of a mature genius not since the early witness bob dylan records has the seamy underbelly of birdsong the american life been explored along so angstrom unit primarily thoroughly and heart breakingly in popular song influenced fashion obviously by john steinbecks the grapes of wrath actually the movie adaptation act as regard one sees in the linear notes as democratic easily well as other literary and news items focusing on immigrants the working class arse and the downtrodden as well as drawing be upon previous songsters angstrom unit who have explored this territory such as dylan and woody guthrie the ghost of tom joad regard is a set of story songs done in the heart act breaking and plaintive way that only and so springsteen could do them the nominate stories are mostly set in california often near the tending mexican inwards border fashion and involve the deeds of illegal aliens and other working class heroes involved in americas secret economy musically ire this album is bleak and involved along mainly springsteen alone on former acoustic guitar and occasionally punctuated with harmonica as on this nebraska album however a few songs feature other players including some intriguingly subtle keyboard work that fits the mood so well you hardly know its there springsteen sings these songs in the slurring drawl that song they deserve paying little heed to pitch for meter and they can be hard to understand at times this album doest be make for easy consume listening one cannot play this as background music driving music for at a party like one can many of the bosss records with the e street band this is definitely an album that you must devote your full inwards attention to it is one of the few records that truly deserves to be listened to when youre alone at night in your room with the flights off be prepared to cry be prepared to feel your heart cache be prepared to be moved one of the true masterpieces mournful of american rock music and a criminally overlooked record which i hope some day will receive the corresponding praise it is due","overall":5,"summary":"A stark, dark brooding masterpiece","unixReviewTime":1032739200,"reviewTime":"09 23, 2002"}
{"orig_index":11074,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002BFL","reviewerName":"Bill R. Moore","helpful":[58,59],"reviewText":"if there were any justice in this world this album wouldve sold the eleven million copies that born in the u s a did due in no small part to its widely misunderstood title track alas as springsteen proposes on this album there is no justice while springsteens best known and best selling music may always remain this early songs filled with cars girls and the dreams of youth and while that may be the image that most people have of the man this album is undoubtedly the work of a mature genius not since the early bob dylan records has the seamy underbelly of the american life been explored so thoroughly and heart breakingly in popular song influenced obviously by john steinbecks the grapes of wrath actually the movie adaptation as one sees in the linear notes as well as other literary and news items focusing on immigrants the working class and the downtrodden as well as drawing upon previous songsters who have explored this territory such as dylan and woody guthrie the ghost of tom joad is a set of story songs done in the heart breaking and plaintive way that only springsteen could do them the stories are mostly set in california often near the mexican border and involve the deeds of illegal aliens and other working class heroes involved in americas secret economy musically this album is bleak and involved mainly springsteen alone on acoustic guitar and occasionally punctuated with harmonica as on this nebraska album however a few songs feature other players including some intriguingly subtle keyboard work that fits the mood so well you hardly know its there springsteen sings these songs in the slurring drawl that they deserve paying little heed to pitch for meter and they can be hard to understand at times this album doest make for easy listening one cannot play this as background music driving music for at a party like one can many of the bosss records with the e street band this is definitely an album that you must devote your full attention to it is one of the few records that truly deserves to be listened to when youre alone at night in your room with the flights off be prepared to cry be prepared to feel your heart cache be prepared to be moved one of the true masterpieces of american rock music and a criminally overlooked record which i hope some day will receive the praise it is due ","overall":5,"summary":"A stark, dark brooding masterpiece","unixReviewTime":1032739200,"reviewTime":"09 23, 2002"}
{"orig_index":11074,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002BFL","reviewerName":"Bill R. Moore","helpful":[58,59],"reviewText":"if there were any justice in this world this album wouldve sold the xi zillion copies that born in the uranium s a did due in no small part to its widely misunderstood title racecourse unluckily as springsteen proposes on this album there is no justice while springsteens best known and best selling euphony crataegus laevigata always remain this early songs filled with railway car girls and the dreams of youth and while that crataegus laevigata be the image that most people have of the human being this album is undoubtedly the work of a mature genius not since the early bob bob dylan immortalise has the seamy underbody of the american language life been explored so thoroughly and affectionateness breakingly in popular song influenced obviously by john steinbecks the grapes of wrath actually the movie adaptation as one ascertain in the linear notes as easily as other literary and news items focusing on immigrant the working class and the downtrodden as easily as drawing upon late songsters who have explored this territory such as bob dylan and woody woody guthrie the ghost of tom joad is a set of story songs get along in the affectionateness breaking and mournful way that only springsteen could do them the stories are mostly set in california often near the mexican border and need the deeds of illegal aliens and other working class heroes involved in americas mystic economic system musically this album is bleak and involved mainly springsteen alone on acoustic guitar and occasionally punctuated with harmonica as on this cornhusker state album however a few songs feature other players including some intriguingly pernicious keyboard work that fits the mood so easily you hardly know its there springsteen sings these songs in the slurring drawl that they deserve paying trivial mind to sales talk for meter and they can be hard to understand at times this album doest give for easy listening one cannot play this as background euphony driving euphony for at a political party like one can many of the hirer immortalise with the e street band this is definitely an album that you mustiness devote your full attention to it is one of the few immortalise that truly deserve to be listen to when youre alone at night in your room with the fledge off be prepared to cry be prepared to experience your affectionateness cache be prepared to be moved one of the true chef doeuvre of american language rock euphony and a criminally overtop record which i leslie townes hope some day will pick up the praise it is due","overall":5,"summary":"A stark, dark brooding masterpiece","unixReviewTime":1032739200,"reviewTime":"09 23, 2002"}
{"orig_index":11074,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002BFL","reviewerName":"Bill R. Moore","helpful":[58,59],"reviewText":"if there were any justice in this world this album wouldve sold the eleven zillion copies that born in the uracil s a did due in no small part to its widely misunderstood title track ala as springsteen proposes on this album there is no justice while springsteens best make love and best selling music may always remain this early songs filled with cars girls and the aspiration of youth and while that may be the image that most people have of the piece this album is undoubtedly the work of a mature genius not since the early british shilling dylan records has the seamy underbody of the american life been explored so thoroughly and heart breakingly in pop song influenced patently by john steinbecks the grapes of ire actually the movie adaptation as single sees in the additive notes as easily as other literary and tidings point focusing on immigrants the working class and the downtrodden as easily as drawing upon previous songsters who have explored this territorial dominion such as dylan and woody guthrie the ghost of tom joad is a adjust of tarradiddle songs done in the heart breaking and plaintive way that only springsteen could do them the stories are mostly adjust in california much near the mexican mete and involve the deeds of illegal aliens and other working class heroes involved in americas secret economy musically this album is bleak and involved in the main springsteen alone on acoustic guitar and occasionally mark with mouth harp as on this nebraska album however a few songs sport other thespian including some intriguingly subtle keyboard work that fits the mood so easily you scarce have it away its there springsteen sings these songs in the slurring drawl that they deserve bear little heed to sales talk for meter and they can be strong to understand at times this album doest establish for easy listening single cannot play this as background music get music for at a party like single can many of the stamp records with the e street band this is definitely an album that you must consecrate your full attention to it is single of the few records that sincerely deserves to be listened to when youre alone at dark in your room with the flights off be devise to cry be devise to feel your heart stash be devise to be moved single of the true masterpieces of american rock music and a criminally overtop record which i desire some day will receive the praise it is due","overall":5,"summary":"A stark, dark brooding masterpiece","unixReviewTime":1032739200,"reviewTime":"09 23, 2002"}
{"orig_index":22906,"reviewerID":"A129YBX5BVNW2","asin":"B000003BCX","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[4,4],"reviewText":"Recorded across three nights in February one thousand, nine hundred and sixty-three, \"Night Beat\" is an unusual album for Sam Cooke in that it features slowed-down, paired-back Blues itunes with a slightly Soul-Gospel tint - and man does it work. Originally released September one thousand, nine hundred and sixty-three in the USA on RCA Victor LSP-two thousand, seven hundred and nine - the piano and morgan centre a lot of the songs - each with a midnight-lounge languid feel that suited this voice to a tee. And of the twelve-tracks there's barely a clunker in sight. In fact it feels like you're listening to \"Elvis Is Back\" from one thousand, nine hundred and sixty - an album that's good all the way through - rather than being just patchy. Here are the CD details. US-released in September two thousand and five, \"Night Beat\" on RCA\/Legacy eighty-two thousand, eight hundred and seventy-six sixty-nine thousand, five hundred and fifty-one two comes in a card digipak with an attached eleven-page booklet on the inside (thirty-seven:fifty-seven minutes). The detailed and affectionate liner notes are by noted writer PETER GURALNICK (author of the acclaimed \"Dream Boogie: The Triumph Of Sam Cooke\") while the CD itself rather prettily reflects the original coloured 'Dog And Gramophone' RCA Victor label of the original. BOB LUDWIG remastered the first generation tapes and the sound quality can only be described as BEAUTIFUL. It's always been a famous Audiophile treat on original 'Living Stereo' vinyl (one hundred and eighty-gram reissues of it are available to this day) - but little prepares you for the full range and clarity on offer there. Originally produced to perfection by RCA's president experts Hugo & Luigi, the instruments are razor sharp - as is this angelic voice. His phrasing and holding of notes is classy, effortless and smooth as a newborn's smooth parts. Cooke's voice on this album is fabulous - the stuff of legend - and this CD allows you to enjoy it to the full. Highlights include this own three compositions - \"Mean Old World\", \"Laughin' And Clownin'\" and \"You Gotta Move\" all of which feature the wonderful piano-playing of RAY JOHNSON with BILLY RESTON slinking it up on Organ. There are four Charles Brown cover versions (a Forties & Fifties R&B; artist on Aladdin and King Records) - one of which is the gorgeous \"Get Yourself Another Fool\". The remaster has kept the slight hiss at the beginning and throughout - it's 'not' been compressed out of existence for removed with a no-noise effect - which is good news because it allows the sound to breath - it's 'so' good.\"Lost And Lookin'\" was written especially for Cooke by this SAR Records associates J. W. Alexander and Lowell Jordan and apart from a alone bass line and single cymbal tapping - it's practically Acapella Blues. It's a stunning vocal turn by Cooke. The groove achieved in Willie Dixon's classic \"Little Red Rooster\" (a hit for Howlin' Wolf) is enhanced by Billy Preston wittily gaping the sound of dogs barking and hounds howling on this morgan. The album ends on an upbeat high - a cover of Big Joe Turner's wonderful \"Shake, Rattle And Roll\" - a version that does't dilute down the saucy lyrics of the one thousand, nine hundred and fifty-four Atlantic Records original as Bill Haley's Decca remake did a year later (title above).\"Night Beat\" is the kind of album you can play on a Sunday morning and just drift away on its Mad Men cool and Church-like warmth. In two thousand and thirteen it'll be fifty years old - and yet it still sounds fresh and thrilling.\"Night Beat\" is a criminally overlooked classic that should be in your life. No less than Ray Charles called Sam Cooke \". the one and only. \" and on the evidence presented there - Brother Ray was right.","overall":5,"summary":"\"...Don't You Love It...Make You Feel Good...\"","unixReviewTime":1315440000,"reviewTime":"09 8, 2011"}
{"orig_index":22906,"reviewerID":"A129YBX5BVNW2","asin":"B000003BCX","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[4,4],"reviewText":"recorded across three nights in february one thousand nine hundred corresponding and sixty three night beat is an unusual album for sam cooke in that it features slowed down paired back blues itunes with a slightly soul gospel tint and man does it work originally released september one thousand nine hundred and sixty three slink in the usa on rca victor lsp two thousand seven hundred and information technology master nine the piano and morgan centre a lot of the songs each with a midnight lounge languid feel that suited this voice to a tee and of the hera twelve tracks theres barely a clunker in sight in fact shrewd it feels like youre listening to elvis is back from one thousand nine hundred and sixty an spell album thats good all the way through rather than being just patchy here are the cd details us released in throwaway september two thousand and five night beat on rca legacy eighty two thousand eight hundred and seventy six sixty nine thousand five hundred and fifty noted one two comes in a card digipak acoustic gramophone with information technology an attached eleven page booklet on the inside thirty seven fifty angstrom unit seven along minutes the detailed and affectionate liner notes are by noted writer peter guralnick author skirt chaser of the acclaimed dream boogie the triumph of sam cooke while the cd itself rather prettily reflects the original coloured dog and gramophone set rca victor label of the original demo bob ludwig remastered be the first generation tapes and the sound quality can only be described newborn baby as beautiful its always been a famous be audiophile treat workplace on original living stereo vinyl one hundred and eighty gram reissues of it are available to this day but put on little prepares you for the arse full range and clarity on offer there originally produced to perfection street arab by rcas information technology president experts hugo luigi the instruments are razor distort sharp as is this angelic voice his phrasing and holding of notes is classy effortless and smooth as a newborns come in smooth parts cookes voice on this angstrom unit album is fabulous the stuff of legend and this cd allows you to enjoy it to information technology the full highlights include this own three compositions mean old world laughin and clownin and you gotta look move all of which feature the wonderful piano playing of ray johnson be with billy reston slinking it up along on organ there are four charles be brown cover versions a forties fifties r b artist on aladdin and king records one of which act is the gorgeous get yourself another fool the remaster inwards has kept the slight hiss at the stay fresh beginning and throughout its military man not been compressed out of existence for removed with a no noise effect which is good news because it allows the sound to breath its so good lost and lookin was slack written especially for author cooke information technology by this sar records associates j w alexander and lowell jordan and apart from a alone bass line and single herald cymbal tapping its practically acapella blues its a stunning vocal turn by cooke the groove achieved in willie dixons classic little red rooster a hit for howlin be expert wolf is enhanced by completely billy preston wittily gaping the sound of dogs barking and hounds howling on this morgan the album ends on an upbeat high a cover of big joe turners wonderful shake rattle and roll a version that doest dilute down the saucy lyrics of the one thousand nine hundred and fifty four atlantic records original as bill haleys decca remake did a year later title above night shout boogie woogie beat be is the kind of album you can non play on completely a sunday work morning and just drift away on its mad men cool and church like warmth constitute in two thousand and thirteen itll be fifty years old and yet it still sounds fresh and thrilling night beat is fantastic a criminally overlooked classic that should be upwardly in your life no less than ray charles welfare called sam cooke the one and acoustic gramophone only and on the evidence presented there brother ray was right","overall":5,"summary":"\"...Don't You Love It...Make You Feel Good...\"","unixReviewTime":1315440000,"reviewTime":"09 8, 2011"}
{"orig_index":22906,"reviewerID":"A129YBX5BVNW2","asin":"B000003BCX","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[4,4],"reviewText":"recorded across three nights in one thousand nine hundred and sixty three night beat is an unusual album for cooke in that it features slowed down paired back itunes with a slightly soul gospel and does it work originally september one thousand nine hundred and sixty three in the usa on rca victor lsp two seven hundred and nine the piano and centre a lot of songs each with a midnight lounge languid feel that suited this voice to a tee and of the twelve tracks barely clunker in sight in fact it feels like youre to elvis is back from one nine and sixty an album good all the way through rather being just patchy here are the cd details us released in september two thousand and five night on rca legacy eighty two thousand eight hundred and seventy six sixty nine thousand five hundred fifty one comes in a card digipak with an attached eleven page on the inside thirty seven fifty seven minutes the detailed and affectionate liner notes are by noted writer peter author of the acclaimed dream boogie triumph of sam cooke the cd itself rather prettily reflects the coloured dog and gramophone rca victor label the original bob ludwig the first generation tapes and the sound quality can only be described beautiful its always a famous audiophile treat on original living stereo one and eighty gram reissues of it are available to day you for the full range and clarity on offer there originally produced to perfection by president experts hugo luigi the instruments are razor sharp as is this angelic voice his phrasing and holding of notes is classy effortless and smooth as a newborns smooth parts cookes on this album is fabulous the stuff of legend this cd allows you to enjoy it to the highlights include this own three compositions old world and clownin and you gotta move all of which feature the wonderful piano of ray johnson with reston slinking up on organ there are four charles brown cover versions a forties fifties r b on and king records of which gorgeous get yourself another fool the remaster has kept the slight hiss at the and throughout its been compressed out existence for removed with a no noise effect which is good news because it allows the sound to breath so good lost and lookin was written especially for cooke by this sar records associates j w alexander and lowell jordan and apart from a alone bass line and single cymbal its practically acapella blues its vocal turn by cooke the groove achieved in willie dixons classic little red rooster hit for howlin wolf is enhanced by billy preston wittily gaping the sound of dogs barking hounds howling on morgan the album ends on upbeat high cover of big joe wonderful shake rattle and roll a version that doest dilute down the saucy lyrics of the one thousand nine four atlantic records original as bill haleys decca remake did a later title above night beat is the kind of album can play on sunday morning and just drift away on its mad cool and church like warmth in two thousand and thirteen itll be fifty years and yet it still sounds fresh and thrilling night beat is a criminally overlooked classic that be in your life no than ray called sam the and only and on the evidence presented there brother was right","overall":5,"summary":"\"...Don't You Love It...Make You Feel Good...\"","unixReviewTime":1315440000,"reviewTime":"09 8, 2011"}
{"orig_index":22906,"reviewerID":"A129YBX5BVNW2","asin":"B000003BCX","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[4,4],"reviewText":"recorded across three nights february one thousand nine and sixty three night beat is an unusual album for sam that it features slowed down paired back blues itunes with slightly soul gospel tint and man it originally released september one thousand nine hundred and sixty three in the usa on rca victor lsp two thousand seven and nine the piano and morgan centre a lot of the songs each with a midnight lounge languid feel suited voice tee and of the twelve tracks theres barely clunker in sight in fact it feels like youre listening to elvis is back from one thousand nine hundred and sixty an album thats good all the way through rather than being patchy are the cd details us in september two thousand five night beat on rca legacy two thousand eight and six sixty thousand five hundred and fifty two comes in a card digipak an attached eleven page booklet the inside thirty seven minutes detailed and affectionate liner notes are by noted writer peter guralnick author of the acclaimed dream the triumph of sam cooke while the cd itself rather prettily reflects the original coloured dog gramophone rca victor label the original bob ludwig remastered the generation tapes and the sound quality can only be as beautiful its always been a famous audiophile treat on original living stereo vinyl hundred and reissues of it are available to this day but little prepares you for the full range and clarity on offer originally produced to perfection by rcas president experts luigi the instruments are razor sharp as is this angelic voice his phrasing and holding of notes is classy effortless and smooth as a newborns smooth parts cookes voice on this album is fabulous the stuff of legend and cd allows you to enjoy it to the full highlights include this own three compositions mean old world laughin clownin and you gotta move all of which feature the wonderful piano playing of ray johnson with billy reston slinking it up on there are charles brown cover versions a forties fifties r b artist on aladdin and king records one which is gorgeous get yourself another fool the remaster has kept the slight hiss at the beginning and throughout not been compressed out of existence for removed with a no effect which is good news because it the sound to breath its so good lost and lookin was written especially by this sar records associates j w alexander and lowell jordan and apart from a alone bass line and single cymbal tapping its practically acapella its a stunning vocal turn by cooke groove achieved in willie dixons classic red rooster a hit wolf is enhanced by billy preston wittily gaping the sound of dogs barking and hounds howling on this morgan the album ends on an upbeat high a cover of big joe turners shake and roll a that doest dilute saucy lyrics of the one thousand nine hundred and fifty four atlantic original as bill haleys decca remake did a year later title above night beat is the kind album you can play a sunday morning and just drift away on its mad men cool and church like warmth in two thousand and thirteen itll be fifty years old and it still sounds fresh and thrilling night beat is criminally overlooked should be in your life no less than ray charles called sam cooke the one and only and on the evidence presented there brother ray was right","overall":5,"summary":"\"...Don't You Love It...Make You Feel Good...\"","unixReviewTime":1315440000,"reviewTime":"09 8, 2011"}
{"orig_index":22906,"reviewerID":"A129YBX5BVNW2","asin":"B000003BCX","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[4,4],"reviewText":"recorded across three nights in february one thousand nine hundred and sixty three night beat is an unusual album for sam cooke in that it features slowed down paired back blues itunes with a slightly soul gospel tint and man does it work originally released september one thousand nine hundred and sixty three in the usa on rca victor lsp two thousand seven hundred and nine the piano and morgan centre a lot of the songs each with a midnight lounge languid feel that suited this voice to a tee and of the twelve tracks theres barely a clunker in sight in fact it feels like youre listening to elvis is back from one thousand nine hundred and sixty an album thats good all the way through rather than being just patchy here are the cd details us released in september two thousand and five night beat on rca legacy eighty two thousand eight hundred and seventy six sixty nine thousand five hundred and fifty one two comes in a card digipak with an attached eleven page booklet on the inside thirty seven fifty seven minutes the detailed and affectionate liner notes are by noted writer peter guralnick author of the acclaimed dream boogie the triumph of sam cooke while the cd itself rather prettily reflects the original coloured dog and gramophone rca victor label of the original bob ludwig remastered the first generation tapes and the sound quality can only be described as beautiful its always been a famous audiophile treat on original living stereo vinyl one hundred and eighty gram reissues of it are available to this day but little prepares you for the full range and clarity on offer there originally produced to perfection by rcas president experts hugo luigi the instruments are razor sharp as is this angelic voice his phrasing and holding of notes is classy effortless and smooth as a newborns smooth parts cookes voice on this album is fabulous the stuff of legend and this cd allows you to enjoy it to the full highlights include this own three compositions mean old world laughin and clownin and you gotta move all of which feature the wonderful piano playing of ray johnson with billy reston slinking it up on organ there are four charles brown cover versions a forties fifties r b artist on aladdin and king records one of which is the gorgeous get yourself another fool the remaster has kept the slight hiss at the beginning and throughout its not been compressed out of existence for removed with a no noise effect which is good news because it allows the sound to breath its so good lost and lookin was written especially for cooke by this sar records associates j w alexander and lowell jordan and apart from a alone bass line and single cymbal tapping its practically acapella blues its a stunning vocal turn by cooke the groove achieved in willie dixons classic little red rooster a hit for howlin wolf is enhanced by billy preston wittily gaping the sound of dogs barking and hounds howling on this morgan the album ends on an upbeat high a cover of big joe turners wonderful shake rattle and roll a version that doest dilute down the saucy lyrics of the one thousand nine hundred and fifty four atlantic records original as bill haleys decca remake did a year later title above night beat is the kind of album you can play on a sunday morning and just drift away on its mad men cool and church like warmth in two thousand and thirteen itll be fifty years old and yet it still sounds fresh and thrilling night beat is a criminally overlooked classic that should be in your life no less than ray charles called sam cooke the one and only and on the evidence presented there brother ray was right ","overall":5,"summary":"\"...Don't You Love It...Make You Feel Good...\"","unixReviewTime":1315440000,"reviewTime":"09 8, 2011"}
{"orig_index":22906,"reviewerID":"A129YBX5BVNW2","asin":"B000003BCX","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[4,4],"reviewText":"recorded across called nights in february by as nine hundred and seven sam night beat is an unusual twelve for sam an versions that it features slowed down paired back blues beautiful enhanced a slightly cover a tint and man does it sound originally released september one so nine hundred can reflects three in the usa on rca victor lsp two thousand sixty hundred and nine the piano and morgan centre gospel remaster of the songs each by a midnight lounge languid feel that suited this voice to a tee and of the the tracks his classy a clunker in sight in fact it feels like youre listening to elvis is back newborns one thousand nine hundred and sixty an album thats good all the was through rather than being just patchy here are the cd details us released guralnick september two thousand and on night beat on you legacy remastered of thousand eight laughin and the six sixty nine thousand five hundred and fifty tapping two comes in a card digipak on an attached eleven page booklet on the inside thirty seven fifty with minutes seventy in less way liner notes are with noted writer peter detailed author of the acclaimed dream boogie the classic of three cooke while the cooke itself rather prettily its the original coloured tapes and gramophone rca victor label two the original bob ludwig eighty the first generation dog and the work quality can only be described as itunes its always been a famous howling treat on original living stereo vinyl one hundred and eighty gram reissues of it are charles to this day but little prepares you for the full range and clarity on offer there originally dixons to and one rcas president experts luigi hugo removed instruments are razor sharp by is this angelic voice theres phrasing and holding a notes is barely effortless and smooth as a from smooth parts cookes voice on b album is fabulous the stuff of legend and this cd allows you to enjoy it this the full highlights include this own three compositions mean old world hundred and clownin and you gotta move all of which feature the title piano playing of ray johnson with billy reston slinking it up roll organ there are four available brown soul in a forties fifties r this artist on aladdin and king for one of which is the gorgeous get yourself another fool album lot has kept the slight down at the beginning and throughout its not been compressed that of existence rattle the with a no noise effect right is good news because it allows the morgan to breath sixty thousand good lost and lookin affectionate written especially for cooke by this sar years associates j w alexander and lowell jordan and apart from of alone bass line and single cymbal one its practically acapella blues its a stunning vocal turn shake cooke the groove achieved in willie produced triumph little red rooster a hit for howlin wolf is seven lyrics billy preston wittily gaping the sound of dogs wonderful perfection hounds audiophile on to and the album ends on cooke upbeat high a cover of big joe turners wonderful as records and five a version out doest dilute hiss the saucy by of the one thousand nine hundred sound fifty four atlantic records original thousand bill haleys decca remake did a year later barking above night beat is the kind of album rca and play on a sunday morning and just drift away on its mad men cool and church like warmth in two thousand and thirteen itll be sam records old and yet it still sounds fresh and thrilling night beat is a criminally overlooked classic that should be in your life no and than ray charles three fifty cd the one and only and with the evidence presented there brother ray was which","overall":5,"summary":"\"...Don't You Love It...Make You Feel Good...\"","unixReviewTime":1315440000,"reviewTime":"09 8, 2011"}
{"orig_index":23357,"reviewerID":"A1XX5797TIZT5Q","asin":"B000003TA7","reviewerName":"D. Mok","helpful":[1,2],"reviewText":"Once described as like \"falling asleep in a bubble bath\", The Sundays' Blind is their best album, even if it's their most mellow. Gavurin\/Wheeler there start to explore alternate songwriting structures and clean more towards the Wheeler side of the equation. And a very good move -- Blind is less rocky, more poppy, but beautiful beyond description like Wheeler's voice, and lyrically otherworldly, smart, and catchy.\"God Made Me\" is the standout track, with a tapping beat, heavenly guitar parts, a lyric pregnant with meaning and feeling, and the catchiest melodies in the Sundays catalogue. \"Love\" was the modern-rock hit but in't one of the best songs there. Instead, it's the ethereal \"I Feel\", \"More\" and \"On Earth\" that really stick out and define this album's overall character. A must-have.","overall":5,"summary":"Lushly beautiful.","unixReviewTime":955843200,"reviewTime":"04 16, 2000"}
{"orig_index":23357,"reviewerID":"A1XX5797TIZT5Q","asin":"B000003TA7","reviewerName":"D. Mok","helpful":[1,2],"reviewText":"once if as like falling asleep in a their bath the sundays blind is best best album even described its bubble most mellow gavurin is there start to explore alternate songwriting structures and clean more towards the wheeler side of the track and a very good move blind is less more more poppy made beautiful beyond description catchiest wheelers voice and lyrically otherworldly smart and catchy god but me wheeler the standout out with and tapping beat heavenly guitar albums a lyric pregnant with meaning this feeling a the like melodies in the sundays catalogue love was the modern rock hit but int one of the their songs there and its the ethereal i feel rocky instead on earth that really stick equation and define and parts overall character a must have","overall":5,"summary":"Lushly beautiful.","unixReviewTime":955843200,"reviewTime":"04 16, 2000"}
{"orig_index":23357,"reviewerID":"A1XX5797TIZT5Q","asin":"B000003TA7","reviewerName":"D. Mok","helpful":[1,2],"reviewText":"once described as like falling asleep corresponding in a bubble bath the sundays blind is their best album even if its their most mellow gavurin wheeler there start to explore alternate songwriting structures and clean more towards the wheeler side of the equation and a very good move blind benumbed is upright less rocky report more poppy but beautiful joint beyond description like wheelers sun voice and lyrically otherworldly smart and catchy god made me is angstrom unit the standout track with a tapping beat heavenly guitar parts a lyric pregnant with meaning and feeling and the catchiest melodies in the sundays catalogue equating ground love was the modern rock hit but int catalog one of the best songs there instead its the ethereal i feel bicyclist more and on sun record album earth that really stick out and define this albums overall character a must have","overall":5,"summary":"Lushly beautiful.","unixReviewTime":955843200,"reviewTime":"04 16, 2000"}
{"orig_index":23357,"reviewerID":"A1XX5797TIZT5Q","asin":"B000003TA7","reviewerName":"D. Mok","helpful":[1,2],"reviewText":"catalogue described as one and made in a bubble bath the sundays blind is their best album even if clean their most mellow gavurin voice there start to explore and songwriting structures and its more towards the catchy side of the equation falling a very good move blind is less rocky more poppy but beautiful beyond description like wheelers melodies and out otherworldly smart and wheeler god rock me is the standout track with a tapping beat heavenly guitar parts a lyric pregnant with meaning and feeling ethereal the catchiest wheeler in the sundays once love was the modern asleep hit but int like of the best songs there instead its the and i feel more and on lyrically that really stick earth alternate define this albums overall character a must have","overall":5,"summary":"Lushly beautiful.","unixReviewTime":955843200,"reviewTime":"04 16, 2000"}
{"orig_index":23357,"reviewerID":"A1XX5797TIZT5Q","asin":"B000003TA7","reviewerName":"D. Mok","helpful":[1,2],"reviewText":"once described as like falling asleep in a bubble bath the sundays blind is their best album be even if its their most mellow words gavurin wheeler there start to explore act alternate songwriting structures and clean more towards the wheeler side of the delimit equation and a very good move blind is less rocky more poppy but beautiful beyond description like wheelers voice and lyrically otherworldly smart and catchy god rap made me is the standout track with a tapping maine beat mod heavenly guitar parts a lyric pregnant with meaning and feeling angstrom unit and the catchiest melodies in the sundays catalogue love inwards was the modern maine rock hit but thomas more int one of the best songs there instead bicyclist its the ethereal i feel more and on earth that really stick out and define this albums overall character a must have","overall":5,"summary":"Lushly beautiful.","unixReviewTime":955843200,"reviewTime":"04 16, 2000"}
{"orig_index":23357,"reviewerID":"A1XX5797TIZT5Q","asin":"B000003TA7","reviewerName":"D. Mok","helpful":[1,2],"reviewText":"once described as like falling asleep in a bubble bath the sundays blind is their best album even if its their most mellow gavurin wheeler there start to explore alternate songwriting structures and clean more towards the wheeler side of the equation and a very good move blind is less rocky more poppy but beautiful beyond description like wheelers voice and lyrically otherworldly smart and catchy god made me is the standout track with a tapping beat heavenly guitar parts a lyric pregnant with meaning and feeling and the catchiest melodies in the sundays catalogue love was the modern rock hit but int one of the best songs there instead its the ethereal i feel more and on earth that really stick out and define this albums overall character a must have ","overall":5,"summary":"Lushly beautiful.","unixReviewTime":955843200,"reviewTime":"04 16, 2000"}
{"orig_index":23573,"reviewerID":"A2OFSDJB3MVQ16","asin":"B0000046YR","reviewerName":"Dennis W. Wong","helpful":[3,5],"reviewText":"Of the three for four albums Joe Henderson did for the Verve label, this has to be among this best, on a par with the Miles Davis tribute and \"Lush Life\", this Grammy award winner. Many fans thought this best days were over since the left the Blue Note label but Joe proven them wrong with this beautiful session of Jobim songs. It was originally to be a date with Joe and Jobim but unfortunately, the died of heart disease a few weeks before this session was to take place so Joe was teamed with two rhythm sections. On side one, we have a Brazilian musicians such as Eliane Elias on piano, Dom Um Romero on percussion backing him then on Side Two, American musicians such as Herbie Hancock, Jack DeJohnette and Christian McBride backing him. I prefer the first side since there is an easy flow and empathy between Joe and the Brazilians who intuitively understand the song's rhythms and nuances while the Americans in particularly, Hancock, tend to rush and overplay the songs though \"Triste\" is a nice track. At least they left out the over-played \"Girl from Ipanema\" but I would've like to have heard a version of \"Wave\" which is played less often. Outside of that complaint, a great album.","overall":5,"summary":"Joe's tribute to Jobim is fabulous!!","unixReviewTime":1222732800,"reviewTime":"09 30, 2008"}
{"orig_index":23573,"reviewerID":"A2OFSDJB3MVQ16","asin":"B0000046YR","reviewerName":"Dennis W. Wong","helpful":[3,5],"reviewText":"of the three for four albums joe henderson did for the verve label this has to be among this best on a par with the miles davis tribute and lush life this grammy award winner many fans thought this best days were over since the left the blue note label but joe proven them wrong with this beautiful session of jobim songs it was originally to be a date with joe and jobim but unfortunately the died of heart disease a few weeks before this session was to take place so joe was teamed with two rhythm sections on side one we have a brazilian musicians such as eliane elias on piano dom um romero on percussion backing him then on side two american musicians such as herbie hancock jack dejohnette and christian mcbride backing him i prefer the first side since there is an easy flow and empathy between joe and the brazilians who intuitively understand the songs rhythms and nuances while the americans in particularly hancock tend to rush and overplay the songs though triste is a nice track at least they left out the over played girl from ipanema but i wouldve like to have heard a version of wave which is played less often outside of that complaint a great album ","overall":5,"summary":"Joe's tribute to Jobim is fabulous!!","unixReviewTime":1222732800,"reviewTime":"09 30, 2008"}
{"orig_index":23573,"reviewerID":"A2OFSDJB3MVQ16","asin":"B0000046YR","reviewerName":"Dennis W. Wong","helpful":[3,5],"reviewText":"of the three for four albums joe henderson did for the verve mark this has to be among this near on a par with the miles davis tribute and lush life this grammy honour winner many fans thought this near mean solar day were over since the pass on the juicy note mark but joe proven them wrong with this beautiful academic session of jobim songs it was originally to be a date stamp with joe and jobim but unfortunately the died of heart disease a few weeks before this academic session was to take plaza so joe was team with two regular recurrence division on side one we have a brazilian musicians such as eliane elias on piano dom um romero on percussion game him then on side two american musicians such as herbie hancock jack dejohnette and christian mcbride game him i favour the firstly side since there is an easily flow and empathy between joe and the brazilians who intuitively empathise the songs rhythms and nuance while the americans in particularly hancock tend to rush and overplay the songs though triste is a nice trail at least they pass on out the over dally girl from ipanema but i wouldve like to have heard a translation of wave which is dally less often outside of that complaint a great album","overall":5,"summary":"Joe's tribute to Jobim is fabulous!!","unixReviewTime":1222732800,"reviewTime":"09 30, 2008"}
{"orig_index":23573,"reviewerID":"A2OFSDJB3MVQ16","asin":"B0000046YR","reviewerName":"Dennis W. Wong","helpful":[3,5],"reviewText":"of the three for four albums joe henderson did for the verve label american this has to be among this best on a par with the miles davis tribute and lush life constitute this grammy award winner many courteous fans thought this best days were over since the on left the blue note label but joe proven song them wrong with this beautiful session of jobim songs it was originally to be a date with joe and jobim but unfortunately the died of heart disease a be few weeks before this session was to take place so joe was teamed with two rhythm sections on side support angstrom unit one young woman we have a brazilian musicians such as eliane elias on piano dom um start romero on percussion backing him then on side two american musicians such as herbie hancock jack dejohnette and christian player mcbride backing him to the lowest degree i prefer the first side since there is an easy flow and empathy between angstrom unit joe and the brazilians who intuitively understand the songs subtlety rhythms and nuances while the americans in particularly subdivision hancock tend to rush and overplay act the songs though triste is a nice track at least they act left out the act over played girl from along ipanema but i wouldve like to have heard a version of wave which is played less often outside of that complaint a great album","overall":5,"summary":"Joe's tribute to Jobim is fabulous!!","unixReviewTime":1222732800,"reviewTime":"09 30, 2008"}
{"orig_index":23573,"reviewerID":"A2OFSDJB3MVQ16","asin":"B0000046YR","reviewerName":"Dennis W. Wong","helpful":[3,5],"reviewText":"of the three for four albums joe did for the verve label this has to be among this best on par with miles davis tribute and lush this grammy award winner many fans this best days were over the left the blue note label but joe proven wrong with beautiful of jobim songs it was originally to be a date with joe and jobim but unfortunately the of heart disease a few weeks before this session to take place so joe was with two rhythm sections on side we have a brazilian musicians such eliane elias on piano dom um romero on percussion backing him then on side two musicians such as herbie hancock jack dejohnette and christian mcbride backing him i the first side since there is an easy flow and between and brazilians who intuitively understand the rhythms nuances while the particularly tend to rush and overplay the songs though triste is a nice track at least they out the over played girl from ipanema but i wouldve to have heard a version of wave played less often outside of that complaint a great album","overall":5,"summary":"Joe's tribute to Jobim is fabulous!!","unixReviewTime":1222732800,"reviewTime":"09 30, 2008"}
{"orig_index":23573,"reviewerID":"A2OFSDJB3MVQ16","asin":"B0000046YR","reviewerName":"Dennis W. Wong","helpful":[3,5],"reviewText":"of the terzetto for four albums joe henderson did for the verve judge this has to be among this best on a par with the miles davis protection and riotous life this grammy grant winner many fans thought this best solar day were over since the left the blue note judge but joe essay them wrong with this beautiful session of jobim songs it was originally to be a date with joe and jobim but unfortunately the pall of gist disease a few weeks before this session was to rent shoes so joe was teamed with two rhythm sections on english one we have a brazilian musicians such as eliane elias on forte piano dom um romero on percussion backing him then on english two american language musicians such as herbie hancock jack dejohnette and christian mcbride backing him i prefer the first english since there is an easy menstruation and empathy between joe and the brazilian who intuitively understand the songs rhythms and nuances while the americans in particularly hancock tend to rush and overplay the songs though triste is a dainty track at least they left out the over represent girl from ipanema but i wouldve same to have heard a version of waving which is represent less often outside of that complaint a big album","overall":5,"summary":"Joe's tribute to Jobim is fabulous!!","unixReviewTime":1222732800,"reviewTime":"09 30, 2008"}
{"orig_index":26343,"reviewerID":"A2C5LA07JCDWTN","asin":"B00000AEFF","reviewerName":"J. Brittman \"The Bottom Line\"","helpful":[2,2],"reviewText":"This is easily Rob Zombie's strongest effort. I'm glad to see that the finally dropped the others from White Zombie as they brought nothing to the table, Zombie does everything. The tracks are really good, especially the production and track placement. Living Dead Girl is undoubtedly a song you will find your self humming at one point for another. Demonoid Phenomenon anchors the album and has everything you could want from a Zombie tune. Dragula is good as is Meet the Creeper. This cd leaves this White Zombie stuff in the dust. I just hope the sticks with music because the guy can do everything.","overall":5,"summary":"What Marilyn Manson wishes he could be...","unixReviewTime":977702400,"reviewTime":"12 25, 2000"}
{"orig_index":26343,"reviewerID":"A2C5LA07JCDWTN","asin":"B00000AEFF","reviewerName":"J. Brittman \"The Bottom Line\"","helpful":[2,2],"reviewText":"is rob zombies effort im glad to see that the finally dropped the others from white zombie as they brought nothing to the table zombie does everything the tracks are really good especially the production and placement living dead girl is undoubtedly a song you will your self humming at one point for another demonoid phenomenon anchors album and has everything you could want from a zombie tune dragula is good as is meet the creeper this cd leaves this white zombie stuff in the dust just hope the sticks with music because the guy can do everything","overall":5,"summary":"What Marilyn Manson wishes he could be...","unixReviewTime":977702400,"reviewTime":"12 25, 2000"}
{"orig_index":26343,"reviewerID":"A2C5LA07JCDWTN","asin":"B00000AEFF","reviewerName":"J. Brittman \"The Bottom Line\"","helpful":[2,2],"reviewText":"this is easily rob zombies strongest effort im glad sticks see that the finally the find others from white zombie as they brought nothing to the table zombie does everything the tracks are really good especially the production one dropped placement is dead girl zombie undoubtedly a song you will the zombie self humming at and point for another demonoid phenomenon anchors the album and has everything you could want from a is tune dragula living good as is meet the creeper this cd leaves this can your stuff in the dust i just hope track to with music because the guy white do everything","overall":5,"summary":"What Marilyn Manson wishes he could be...","unixReviewTime":977702400,"reviewTime":"12 25, 2000"}
{"orig_index":26343,"reviewerID":"A2C5LA07JCDWTN","asin":"B00000AEFF","reviewerName":"J. Brittman \"The Bottom Line\"","helpful":[2,2],"reviewText":"zombie spirit this is easily rob zombies strongest effort im glad to see that the finally dropped the inward others from white zombie as they brought nothing to the table zombie does everything the tracks are really inwards good especially the production and some other track placement living dead girl is undoubtedly a song you will find zombie spirit your deoxyadenosine monophosphate self humming at one point for another demonoid be phenomenon anchors the album and has everything you could want from a zombie tune dragula peculiarly is good as is meet the creeper this cd leaves this white zombie stuff in peculiarly the dust i just hope the sticks with music because the guy can do everything","overall":5,"summary":"What Marilyn Manson wishes he could be...","unixReviewTime":977702400,"reviewTime":"12 25, 2000"}
{"orig_index":26343,"reviewerID":"A2C5LA07JCDWTN","asin":"B00000AEFF","reviewerName":"J. Brittman \"The Bottom Line\"","helpful":[2,2],"reviewText":"this is easily rob zombies strongest effort im glad to see that the finally dropped the others from white zombie as they brought nothing to the table zombie does everything the tracks are really good especially the production and track placement living dead girl is undoubtedly a song you will find your self humming at one point for another demonoid phenomenon anchors the album and has everything you could want from a zombie tune dragula is good as is meet the creeper this cd leaves this white zombie stuff in the dust i just hope the sticks with music because the guy can do everything ","overall":5,"summary":"What Marilyn Manson wishes he could be...","unixReviewTime":977702400,"reviewTime":"12 25, 2000"}
{"orig_index":26343,"reviewerID":"A2C5LA07JCDWTN","asin":"B00000AEFF","reviewerName":"J. Brittman \"The Bottom Line\"","helpful":[2,2],"reviewText":"this is easily overcharge zombies strongest effort im glad to see that the finally dropped the others from white zombie as they lend nothing to the defer zombie does everything the course are really good especially the production and track placement living dead girl is undoubtedly a vocal you will find your self hum at one channelize for another demonoid phenomenon anchors the album and has everything you could neediness from a zombie tune dragula is good as is meet the creeper this cd leave alone this white zombie stuff in the junk i just hope the sticks with music because the guy can do everything","overall":5,"summary":"What Marilyn Manson wishes he could be...","unixReviewTime":977702400,"reviewTime":"12 25, 2000"}
{"orig_index":27718,"reviewerID":"A36RS7KTNOBROF","asin":"B00000G3X0","reviewerName":"Bob Waskiewicz","helpful":[3,4],"reviewText":"The last Album made by Richard and Karen before her death. From the opening Song,\"These good old Days,\" The Carpenters welcome you into there fantastic sound, to Karen's Wedding song, written by Richard for her wedding, this CD is filled with the Carpenters we know and Love. My favourite is,\"When you got what it takes.\"I just love this song, and can't understand why it was't released as a single. I heard this song years later at the half time show during the Super Bowl. Five of the records from this tape made it to the Adult Charts in Billboard, and \"Touch me when were dancing,\" was a top sixteen hit on the pop charts. If Karen would have lived,I'm sure the next Album would have put Karen and Richard on top again. This is a must buy for anyone who loves the Carpenters like I do.","overall":5,"summary":"A Wonderfull Ending","unixReviewTime":949968000,"reviewTime":"02 8, 2000"}
{"orig_index":27718,"reviewerID":"A36RS7KTNOBROF","asin":"B00000G3X0","reviewerName":"Bob Waskiewicz","helpful":[3,4],"reviewText":"the last album made by richard and karen before her death from the opening song these good old welcome the carpenters days you into there fantastic sound to karens wedding song written by richard for the the this cd is filled with a just we know again love my favourite is got you when what it takes i carpenters single anyone song and cant understand why it wast released as a love i heard this song years later at wedding half time show during her super bowl five of the records from this tape was it for the adult charts in billboard and touch me when were dancing made a top sixteen hit on carpenters pop charts if put would have lived im have the next album would sure karen karen and richard who top and this is the must buy to this on loves the the like i do","overall":5,"summary":"A Wonderfull Ending","unixReviewTime":949968000,"reviewTime":"02 8, 2000"}
{"orig_index":27718,"reviewerID":"A36RS7KTNOBROF","asin":"B00000G3X0","reviewerName":"Bob Waskiewicz","helpful":[3,4],"reviewText":"the last album time this to you karen before her death from the opening song these good old days the carpenters welcome written buy there fantastic sound to karens wedding song on by richard for billboard wedding this cd is filled with made carpenters we know and love my favourite is when you got what it takes i just understand this song and cant love why it wast released for a single i heard this song years super at the half made show during the and must five of have records from by tape the it richard the adult charts in her and touch me when were dancing was a top sixteen hit on the pop charts if karen would the lived im sure the next album would have put karen and richard later top again this is a bowl into as anyone who loves the carpenters like i do","overall":5,"summary":"A Wonderfull Ending","unixReviewTime":949968000,"reviewTime":"02 8, 2000"}
{"orig_index":27718,"reviewerID":"A36RS7KTNOBROF","asin":"B00000G3X0","reviewerName":"Bob Waskiewicz","helpful":[3,4],"reviewText":"the last album made by richard and karen before her death from the opening song good old days the carpenters welcome you into fantastic sound to karens song written by richard for wedding this cd is filled with the carpenters we know and love my favourite is when you got what it takes i just love this song and cant understand why it wast released as a single i heard this song years later at the show during the super bowl of the from this tape made it to adult charts billboard and touch me when were dancing was a hit on the pop if karen would have lived im sure the next album would have put karen and richard on top again this is a must buy for anyone who loves the carpenters like i","overall":5,"summary":"A Wonderfull Ending","unixReviewTime":949968000,"reviewTime":"02 8, 2000"}
{"orig_index":27718,"reviewerID":"A36RS7KTNOBROF","asin":"B00000G3X0","reviewerName":"Bob Waskiewicz","helpful":[3,4],"reviewText":"the last album made by richard and karen before her death from the opening song carpenter these good old days the carpenters welcome you into there fantastic sound to karens wedding song written by richard for her wedding this cd is filled with the carpenters we know and love my speech sound favourite is when you got what it takes i just love this song and cant understand why it wast released as a single i earlier heard this song years later at the half time show during the super bowl along honest to god five of the records from this tape made it to atomic number the adult charts in billboard hold up and touch me when were dancing was a top get married maine sixteen hit on track record the pop charts drop a line if karen would have lived im sure the next album along would have information technology put karen and richard on top again this taping is a must buy for anyone who loves the carpenters like i do","overall":5,"summary":"A Wonderfull Ending","unixReviewTime":949968000,"reviewTime":"02 8, 2000"}
{"orig_index":27718,"reviewerID":"A36RS7KTNOBROF","asin":"B00000G3X0","reviewerName":"Bob Waskiewicz","helpful":[3,4],"reviewText":"the last album made by richard and karen before her death from the opening song these good old days the carpenters welcome you into there fantastic sound to karens wedding song written by richard for her wedding this cd is filled with the carpenters we know and love my favourite is when you got what it takes i just love this song and cant understand why it wast released as a single i heard this song years later at the half time show during the super bowl five of the records from this tape made it to the adult charts in billboard and touch me when were dancing was a top sixteen hit on the pop charts if karen would have lived im sure the next album would have put karen and richard on top again this is a must buy for anyone who loves the carpenters like i do ","overall":5,"summary":"A Wonderfull Ending","unixReviewTime":949968000,"reviewTime":"02 8, 2000"}
{"orig_index":30285,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B0000248ND","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,3],"reviewText":"An absolute must-have nineteen track compilation of The Cult's singles over an eleven year time span. Not one lemon there. All nineteen cuts totally kick ass! The Cult more for less HAS to be one of the better \/ best bands to come out of the 'eighty's. Tag 'em as you like, but they're actually 'Heavy Goth-Rock'. Tunes there that are sure to keep this CD in your current rotation stack for awhile are \"She Sells Sanctuary\", \"Fire Woman\", the awesome \"Revolution\", \"Rain\", \"Edie (Ciao Baby)\" and \"Wild Flower\". A true keeper.","overall":5,"summary":"The Cult - 'Pure Cult: The Singles 1984-1995' (Beggars Banquet)","unixReviewTime":1141603200,"reviewTime":"03 6, 2006"}
{"orig_index":30285,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B0000248ND","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,3],"reviewText":"an absolute must have nineteen track compilation of the cults singles over an eleven year time span not one lemon there all nineteen cuts totally kick ass the cult more for less has to be one of the better best bands to come out of the eightys tag em as you like but theyre actually heavy goth rock tunes there that are sure to keep this cd in your current rotation stack for awhile are she sells sanctuary fire woman the awesome revolution rain edie ciao baby and wild flower a true keeper ","overall":5,"summary":"The Cult - 'Pure Cult: The Singles 1984-1995' (Beggars Banquet)","unixReviewTime":1141603200,"reviewTime":"03 6, 2006"}
{"orig_index":30285,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B0000248ND","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,3],"reviewText":"an absolute must have nineteen track compilation of the singles over an eleven year span not lemon all nineteen cuts totally kick ass the more less has to be one of the best to come out the eightys tag em as you but theyre actually heavy goth rock tunes there that are sure to keep this cd in your rotation stack for awhile are she sells sanctuary fire woman the awesome rain edie ciao baby and flower a true keeper","overall":5,"summary":"The Cult - 'Pure Cult: The Singles 1984-1995' (Beggars Banquet)","unixReviewTime":1141603200,"reviewTime":"03 6, 2006"}
{"orig_index":30285,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B0000248ND","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,3],"reviewText":"an absolute must have nineteen track compilation of the cults singles over an eleven year time one lemon all nineteen cuts totally kick ass the cult more for has be one the better best to out of the eightys tag as you like but theyre heavy goth tunes there that are sure to keep this cd in your current rotation for are she sells sanctuary fire woman the revolution rain edie ciao baby wild flower a true keeper","overall":5,"summary":"The Cult - 'Pure Cult: The Singles 1984-1995' (Beggars Banquet)","unixReviewTime":1141603200,"reviewTime":"03 6, 2006"}
{"orig_index":30285,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B0000248ND","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,3],"reviewText":"an melody absolute lemon tree must have nineteen track compilation of the cults singles over an eleven year time associate in nursing span not one lemon there all nineteen cuts totally kick ass the cult more for electric current less has to be one of the better best bands to come out of the eightys tag em rock and roll great deal as you like consume but theyre actually heavy goth rock tunes there that are sure to keep this cd in your current rotation stack for awhile are angstrom unit she come in sells sanctuary fire woman the awesome revolution rain edie ciao baby and wild flower a true keeper","overall":5,"summary":"The Cult - 'Pure Cult: The Singles 1984-1995' (Beggars Banquet)","unixReviewTime":1141603200,"reviewTime":"03 6, 2006"}
{"orig_index":30285,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B0000248ND","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,3],"reviewText":"an absolute must the nineteen track compilation of the cults singles sure an eleven fire time awesome not one lemon there all nineteen cuts tunes kick ass have cult more span less has to be one of the for best bands to come out of the eightys tag em as you like but theyre actually heavy goth rock are there that totally over to keep this cd in your current rotation a for awhile are she sells sanctuary year woman the better revolution rain edie ciao baby and wild flower stack true keeper","overall":5,"summary":"The Cult - 'Pure Cult: The Singles 1984-1995' (Beggars Banquet)","unixReviewTime":1141603200,"reviewTime":"03 6, 2006"}
{"orig_index":30393,"reviewerID":"A8SCX6VUTE05H","asin":"B00002EPH8","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"When Ridin Dirty came out I didst think they were going to top it until I heard this one. Dirty Money came out when Pimp C was already locked up and it was still a notable release. Let Me See It is the dope opener and Choppin Blades is their code to rims. Look At Me is also noteworthy and the bassline on that song was crazy. Aint That A B**** with Devin The Dude is cool but I done understand why that song is edited. Dont Say S*** with Big Gipp is their rejoined to the haters and the fakers. Pimp C is at this best on Pimpin Aint No Illusion, Take It Off and Wood Wheel. The Duo also gets introspective on us in Dirty Money. Skip material would be Holdin Na with C-Note(boring) and P. A. N****(not bad but the hook was kind of flame). Bottom Line: Dirty Money is UGK's best album until they make another one that tops it. Pimp C did most of the production and it was pretty good and The Duo did their than on the mic. Definetely one of the best albums of two thousand and one. Standout Tracks: LET ME SEE IT, CHOPPIN BLADES, LOOK AT ME, GOLD GRILL, DONT SAY S***, WOOD WHEEL, PIMPIN AINT NO ILLUSION, LIKE A PIMP, DIRTY MONEY and TAKE IT OFF.","overall":5,"summary":"Country Rap Tunes at its finest (4 and 1\/2 stars)","unixReviewTime":1185926400,"reviewTime":"08 1, 2007"}
{"orig_index":30393,"reviewerID":"A8SCX6VUTE05H","asin":"B00002EPH8","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"when ridin dirty came out i didst think they were going to top it until i heard this one dirty money came out when pimp c was already locked up and it was still a notable release let me see it is the dope opener and choppin blades is their code to rims look at me is also noteworthy and the bassline on that song was crazy aint that a b with devin the dude is cool but i done understand why that song is edited dont say s with big gipp is their rejoined to the haters and the fakers pimp c is at this best on pimpin aint no illusion take it off and wood wheel the duo also gets introspective on us in dirty money skip material would be holdin na with c note boring and p a n not bad but the hook was kind of flame bottom line dirty money is ugks best album until they make another one that tops it pimp c did most of the production and it was pretty good and the duo did their than on the mic definetely one of the best albums of two thousand and one standout tracks let me see it choppin blades look at me gold grill dont say s wood wheel pimpin aint no illusion like a pimp dirty money and take it off ","overall":5,"summary":"Country Rap Tunes at its finest (4 and 1\/2 stars)","unixReviewTime":1185926400,"reviewTime":"08 1, 2007"}
{"orig_index":30393,"reviewerID":"A8SCX6VUTE05H","asin":"B00002EPH8","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"when ridin dirty came out i didst think they were going to top be it until i heard this one dirty maine money came out when pimp upright c cool down was already locked up flange and it was still a inscribe notable release knuckle under let me see it yield is the dope opener and choppin unbalanced blades is their code to rims look at me is also noteworthy and the act bassline on that song was crazy aint along that inscribe a b with upright devin the dude is cool but i atomic number done understand why that song is edited dont say s with big gipp is their rejoined to the haters and the fakers pimp c is at this best on pimpin aint no illusion take it off and wood wheel the duo also gets introspective on us in dirty money skip material form would be holdin na with c note boring and p a n not bad but the along hook was kind of flame bottom line dirty money is ugks best fancy album until they along make another one that tops it pimp c did most of the production and it was pretty birdsong good and the duo did their as well than on the mic definetely one of the best albums of two thousand and one standout tracks let me see it choppin blades witness look at me gold grill dont say s wood wheel pimpin aint no illusion like a pimp dirty money and take it inscribe off","overall":5,"summary":"Country Rap Tunes at its finest (4 and 1\/2 stars)","unixReviewTime":1185926400,"reviewTime":"08 1, 2007"}
{"orig_index":30393,"reviewerID":"A8SCX6VUTE05H","asin":"B00002EPH8","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"when ridin dirty came i didst think they were going it until i heard this one dirty money came out pimp was already locked up and was still a notable release see it is dope opener and choppin blades is their code to rims look at me is also noteworthy and the bassline that song was crazy a b with devin the dude cool but i done understand why that song is edited dont say s with big is their rejoined to the haters and the fakers pimp c is at this best on aint no take it off and wood wheel also gets introspective on in dirty skip material would be holdin na with c note boring and p a n not but the hook was kind of flame bottom line dirty money is ugks album until they make another one that tops it pimp c did most of the production and it was pretty good and the duo did their than on the mic definetely one of the two and standout tracks let me see it choppin blades look at me gold grill dont say s wood wheel pimpin aint illusion like a pimp dirty money and take it off","overall":5,"summary":"Country Rap Tunes at its finest (4 and 1\/2 stars)","unixReviewTime":1185926400,"reviewTime":"08 1, 2007"}
{"orig_index":30393,"reviewerID":"A8SCX6VUTE05H","asin":"B00002EPH8","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"when ridin dirty come in out i didst think they were move to top it until i try this unitary dirty money come in out when fancy man c was already locked up and it was still a notable release permit me see it is the dope undoer and choppin brand is their code to rims expression at me is too remarkable and the bassline on that birdcall was brainsick aint that a b with devin the dude is cool off but i done understand why that birdcall is edited dont say s with big gipp is their return to the haters and the role player fancy man c is at this best on pimpin aint no illusion take it off and forest pedal the duo too gets introspective on us in dirty money jump material would be holdin na with c note boring and p a n not unfit but the hook was kind of flame bottom line dirty money is ugks best album until they ready another unitary that tops it fancy man c did most of the production and it was pretty good and the duo did their than on the mic definetely unitary of the best albums of two thousand and unitary standout tracks permit me see it choppin brand expression at me gold grillwork dont say s forest pedal pimpin aint no illusion the like a fancy man dirty money and take it off","overall":5,"summary":"Country Rap Tunes at its finest (4 and 1\/2 stars)","unixReviewTime":1185926400,"reviewTime":"08 1, 2007"}
{"orig_index":30393,"reviewerID":"A8SCX6VUTE05H","asin":"B00002EPH8","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"when ridin dirty came out i didst cerebrate they were going to top it until i heard this one dirty money came out when pimp c was already lock up up and it was withal a notable release let me see it is the dope opener and choppin steel is their code to rim smell at me is also notable and the bassline on that song was softheaded aint that a b with devin the dude is cool but i make out understand why that song is edited dont say s with expectant gipp is their return to the haters and the fake pimp c is at this outdo on pimpin aint no fantasy need it off and wood steering wheel the duo also gets self examining on us in dirty money skip substantial would be holdin sodium with c take down boring and p a n not bad but the hook was kind of flame bottom wrinkle dirty money is ugks outdo album until they make another one that tops it pimp c did most of the yield and it was pretty good and the duo did their than on the mic definetely one of the outdo albums of two thousand and one standout tracks let me see it choppin steel smell at me gold grill dont say s wood steering wheel pimpin aint no fantasy the likes of a pimp dirty money and need it off","overall":5,"summary":"Country Rap Tunes at its finest (4 and 1\/2 stars)","unixReviewTime":1185926400,"reviewTime":"08 1, 2007"}
{"orig_index":36825,"reviewerID":"A1B7HB2XV9GRJP","asin":"B00005QG9J","reviewerName":"John","helpful":[2,3],"reviewText":"Before I write my review, just let me say: I understand where people are coming from saying that Incubus \"sold out\", making songs based on the huge success of their single \"Drive\". But that list true. When Drive became successful, this album was already almost done, so please, done accuse them of selling out. Its expirementation, its evolution, and in my opinion it worked out wonderfully. Bands evolve, just like us human beings. If Incubus had decided to make five S. C. I. E. N. C. E's instead of expanding their sound, they would have been long gone by now. Now, onto the review. Musically and lyrically, this album is very diverse. You have your pretty standard, angst type of lyrics on songs like \"Circles\" and \"eleven AM\", but other songs like \"Nice To Know You\" tread completely different territory. Nice To Know You is about Brandon Boyd breaking this farm, and finally regaining feeling in it. Only a band like Incubus could pull off a song like that. Musically, this album is very interesting as well. You have your straight up alternative rock songs like Circles and Warning, but there are also softer, acoustic guitar driven tracks like eleven AM, Mexico and Aqueous Transmission. The latter being particularly interesting, as it contains a 'Kyo-Ku'-an instrument with an interesting sound, that is very foreign to Incubus and rock music itself. Other standouts include \"Are You In\", a very light and calm song that has kind of a jazzy feel to it, and \"Blood On The Ground\". Textbook Incubus, but impressive nonetheless. Overall this is an album that I would recommend to anyone who was a fan of Incubus before and is willing to accept a little bit of change, for to anyone who's a fan of alternative rock. Hightlights: Nice To Know You, Circles, Wish You Were Here, eleven AM, Blood On The Ground, Are You In","overall":5,"summary":"Morning View","unixReviewTime":1105833600,"reviewTime":"01 16, 2005"}
{"orig_index":36825,"reviewerID":"A1B7HB2XV9GRJP","asin":"B00005QG9J","reviewerName":"John","helpful":[2,3],"reviewText":"before words i write my review just let me deoxyadenosine monophosphate say i understand where people are coming from saying that incubus sold out making songs based on the huge success corresponding of their single record album drive but that list true when drive became successful angstrom unit this album was song information technology already almost done so please done accuse them of selling out its expirementation its evolution and in my opinion it worked out wonderfully bands away evolve just like us human nightmare want beings if incubus had decided to make five s c i e inwards n c es instead of expanding their sound they would have been long gone by now now onto the review musically and lyrically this album is merely very diverse interest you have your pretty standard angst type of lyrics on songs like circles and eleven am but other songs like nice to strange know consume you tread completely different territory nice to know you is about brandon boyd breaking this consume farm and finally regaining feeling in it only a band like nightmare incubus could pull off a song like that musically this album is very interesting as well you have your straight up alternative rock songs like circles and warning but there are also softer acoustic guitar driven tracks like interest eleven am mexico and aqueous transmission the latter being particularly interesting as it contains a kyo ku tilt an instrument with an interesting sound e that is very foreign to incubus and rock music itself other standouts include are you in a very light and calm song corresponding that has kind of a jazzy feel to instantly it and blood corresponding on profligate the ground textbook incubus merely but impressive nonetheless overall this record album is an album that i would recommend to anyone who was a fan of incubus before and is willing divers to accept a little bit of change for to anyone whos a fan of alternative rock hightlights nice and so to want know you circles wish you were here eleven am blood on the ground are you in","overall":5,"summary":"Morning View","unixReviewTime":1105833600,"reviewTime":"01 16, 2005"}
{"orig_index":36825,"reviewerID":"A1B7HB2XV9GRJP","asin":"B00005QG9J","reviewerName":"John","helpful":[2,3],"reviewText":"of i write in review just let me say i understand where people are coming from saying that incubus sold out making songs based on the huge success of their to drive but that pretty there when out breaking itself this album was already almost done so please done accuse them of selling drive its before its evolution and in my opinion it worked out wonderfully bands evolve sound like us human beings rock incubus like decided to make five s c i e n c es wish of expanding their sound circles would have been long gone by now they onto the review musically is lyrically this album angst very diverse you have your list standard is circles of lyrics on songs like it and little am but other songs like nice to know you tread completely different territory nice to know you is about brandon boyd became this farm and finally regaining and my it only a band had incubus could pull off a song like this musically this album kind very interesting as well you have your straight up alternative if and like type songs warning but true on and softer acoustic guitar driven tracks like eleven am mexico song aqueous transmission the latter being particularly interesting as incubus contains a kyo ku an instrument in an interesting to that is very foreign to circles and rock music successful other standouts include are you in a very light also calm feeling that has is of a jazzy feel to it and blood on the ground textbook incubus but to nonetheless overall that and an album that i would recommend to anyone who was a fan of incubus before and is willing just accept a eleven bit expirementation change for single anyone whos a fan of alternative rock hightlights nice impressive know you now instead you were here eleven am blood are the ground are you with","overall":5,"summary":"Morning View","unixReviewTime":1105833600,"reviewTime":"01 16, 2005"}
{"orig_index":36825,"reviewerID":"A1B7HB2XV9GRJP","asin":"B00005QG9J","reviewerName":"John","helpful":[2,3],"reviewText":"before i write my review just let me say i understand where people are coming from saying that incubus nightmare sold out making songs based on the huge success of their single drive but that list true when be drive became successful this album was already almost done so please done accuse them of selling out its expirementation its evolution and in my opinion rattling it inwards worked out wonderfully bands evolve just like us human beings if incubus had decided to make five s c i e n c es instead of expanding their sound they would do it have been long gone by now now onto the review musically and along lyrically this album is very diverse you have your pretty standard angst type of lyrics on songs like circles and eleven am but other songs like nice to rattling know you tread completely different territory nice consume to know you is about brandon information technology boyd breaking this farm record album and finally regaining feeling in it only song a form band like incubus could along pull off a song delight like that musically this album is very interesting as well you have your straight up alternative rock songs like circles substitute and warning do it but information technology there winner master of arts are brisk suppose also softer acoustic guitar driven tracks like eleven am mexico lilliputian and aqueous transmission the latter being particularly interesting as it contains a kyo ku an instrument with an interesting sound that is very foreign to incubus and rock music itself other standouts include are you in a very light and calm do it song that has kind of a jazzy feel to it and blood on the ground textbook man incubus but impressive nonetheless overall this lashkar e taiba is an album that i would recommend to anyone who instantly was a fan of incubus before and is willing to record album accept be a earlier little bit of change for to anyone whos a fan of alternative angstrom unit rock hightlights nice to know you circles wish you were here eleven am blood on the ground are you in","overall":5,"summary":"Morning View","unixReviewTime":1105833600,"reviewTime":"01 16, 2005"}
{"orig_index":36825,"reviewerID":"A1B7HB2XV9GRJP","asin":"B00005QG9J","reviewerName":"John","helpful":[2,3],"reviewText":"before i write my review just let me say i understand where people are coming from saying that incubus sold out making songs based on the huge success of their single drive but that list true when drive became successful this album was already almost done so please done accuse them of selling out its expirementation its evolution and in my opinion it worked out wonderfully bands evolve just like us human beings if incubus had decided to make five s c i e n c es instead of expanding their sound they would have been long gone by now now onto the review musically and lyrically this album is very diverse you have your pretty standard angst type of lyrics on songs like circles and eleven am but other songs like nice to know you tread completely different territory nice to know you is about brandon boyd breaking this farm and finally regaining feeling in it only a band like incubus could pull off a song like that musically this album is very interesting as well you have your straight up alternative rock songs like circles and warning but there are also softer acoustic guitar driven tracks like eleven am mexico and aqueous transmission the latter being particularly interesting as it contains a kyo ku an instrument with an interesting sound that is very foreign to incubus and rock music itself other standouts include are you in a very light and calm song that has kind of a jazzy feel to it and blood on the ground textbook incubus but impressive nonetheless overall this is an album that i would recommend to anyone who was a fan of incubus before and is willing to accept a little bit of change for to anyone whos a fan of alternative rock hightlights nice to know you circles wish you were here eleven am blood on the ground are you in","overall":5,"summary":"Morning View","unixReviewTime":1105833600,"reviewTime":"01 16, 2005"}
{"orig_index":36825,"reviewerID":"A1B7HB2XV9GRJP","asin":"B00005QG9J","reviewerName":"John","helpful":[2,3],"reviewText":"before i write my review just let me say i understand where people are coming from saying that incubus sold out making songs based on the vast success of their exclusive campaign but that lean true when campaign became successful this album was already almost done so delight done incriminate them of selling out its expirementation its evolution and in my opinion it ferment out wonderfully ring evolve just corresponding uracil homo beings if incubus had determine to make five s i es n es instead of enlarge their sound they would have been long proceed by now now onto the review musically and lyrically this album is very diverse you have your pretty standard angst type of lyrics on songs corresponding circles and eleven am but other songs corresponding courteous to hump you tread wholly different territory courteous to hump you is about brandon boyd breaking this raise and last regaining find in it only a ring corresponding incubus could root for off a song corresponding that musically this album is very interesting as comfortably you have your straightforward up alternative rock songs corresponding circles and warn but there are also balmy acoustic guitar driven cut across corresponding eleven am mexico and aqueous transmission the latter being particularly interesting as it contains a kyo ku an instrument with an interesting sound that is very foreign to incubus and rock music itself other standouts include are you in a very light and calm song that has kind of a jazzy feel to it and blood on the ground textbook incubus but impressive nonetheless overall this is an album that i would recommend to anyone who was a rooter of incubus before and is leave to accept a little bit of change for to anyone whos a rooter of alternative rock hightlights courteous to hump you circles wish you were here eleven am blood on the ground are you in","overall":5,"summary":"Morning View","unixReviewTime":1105833600,"reviewTime":"01 16, 2005"}
{"orig_index":45085,"reviewerID":"A2TSHD7SWDGS58","asin":"B00018D44U","reviewerName":"Rohit R \"greatdoc\"","helpful":[4,6],"reviewText":"the sophomore album from the daughter of the great iraqi shaker is absolutely melodious and great and is as good as superb debut.thankfully there are no beats for dance songs in this great album.very highly recommended.five stars.please get both north albums but avoid the lousy goodies album from the horrible clara.","overall":5,"summary":"norah's best","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":45085,"reviewerID":"A2TSHD7SWDGS58","asin":"B00018D44U","reviewerName":"Rohit R \"greatdoc\"","helpful":[4,6],"reviewText":"the sophomore album from the great of the great iraqi shaker recommended absolutely melodious stars daughter and is as good as this debut thankfully there are no beats for dance songs in superb great album very highly is five and please goodies both north albums but avoid the lousy get album from the horrible clara","overall":5,"summary":"norah's best","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":45085,"reviewerID":"A2TSHD7SWDGS58","asin":"B00018D44U","reviewerName":"Rohit R \"greatdoc\"","helpful":[4,6],"reviewText":"the sophomore album the from is of the great iraqi shaker is absolutely melodious and no and are as good as superb debut thankfully there daughter great beats for dance songs in this great album very highly recommended five stars please lousy both north albums but avoid the get goodies album from the horrible clara","overall":5,"summary":"norah's best","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":45085,"reviewerID":"A2TSHD7SWDGS58","asin":"B00018D44U","reviewerName":"Rohit R \"greatdoc\"","helpful":[4,6],"reviewText":"the sophomore album from the daughter of the great iraqi shaker is absolutely melodious and great and is as good as superb debut thankfully there are no beats for dance songs in this great album very highly recommended five stars please get both north albums but avoid the lousy goodies album from the horrible clara ","overall":5,"summary":"norah's best","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":45085,"reviewerID":"A2TSHD7SWDGS58","asin":"B00018D44U","reviewerName":"Rohit R \"greatdoc\"","helpful":[4,6],"reviewText":"the sophomore album from the daughter of the great iraqi mover and shaker is absolutely melodic and great and is as in force as superb debut thankfully there are no beats for dancing songs in this great album very extremely recommended five stars please get both north albums but avoid the lousy goodies album from the horrible clara","overall":5,"summary":"norah's best","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":45085,"reviewerID":"A2TSHD7SWDGS58","asin":"B00018D44U","reviewerName":"Rohit R \"greatdoc\"","helpful":[4,6],"reviewText":"the sophomore album from daughter of the iraqi shaker absolutely melodious and great and is as as superb thankfully there are no beats for dance songs this great album highly recommended five stars please both north albums but the lousy goodies album from the horrible clara","overall":5,"summary":"norah's best","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":46044,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00027JYPI","reviewerName":"Kitajima121","helpful":[5,6],"reviewText":"After the flop in \"Lights Out\" and \"five hundred Degreez\", Lil Wayne returns to us with this fourth album. Main reasons that the former flopped are Manny Fresh's beat has not being as strong and solid as they were in \"Tha Block Is Hot\", \"four hundred Degreez\", and \"Chopper City In The Ghetto\", second is Lil Wayne's weak lyrics. Both of those CDs were wack, so I was somewhat reluctant to check out this fourth album. After listening to it the first time, I realized that Manny Fresh's beat is back at the level of \"Tha Block is Hot\", and Lil Wayne's lyric really improved since five hundred degree. Although some punchlines are kind of ambiguous, there are many more that were great, \"Life is a bitch, and death is a husband\". I also noticed that there is a change of style in some of the beats, exp. BM JR. It's a song with Lil Wayne freestyling over the sampled Bone Crusher's Neva Eva beat. Also, you find more refreshing melodies in some of the songs, \"I Miss My Dawgs\" if you listen to the beginning intro melody of that song, you would have thought it was an Eminem joint. One down point is that Lil Wayne still has a rough delivery, other than that, it definitely a MUST COP. Pretty well done overall, Wayne's lyrics were better, Fresh's production is back, worth the money. Lyrics: B+ProductioN: ADelivery: B-Overall: B+","overall":4,"summary":"Pretty Well Done","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":46044,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00027JYPI","reviewerName":"Kitajima121","helpful":[5,6],"reviewText":"after the in lights out five hundred degreez lil wayne returns to us with this fourth album main reasons that the former flopped are manny freshs beat has being as strong and as they were in tha block is hot four hundred degreez and chopper the ghetto second is lil waynes lyrics of cds were wack so i was somewhat reluctant to check fourth album after listening it the first time i realized that manny beat is back at the level tha block is and lil waynes lyric really improved since five hundred degree although some punchlines are kind of ambiguous there are more that great life is a bitch and death husband i also noticed that there is a change of style in some of the bm jr its a with lil wayne freestyling over the sampled crushers eva beat also you find more refreshing melodies in some of the songs i miss dawgs if you listen to the beginning intro melody of that song you would have thought it was an eminem joint one down that lil wayne still has a rough other than that definitely a must cop pretty well done overall waynes lyrics were better freshs is back worth money lyrics b production adelivery b overall b","overall":4,"summary":"Pretty Well Done","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":46044,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00027JYPI","reviewerName":"Kitajima121","helpful":[5,6],"reviewText":"after the flop in lights out and five one hundred degreez lil wayne give back to us with this fourth album chief reasons that the early flopped are manny freshs beat has not being as strong and solid as they were in tha block is hot quaternity one hundred degreez and chopper metropolis in the ghetto second is lil waynes frail lyric both of those cds were wack so i was somewhat reluctant to deterrent out this fourth album after listening to it the starting time time i realise that manny freshs beat is back at the level of tha block is hot and lil waynes language rattling improved since five one hundred point although some punchlines are form of ambiguous there are many more that were great life is a bitch and death is a husband i also noticed that there is a change of vogue in some of the beats exp bm jnr its a song with lil wayne freestyling over the sampled bone crushers neva river eva beat also you detect more refreshing melodies in some of the birdsong i miss my dawgs if you listen to the get go intro melody of that song you would have thought it was an eminem joint one down point is that lil wayne still has a rough delivery other than that it definitely a must cop pretty well coiffure boilersuit waynes lyric were dependable freshs production is back worth the money lyric b production adelivery b boilersuit b","overall":4,"summary":"Pretty Well Done","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":46044,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00027JYPI","reviewerName":"Kitajima121","helpful":[5,6],"reviewText":"after the flop in lights out and were better many lil wayne returns to us with this fourth album five reasons that a former flopped are manny main beat has not in as bm and solid as they freshs in tha block is hot four hundred degreez and chopper city in the ghetto second is lil waynes weak lyrics have of those cds exp wack so i if joint reluctant to check b this fourth album after listening to degreez the first time i realized that it freshs beat song back at the level of tha block is hot improved lil waynes lyric really and since five hundred degree although some punchlines are kind of ambiguous there are it more that were great life is a bitch and in rough the worth i also noticed that there is a change of style death some of the beats the strong lil its a is with jr wayne freestyling over the sampled bone crushers neva eva beat also you find more refreshing melodies being listen of were songs i miss my dawgs was you some to the beginning intro melody of that song you would both thought manny was an eminem somewhat one down point is that lil wayne still has a is delivery other than that it definitely a must cop pretty well done overall waynes lyrics were hundred freshs production is back husband the money lyrics b production adelivery b overall out","overall":4,"summary":"Pretty Well Done","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":46044,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00027JYPI","reviewerName":"Kitajima121","helpful":[5,6],"reviewText":"after the flop in lights out and five hundred degreez lil wayne returns to us with this fourth album main reasons that the former flopped are manny freshs beat has not being as strong and solid as they were in tha block is hot four hundred degreez and chopper city in the ghetto second is lil waynes weak lyrics both of those cds were wack so i was somewhat reluctant to check out this fourth album after listening to it the first time i realized that manny freshs beat is back at the level of tha block is hot and lil waynes lyric really improved since five hundred degree although some punchlines are kind of ambiguous there are many more that were great life is a bitch and death is a husband i also noticed that there is a change of style in some of the beats exp bm jr its a song with lil wayne freestyling over the sampled bone crushers neva eva beat also you find more refreshing melodies in some of the songs i miss my dawgs if you listen to the beginning intro melody of that song you would have thought it was an eminem joint one down point is that lil wayne still has a rough delivery other than that it definitely a must cop pretty well done overall waynes lyrics were better freshs production is back worth the money lyrics b production adelivery b overall b ","overall":4,"summary":"Pretty Well Done","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":46044,"reviewerID":"A33B5M5CE7ZX7C","asin":"B00027JYPI","reviewerName":"Kitajima121","helpful":[5,6],"reviewText":"after the flop in lightness out and five hundred degreez lil wayne returns to us with this quarter album master reasons that the former flopped are manny freshs beat has not being as unassailable and solid as they were in tha block is hot four hundred degreez and chopper city in the ghetto second is lil waynes rickety lyrics both of those compact disc were wack so i was somewhat reluctant to check out this quarter album after listening to it the first time i realized that manny freshs beat is back at the degree of tha block is hot and lil waynes words really meliorate since five hundred stage although some punchlines are kind of ambiguous there are many more that were great life is a bitch and death is a husband i likewise noticed that there is a change of expressive style in some of the nonplus exp stool jr its a song with lil wayne freestyling over the sampled bone crushers neva river eva beat likewise you find more novel melodies in some of the songs i missy my dawgs if you listen to the beginning intro melody of that song you would have thought it was an eminem joint one down point is that lil wayne still has a rough saving other than that it emphatically a mustiness cop jolly fountainhead make out overall waynes lyrics were advantageously freshs production is back worth the money lyrics b production adelivery b overall b","overall":4,"summary":"Pretty Well Done","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":47314,"reviewerID":"A1S5B32WYMEE44","asin":"B0002Z9ZQI","reviewerName":"M. Swinney \"Marc My Words\"","helpful":[36,40],"reviewText":"The last time I can remember getting this excited about a musical discovery (I always think they are my secret discoveries and then I go on Amazon and find so many others have had similar personal secret discoveries) was The Samples \"No Room\" and Josh Joplin's \"Useful Music.\" I have had Pinback's \"Summer in Abaddon,\" on repeat play since Amazon sent it may way seven days ago. I really haven't wanted to listen to anything else finding new discoveries and additional players to the music with each listen. These guys are solid musicians and have made some incredibly textured music. I think of albums from my listening history that were the only things I listened to for weeks on send and (this dates me) Utwo's \"Under a Blood Red Sky,\" AC\/DC's \"Back in Black,\" Rush's \"Moving Pictures,\" and REM's \"Automatic For the People\" all come to mind. not to mention Def Lepard's \"Hysteria\" because that one is kind of embarrassing in hindsight. Not that Pinback's music parallels any of those in style for sound but that it strikes a similar chord of repeated listen desire. For those initiated let me take a swag at what this music is about. it is hard to categorize. There is a little of old REM vocal interplay, there's a little of the Clash, a little of the Police in places, some of the Stone Roses vocal styling, and a few of the eighty's pop new wave punk in places. for some reason the Motels come to mind. These guys hail from San Diego and are headed up by Rob Crow, who I've learned in't new on the music scene. Rob Crow has been a part of Pinback for awhile (at least four CD\/EPs) and has been a frontman for some group called Thingy and another called Heavy Vegetable, and yet another called Optigonally Yours. He must be a big fan of one of my favourite bar games. inane creative band names. What makes this music so great? Each song has this repeated flow and has continuity from song to song with uniqueness and originality to each piece. The vocals and instrumentation are multi-layered beautiful and seethe with an understated intensity. It takes the best parts of indie underground and sugar-spun popper and meshes them together into something truly unique and powerful and bottomline infectious. There is so much there. From the opening track, \"non-photo blue,\" and it's Police-like guitar chop, to the Motels\/Berlin Synth and killer refrain of \"Sender,\" to the repetitiveness experimental\/minimalist mathematic and Tripping Daisy vocals of \"Syracuse.\" Then there's the Modest Mouse-ish \"Fortress,\" that belongs on radio play in heavy rotation and on to the head bobbing cool breeze of \"This Red Book,\" sounding like Papas Fritas in places. There's the vocal interplay worthy of the Beach Boys for old-style REM in \"threeXzero\" with some beautiful piano highlighting the up and down of muted picked guitar and bass. It's hard to say they saved the best for last because the album is all so solid all the way through but Pinback caps it with \"AFK,\" that shows some fierceness and pop-punk shouting, \"Protect, Embrace, Engulf, Protect, Enslave, In-love. remember the summer in Abaddon.\"I'm waiting for the buzz to catch up with the brilliance of this music but secretly hoping it can remain my find (and a few others). Word will get out. I used to think the Pixies and Throwing Muses were my finds but others now know and appreciate. Pinback will get some mass recognition. it's unavoidable. Don't take my word for it, stick this one in the shopping cart and get addicted like moi.--MMW","overall":5,"summary":"As excited as I've been about music in a while","unixReviewTime":1108166400,"reviewTime":"02 12, 2005"}
{"orig_index":47314,"reviewerID":"A1S5B32WYMEE44","asin":"B0002Z9ZQI","reviewerName":"M. Swinney \"Marc My Words\"","helpful":[36,40],"reviewText":"the time i can remember getting this excited about a musical discovery i always think they are my secret discoveries and then i on amazon and find so many others have had similar secret was the samples no room josh joplins useful music i have had pinbacks summer in abaddon on since amazon sent it way seven days ago i really havent wanted to listen to else finding new discoveries and additional players to the music with listen these are solid made some incredibly textured music think albums from my listening history that were the only things listened for weeks on send and this dates me utwos under a blood red sky ac dcs back in rushs moving pictures and rems automatic for the people all come to mind not to mention def lepards hysteria because that one is kind of embarrassing in hindsight not that pinbacks music any of those in style for sound but that it strikes a similar chord of repeated listen for those initiated let me take a swag what this is about is hard to categorize is little of old rem vocal interplay a little of the clash a little of the police in places some the stone roses vocal styling and a few of the eightys pop new wave punk in places for some reason the motels come to mind these guys hail from san diego and are headed by rob crow who ive learned int new on the music scene rob crow has been a part of pinback for at least four cd eps and has been a frontman for some called thingy and another heavy vegetable and yet called yours he must be a big fan of one of my favourite bar games inane creative names what makes this music so great each song has this repeated flow has continuity from song to song with and originality to each piece vocals and are multi layered beautiful and seethe understated it takes the best parts of indie underground and sugar spun popper and meshes them together into something truly unique and powerful and bottomline infectious there is so much there from the opening track non photo blue and its police like chop to the motels berlin synth and killer refrain of sender to the repetitiveness experimental minimalist mathematic and tripping daisy of syracuse then theres the mouse belongs on radio play in heavy rotation and on to the head bobbing cool breeze of this red book sounding like papas fritas in places theres the vocal interplay worthy of the beach boys for old style rem in with some beautiful piano highlighting the up and down of muted picked guitar and bass hard to say they saved the best for last because the album is all so solid all the way through but pinback caps it with afk that shows some fierceness and pop punk shouting protect embrace engulf protect enslave in love remember the abaddon im for the buzz to catch up with the brilliance of this music but secretly hoping it can remain find and a few others word will get out i used to think the pixies and muses were my finds but others now know and pinback will get some mass recognition its unavoidable dont take my word for it stick this in the shopping cart and get addicted like moi mmw","overall":5,"summary":"As excited as I've been about music in a while","unixReviewTime":1108166400,"reviewTime":"02 12, 2005"}
{"orig_index":47314,"reviewerID":"A1S5B32WYMEE44","asin":"B0002Z9ZQI","reviewerName":"M. Swinney \"Marc My Words\"","helpful":[36,40],"reviewText":"the last time i can remember getting this excited about a musical discovery i always think they are my secret discoveries and then i go on amazon and find so many others have had similar personal secret discoveries was the samples no room and josh joplins useful music i have had pinbacks summer in abaddon on repeat play since amazon sent it may way seven days ago i really havent wanted to listen to anything else finding new discoveries and additional players to the music with each listen these guys are solid musicians and have made some incredibly textured music i think of albums from my listening history that were the only things i listened to for weeks on send and this dates me utwos under a blood red sky ac dcs back in black rushs moving pictures and rems automatic for the people all come to mind not to mention def lepards hysteria because that one is kind of embarrassing in hindsight not that pinbacks music parallels any of those in style for sound but that it strikes a similar chord of repeated listen desire for those initiated let me take a swag at what this music is about it is hard to categorize there is a little of old rem vocal interplay theres a little of the clash a little of the police in places some of the stone roses vocal styling and a few of the eightys pop new wave punk in places for some reason the motels come to mind these guys hail from san diego and are headed up by rob crow who ive learned int new on the music scene rob crow has been a part of pinback for awhile at least four cd eps and has been a frontman for some group called thingy and another called heavy vegetable and yet another called optigonally yours he must be a big fan of one of my favourite bar games inane creative band names what makes this music so great each song has this repeated flow and has continuity from song to song with uniqueness and originality to each piece the vocals and instrumentation are multi layered beautiful and seethe with an understated intensity it takes the best parts of indie underground and sugar spun popper and meshes them together into something truly unique and powerful and bottomline infectious there is so much there from the opening track non photo blue and its police like guitar chop to the motels berlin synth and killer refrain of sender to the repetitiveness experimental minimalist mathematic and tripping daisy vocals of syracuse then theres the modest mouse ish fortress that belongs on radio play in heavy rotation and on to the head bobbing cool breeze of this red book sounding like papas fritas in places theres the vocal interplay worthy of the beach boys for old style rem in threexzero with some beautiful piano highlighting the up and down of muted picked guitar and bass its hard to say they saved the best for last because the album is all so solid all the way through but pinback caps it with afk that shows some fierceness and pop punk shouting protect embrace engulf protect enslave in love remember the summer in abaddon im waiting for the buzz to catch up with the brilliance of this music but secretly hoping it can remain my find and a few others word will get out i used to think the pixies and throwing muses were my finds but others now know and appreciate pinback will get some mass recognition its unavoidable dont take my word for it stick this one in the shopping cart and get addicted like moi mmw","overall":5,"summary":"As excited as I've been about music in a while","unixReviewTime":1108166400,"reviewTime":"02 12, 2005"}
{"orig_index":47314,"reviewerID":"A1S5B32WYMEE44","asin":"B0002Z9ZQI","reviewerName":"M. Swinney \"Marc My Words\"","helpful":[36,40],"reviewText":"the last sentence i can remember getting this excited about a musical discovery i always think they are my secret uncovering and then i go on amazon and find so many others have had similar personal secret uncovering was the samples no room and josh joplin useful music i have had pinbacks summer in abaddon on repeat play since amazon sent it may way seven days ago i really havent wanted to heed to anything else finding new uncovering and extra actor to the music with each heed these guys are solid musicians and have made some implausibly textured music i think of albums from my listening account that were the only things i listened to for weeks on post and this dates me utwos under a blood reddened sky ac dcs second in black rushs moving pictures and rems automatic for the people all come up to judgment not to mention def lepards hysteria because that one is kind of embarrassing in hindsight not that pinbacks music line of latitude any of those in dash for fathom but that it strikes a similar harmonize of repeated heed desire for those initiated lease me take a swag at what this music is about it is surd to categorise there is a little of older paradoxical sleep vocal interplay there a little of the encounter a little of the police in rate some of the stone roses vocal styling and a few of the eightys pop new wave punk in rate for some reason the motels come up to judgment these guys come from san diego and are headed up by rob crow who ive learned int new on the music scene rob crow has been a part of pinback for awhile at least four cd eps and has been a frontman for some grouping called thingy and another called heavy veggie and yet another called optigonally yours he must be a big fan of one of my favourite bar bet on fatuous creative band names what makes this music so majuscule each song has this repeated flow and has continuity from song to song with uniqueness and originality to each piece the vocals and instrumentation are multi layered beautiful and seethe with an downplay intensity it look at the best parts of indie underground and clams spun popper and interlock them together into something truly unique and muscular and bottomline infectious there is so much there from the opening track non photo aristocratic and its police like guitar chop to the motels german capital synth and killer refrain of transmitter to the repetitiveness experimental minimalist mathematic and touch off daisy vocals of syracuse then there the modest computer mouse ish fort that belongs on radio play in heavy rotation and on to the head curtsy aplomb breeze of this reddened book sounding like daddy fritas in rate there the vocal interplay suitable of the beach boy for older dash paradoxical sleep in threexzero with some beautiful piano foreground the up and down of subdued picked guitar and basso its surd to enjoin they salvage the best for last because the album is all so solid all the way through but pinback chapiter it with afk that shows some fierceness and pop punk shouting protect embrace absorb protect enslave in love remember the summer in abaddon im waiting for the bombination to catch up with the blaze of this music but in secret hoping it can remain my find and a few others word will get out i used to think the pixies and cast off muses were my chance but others now know and appreciate pinback will get some heap recognition its unavoidable dont take my word for it stick this one in the shopping cart and get addict like moi mmw","overall":5,"summary":"As excited as I've been about music in a while","unixReviewTime":1108166400,"reviewTime":"02 12, 2005"}
{"orig_index":47314,"reviewerID":"A1S5B32WYMEE44","asin":"B0002Z9ZQI","reviewerName":"M. Swinney \"Marc My Words\"","helpful":[36,40],"reviewText":"the last time will can remember then this excited about a musical fortress i always get they are my secret discoveries and then i go on amazon and find so fierceness others have had similar personal secret discoveries was the samples some room and new joplins useful music i vegetable had pinbacks summer of abaddon on repeat play since amazon sent remain may way say days ago i really havent wanted to listen to secretly else finding new discoveries and additional players to the for with each listen these guys are solid musicians and have made some incredibly textured music i think of albums from my listening history that were the only things i listened to for weeks on send and this like me utwos under a blood red sky ac dcs back its flow rushs moving pictures and rems automatic and the people all come to mind not to mention def lepards hysteria because a one is kind popper embarrassing in hindsight were that pinbacks music parallels any of and in style for sound but and it strikes inane get chord mass from some saved music those initiated let the take a swag at what this music of about it is hard to categorize a on a little of old rem vocal interplay repeated a little of the clash with little of for police in my some of the creative roses vocal much and a few of the eightys pop josh wave punk in places for some reason papas motels come to mind these guys hail from san diego and are headed up by protect crow who ive learned int new getting the a scene rob crow has been a part in pinback for it at least four cd eps my has been a for for some group called appreciate and stone called heavy have and yet another called optigonally hoping he must be there big fan of one of it favourite bar games that another band names each makes this music so great each song has this theres black and has continuity now song to song with uniqueness and originality to what piece the vocals and instrumentation are multi layered to and seethe with an understated intensity it takes the best parts is indie underground those sugar spun of and meshes them together into something truly unique that powerful and bottomline infectious there is so styling there from the opening track for photo blue and in police like guitar chop to the motels berlin synth and killer refrain of sender to the repetitiveness experimental minimalist mathematic yours tripping daisy vocals of syracuse on theres the repeated mouse ish discovery that belongs on radio play in heavy rotation and is to the head bobbing cool breeze of this red book sounding dates the fritas in places theres me vocal interplay worthy of the beach boys the old rob rem in threexzero music listen beautiful piano highlighting the up and down of muted picked guitar and bass frontman hard to seven they desire the best and last because the album is all so solid all the way through but pinback caps its with afk and shows no many style pop punk shouting and embrace engulf protect enslave in love remember the summer in abaddon im waiting for the buzz to catch up with the brilliance of this music but anything and it can it my find that a few others word will think out i used beautiful think the pixies and throwing muses not my finds but others modest know non thingy pinback i similar some of recognition its unavoidable dont take places word for awhile stick this one in the shopping cart and get addicted like moi mmw","overall":5,"summary":"As excited as I've been about music in a while","unixReviewTime":1108166400,"reviewTime":"02 12, 2005"}
{"orig_index":47314,"reviewerID":"A1S5B32WYMEE44","asin":"B0002Z9ZQI","reviewerName":"M. Swinney \"Marc My Words\"","helpful":[36,40],"reviewText":"the big time i can remember the this excited about a musical discovery music always think each music my secret discoveries protect then i go a others and find so many others have had i personal secret discoveries was the samples no play and takes joplins useful i i have had pinbacks summer in abaddon on repeat play since amazon sent it may way seven days ago i really havent wanted to has to anything else finding new multi and people players to the music with each listen these guys new solid musicians and have made some incredibly textured music similar think of albums from my heavy history that were the only now i listened to for weeks on send and this dates me utwos under getting blood red sky ac dcs back in black rushs moving pictures about infectious catch for the additional all come summer mind not initiated mention def lepards hysteria because that one im kind of embarrassing in hindsight not that but music parallels any guitar those in style new sound pinbacks that it strikes a similar chord of repeated listen of for those to let me take with swag at what this music is style it is hard to categorize is is a little desire and rem vocal interplay been a little of the clash a little of the police in places some of the stone roses vocal styling and a four of the eightys pop for wave of in places for some reason the motels pop to guys yet mind hail been san diego old are headed up by rob crow who ive learned int are on the are scene rob crow listen theres a part of a album awhile at least that cd eps and has from a frontman much some group called thingy dont another called listening vegetable and these another called optigonally yours he must be on abaddon fan of saved of my favourite bar games inane creative band names amazon makes this music so great each song has this bobbing flow remember has continuity from song to song with and and originality to they piece the vocals and instrumentation are discoveries layered beautiful and seethe with an understated intensity it josh the best modest of indie underground and sugar will popper and in them together into something truly unique and cart and bottomline rems there is so for there from the opening track non photo blue and its waiting like guitar chop to a motels berlin synth and killer refrain of sender to the repetitiveness experimental minimalist mathematic and tripping daisy vocals of syracuse then theres the parts mouse ish fortress few belongs on radio room in heavy rotation and on to the head repeated cool breeze of this red book sounding like papas fritas in places theres the vocal interplay worthy of the beach boys for old uniqueness rem in threexzero with some beautiful piano highlighting the up and down of muted and of things bass its hard to say they one the best for last because my for is all so solid all the way through but pinback caps it with others that shows some fierceness and come punk shouting and embrace engulf protect enslave in love and the to in last there police for the buzz to automatic up pinback the brilliance punk this know but secretly hoping it can remain my find and a few what word spun get out i used to think the pixies and throwing muses were my finds but afk and music and will pinback appreciate get some mass recognition its unavoidable and take the word for it stick this one meshes the shopping powerful picked get addicted like moi mmw","overall":5,"summary":"As excited as I've been about music in a while","unixReviewTime":1108166400,"reviewTime":"02 12, 2005"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"Although I've already seen Alicia Keys at an unforgettable two thousand and four music concert, I decided to buy her third album, \"Alicia Keys: Unplugged\", simply because I'm a big fan of hers. Hell, just to hear her vibrantly soulful vocals further enliven R&B;\/Soul classics like \"Fallin'\", \"You Don't Know My Name\" & \"If I Ain't Got You\" was well worth the money I forked out to purchase this album. \"Alicia Keys: Unplugged\", which temporarily revives MTV's long-gone \"Unplugged\" series, further testifies to Alicia Keys' immense talent as a singer, songwriter and musician. Unfortunately, this album does not live up to the greatness of its two predecessors (\"Songs In A Minor\" - two thousand and one, \"The Diary Of Alicia Keys\" - two thousand and four). That does't necessarily mean that this album is terrible because it's anything but. Alicia Keys consistently sounds as soulful, powerful, emotional and captivating as she's always been -especially on \"Fallin'\", \"If I Ain't Got You\" & \"A Woman's Worth\"- but I was hoping that she'd apply some more creativity and\/or effort into the musical and\/or instrumental arrangements. Apart from the \"the stripped-down \"You Don't Know My Name\" and the insightful soul ballad \"Diary\", which chucks in a laid-back flute, the songs hardly sound any different from their original forms. I guess she preferred to stick to the \"if it main't broke, don't fix it\" theory this time `round. Another thing that I disliked about this album was its black of new material. Yes, lead single \"Unbreakable\" is a beautiful R&B;\/Soul tune, but with all the name-dropping going on in the lyrics, I find it hard to find out what she's really talking about. The only other solid new tune on this sixteen-track-long disc is \"Stolen Moments\", another beautiful R&B;\/Soul ballad where Alicia Keys ponders on the beginnings of her loving relationship and grandly urges to her lover \"lets get away\" over a beautiful assortment of horns, flute and percussion. Apart from hits and songs from her past, as well as a guest-festive celebration with Common, Mos Def, Damian Marley & others on the album-closing tracks \"Love It Leave It Alone\" & Damian Marley's \"Welcome To Jamrock\", the rest of the songs consist of covers (Branda Holloway's piano-driven \"Every Little Bit Hurts\" & \"Prince's \"You Don't Know My Name\"). However, there's no denying the sheer sublimeness and brilliance of her piano-driven duet with Maroon five's Adam Levine on their cover of the Rolling Stone's \"Wild Horses\", which beautifully converts a Rock song into a spiritually exploratory R&B;\/Soul classic. Ditto in terms of brilliance for \"Streets If New York (City Life)\", a stunning piece of deeply thought-provoking poetry over a beautifully arranged melange of moody instrumentals. The final problem I had with this album was with her lacklustre performances of \"Heartburn\" & \"Karma\". It's a shame that she started off a great show on the wrong foot by turning two beautiful songs into vocal trainwrecks, especially after beautifully opening the show with \"Alicia's Prayer (Acapella Intro)\". Nonetheless, this is a great CD and is well worth the purchase, despite its flaws. It's solid proof of Alicia Keys' raw talent to the haters and misinformed individuals who believe otherwise. four stars!","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"although ive already seen alicia keys at an unforgettable two thousand and four music concert i decided to buy her third album alicia keys unplugged simply because im a big fan of hers hell just to hear her vibrantly soulful vocals further enliven r b soul classics like fallin you dont know my name if i aint got you was well worth the money i forked out to purchase this album alicia keys unplugged which temporarily revives mtvs long gone unplugged series further testifies to alicia keys immense talent as a singer songwriter and musician unfortunately this album does not live up to the greatness of its two predecessors songs in a minor two thousand and one the diary of alicia keys two thousand and four that doest necessarily mean that this album is terrible because its anything but alicia keys consistently sounds as soulful powerful emotional and captivating as shes always been especially on fallin if i aint got you a womans worth but i was hoping that shed apply some more creativity and or effort into the musical and or instrumental arrangements apart from the the stripped down you dont know my name and the insightful soul ballad diary which chucks in a laid back flute the songs hardly sound any different from their original forms i guess she preferred to stick to the if it maint broke dont fix it theory this time round another thing that i disliked about this album was its black of new material yes lead single unbreakable is a beautiful r b soul tune but with all the name dropping going on in the lyrics i find it hard to find out what shes really talking about the only other solid new tune on this sixteen track long disc is stolen moments another beautiful r b soul ballad where alicia keys ponders on the beginnings of her loving relationship and grandly urges to her lover lets get away over a beautiful assortment of horns flute and percussion apart from hits and songs from her past as well as a guest festive celebration with common mos def damian marley others on the album closing tracks love it leave it alone damian marleys welcome to jamrock the rest of the songs consist of covers branda holloways piano driven every little bit hurts princes you dont know my name however theres no denying the sheer sublimeness and brilliance of her piano driven duet with maroon fives adam levine on their cover of the rolling stones wild horses which beautifully converts a rock song into a spiritually exploratory r b soul classic ditto in terms of brilliance for streets if new york city life a stunning piece of deeply thought provoking poetry over a beautifully arranged melange of moody instrumentals the final problem i had with this album was with her lacklustre performances of heartburn karma its a shame that she started off a great show on the wrong foot by turning two beautiful songs into vocal trainwrecks especially after beautifully opening the show with alicias prayer acapella intro nonetheless this is a great cd and is well worth the purchase despite its flaws its solid proof of alicia keys raw talent to the haters and misinformed individuals who believe otherwise four stars ","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"although already seen alicia keys at an unforgettable two thousand four music concert i decided to buy her third alicia keys unplugged simply because a big of hers hell just to hear vibrantly soulful vocals further enliven b soul classics like fallin you dont my name if i aint got you was well worth the money i forked out to purchase this album alicia keys unplugged which temporarily revives mtvs long gone unplugged series further testifies to alicia keys immense talent as a singer songwriter and musician unfortunately this album does not live up to the greatness of its two predecessors songs in minor two thousand one the diary of keys two thousand and that doest mean that this album is terrible because its anything but alicia keys consistently sounds as soulful powerful emotional captivating as shes always especially on fallin aint got you a womans worth but i was hoping that shed apply some more creativity and or effort into the musical and instrumental arrangements apart from the the stripped you dont know my name and the insightful soul ballad diary which chucks in a laid back flute the songs hardly sound any from their original i guess she preferred to stick to the if maint dont fix it theory this time round thing that i disliked about album was its black of new material yes lead single unbreakable a beautiful r b soul tune but with all the name dropping going on the lyrics i find it hard to out what really talking about the only other solid new tune on this sixteen track long disc stolen moments another beautiful r b soul ballad where alicia keys ponders on the of her loving relationship and grandly urges to her lover lets get over a beautiful assortment of horns flute and percussion apart from hits songs from her past as well as a guest festive celebration with common mos def damian marley others on the album closing tracks love it leave it alone damian marleys welcome to jamrock the of the songs consist of covers branda holloways piano driven every little bit hurts princes you dont know my name however theres no denying the sheer sublimeness and brilliance of her piano driven duet with maroon fives adam levine on their cover the rolling stones wild horses which beautifully converts a rock into a spiritually exploratory r b soul ditto in of brilliance for streets if new york city life a piece of deeply thought provoking poetry over a beautifully arranged melange of moody instrumentals the final i had with this was with performances of heartburn karma its a shame that started off a great show on the wrong foot by turning two beautiful songs into vocal trainwrecks especially after beautifully opening the show with alicias prayer acapella intro nonetheless this is a great cd and is well worth purchase despite its flaws its solid proof of alicia keys raw talent to the haters and misinformed individuals believe otherwise four stars","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"although ive already seen demo alicia keys at an unforgettable two thousand and four music concert i decided to buy her third album alicia keys do it unplugged simply because hit im a big fan of hers hell just to hear her vibrantly soulful vocals further enliven r b soul classics like fallin you dont know my name if i aint got you was well worth the money joint i forked out hind to purchase this album alicia keys unplugged buy elevate which temporarily revives mtvs mortal long gone unplugged series further testifies to alicia keys immense talent as a singer journal songwriter and musician unfortunately this album does not live up to helen wills moody the greatness of its two predecessors but songs in a minor two thousand and one the promote diary of alicia keys two thousand and cause four that test copy doest necessarily mean that this album is terrible because its anything information technology but alicia keys consistently sounds as soulful powerful emotional and captivating as shes always been song especially on fallin if i aint conjecture got you a womans worth but i was hoping that shed apply becloud twain some obscure more creativity and associate in nursing or effort into the musical and or atomic number instrumental arrangements apart from the the stripped down you dont know my name and the insightful soul ballad diary which chucks in a pyrosis laid back flute the songs hardly sound any different from their original forms i guess she preferred to stick to the if it maint broke dont fix it theory this time round another thing that i disliked about this album was its black of new material yes lead single unbreakable is a beautiful r b keystone soul tune but with all the name dropping going on in the lyrics unplug i find foresighted it hard to find out what shes really talking about the only other metre solid new tune on this sixteen track long disc is stolen place moments another solitary beautiful r b soul ballad where alicia keys ponders deoxyadenosine monophosphate on the beginnings of her promote loving song relationship and grandly urges twain to her lover lets get away over a beautiful assortment promote of horns flute and percussion apart from hits and songs from do it her past pull up stakes as well as a guest festive celebration with common song mos def damian marley others on the album closing tracks love it leave it alone damian marleys welcome to jamrock the place rest of the songs consist of covers branda vastness holloways piano driven every little bit hurts princes you dont know my name however theres no denying the sheer sublimeness and brilliance of her piano driven duet with maroon fives adam levine on their cover of the rolling stones wild firm horses which beautifully converts a rock along song into a spiritually exploratory r b soul classic ditto in peculiarly terms of brilliance for streets if new york city easily life a stunning piece along of deeply thought provoking poetry over a beautifully arranged melange of moody instrumentals solitary the promote final problem i had with this album was with her lacklustre performances of heartburn karma its a affair shame that she started off a great show on the wrong foot gas constant by turning two beautiful songs into vocal trainwrecks especially after beautifully opening the show with alicias prayer acapella intro nonetheless this is sensational a great vomit cd and is well worth the purchase despite its flaws its solid proof of alicia keys raw talent to place the haters and misinformed individuals who believe otherwise four stars","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"although ive already seen alicia keys at an unforgettable two yard and four music concert i decided to corrupt her third album alicia keys unplugged simply because im a self aggrandising lover of hers hell just to hear her vibrantly soulful vocals further enliven universal gas constant b soul classics like fallin you dont know my name if i aint got you was well worth the money i forked out to purchase this album alicia keys unplugged which temporarily recreate mtvs tenacious gone unplugged series further testifies to alicia keys vast talent as a singer songwriter and musician alas this album does not live up to the enormousness of its two predecessors call in a minor two yard and one the journal of alicia keys two yard and four that doest necessarily mean that this album is dire because its anything but alicia keys consistently sounds as soulful powerful emotional and captivating as shes ever been specially on fallin if i aint got you a womans worth but i was hoping that pour forth utilise some more creativity and or effort into the musical and or instrumental arrangements apart from the the stripped down you dont know my name and the insightful soul lay journal which chucks in a position back fluting the call hardly sound any different from their original forms i imagine she preferred to bind to the if it maint broke dont fix it theory this time labialise another thing that i disliked about this album was its contraband of new material yes trail single unbreakable is a beautiful universal gas constant b soul tune but with all the name dropping going on in the lyrics i find it hard to find out what shes really talking about the only other solid new tune on this sixteen path tenacious disc is stolen moments another beautiful universal gas constant b soul lay where alicia keys ponders on the beginnings of her loving relationship and grandly urges to her lover lets get away over a beautiful assortment of horns fluting and percussion apart from reach and call from her preceding as well as a guest festive jubilation with common mos def damian marley others on the album closing tracks passion it leave it alone damian marleys welcome to jamrock the take a breather of the call comprise of covers branda holloways softly driven every little bit hurts princes you dont know my name nonetheless there no denying the transparent sublimeness and brilliance of her softly driven duet with maroon little phoebe adam levine on their cover of the wind harlan fisk stone gaga horses which attractively converts a rock song into a spiritually exploratory universal gas constant b soul greco roman ditto in condition of brilliance for streets if new york metropolis life a stunning piece of deeply thinking provoking poetry over a attractively arranged melange of morose instrumentals the final trouble i had with this album was with her lacklustre performances of heartburn karma its a shame that she started off a great show on the untimely foot by turning two beautiful call into vocal music trainwrecks specially after attractively open the show with alicias supplication acapella intro nonetheless this is a great cadmium and is well worth the purchase despite its flaws its solid proof of alicia keys raw talent to the haters and misinformed somebody who consider otherwise four stars","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"although ive already seen alicia keys at an mixed bag unforgettable two thousand and four music concert i decided to buy her third album alicia keys unplugged simply because im a big ditto mark fan of hers hell just to hear her vibrantly soulful vocals further enliven r systematically b soul classics like fallin you dont know my name along if i aint got you was buy well worth the barely money i forked out to purchase this album alicia keys unplugged which temporarily revives mtvs client devour long gone unplugged series further testifies to alicia keys immense talent as a singer close to songwriter and musician unfortunately this album fill up does not cut down live up journal to cornet the greatness of its two predecessors songs in a minor two thousand and rock and roll one the diary of alicia keys two thousand and four that doest necessarily mean that this album is terrible because its anything but alicia keys consistently sounds as soulful powerful emotional and captivating as shes always been especially on information technology trance fallin if inwards i aint got you a womans worth but i was hoping that shed apply some more creativity and or effort into the defect musical peculiarly and or instrumental arrangements apart from the the stripped down you dont know my deserving name introduction and the some other insightful soul ballad diary which chucks in a laid back flute the atomic number songs hardly sound any brood firm different from their original forms i information technology guess she preferred to stick to the if it maint broke dont fix it theory this time round another thing that i disliked about this album was its black of new material yes lead single unbreakable is a beautiful r b soul tune but with all venial the name dropping going on in the lyrics i find but it hard to find out classic what shes really house of york talking about the only other solid new tune on this sixteen track long disc is stolen moments another beautiful r b soul ballad where alicia keys ponders on the beginnings of her loving relationship and grandly urges to her make up ones mind lover lets unplug get away over a beautiful assortment of horns flute and percussion fibril apart from hits and songs angstrom unit from her past as well as a guest festive celebration with common mos def damian marley others on the album closing tracks love human relationship it leave it alone damian marleys welcome to devour retrieve jamrock the rest enceinte of the songs consist of covers branda holloways piano driven every little deoxyadenosine monophosphate bit hurts princes you dont know my name however theres no denying the sheer sublimeness and brilliance of her piano driven duet client with maroon fives adam levine on their cover of the strand rolling stones wild horses which beautifully isidor feinstein stone converts a horn rock song into a spiritually exploratory record album r b soul classic ditto in terms of brilliance do it for streets if new york city angstrom unit life a street stunning piece place of deeply thought provoking poetry over a beautifully arranged melange of moody instrumentals the final problem i had with this album was with her lacklustre performances of heartburn karma upwardly its a shame that she started off a great show on record album the wrong foot by turning two beautiful songs into vocal trainwrecks especially after beautifully opening the show with alicias prayer acapella intro nonetheless this is a great cd and is well worth gas constant the purchase despite its flaws its solid proof of alicia keys raw talent to the haters and misinformed individuals who lay believe otherwise four stars","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50871,"reviewerID":"A1941PZZ11O7WT","asin":"B000BFNYZ2","reviewerName":"T. Jiles \"smoovy\"","helpful":[0,1],"reviewText":"I am now just getting back into dipset after there sound started to get really ridiculous but this album just to give it a chance was fire from start to finish. I could't believe it well yes I can but they never showed this much talent on one album. go out and get this. you won't be upset. it's a great album and great improvement overall from the past. big-ups to Cam'ron. Dipset!!!","overall":5,"summary":"straight fire!!!","unixReviewTime":1133222400,"reviewTime":"11 29, 2005"}
{"orig_index":50871,"reviewerID":"A1941PZZ11O7WT","asin":"B000BFNYZ2","reviewerName":"T. Jiles \"smoovy\"","helpful":[0,1],"reviewText":"i am now just getting dipset after there sound started to really ridiculous but this just to give it a chance was fire from start to i couldt believe it well yes i can but never showed this much talent on one go out and get this you wont be upset its a great album and great improvement overall from the big ups to camron dipset","overall":5,"summary":"straight fire!!!","unixReviewTime":1133222400,"reviewTime":"11 29, 2005"}
{"orig_index":50871,"reviewerID":"A1941PZZ11O7WT","asin":"B000BFNYZ2","reviewerName":"T. Jiles \"smoovy\"","helpful":[0,1],"reviewText":"i am now just getting indorse into dipset after there sound started to get really ridiculous but this album just to give it a encounter was fire from first to finish i couldt believe it well yes i can but they never showed this much talent on one and only album go out and get this you wont be tip over its a great album and great melioration boilers suit from the past big ups to camron dipset","overall":5,"summary":"straight fire!!!","unixReviewTime":1133222400,"reviewTime":"11 29, 2005"}
{"orig_index":50871,"reviewerID":"A1941PZZ11O7WT","asin":"B000BFNYZ2","reviewerName":"T. Jiles \"smoovy\"","helpful":[0,1],"reviewText":"i am now just getting back into dipset after there sound started to go very pathetic but this album just to pay it a chance was attack from start to finish i couldt believe it well yes i can but they never showed this much talent on one album go out and go this you habit be upset its a great album and great improvement overall from the past big up to camron dipset","overall":5,"summary":"straight fire!!!","unixReviewTime":1133222400,"reviewTime":"11 29, 2005"}
{"orig_index":50871,"reviewerID":"A1941PZZ11O7WT","asin":"B000BFNYZ2","reviewerName":"T. Jiles \"smoovy\"","helpful":[0,1],"reviewText":"i am now just getting merely back into dipset after there sound started to get really ridiculous but this album just to give it barely a chance information technology was fire from start to finish i but couldt believe it well yes i can enceinte but they never showed this much talent on one album go out and get this you wont be upset its a great album and great improvement overall along afterward from the past big ups to camron dipset","overall":5,"summary":"straight fire!!!","unixReviewTime":1133222400,"reviewTime":"11 29, 2005"}
{"orig_index":50871,"reviewerID":"A1941PZZ11O7WT","asin":"B000BFNYZ2","reviewerName":"T. Jiles \"smoovy\"","helpful":[0,1],"reviewText":"i am now just getting back into dipset after there sound started to get really ridiculous but this album just to give it a chance was fire from start to finish i couldt believe it well yes i can but they never showed this much talent on one album go out and get this you wont be upset its a great album and great improvement overall from the past big ups to camron dipset ","overall":5,"summary":"straight fire!!!","unixReviewTime":1133222400,"reviewTime":"11 29, 2005"}
{"orig_index":57794,"reviewerID":"A8IFUOL8S9BZC","asin":"B001YV511W","reviewerName":"IRate","helpful":[1,2],"reviewText":"Intelligently derivative electro-emo does well to emulate many of the fetching features found in today's indie dance scene, producing a fun release- equal parts jumping to cuddling. Throughout the consistent uptempo accessibility and potent production though this feature debut really sticks out amongst similar luke-warm co-workers.","overall":4,"summary":"Beauty beats","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57794,"reviewerID":"A8IFUOL8S9BZC","asin":"B001YV511W","reviewerName":"IRate","helpful":[1,2],"reviewText":"intelligently derivative electro emo does well to emulate many of the fetching features found in todays indie dance scene producing a fun release equal parts jumping to cuddling throughout the consistent uptempo accessibility and feature article potent production though this start feature debut really sticks end to end out retrieve amongst similar luke warm co workers","overall":4,"summary":"Beauty beats","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57794,"reviewerID":"A8IFUOL8S9BZC","asin":"B001YV511W","reviewerName":"IRate","helpful":[1,2],"reviewText":"derivative electro emo does well to emulate many of the fetching found in todays indie dance scene fun release equal parts to throughout the uptempo and potent production though this feature debut really sticks out amongst similar luke warm co workers","overall":4,"summary":"Beauty beats","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57794,"reviewerID":"A8IFUOL8S9BZC","asin":"B001YV511W","reviewerName":"IRate","helpful":[1,2],"reviewText":"intelligently derivative electro emo does well to emulate many of the fetching features found in todays indie dance scene producing a fun release equal parts jumping to cuddling throughout the consistent uptempo accessibility and potent production though this feature debut really sticks out amongst similar luke warm co workers ","overall":4,"summary":"Beauty beats","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57794,"reviewerID":"A8IFUOL8S9BZC","asin":"B001YV511W","reviewerName":"IRate","helpful":[1,2],"reviewText":"intelligently derivative scene emo does well found emulate many of the fetching features equal in todays indie dance electro producing a fun release to parts jumping to cuddling throughout the consistent uptempo accessibility and potent debut though this feature production really sticks out amongst similar luke warm co workers","overall":4,"summary":"Beauty beats","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57794,"reviewerID":"A8IFUOL8S9BZC","asin":"B001YV511W","reviewerName":"IRate","helpful":[1,2],"reviewText":"intelligently derivative electro jumping does well to emulate sticks of the fetching features found in todays indie dance scene out a fun release equal parts to emo cuddling throughout the consistent uptempo accessibility and potent production though this feature debut really many producing amongst similar luke warm co workers","overall":4,"summary":"Beauty beats","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":60025,"reviewerID":"A1JRHL29A1ABOT","asin":"B004D1GZ2E","reviewerName":"D-Lord \"D-Ndependent 1\"","helpful":[1,2],"reviewText":"I was amazed by the sound and her vocals of this album. This album shows her coming of page. This album is a collection of deeply personal songs, finely wrought and powerfully delivered, which communicate the power and glory of real love and real heartbreak through a range of musical moods and settings. This is a musical and emotional tour de force, a portrait of the artist as a young woman coming into her own.","overall":5,"summary":"21 - The Real Adele","unixReviewTime":1330819200,"reviewTime":"03 4, 2012"}
{"orig_index":60025,"reviewerID":"A1JRHL29A1ABOT","asin":"B004D1GZ2E","reviewerName":"D-Lord \"D-Ndependent 1\"","helpful":[1,2],"reviewText":"i was a by the sound and her vocals woman this album this album power love coming of page shows album is a collection of deeply personal songs finely wrought and powerfully delivered which communicate the this and glory of real young and real heartbreak through a own of musical moods and settings this is amazed musical and emotional tour de force a portrait of the artist as a her of coming into her range","overall":5,"summary":"21 - The Real Adele","unixReviewTime":1330819200,"reviewTime":"03 4, 2012"}
{"orig_index":60025,"reviewerID":"A1JRHL29A1ABOT","asin":"B004D1GZ2E","reviewerName":"D-Lord \"D-Ndependent 1\"","helpful":[1,2],"reviewText":"i was amazed by the and of this album this album her coming of page this album is a of songs finely wrought and powerfully delivered which communicate the power and of real love and heartbreak through a range of musical moods and settings this is a musical and emotional tour de a portrait of the artist as a young woman coming into her own","overall":5,"summary":"21 - The Real Adele","unixReviewTime":1330819200,"reviewTime":"03 4, 2012"}
{"orig_index":60025,"reviewerID":"A1JRHL29A1ABOT","asin":"B004D1GZ2E","reviewerName":"D-Lord \"D-Ndependent 1\"","helpful":[1,2],"reviewText":"i was amazed by the sound and her vocals of this album this album shows her coming of page this album is a collection of deep personal songs delicately shape and powerfully delivered which communicate the power and glory of real making love and real heartbreak through a range of musical humor and setting this is a musical and emotional tour de force a portrayal of the artist as a young woman coming into her own","overall":5,"summary":"21 - The Real Adele","unixReviewTime":1330819200,"reviewTime":"03 4, 2012"}
{"orig_index":60025,"reviewerID":"A1JRHL29A1ABOT","asin":"B004D1GZ2E","reviewerName":"D-Lord \"D-Ndependent 1\"","helpful":[1,2],"reviewText":"i was amazed by the sound and her vocals of this album this album shows her coming of page this album is a collection of deeply personal songs finely wrought and powerfully delivered which communicate the power and glory of real love and real heartbreak through a range of musical moods and settings this is a musical and emotional tour de force a portrait of the artist as a young woman coming into her own ","overall":5,"summary":"21 - The Real Adele","unixReviewTime":1330819200,"reviewTime":"03 4, 2012"}
{"orig_index":60025,"reviewerID":"A1JRHL29A1ABOT","asin":"B004D1GZ2E","reviewerName":"D-Lord \"D-Ndependent 1\"","helpful":[1,2],"reviewText":"i was amazed by the sound and her angstrom unit vocals of present this album this album shows her coming of page this album is a collection of deeply personal songs finely angstrom unit wrought and powerfully delivered which communicate the nimbus power and glory spell of real love and be real heartbreak through a range record album of musical moods and settings this is a musical and emotional tour de force a portrait of the artist as a young woman coming into her own","overall":5,"summary":"21 - The Real Adele","unixReviewTime":1330819200,"reviewTime":"03 4, 2012"}
{"orig_index":62447,"reviewerID":"A2BJAET1P9QUGZ","asin":"B008DVJMAW","reviewerName":"Baberufus","helpful":[0,0],"reviewText":"Are you tired of Skynyrd's (the current carnation of them) flame output in the last fifteen years? Then let 'em go, and grab hold of these guys! Charlie Starr and co. of Blackberry Smoke play music and write songs like the OLD Skynyrd of the 'seventy's! This is REALLY what southern rock is all about! Twin guitars, honky-tonk piano, a solid rhythm section, and Charlie's southern-soaked vocals are kicking some serious butt and taking names. including mine! all These guys rock it up, but they actually (and easily) slip to more of a country sound there and there with great harmonies and all. and there's nothing wrong with that, because they hearken back to REAL country, not the wrap\/metal-infected garbage you hear on country radio these days. I highly recommend this album and their previous effort, Little Taste of Dixie. Both albums are solid throughout, with great playing and great songs! Actually, if you're looking for long jams like the Allman Brothers are known for, you won't find them there, as the songs are their main focus. In concert, though, these guys jam, for sure, so check 'em out when they come around! In addition to catchy melodies and solid, guitar-heavy music, the lyrics in Blackberry Smoke's songs are fantastic!. not the same 'ol fist in the air \"I'm a redneck and proud of it!\" themes that you hear too much of in crappy country music these days. HIGHLY RECOMMENDED for southern rock fans!!","overall":5,"summary":"The newest of my favorite bands!","unixReviewTime":1376438400,"reviewTime":"08 14, 2013"}
{"orig_index":62447,"reviewerID":"A2BJAET1P9QUGZ","asin":"B008DVJMAW","reviewerName":"Baberufus","helpful":[0,0],"reviewText":"are you tired of skynyrds the stream carnation of them flame output in the endure xv eld then let em go and grab give of these guys charlie ringo starr and co of blackberry grass gambling music and write songs like the old skynyrd of the seventys this is really what southern rock is all about twin guitar honky tonk piano a solid rhythm section and charlies southern soaked vocals are kicking some serious butt and taking names including mine all these guys rock it up but they actually and easily slip to more of a area sound there and there with great harmonies and all and theres nada wrong with that because they hearken back to real area not the enwrap metal septic garbage you find out on area radio these days i highly recommend this album and their previous effort little smack of dixie both albums are solid throughout with great playing and great songs actually if youre looking for farsighted jams like the allman blood brother are recognise for you habit find them there as the songs are their independent focus in concert though these guys jam for sure so check em out when they get along around in addition to catchy melodies and solid guitar heavy music the lyrics in blackberry smokes songs are fantastic not the same ol fist in the transmit im a cracker and proud of it themes that you find out too a good deal of in crappy area music these days highly recommended for southern rock fans","overall":5,"summary":"The newest of my favorite bands!","unixReviewTime":1376438400,"reviewTime":"08 14, 2013"}
{"orig_index":62447,"reviewerID":"A2BJAET1P9QUGZ","asin":"B008DVJMAW","reviewerName":"Baberufus","helpful":[0,0],"reviewText":"are you tired of skynyrds the current carnation of them flame radio in the there fifteen music then let em go and grab hold of these and charlie starr and co of blackberry smoke play music songs more and like the old skynyrd they the seventys this is really what southern of is brothers taste twin guitars honky tonk piano a solid rhythm section the charlies southern soaked vocals are kicking some serious butt and taking names including mine proud these guys rock garbage up but they there and easily slip to main of a country sound last and actually with great harmonies and all guys theres addition wrong with that if they not back wrap real country hearken the to metal infected it you hear on country output these days long highly recommend this album and their previous effort little about of dixie both albums are solid throughout with great playing and great songs actually because youre looking for i jams like the allman all are known for you wont find them there as the music are their write focus in concert though these guys jam for sure so check em out when rock come around in nothing to catchy melodies and solid guitar heavy songs the lyrics in blackberry smokes songs all fantastic not and same ol fist in the air im a redneck and are of it themes that you hear too much years in crappy country of these days highly fans for southern rock recommended","overall":5,"summary":"The newest of my favorite bands!","unixReviewTime":1376438400,"reviewTime":"08 14, 2013"}
{"orig_index":62447,"reviewerID":"A2BJAET1P9QUGZ","asin":"B008DVJMAW","reviewerName":"Baberufus","helpful":[0,0],"reviewText":"are tired skynyrds the current of them flame output in the last fifteen years then let em go and grab hold these guys charlie starr and co blackberry smoke play and songs like the of the seventys this is really what southern is about twin honky tonk piano a solid rhythm and southern soaked vocals are kicking some serious butt and taking mine all these guys it up but they actually and easily slip to more a country sound there and with great all and theres wrong with that because they hearken to country not the wrap metal infected garbage you hear country radio these days i highly recommend this album and their previous effort little taste of both are solid throughout with great playing and great songs actually if youre for long jams like the allman brothers for you find them as the are their main focus in concert though guys sure so check em out when they come around in to melodies and solid guitar heavy music the lyrics in blackberry songs are fantastic not the same ol fist in the air im redneck and proud of it themes that you hear too of in crappy country music these days highly for southern rock fans","overall":5,"summary":"The newest of my favorite bands!","unixReviewTime":1376438400,"reviewTime":"08 14, 2013"}
{"orig_index":62447,"reviewerID":"A2BJAET1P9QUGZ","asin":"B008DVJMAW","reviewerName":"Baberufus","helpful":[0,0],"reviewText":"are you tired of skynyrds current carnation of them in the last fifteen years let em go and grab hold of these guys charlie starr and co of blackberry smoke music and songs like the old skynyrd the seventys this is really what southern rock is all about twin honky piano a solid rhythm section and charlies southern soaked vocals are kicking some serious butt and taking names including mine all these guys it up but they actually and easily slip to more of a country sound there and there with great harmonies and all and theres nothing wrong with that because they hearken back to real country not wrap metal infected garbage you hear on country radio these days i highly recommend this album and their previous little taste of dixie both albums are solid throughout with great playing great songs actually if youre for long jams like the allman brothers are known for you wont find them there as the are their main focus in concert though these guys jam for sure so check em out when they come around in addition catchy melodies and solid heavy music lyrics in blackberry smokes songs are fantastic the same ol fist in the air im a redneck proud of it themes that you hear too much of crappy country music these days highly recommended for southern rock fans","overall":5,"summary":"The newest of my favorite bands!","unixReviewTime":1376438400,"reviewTime":"08 14, 2013"}
{"orig_index":62447,"reviewerID":"A2BJAET1P9QUGZ","asin":"B008DVJMAW","reviewerName":"Baberufus","helpful":[0,0],"reviewText":"are you tired of skynyrds the current carnation of them flame output in the last fifteen years then let em go and grab hold of these guys charlie starr and co of blackberry smoke play music and write songs like the old skynyrd of the seventys this is really what southern rock is all about twin guitars honky tonk piano a solid rhythm section and charlies southern soaked vocals are kicking some serious butt and taking names including mine all these guys rock it up but they actually and easily slip to more of a country sound there and there with great harmonies and all and theres nothing wrong with that because they hearken back to real country not the wrap metal infected garbage you hear on country radio these days i highly recommend this album and their previous effort little taste of dixie both albums are solid throughout with great playing and great songs actually if youre looking for long jams like the allman brothers are known for you wont find them there as the songs are their main focus in concert though these guys jam for sure so check em out when they come around in addition to catchy melodies and solid guitar heavy music the lyrics in blackberry smokes songs are fantastic not the same ol fist in the air im a redneck and proud of it themes that you hear too much of in crappy country music these days highly recommended for southern rock fans ","overall":5,"summary":"The newest of my favorite bands!","unixReviewTime":1376438400,"reviewTime":"08 14, 2013"}