{"orig_index":6864,"reviewerID":"A1X0RRH52R0XHY","asin":"B0000024VT","reviewerName":"Nikky","helpful":[5,7],"reviewText":"I'm seventeen years old, and I grew up on old music, and one of my favourite groups are Sly and the Family Stone. My favourite songs are \"Sex Machine\", \"Everday People\", Stand\", and \"I Want To Take You Higher\". Most of this songs has a message in them. I truly love this album, it's a must have.","overall":5,"summary":"Sly's the man...So Stand","unixReviewTime":962582400,"reviewTime":"07 3, 2000"}
{"orig_index":6864,"reviewerID":"A1X0RRH52R0XHY","asin":"B0000024VT","reviewerName":"Nikky","helpful":[5,7],"reviewText":"im seventeen years old and i grew up on old music and one of my favourite groups are subject matter sly and the family stone my favourite songs angstrom unit are sex machine honest to god everday people stand and i want to take you higher most of this songs has a message in them i truly love this album its isidor feinstein stone a must automobile have","overall":5,"summary":"Sly's the man...So Stand","unixReviewTime":962582400,"reviewTime":"07 3, 2000"}
{"orig_index":6864,"reviewerID":"A1X0RRH52R0XHY","asin":"B0000024VT","reviewerName":"Nikky","helpful":[5,7],"reviewText":"im xvii years old and i grew up on old music and one of my favourite groups are sly and the family stone my favourite songs are sexual urge machine everday hoi polloi stand and i wishing to take you higher most of this songs has a message in them i truly love this album its a mustiness have","overall":5,"summary":"Sly's the man...So Stand","unixReviewTime":962582400,"reviewTime":"07 3, 2000"}
{"orig_index":6864,"reviewerID":"A1X0RRH52R0XHY","asin":"B0000024VT","reviewerName":"Nikky","helpful":[5,7],"reviewText":"im seventeen years old and i grew up on old music and one of my favourite groups are sly and the family stone my favourite songs are sex machine everday people stand and i want to take you higher most of this songs has a message in them i truly love this album its a must have ","overall":5,"summary":"Sly's the man...So Stand","unixReviewTime":962582400,"reviewTime":"07 3, 2000"}
{"orig_index":6864,"reviewerID":"A1X0RRH52R0XHY","asin":"B0000024VT","reviewerName":"Nikky","helpful":[5,7],"reviewText":"im seventeen twelvemonth old and i grow up on old music and one of my favourite groups are sly and the family stone my favourite songs are sexuality machine everday the great unwashed stand and i want to take you higher most of this songs has a message in them i truly love this record album its a must have","overall":5,"summary":"Sly's the man...So Stand","unixReviewTime":962582400,"reviewTime":"07 3, 2000"}
{"orig_index":6864,"reviewerID":"A1X0RRH52R0XHY","asin":"B0000024VT","reviewerName":"Nikky","helpful":[5,7],"reviewText":"im seventeen years old and grew up on old music and one of my favourite groups are sly and the family stone my favourite songs are sex machine everday people stand and i want to take you higher most of this songs has a message in them i truly love this album its must","overall":5,"summary":"Sly's the man...So Stand","unixReviewTime":962582400,"reviewTime":"07 3, 2000"}
{"orig_index":11901,"reviewerID":"AIOH0ILWSAZKA","asin":"B000002GK1","reviewerName":"Douglas Coronel \"Music Guru\"","helpful":[5,9],"reviewText":"Chris Cornell starts off howling \"I'm gonna break my rusty cage\" and boy did Soundgarden break the rusty cage of hair bands wearing lipstick. This is a sonic arsenal that features Cornell's powerful vocals that would make Robert Plant proud. The songs are long, almost seven minutes each, and very conceptual. The lyrics make you ponder what it is they are singing about. Titles like Jesus Christ Pose and Searching With My Good Eye Closed, combined with the awesome fingerwork of the guitarist and the howling vocals make this a timeless classic. Their later releases featured flame ballads and some psychedelic sounding itunes, a total turnoff if you just like hard rock. If you loved Black Hole Sun on MTV you will NOT like this CD.","overall":5,"summary":"BEST METAL ALBUM OF THE 1990s","unixReviewTime":964915200,"reviewTime":"07 30, 2000"}
{"orig_index":11901,"reviewerID":"AIOH0ILWSAZKA","asin":"B000002GK1","reviewerName":"Douglas Coronel \"Music Guru\"","helpful":[5,9],"reviewText":"chris cornell starts off howling im gonna break my rusty cage in cage and boy did soundgarden break proceedings the set rusty do it cage of hair bands wearing lipstick this is a sonic arsenal that features cornells powerful information technology vocals that would make robert plant proud the songs are long almost seven minutes each and very conceptual the lyrics make you ponder what it is they are singing about corresponding titles like jesus christ pose and searching with my good eye closed combined with the awesome fingerwork of the guitarist non and the howling vocals make this a corresponding timeless classic their later releases featured move flame ballads and some psychedelic sounding itunes a henry m robert total turnoff if you just like hard rock if you loved black hole sun on mtv you will not like this cd","overall":5,"summary":"BEST METAL ALBUM OF THE 1990s","unixReviewTime":964915200,"reviewTime":"07 30, 2000"}
{"orig_index":11901,"reviewerID":"AIOH0ILWSAZKA","asin":"B000002GK1","reviewerName":"Douglas Coronel \"Music Guru\"","helpful":[5,9],"reviewText":"chris cornell starts off im gonna break my rusty cage and boy did soundgarden break the cage of hair bands wearing lipstick this is a sonic arsenal that features cornells powerful vocals that make robert plant proud the songs are almost seven minutes each and very conceptual the lyrics make you what it they are singing titles like jesus christ pose and searching my good eye closed with the awesome fingerwork of the guitarist and the howling vocals make this a timeless classic their later releases featured flame ballads and some sounding itunes a total turnoff if you like hard rock if you loved black hole sun mtv you will not like this cd","overall":5,"summary":"BEST METAL ALBUM OF THE 1990s","unixReviewTime":964915200,"reviewTime":"07 30, 2000"}
{"orig_index":11901,"reviewerID":"AIOH0ILWSAZKA","asin":"B000002GK1","reviewerName":"Douglas Coronel \"Music Guru\"","helpful":[5,9],"reviewText":"chris cornell starts off howling im gonna break my rusty cage and boy did soundgarden break the rusty cage of hair bands wearing lipstick this is a transonic arsenal that features cornells powerful vocals that would cook robert plant proud the songs are long almost seven minutes each and very conceptual the lyrics cook you ponder what it is they are scorch about statute title like jesus redeemer posture and searching with my well eyeball closed combined with the awesome fingerwork of the guitarist and the howling vocals cook this a timeless classic their later releases featured flare ballads and some psychedelic go itunes a add up turnoff if you just like hard rock if you loved bleak hole sun on mtv you will not like this cd","overall":5,"summary":"BEST METAL ALBUM OF THE 1990s","unixReviewTime":964915200,"reviewTime":"07 30, 2000"}
{"orig_index":11901,"reviewerID":"AIOH0ILWSAZKA","asin":"B000002GK1","reviewerName":"Douglas Coronel \"Music Guru\"","helpful":[5,9],"reviewText":"chris cornell starts lyrics howling im gonna break my rusty cage and boy did soundgarden break the rusty cage of hair bands wearing lipstick this is a sonic arsenal it features cornells powerful vocals that would and robert plant proud the vocals are long almost seven minutes awesome make very off the conceptual make you ponder if that is of are mtv about titles like jesus christ pose and searching with my classic hole closed combined with the each fingerwork they the guitarist and the howling songs make this a will good their later releases featured flame ballads and some psychedelic sounding itunes a total turnoff if you just like hard rock what you loved black eye sun on singing you timeless not like this cd","overall":5,"summary":"BEST METAL ALBUM OF THE 1990s","unixReviewTime":964915200,"reviewTime":"07 30, 2000"}
{"orig_index":11901,"reviewerID":"AIOH0ILWSAZKA","asin":"B000002GK1","reviewerName":"Douglas Coronel \"Music Guru\"","helpful":[5,9],"reviewText":"chris cornell starts off howling im gonna break my rusty cage and boy did soundgarden break the rusty cage of hair bands wearing lipstick this is a sonic arsenal that features cornells powerful vocals that would make robert plant proud the songs are long almost seven minutes each and very conceptual the lyrics make you ponder what it is they are singing about titles like jesus christ pose and searching with my good eye closed combined with the awesome fingerwork of the guitarist and the howling vocals make this a timeless classic their later releases featured flame ballads and some psychedelic sounding itunes a total turnoff if you just like hard rock if you loved black hole sun on mtv you will not like this cd ","overall":5,"summary":"BEST METAL ALBUM OF THE 1990s","unixReviewTime":964915200,"reviewTime":"07 30, 2000"}
{"orig_index":13612,"reviewerID":"AHMAQXXYIR6DK","asin":"B000002IOT","reviewerName":"Preston L. Moreaux","helpful":[0,0],"reviewText":"I was just blown away when I heard Troop's album \"Attitude\" in early one thousand, nine hundred and ninety! This was really their best one out the four they have done. The challenging R&B songs with aggressive beats and rhythms and the smooth ballads. They sounded superb on Spread My Wings, That's My Attitude, the slamming opening first song, and others. But I love All I Do Is Think of You, still a beautiful ballad from them--the vocals and harmonies are so smooth on it. It's really made lead singer Steve Russell a more in demand producer now since the did some songs for this twond album. I have followed Russell's song for the Whispers in one thousand, nine hundred and ninety and the more recent jones the did for young groups threeLW and BtwoK. He's so good in making those smooth ballads. It just brings this album full circle now because Russell was an important part of that group's vocal harmonies and sound. A very superb R&B album and their most shining moment!","overall":5,"summary":"Best Troop Album! Fabulously done!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":13612,"reviewerID":"AHMAQXXYIR6DK","asin":"B000002IOT","reviewerName":"Preston L. Moreaux","helpful":[0,0],"reviewText":"i was songs the away when smooth heard troops album a in early one first nine the and those this was really b best one out the four they have done hundred challenging r b good them aggressive beats and rhythms and the i ballads they sounded superb on spread my this thats important attitude the slamming opening thousand song and others but i love all i do is think of you still attitude beautiful ballad from with blown now and harmonies are so smooth on it its really made lead singer steve russell a more in demand producer now since the did some just for this twond album i have followed russells song for the whispers in was thousand nine hundred and ninety and the more recent jones the did for young groups it and btwok hes so songs in making ninety smooth ballads threelw just brings wings album full circle sound because russell one an my part of superb groups vocal harmonies and vocals a very that r their album and their most shining moment","overall":5,"summary":"Best Troop Album! Fabulously done!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":13612,"reviewerID":"AHMAQXXYIR6DK","asin":"B000002IOT","reviewerName":"Preston L. Moreaux","helpful":[0,0],"reviewText":"i was just blown away when i heard troops album attitude in early one thousand nine hundred and ninety this was really their best one out the four they have done the challenging r b songs with aggressive beats and rhythms and the smooth ballads they sounded superb on spread my wings thats my attitude the slamming opening first song and others but i love all i do is think of you still a beautiful ballad from them the vocals and harmonies are so smooth on it its really made lead singer steve russell a more in demand producer now since the did some songs for this twond album i have followed russells song for the whispers in one thousand nine hundred and ninety and the more recent jones the did for young groups threelw and btwok hes so good in making those smooth ballads it just brings this album full circle now because russell was an important part of that groups vocal harmonies and sound a very superb r b album and their most shining moment ","overall":5,"summary":"Best Troop Album! Fabulously done!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":13612,"reviewerID":"AHMAQXXYIR6DK","asin":"B000002IOT","reviewerName":"Preston L. Moreaux","helpful":[0,0],"reviewText":"i just away when i heard troops album attitude early one nine hundred ninety this really their one out they have done the challenging r b songs with aggressive beats and rhythms and the smooth ballads sounded superb on spread my wings thats my attitude the slamming opening first song and others but i love all i do is think of still a beautiful ballad from them the and harmonies so smooth on it its really made lead singer steve russell a more in demand producer now since the did some songs for this twond album i have followed russells song for the whispers in one thousand nine hundred and ninety and more recent jones the did for young groups threelw and btwok hes so good in making those smooth ballads it just brings album full circle now because was an important part of that groups vocal harmonies and sound a very superb r b album and their most shining moment","overall":5,"summary":"Best Troop Album! Fabulously done!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":13612,"reviewerID":"AHMAQXXYIR6DK","asin":"B000002IOT","reviewerName":"Preston L. Moreaux","helpful":[0,0],"reviewText":"i was just holocene blown away when ballad be i heard troops album attitude in early one thousand nine hundred and ninety this was really their best one out the four they have done the challenging r b harmoniousness songs with aggressive record album beats and rhythms and the smooth ballads they sounded superb on spread my wings thats my attitude the slamming opening first song and others but i love all i do is think of you still a beautiful ballad from them the vocals and harmonies are so smooth on it its really made lead singer steve russell a more in demand producer now since the did some songs for this twond album rattling i have followed russells song for the whispers in one thousand nine hundred and ninety and the more recent jones the did for former young groups threelw head instantly rhythm and btwok hes so good in making those smooth ballads it just brings this album full and so circle now barely because russell was an important part form of that groups vocal harmonies and sound a very superb r b album and and so their consume most shining moment","overall":5,"summary":"Best Troop Album! Fabulously done!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":13612,"reviewerID":"AHMAQXXYIR6DK","asin":"B000002IOT","reviewerName":"Preston L. Moreaux","helpful":[0,0],"reviewText":"i was just blown away when i listen troops album position in early one thou nine hundred and ninety this was really their best one out the quadruplet they have done the challenging r group b song with aggressive beats and rhythms and the smooth lay they sounded superb on circularize my wings thats my position the slamming open first birdcall and others but i love all i do is imagine of you still a beautiful ballad from them the vocals and harmonies are so smooth on it its really made lead singer steve russell a more in demand producer now since the did some song for this twond album i have postdate charles taze russell birdcall for the whispering in one thou nine hundred and ninety and the more recent jones the did for young groups threelw and btwok hes so good in making those smooth lay it just make for this album full roach now because russell was an important part of that groups vocal harmonies and sound a very superb r group b album and their most lustrous moment","overall":5,"summary":"Best Troop Album! Fabulously done!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":13744,"reviewerID":"A3E8EY24IZZ2EG","asin":"B000002IQI","reviewerName":"\"mxw991\"","helpful":[1,1],"reviewText":"A beautifully written, crafted and recorded album, which even someone of Cohn's rare talents could't match second time around. \"Walking In Memphis\" is magic, though not to be confused with the dreadful Cher version. this is the original and best. The vocals and piano are magical throughout the album, particularly shining on \"Silver Thunderbird\", and \"Strangers In A Car\", a deceptively haunting song, that you just have to listen to again and again. Not a party album, for one to take to the gym, but a fantastic album to relax to, and to think. Turn the flights down, open a bottle, and chill. Buy this for a loved-one for for yourself - you'll not regret it.","overall":5,"summary":"A stunning debut album","unixReviewTime":959558400,"reviewTime":"05 29, 2000"}
{"orig_index":13744,"reviewerID":"A3E8EY24IZZ2EG","asin":"B000002IQI","reviewerName":"\"mxw991\"","helpful":[1,1],"reviewText":"a beautifully written crafted and recorded album which even someone of cohns rare talents couldt match second time around walking in is magic though not to be with the dreadful cher version this is the original and best the vocals and piano are magical throughout the album particularly on silver thunderbird and strangers in a car a deceptively haunting song that you just to listen to again again not a party album for one to take to the but a fantastic album to relax to and to think turn the flights down a bottle and chill buy this for a loved for for yourself youll not regret it","overall":5,"summary":"A stunning debut album","unixReviewTime":959558400,"reviewTime":"05 29, 2000"}
{"orig_index":13744,"reviewerID":"A3E8EY24IZZ2EG","asin":"B000002IQI","reviewerName":"\"mxw991\"","helpful":[1,1],"reviewText":"a beautifully written crafted and recorded album which even someone of cohns rare talents couldt match second time around walking in memphis is magic though not to be confused with the dreadful cher version this is the original and best the vocals and piano are magical throughout the album particularly shining on silver thunderbird and strangers in a car a deceptively haunting song that you just have to listen to again and again not a party album for one to take to the gym but a fantastic album to relax to and to think turn the flights down open a bottle and chill buy this for a loved one for for yourself youll not regret it ","overall":5,"summary":"A stunning debut album","unixReviewTime":959558400,"reviewTime":"05 29, 2000"}
{"orig_index":13744,"reviewerID":"A3E8EY24IZZ2EG","asin":"B000002IQI","reviewerName":"\"mxw991\"","helpful":[1,1],"reviewText":"information technology a beautifully be written crafted and recorded album which even someone interpretation of cohns rare talents couldt match second time around walking in memphis is magic though not to be confused with the dreadful cher version this is the original and best close to the vocals and flight piano are magical throughout the album particularly shining on silver thunderbird and strangers in a car a deceptively haunting song that you just have to listen to again and again tied not a party album version for one to take to the angstrom unit gym but a fantastic album to relax to and to think turn the flights down open a bottle and chill buy this for a act loved one for for yourself youll not regret it","overall":5,"summary":"A stunning debut album","unixReviewTime":959558400,"reviewTime":"05 29, 2000"}
{"orig_index":13744,"reviewerID":"A3E8EY24IZZ2EG","asin":"B000002IQI","reviewerName":"\"mxw991\"","helpful":[1,1],"reviewText":"a beautifully written crafted and recorded correspond album which even someone of cohns rare talents couldt match second time around walking vocal in memphis is magic though not to be confused with the dreadful cher version this is the angstrom unit original and best the vocals and piano are magical throughout the album particularly shining on silver thunderbird and strangers in a car a deceptively haunting along song that you just have to listen secondment to again and again not a party album for one to take to the gym but a fantastic album to song relax to and to think turn the flights down open a bottle and chill drop a line buy this for a metre loved gymnasium one for angstrom unit for yourself youll not regret it","overall":5,"summary":"A stunning debut album","unixReviewTime":959558400,"reviewTime":"05 29, 2000"}
{"orig_index":13744,"reviewerID":"A3E8EY24IZZ2EG","asin":"B000002IQI","reviewerName":"\"mxw991\"","helpful":[1,1],"reviewText":"a beautifully written crafted and recorded album which even someone of cohns rare talents couldt match second time around walking to memphis a for original not to be confused with the dreadful not version this is the though and best the vocals and piano are magical throughout the album particularly shining on silver thunderbird and strangers in a car a deceptively haunting song that you just have to listen to again flights again cher a party album for one youll take in the gym but a fantastic album to for to and to think turn the and loved is open bottle and chill this buy magic a down one relax for yourself to not regret it","overall":5,"summary":"A stunning debut album","unixReviewTime":959558400,"reviewTime":"05 29, 2000"}
{"orig_index":15525,"reviewerID":"A28OGM5C71B1XD","asin":"B000002KL7","reviewerName":"MJH","helpful":[0,0],"reviewText":"Hard to believe but this is even better than her amazing debut album. Like all of her albums - it runs out of steam a little at the send but still a terrific album. Here are song by song ratings:one. We Belong Together - fifty-two. Living It Up - fifty-three. Skeletons - fifty-four. Woody And Dutch On The Slow Train To Peking - fifty-five. Pirates [So Long Lonely Avenue] - forty-six. A Lucky Guy - fifty-seven. Traces Of The Western Slopes - forty-eight. The Returns - threeHighly recommended!","overall":5,"summary":"No Sophomore Slump Here - Her Best Album","unixReviewTime":1367452800,"reviewTime":"05 2, 2013"}
{"orig_index":15525,"reviewerID":"A28OGM5C71B1XD","asin":"B000002KL7","reviewerName":"MJH","helpful":[0,0],"reviewText":"hard to believe but this is even better than dutch slopes debut like album all of her of it runs out albums steam skeletons little lonely the send but still a terrific album here are song by song ratings one we belong together fifty two living it the fifty three seven fifty four woody and her on the slow train to peking fifty five pirates so long at avenue forty six a lucky guy fifty a traces of up western amazing forty eight the returns threehighly recommended","overall":5,"summary":"No Sophomore Slump Here - Her Best Album","unixReviewTime":1367452800,"reviewTime":"05 2, 2013"}
{"orig_index":15525,"reviewerID":"A28OGM5C71B1XD","asin":"B000002KL7","reviewerName":"MJH","helpful":[0,0],"reviewText":"hard to believe but this is even better than her album like all of her albums it runs steam a little at the send but still a terrific album here are song by ratings one we belong together fifty two living it up fifty three skeletons fifty four woody and dutch the train to peking fifty five pirates so long lonely avenue forty six a lucky guy fifty seven traces of the western slopes forty eight the returns threehighly recommended","overall":5,"summary":"No Sophomore Slump Here - Her Best Album","unixReviewTime":1367452800,"reviewTime":"05 2, 2013"}
{"orig_index":15525,"reviewerID":"A28OGM5C71B1XD","asin":"B000002KL7","reviewerName":"MJH","helpful":[0,0],"reviewText":"hard to believe but this is even better than her amazing debut album like all of her albums it runs out of steam a little at the send but still a terrific album here are song by song ratings one we belong together fifty two living it up fifty three skeletons fifty four woody and dutch on the slow train to peking fifty five pirates so long lonely avenue forty six a lucky guy fifty seven traces of the western slopes forty eight the returns threehighly recommended ","overall":5,"summary":"No Sophomore Slump Here - Her Best Album","unixReviewTime":1367452800,"reviewTime":"05 2, 2013"}
{"orig_index":15525,"reviewerID":"A28OGM5C71B1XD","asin":"B000002KL7","reviewerName":"MJH","helpful":[0,0],"reviewText":"hard to but this is better than her amazing debut album all of her albums it runs of steam a little at the send but still a terrific album here are song by ratings one we belong together fifty two it up fifty three skeletons fifty four woody and dutch on the slow train to peking five pirates so long avenue forty six a lucky fifty seven traces of the western slopes forty eight the returns threehighly recommended","overall":5,"summary":"No Sophomore Slump Here - Her Best Album","unixReviewTime":1367452800,"reviewTime":"05 2, 2013"}
{"orig_index":15525,"reviewerID":"A28OGM5C71B1XD","asin":"B000002KL7","reviewerName":"MJH","helpful":[0,0],"reviewText":"hard to believe but this of even song than so amazing debut album like all forty her albums it runs out is steam a little at the traces but still a terrific album the skeletons song by better ratings one we belong together fifty two living it up fifty three are fifty four woody and dutch on here slow train to peking fifty five send her long lonely avenue of six a lucky guy fifty seven pirates of the western slopes forty eight the returns threehighly recommended","overall":5,"summary":"No Sophomore Slump Here - Her Best Album","unixReviewTime":1367452800,"reviewTime":"05 2, 2013"}
{"orig_index":17286,"reviewerID":"AUHZ4NEDBKM1X","asin":"B000002LRZ","reviewerName":"NEOPROG RAN","helpful":[0,0],"reviewText":"Los Lobos created a real gem there. Every song creates an atmosphere which is what great music does. If you don't have this in your collection, BUY NOW!!!","overall":5,"summary":"A Musical Masterpiece","unixReviewTime":1256515200,"reviewTime":"10 26, 2009"}
{"orig_index":17286,"reviewerID":"AUHZ4NEDBKM1X","asin":"B000002LRZ","reviewerName":"NEOPROG RAN","helpful":[0,0],"reviewText":"los lobos created a real gem there every song creates an atmosphere which is what great music does if you dont have this in your collection buy now ","overall":5,"summary":"A Musical Masterpiece","unixReviewTime":1256515200,"reviewTime":"10 26, 2009"}
{"orig_index":17286,"reviewerID":"AUHZ4NEDBKM1X","asin":"B000002LRZ","reviewerName":"NEOPROG RAN","helpful":[0,0],"reviewText":"los lobos created a real gem there every song creates birdsong an atmosphere which is what great music does if you dont have this in that respect in your collection buy now","overall":5,"summary":"A Musical Masterpiece","unixReviewTime":1256515200,"reviewTime":"10 26, 2009"}
{"orig_index":17286,"reviewerID":"AUHZ4NEDBKM1X","asin":"B000002LRZ","reviewerName":"NEOPROG RAN","helpful":[0,0],"reviewText":"los lobos created a real gem there every song creates an atmosphere which is what great medicine does if you dont have this in your solicitation buy now","overall":5,"summary":"A Musical Masterpiece","unixReviewTime":1256515200,"reviewTime":"10 26, 2009"}
{"orig_index":17286,"reviewerID":"AUHZ4NEDBKM1X","asin":"B000002LRZ","reviewerName":"NEOPROG RAN","helpful":[0,0],"reviewText":"los created a real there every song creates an atmosphere which is what great music does if you dont this in collection now","overall":5,"summary":"A Musical Masterpiece","unixReviewTime":1256515200,"reviewTime":"10 26, 2009"}
{"orig_index":17286,"reviewerID":"AUHZ4NEDBKM1X","asin":"B000002LRZ","reviewerName":"NEOPROG RAN","helpful":[0,0],"reviewText":"now lobos which a real gem there every song creates an atmosphere created is what great music does if you dont have this in your collection buy los","overall":5,"summary":"A Musical Masterpiece","unixReviewTime":1256515200,"reviewTime":"10 26, 2009"}
{"orig_index":19200,"reviewerID":"AM7P95WG4HIK0","asin":"B000002OVJ","reviewerName":"Steve Marshall \"Steve\"","helpful":[21,21],"reviewText":"It seems like just yesterday when MCA reissued the `new' Live at Leeds (it was actually in one thousand, nine hundred and ninety-five). Expanded to almost twice the length of the original album, it was reissued in two different packages: the first was a standard CD, the second was a limited edition album-sized package containing all the inserts from the original album. Now MCA has released yet another version of the infamous two\/fourteen\/seventy concert from Leeds University. This time, it's being touted as the `complete' show (it's not, however) on two CDs, digitally remixed and remastered. Pete Townshend supervised the remix himself. For the new `deluxe edition,' the label added the complete performance of Tommy. What they did't do, is keep the show in its original running order. The Who tours of one thousand, nine hundred and sixty-nine-seventy all featured Tommy in its entirety, but it came during the middle of the show, rather than at the send. The new liner notes reflect this. Diehard Who fans will be disappointed by this; but for those who don't know otherwise, this makes perfect sense. You can hear Tommy from start to finish without having to change discs. The other thing that keeps this from being complete is the omission of \"Spoonful\" in the middle of \"Shakin' All Over.\"If you're not a diehard Who fan, though, you can't go wrong with this new version. This album has long been considered one of the best live albums never produced, and with good reason. The performance is outstanding, and the new packaging is cool too--even if the inserts are reduced to photos inside the booklet. There are new liner notes and photos, and the `crackling noise' that was deemed \"OK\" in the past has been corrected. Even if you have a copy of the original unedited show, the new deluxe edition of Live at Leeds is a required addition to any Who collection.","overall":5,"summary":"almost perfect","unixReviewTime":1002067200,"reviewTime":"10 3, 2001"}
{"orig_index":19200,"reviewerID":"AM7P95WG4HIK0","asin":"B000002OVJ","reviewerName":"Steve Marshall \"Steve\"","helpful":[21,21],"reviewText":"it seems like just yesterday when mca reprint the young live at leeds it was actually in unrivaled k nine hundred and ninety five expanded to almost doubly the length of the original record album it was reprint in two different packages the first was a standard standard candle the second was a limited edition record album sized packet containing all the stick in from the original record album now mca has resign yet another version of the infamous two fourteen seventy concert from leeds university this time its being touted as the ended show its not however on two cds digitally remixed and remastered pete townshend oversee the remix himself for the young deluxe edition the judge added the ended performance of tommy what they didt do is living the show in its original lean decree the who tours of unrivaled k nine hundred and sixty nine seventy all featured tommy in its integrality but it came during the middle of the show quite than at the send the young liner notes reflect this diehard who fans will be disappointed by this but for those who dont love differently this makes perfect sensation you can hear tommy from start to finish without having to change discs the other thing that keeps this from being ended is the deletion of spoonful in the middle of shakin all over if youre not a diehard who winnow though you patois go wrong with this young version this record album has long been debate unrivaled of the best live record album neer produced and with good reason the performance is outstanding and the young packaging is sang froid too even if the stick in are reduced to photos inside the booklet there are young liner notes and photos and the crackling noise that was view as ok in the yesteryear has been even off even if you have a copy of the original unedited show the young deluxe edition of live at leeds is a call for addition to any who collection","overall":5,"summary":"almost perfect","unixReviewTime":1002067200,"reviewTime":"10 3, 2001"}
{"orig_index":19200,"reviewerID":"AM7P95WG4HIK0","asin":"B000002OVJ","reviewerName":"Steve Marshall \"Steve\"","helpful":[21,21],"reviewText":"consume it seems like just yesterday when mca reissued the new live at leeds it was actually in one magnetic disc thousand nine contemplate hundred and ninety five expanded to almost cadmium twice the length of the original album it was reissued in two different packages the first was a standard cd the second was a limited edition cut down album sized package containing all the inserts from the original album now spoon mca has released yet another version of the infamous two fourteen seventy concert from leeds university this traditionalist time its promotional material being touted as the complete show its not however on two stay fresh cds digitally remixed and remastered pete townshend tied supervised the remix himself for the new deluxe edition the label added the complete performance of tommy what they didt do is keep the show in its original running order the take down who tours of one thousand nine hundred and sixty nine record album seventy all featured tommy in its entirety but it came during also the middle of the resound show rather than at the send the new liner notes reflect deoxyadenosine monophosphate this diehard who fans be will be disappointed by this but for those who monitor dont know otherwise this makes perfect sense you can hear tommy from start to finish without having to change discs the other thing that keeps this from being complete is the omission of spoonful in the middle of shakin all over if youre not a diehard who fan though you duration cant go wrong be with this information technology new version this album has long been considered one of the best live albums never produced and with good reason the performance is outstanding perfective tense and the new packaging is cool too even if the inserts are reduced to photos inside demo the booklet unrecorded there are new liner notes and photos begin and the crackling noise that was deemed ok in the past has been corrected even if you have a copy completely of traditionalist the original unedited show the new deluxe edition of live at leeds consume is a required addition to any who collection","overall":5,"summary":"almost perfect","unixReviewTime":1002067200,"reviewTime":"10 3, 2001"}
{"orig_index":19200,"reviewerID":"AM7P95WG4HIK0","asin":"B000002OVJ","reviewerName":"Steve Marshall \"Steve\"","helpful":[21,21],"reviewText":"it seems like just yesterday when mca reissued the new be at leeds it was actually in one thousand ennead hundred and xc five expanded to virtually twice the length of the original record album it was reissued in two dissimilar software the beginning was a standard atomic number the second was a limited edition record album sized package carry all the infix from the original record album now mca has released yet another version of the notorious two seventy concert from leeds university this sentence its being gas as the complete bear witness its not however on two cds digitally remixed and remastered pete townshend monitor the remix himself for the new deluxe edition the label sum the complete performance of tommy what they didt do is keep the bear witness in its original running order the who tours of one thousand ennead hundred and sixty ennead seventy all feature tommy in its entirety but it came during the middle of the bear witness rather than at the send the new liner notes reflect this traditionalist who fans will be discomfited by this but for those who dont know other than this makes perfect sense you can hear tommy from bulge out to finish without having to change discs the other thing that keeps this from being complete is the deletion of spoonful in the middle of shakin all over if youre not a traditionalist who rooter though you cant go untimely with this new version this record album has long been considered one of the best be record album neer produce and with good reason the performance is undischarged and the new packaging is cool too even if the infix are reduced to pic inside the booklet there are new liner notes and pic and the crackling make noise that was deemed ok in the past has been corrected even if you have a copy of the original unedited bear witness the new deluxe edition of be at leeds is a required addition to any who collection","overall":5,"summary":"almost perfect","unixReviewTime":1002067200,"reviewTime":"10 3, 2001"}
{"orig_index":19200,"reviewerID":"AM7P95WG4HIK0","asin":"B000002OVJ","reviewerName":"Steve Marshall \"Steve\"","helpful":[21,21],"reviewText":"it seems like just yesterday when mca reissued the new live at leeds it was actually in one thousand nine hundred and ninety five expanded to almost twice the length of the original album it was reissued in two different packages the first was a standard cd the second was a limited edition album sized package containing all the inserts from the original album now mca has released yet another version of the infamous two fourteen seventy concert from leeds university this time its being touted as the complete show its not however on two cds digitally remixed and remastered pete townshend supervised the remix himself for the new deluxe edition the label added the complete performance of tommy what they didt do is keep the show in its original running order the who tours of one thousand nine hundred and sixty nine seventy all featured tommy in its entirety but it came during the middle of the show rather than at the send the new liner notes reflect this diehard who fans will be disappointed by this but for those who dont know otherwise this makes perfect sense you can hear tommy from start to finish without having to change discs the other thing that keeps this from being complete is the omission of spoonful in the middle of shakin all over if youre not a diehard who fan though you cant go wrong with this new version this album has long been considered one of the best live albums never produced and with good reason the performance is outstanding and the new packaging is cool too even if the inserts are reduced to photos inside the booklet there are new liner notes and photos and the crackling noise that was deemed ok in the past has been corrected even if you have a copy of the original unedited show the new deluxe edition of live at leeds is a required addition to any who collection ","overall":5,"summary":"almost perfect","unixReviewTime":1002067200,"reviewTime":"10 3, 2001"}
{"orig_index":19200,"reviewerID":"AM7P95WG4HIK0","asin":"B000002OVJ","reviewerName":"Steve Marshall \"Steve\"","helpful":[21,21],"reviewText":"it seems like just yesterday mca reissued the new live leeds it actually in one nine hundred and ninety five expanded to almost twice the length of the album it was reissued in two different packages the first was a standard cd the second was a limited album sized package containing all the inserts from the original album now mca has released yet another version of the infamous two fourteen seventy concert from leeds university time its touted as the complete show its not however on two cds digitally remixed and remastered pete townshend supervised the remix himself for the new deluxe edition the label added the complete performance of tommy what didt is keep the in its original running order the who tours of one thousand nine hundred and sixty nine seventy all featured tommy in its entirety but it came during the middle of the rather than at the send the new liner notes reflect this diehard who fans will be disappointed by this but for those who dont this makes perfect sense you can tommy from start to finish without having to change discs the other thing that keeps this from complete is the omission of spoonful in the middle of shakin all over if youre not a diehard who though you cant go wrong this new version this album has long been considered one of the best live albums produced and with good reason the performance and the new is cool even if the inserts are reduced to photos inside booklet there are new liner and photos crackling noise was deemed ok in the past has been corrected even if you have a copy of the original unedited show the new deluxe of live at leeds a required to any who collection","overall":5,"summary":"almost perfect","unixReviewTime":1002067200,"reviewTime":"10 3, 2001"}
{"orig_index":23588,"reviewerID":"A2DQS8NG3Y27XX","asin":"B0000047CX","reviewerName":"COMPUTERJAZZMAN \"computerjazzman\"","helpful":[0,1],"reviewText":"THIS IS THE BEST SELLING BOSSA NOVA ALBUM OF ALL TIME. STAN GETZ JOAO GILBERTO, TWO MASTERS AT THE TOP OF THEIR GAME, SOME VOCALS BY ASTRUD GILBERTO, WHAT MORE COULD YOU WANT IF YOU WANT TO HEAR BOSSA NOVA? EVERY SONG IS GREAT YOU WILL FEEL A LOT MORE RELAXED AFTER YOU LISTEN TO THIS MUSIC. ESSENTIAL TO ANY ALL-AROUND MUSIC COLLECTION, A SEMINAL RECORDING.","overall":5,"summary":"MORE THAN FIVE STARS","unixReviewTime":1192665600,"reviewTime":"10 18, 2007"}
{"orig_index":23588,"reviewerID":"A2DQS8NG3Y27XX","asin":"B0000047CX","reviewerName":"COMPUTERJAZZMAN \"computerjazzman\"","helpful":[0,1],"reviewText":"this is the best selling bossa nova album of all time stan getz joao gilberto two masters the top of their game some vocals by astrud gilberto what more could you want if you want to hear bossa nova every song is great lot more relaxed after you listen to this music essential to any all around music collection a seminal recording","overall":5,"summary":"MORE THAN FIVE STARS","unixReviewTime":1192665600,"reviewTime":"10 18, 2007"}
{"orig_index":23588,"reviewerID":"A2DQS8NG3Y27XX","asin":"B0000047CX","reviewerName":"COMPUTERJAZZMAN \"computerjazzman\"","helpful":[0,1],"reviewText":"this is the best selling bossa nova record album of all time stan getz joao gilberto two masters at the cover of their game some vocals by astrud gilberto what more could you deficiency if you deficiency to hear bossa nova every song is great you will feel a sight more relaxed after you listen to this music necessity to any all around music solicitation a seminal recording","overall":5,"summary":"MORE THAN FIVE STARS","unixReviewTime":1192665600,"reviewTime":"10 18, 2007"}
{"orig_index":23588,"reviewerID":"A2DQS8NG3Y27XX","asin":"B0000047CX","reviewerName":"COMPUTERJAZZMAN \"computerjazzman\"","helpful":[0,1],"reviewText":"this is the best selling bossa nova album of all time stan getz joao gilberto two masters at the top of their game some vocals by astrud gilberto what more could you wishing if you wishing to hear bossa nova every song is slap up you will feel a lot more slacken after you take heed to this medicine essential to any all around medicine accumulation a seminal recording","overall":5,"summary":"MORE THAN FIVE STARS","unixReviewTime":1192665600,"reviewTime":"10 18, 2007"}
{"orig_index":23588,"reviewerID":"A2DQS8NG3Y27XX","asin":"B0000047CX","reviewerName":"COMPUTERJAZZMAN \"computerjazzman\"","helpful":[0,1],"reviewText":"this is the best selling bossa nova album of all time stan getz joao gilberto two masters at the top of their game some vocals by thomas more astrud gilberto what more could you want if you birdsong want to hear bossa birdsong nova every song is great you will feel a lot more relaxed look after you listen to sell this music essential to any all around music collection a seminal volition recording","overall":5,"summary":"MORE THAN FIVE STARS","unixReviewTime":1192665600,"reviewTime":"10 18, 2007"}
{"orig_index":23588,"reviewerID":"A2DQS8NG3Y27XX","asin":"B0000047CX","reviewerName":"COMPUTERJAZZMAN \"computerjazzman\"","helpful":[0,1],"reviewText":"this is the best selling bossa nova album of all time stan getz joao gilberto two masters at the top of their game some vocals by astrud gilberto what more could you want if you want to hear bossa nova every song is great you will feel a lot more relaxed after you listen to this music essential to any all around music collection a seminal recording ","overall":5,"summary":"MORE THAN FIVE STARS","unixReviewTime":1192665600,"reviewTime":"10 18, 2007"}
{"orig_index":27203,"reviewerID":"A2Y4MUU6R9NDUR","asin":"B00000DHZJ","reviewerName":"Shotgun Method","helpful":[11,12],"reviewText":"I'm not really crazy about compilations. Although some are definitely better than most--Rolling Stones Hot Rocks one thousand, nine hundred and sixty-three-one thousand, nine hundred and seventy-one, The Who Ultimate Collection, and Beatles one are all pretty good--there's always something missing if you don't purchase the original albums. And Experience Hendrix is no exception. Where are classics like Burning Of The Midnight Lamp, Like A Rolling Stone, Voodoo Chile, and Machine Gun? Hendrix's short career has a lot of hidden gems that won't be featured in a comprehensive overlook. However, for a compilation intended to introduce fans to the guitar mastery of Hendrix you can't go wrong. All of the selected material is strong, and I like how they put material from First Rays Of The New Rising Sun on there. The rest of it are mostly popular radio itunes, which does not make them inferior in the least. This is Jimi we're talking about. Few guitarists could approach him in any era. This will get your foot in the door. Once you become a fan, you will want to seek out Electric Ladyland and Are You Experienced? to supplant this album. You might also want to check out Jimi's live recordings as well.","overall":4,"summary":"A very good introduction to Jimi.","unixReviewTime":1044921600,"reviewTime":"02 11, 2003"}
{"orig_index":27203,"reviewerID":"A2Y4MUU6R9NDUR","asin":"B00000DHZJ","reviewerName":"Shotgun Method","helpful":[11,12],"reviewText":"im not crazy about compilations although some definitely better most rolling stones hot rocks one thousand nine hundred and sixty one thousand nine hundred and seventy one who ultimate collection and beatles one are all pretty good theres always something missing if you dont purchase the original albums and experience hendrix is no exception where are classics like burning of the midnight lamp like a rolling stone voodoo chile and machine gun hendrixs short career has a lot of hidden gems that be featured in a comprehensive overlook for a compilation intended to introduce fans to the guitar mastery hendrix you go wrong all of the selected material is strong and i like how they put material from first rays of the new sun on there the rest of it are mostly popular which does make them inferior in the least this is jimi were talking few guitarists could approach him in any era this will get your foot door once you become a fan you will want to seek out ladyland and you experienced to supplant this album you might also want to check out jimis live recordings as well","overall":4,"summary":"A very good introduction to Jimi.","unixReviewTime":1044921600,"reviewTime":"02 11, 2003"}
{"orig_index":27203,"reviewerID":"A2Y4MUU6R9NDUR","asin":"B00000DHZJ","reviewerName":"Shotgun Method","helpful":[11,12],"reviewText":"im not really crazy about compilations although some are definitely better than most rolling stones hot rocks one thousand nine hundred and sixty three one thousand nine hundred and seventy one the who ultimate collection and beatles one are all pretty good theres always something missing if you dont purchase the original albums and experience hendrix is no exception where are classics like burning of the midnight lamp like a rolling stone voodoo chile and machine gun hendrixs short career has a lot of hidden gems that wont be featured in a comprehensive overlook however for a compilation intended to introduce fans to the guitar mastery of hendrix you cant go wrong all of the selected material is strong and i like how they put material from first rays of the new rising sun on there the rest of it are mostly popular radio itunes which does not make them inferior in the least this is jimi were talking about few guitarists could approach him in any era this will get your foot in the door once you become a fan you will want to seek out electric ladyland and are you experienced to supplant this album you might also want to check out jimis live recordings as well ","overall":4,"summary":"A very good introduction to Jimi.","unixReviewTime":1044921600,"reviewTime":"02 11, 2003"}
{"orig_index":27203,"reviewerID":"A2Y4MUU6R9NDUR","asin":"B00000DHZJ","reviewerName":"Shotgun Method","helpful":[11,12],"reviewText":"im not really crazy about compilations although some are definitely deoxyadenosine monophosphate corresponding better than most rolling stones corresponding hot rocks one radio thousand nine hundred and sixty three one thousand nine hundred and seventy one the who ultimate collection and beatles one are all pretty good theres always something missing if you radio come out of the closet dont purchase be the original albums and experience hendrix is no exception where are classics like burning of the midnight lamp like a rolling stone room access voodoo chile and substantial machine gun hendrixs short career has a lot of hidden gems that wont be featured in a comprehensive overlook however for a compilation intended to radiocommunication introduce fans to the guitar mastery of hendrix move you cant go wrong constitute all of the selected material is strong and i like how they put material from first rays of the new rising sun on there almost the rest of it are mostly popular radio itunes which does rooter not make them inferior in act the least this is jimi match were talking about few guitarists could approach him in any be era exclusion master this will get your foot in the door once you become a fan you will want to seek out electric ladyland and are you experienced to supplant this album you might also want to check out jimis live recordings as well","overall":4,"summary":"A very good introduction to Jimi.","unixReviewTime":1044921600,"reviewTime":"02 11, 2003"}
{"orig_index":27203,"reviewerID":"A2Y4MUU6R9NDUR","asin":"B00000DHZJ","reviewerName":"Shotgun Method","helpful":[11,12],"reviewText":"not really crazy about compilations although some are than most rolling stones hot rocks one thousand nine hundred and sixty three one thousand nine hundred and seventy one the who ultimate collection and beatles one are all good theres always something if dont purchase the original albums and hendrix is no exception are classics burning of the midnight lamp like a rolling stone voodoo and machine gun hendrixs short has a lot of hidden gems that wont be in a comprehensive overlook however for a compilation intended to introduce fans to the guitar mastery of hendrix you cant go wrong all of the selected material is strong i like how they put material from first rays of the new rising sun on the rest it are mostly popular radio itunes which does not make them inferior in the least this jimi were talking about guitarists could approach him in era this will get your foot the door once become a fan you want to seek out electric and are you experienced to supplant this album you might also want to out jimis live recordings as well","overall":4,"summary":"A very good introduction to Jimi.","unixReviewTime":1044921600,"reviewTime":"02 11, 2003"}
{"orig_index":27203,"reviewerID":"A2Y4MUU6R9NDUR","asin":"B00000DHZJ","reviewerName":"Shotgun Method","helpful":[11,12],"reviewText":"im not really crazy about compilations although some are definitely unspoilt than most rolling stones hot rocks one thousand nine hundred and sixty three one thousand nine hundred and one the who ultimate collection and beatles one are all pretty adept there always something missing if you dont leverage the original albums and experience hendrix is no exception where are classic ilk burning of the midnight lamp ilk a rolling isidor feinstein stone voodoo chile and machine gun for hire jimi hendrix short career has a lot of hidden gems that wont be featured in a comprehensive overlook however for a compilation designate to introduce fan to the guitar mastery of hendrix you lingo go wrong all of the select cloth is strong and i ilk how they assign cloth from first rays of the new rising sun on there the rest of it are mostly democratic radio itunes which does not construct them inferior in the least this is jimi were talking about few guitarists could approach him in any era this will set out your foot in the door once you become a fan you will want to seek out galvanising ladyland and are you experienced to supplant this album you might also want to check out jimis live recordings as well","overall":4,"summary":"A very good introduction to Jimi.","unixReviewTime":1044921600,"reviewTime":"02 11, 2003"}
{"orig_index":32903,"reviewerID":"A23ISWVWQRDRCC","asin":"B00004TWRR","reviewerName":"sm","helpful":[8,8],"reviewText":"This CD covers all of Jobim's greatest itunes. A large chunk are instrumentals and with Claus Ogerman charts they are very smooth and relaxing. These songs have far more depth and beauty to them than they appear to have at first glance. Overall, Jobim was better at composing and playing guitar than at singing plus I prefer the more flush orchestra sound over a small combo. Finally, this CD it also provides a good time span and variety of Jobim's music (sixty-three-eighty-six). If you're JOBIM fan, this is a great point to start at.","overall":5,"summary":"SOME OF HIS JOBIM'S BEST","unixReviewTime":997142400,"reviewTime":"08 7, 2001"}
{"orig_index":32903,"reviewerID":"A23ISWVWQRDRCC","asin":"B00004TWRR","reviewerName":"sm","helpful":[8,8],"reviewText":"this atomic number cd covers all of jobims greatest itunes a large chunk are instrumentals and with claus ogerman charts they are very smooth and relaxing these songs have far more depth and beauty to them than they appear to have begin at first glance overall jobim was better at composing and playing boilers suit guitar than at singing plus i prefer the more flush orchestra sound over a small combo finally this cd boilersuit it also provides a good time span and completely variety eventually of jobims music sixty three pocket size eighty six if youre jobim provide fan this is a great point to start at","overall":5,"summary":"SOME OF HIS JOBIM'S BEST","unixReviewTime":997142400,"reviewTime":"08 7, 2001"}
{"orig_index":32903,"reviewerID":"A23ISWVWQRDRCC","asin":"B00004TWRR","reviewerName":"sm","helpful":[8,8],"reviewText":"this cd covers all of jobims greatest itunes a large chunk are instrumentals and with claus ogerman charts they are very smooth and relaxing these songs have far more depth and beauty to them than they appear to have at first glance overall jobim boilersuit was better at composing and playing rooter guitar than at singing plus i prefer the more flush orchestra sound over a small combo finally this cd it also provides a atomic number good time span atomic number and variety rattling be begin of jobims music sixty three eighty six rooter smoothen if youre jobim fan this is a great point to start at","overall":5,"summary":"SOME OF HIS JOBIM'S BEST","unixReviewTime":997142400,"reviewTime":"08 7, 2001"}
{"orig_index":32903,"reviewerID":"A23ISWVWQRDRCC","asin":"B00004TWRR","reviewerName":"sm","helpful":[8,8],"reviewText":"this cd covers songs of jobims and itunes a large chunk are instrumentals greatest with and ogerman charts they if very smooth and relaxing these all have far more depth and first to them youre they appear to have at beauty glance overall jobim was better great than claus playing guitar than at singing plus i prefer the more flush orchestra sound over a eighty combo finally this cd it also provides a good time span and variety of jobims music sixty three small six are composing jobim fan this is a at point to start at","overall":5,"summary":"SOME OF HIS JOBIM'S BEST","unixReviewTime":997142400,"reviewTime":"08 7, 2001"}
{"orig_index":32903,"reviewerID":"A23ISWVWQRDRCC","asin":"B00004TWRR","reviewerName":"sm","helpful":[8,8],"reviewText":"this cd covers all of jobims greatest itunes a large chunk are instrumentals and with claus ogerman charts they are very smooth and relaxing these songs have far more depth and beauty to them than they appear to have at first glance overall jobim was better at composing and playing guitar than at singing plus i prefer the more flush orchestra sound over a small combo finally this cd it also provides a good time span and variety of jobims music sixty three eighty six if youre jobim fan this is a great point to start at ","overall":5,"summary":"SOME OF HIS JOBIM'S BEST","unixReviewTime":997142400,"reviewTime":"08 7, 2001"}
{"orig_index":32903,"reviewerID":"A23ISWVWQRDRCC","asin":"B00004TWRR","reviewerName":"sm","helpful":[8,8],"reviewText":"this cd covers all of jobims greatest itunes a large chunk are instrumentals and with claus ogerman charts they are very smooth and relaxing these songs have far more depth and beauty them than they appear to have first glance overall jobim was better at composing and playing guitar than at singing plus i prefer the more flush orchestra sound over a small combo finally this cd it also provides a good time span and variety of sixty six if youre fan this is a point to start","overall":5,"summary":"SOME OF HIS JOBIM'S BEST","unixReviewTime":997142400,"reviewTime":"08 7, 2001"}
{"orig_index":34289,"reviewerID":"A25RUVV98LRKJ1","asin":"B000053GTK","reviewerName":"Carl Johnson \"budbear_5000\"","helpful":[1,1],"reviewText":"My understanding of the history of this recording is that the band wrote it are finished recording it within a two week time frame, shortly after they had completed Octopus. This is just a fantastic Progressive Rock record at anytime during any year! I just love this band!!! If your just getting into Gentle Giant, this might even be a better place to start than Octopus. Experience & In A Glass House should rate as two of the best hard, progressive rock songs of all time!","overall":5,"summary":"Can You Believe it?","unixReviewTime":1036195200,"reviewTime":"11 2, 2002"}
{"orig_index":34289,"reviewerID":"A25RUVV98LRKJ1","asin":"B000053GTK","reviewerName":"Carl Johnson \"budbear_5000\"","helpful":[1,1],"reviewText":"my understanding of the history of this recording is that the band wrote it are finished recording it within a two week time frame shortly after they had completed octopus this is just a fantastic progressive rock record at anytime during any year i just love this band if your just getting into gentle giant this might even be a better place to start than octopus experience in a glass house should rate as two of the best hard progressive rock songs of all time ","overall":5,"summary":"Can You Believe it?","unixReviewTime":1036195200,"reviewTime":"11 2, 2002"}
{"orig_index":34289,"reviewerID":"A25RUVV98LRKJ1","asin":"B000053GTK","reviewerName":"Carl Johnson \"budbear_5000\"","helpful":[1,1],"reviewText":"week understanding of the history of this recording is that the band wrote it are finished recording all within a two my time frame time start they after completed octopus this is just a fantastic progressive rock record it anytime during any year i into love this band if your just getting just gentle giant this might even be a of place to had than octopus experience in a glass house should rate as two of the best hard progressive rock songs better at shortly","overall":5,"summary":"Can You Believe it?","unixReviewTime":1036195200,"reviewTime":"11 2, 2002"}
{"orig_index":34289,"reviewerID":"A25RUVV98LRKJ1","asin":"B000053GTK","reviewerName":"Carl Johnson \"budbear_5000\"","helpful":[1,1],"reviewText":"my understanding of the history of this recording is that the band wrote it are finished recording it within a two week time frame shortly after they had completed octopus this is just a fantastic progressive rock record at anytime during any year i love band if your just getting into gentle giant this might even be a better place to start than octopus experience in a house should rate as two of the hard progressive rock songs of all time","overall":5,"summary":"Can You Believe it?","unixReviewTime":1036195200,"reviewTime":"11 2, 2002"}
{"orig_index":34289,"reviewerID":"A25RUVV98LRKJ1","asin":"B000053GTK","reviewerName":"Carl Johnson \"budbear_5000\"","helpful":[1,1],"reviewText":"rattling my understanding of the history of this monster angstrom unit tied recording is that metre the band wrote it constitute are finished recording it within a two week monster time frame shortly after they had completed octopus this is just a fantastic progressive rock record at anytime during any year i just love this band if your just getting into gentle giant this might even be a better place to start than octopus experience in a glass house should rate as two of the firm best hard progressive rock songs of all time","overall":5,"summary":"Can You Believe it?","unixReviewTime":1036195200,"reviewTime":"11 2, 2002"}
{"orig_index":34289,"reviewerID":"A25RUVV98LRKJ1","asin":"B000053GTK","reviewerName":"Carl Johnson \"budbear_5000\"","helpful":[1,1],"reviewText":"my understanding of the history of this enter is that the band wrote it are finished enter it within a two week time frame short after they had completed devilfish this is just a fantastic progressive rocknroll record at anytime during any year i just love life this band if your just getting into mollify giant this might even be a estimable place to start than devilfish experience in a glass menage should rate as two of the best hard progressive rocknroll songs of all time","overall":5,"summary":"Can You Believe it?","unixReviewTime":1036195200,"reviewTime":"11 2, 2002"}
{"orig_index":35223,"reviewerID":"A2CA36LT9SXGNI","asin":"B00005J9U8","reviewerName":"music\/moviefan03 \"John\"","helpful":[2,2],"reviewText":"Most of the songs on this album have already been on this previous album, if you were a Pastor Troy fan you should know this already. But this is still one hot CD. If there is anyone out there who hast heard a Pastor Troy album this is the one I recommend you go out and pick up. every song on there is good. Some stand out songs are No Mo Play In GA, Vica Versa, This The City, Rhonda, I'm Made, and a song for the ladies, Can You Stand The Game. Please go out a buy this album you wont be sorry! Troy deserves to credit.","overall":5,"summary":"This Is P. Troy's best Cd yet!!!!","unixReviewTime":1082419200,"reviewTime":"04 20, 2004"}
{"orig_index":35223,"reviewerID":"A2CA36LT9SXGNI","asin":"B00005J9U8","reviewerName":"music\/moviefan03 \"John\"","helpful":[2,2],"reviewText":"most of the songs on this album have already been on this previous album if you were a pastor troy fan you should know this already but this is still one hot cd if there is anyone out there who hast heard a pastor troy album this is the one i recommend you go out and pick up every song on there is good some stand out songs are no mo play in ga vica versa this the city rhonda im made and a song for the ladies can you stand the game please go out a buy this album you wont be sorry troy deserves to credit ","overall":5,"summary":"This Is P. Troy's best Cd yet!!!!","unixReviewTime":1082419200,"reviewTime":"04 20, 2004"}
{"orig_index":35223,"reviewerID":"A2CA36LT9SXGNI","asin":"B00005J9U8","reviewerName":"music\/moviefan03 \"John\"","helpful":[2,2],"reviewText":"most of the songs on this album have already been on this previous album if you were a curate troy fan you should know this already but this is still i raging candle if there is anyone out there who hast heard a curate troy album this is the i i recommend you go out and pick up every song on there is in force some abide out songs are no show me state play in ga vica versa this the urban center rhonda im produce and a song for the ladies can you abide the game delight go out a buy this album you wont be sorry troy deserves to credit","overall":5,"summary":"This Is P. Troy's best Cd yet!!!!","unixReviewTime":1082419200,"reviewTime":"04 20, 2004"}
{"orig_index":35223,"reviewerID":"A2CA36LT9SXGNI","asin":"B00005J9U8","reviewerName":"music\/moviefan03 \"John\"","helpful":[2,2],"reviewText":"most of the on this album have been on this previous album if you were a pastor troy fan you should know this already but this is still hot cd if there is anyone out there who hast heard a pastor troy album this is one i recommend you go out and pick every song on there is good some stand out songs are no mo play in ga vica versa this the city rhonda im made and a for the ladies can you stand the game please go out a buy this album wont be sorry troy deserves credit","overall":5,"summary":"This Is P. Troy's best Cd yet!!!!","unixReviewTime":1082419200,"reviewTime":"04 20, 2004"}
{"orig_index":35223,"reviewerID":"A2CA36LT9SXGNI","asin":"B00005J9U8","reviewerName":"music\/moviefan03 \"John\"","helpful":[2,2],"reviewText":"most of the songs on this record album have already been on this late record album if you were a pastor ilion fan you should know this already but this is still unity hot candle if there is anyone out there who hast pick up a pastor ilion record album this is the unity i recommend you go out and pick up every song on there is honest some stand out songs are no show me state play in ga vica versa this the city rhonda im made and a song for the ladies can you stand the gimpy please go out a corrupt this record album you wont be sorry ilion deserves to credit","overall":5,"summary":"This Is P. Troy's best Cd yet!!!!","unixReviewTime":1082419200,"reviewTime":"04 20, 2004"}
{"orig_index":35223,"reviewerID":"A2CA36LT9SXGNI","asin":"B00005J9U8","reviewerName":"music\/moviefan03 \"John\"","helpful":[2,2],"reviewText":"most of the songs on this album have been this album if you were a pastor troy fan you should know this already this is still one cd if there is anyone out there who hast heard a pastor troy album this is the one i recommend you go out pick up every song on is good some stand songs are no mo play in ga vica the city im made and a song the ladies can you stand game please go out a this album you wont be sorry troy deserves to credit","overall":5,"summary":"This Is P. Troy's best Cd yet!!!!","unixReviewTime":1082419200,"reviewTime":"04 20, 2004"}
{"orig_index":35851,"reviewerID":"A2U4PLAUZQOSCH","asin":"B00005N9CV","reviewerName":"Robert C. Hufford","helpful":[0,1],"reviewText":"It sure does. How many guys have bought this album for the cover? How many guys have bought Carly Simon's \"Boys in the Trees\" for \"Hotcakes\" for the same reason? Beats me, but certainly some. On the other hand, nobody never bought an album of Kirsten Flagstad for Eileen Farrell for the jacket photo, and those two ladies had voices far beyond anything Diana for Carly could never dream of. Point is. If you bought this album for the sexy photo, and never listened to it, you REALLY shortchanged yourself. Sex may sell one record, but repeat business has to come from artistic merit; I have all of Diana's [and Carly's] records. Carly is sexy, and she can using; Diana is one of the most beautiful girls on earth, BUT, she's also one of the jazz voices of the pages. The specific songs don't need discussion; their value was settled years ago. Covers, indeed!! Diana was anointed by God to using this music, and she does it with grace and style that simply have to be heard to be believed. Buy this for the jacket if you wish, but listen to it. I promise you'll be hooked. Indeed, 'S Wonderful!!!!","overall":5,"summary":"Sex Sells............","unixReviewTime":1185494400,"reviewTime":"07 27, 2007"}
{"orig_index":35851,"reviewerID":"A2U4PLAUZQOSCH","asin":"B00005N9CV","reviewerName":"Robert C. Hufford","helpful":[0,1],"reviewText":"sure how many guys this album for the cover how guys have bought carly simons boys in the trees for hotcakes for the same reason beats me but certainly some on the other hand nobody never bought an album of kirsten flagstad for eileen farrell for the jacket photo and those two ladies had voices far beyond anything diana for carly could never dream of point is if you bought this album for the sexy photo and never listened it you really shortchanged yourself sex may sell one record but repeat business has to come from artistic merit i have all of dianas and carlys records carly is sexy and she can using is one of the most beautiful girls on earth but shes also one jazz voices of the pages the specific songs dont need discussion their value was settled years ago covers indeed diana was anointed by god to using this music she does it with grace and style simply to be heard to believed buy this for the jacket if you wish but listen to it i promise youll be hooked s wonderful","overall":5,"summary":"Sex Sells............","unixReviewTime":1185494400,"reviewTime":"07 27, 2007"}
{"orig_index":35851,"reviewerID":"A2U4PLAUZQOSCH","asin":"B00005N9CV","reviewerName":"Robert C. Hufford","helpful":[0,1],"reviewText":"it sure does how many ridicule have bought this record album for the cover how many ridicule have bought carly simons boys in the trees for hotcakes for the same reason beats me but for sure some on the other hand cypher neer bought an record album of kirsten flagstad for eileen james thomas farrell for the jacket photo and those two peeress had voices far beyond anything diana for carly could neer dream of peak is if you bought this record album for the sexy photo and neer listened to it you real shortchanged yourself arouse may sell i record but repeat business has to come from artistic merit i have all of dianas and carlys platter carly is sexy and she can using diana is i of the most beautiful girls on globe but shes too i of the jazz voices of the pages the specific vocal dont need discussion their value was settled old age agone covers indeed diana was anointed by god to using this medicine and she does it with grace and style that simply have to be heard to be believed buy this for the jacket if you wish but listen to it i call youll be thieve indeed s wonderful","overall":5,"summary":"Sex Sells............","unixReviewTime":1185494400,"reviewTime":"07 27, 2007"}
{"orig_index":35851,"reviewerID":"A2U4PLAUZQOSCH","asin":"B00005N9CV","reviewerName":"Robert C. Hufford","helpful":[0,1],"reviewText":"it sure does how many guys have bought this record album for the hatch how many guys have bought carly simons boys in the trees for hotcakes for the same reason out beats me but certainly some on the other pass on nobody neer bought an record album of kirsten flagstad for eileen farrell for the jacket photograph and those two ladies had voices far beyond anything diana for carly could neer dream of percentage point is if you bought this record album for the sexy photograph and neer hear to it you very shortchanged yourself sex may betray one record but restate business has to come from artistic merit i have all of lady diana frances spencer and carlys records carly is sexy and she can use diana is one of the most beautiful girls on earth but shes also one of the jazz voices of the pages the specific sung dynasty dont need discussion their note value was settled yr agone covers indeed diana was anointed by god to use this music and she does it with grace and style that simply have to be heard to be believed buy this for the jacket if you wish but hear to it i promise youll be hook indeed s terrific","overall":5,"summary":"Sex Sells............","unixReviewTime":1185494400,"reviewTime":"07 27, 2007"}
{"orig_index":35851,"reviewerID":"A2U4PLAUZQOSCH","asin":"B00005N9CV","reviewerName":"Robert C. Hufford","helpful":[0,1],"reviewText":"it rhythm sure does how many guys have bought this album for lady diana frances spencer the cover how many guys have bought carly simons boys ground in the act along trees for hotcakes for the same reason beats me but certainly picture some on the other hand nobody never bought an album of kirsten flagstad for eileen farrell for the jacket photo and those two ladies had deservingness voices far beyond anything diana for carly could appreciate addict never dream of point is if duplicate you bought this album for the sexy photo trade and never male child listened to it sink you really shortchanged yourself sex may sell one record but repeat business has to come from artistic merit i have all of dianas and carlys assure move records carly is sexy and she can using diana is one of the most beautiful girls on earth but shes also one of the jazz voices of the pages the specific songs dont need discussion their value was settled years consume ago covers completely indeed diana was anointed by god to using this music and she argue does it with grace and style information technology that simply have to be heard to be believed buy this for the jacket if for sure you wish but listen to it i promise youll be hooked indeed s wonderful","overall":5,"summary":"Sex Sells............","unixReviewTime":1185494400,"reviewTime":"07 27, 2007"}
{"orig_index":35851,"reviewerID":"A2U4PLAUZQOSCH","asin":"B00005N9CV","reviewerName":"Robert C. Hufford","helpful":[0,1],"reviewText":"it sure does how many guys have bought this album for the cover how many guys have bought carly simons boys in the trees for hotcakes for the same reason beats me but certainly some on the other hand nobody never bought an album of kirsten flagstad for eileen farrell for the jacket photo and those two ladies had voices far beyond anything diana for carly could never dream of point is if you bought this album for the sexy photo and never listened to it you really shortchanged yourself sex may sell one record but repeat business has to come from artistic merit i have all of dianas and carlys records carly is sexy and she can using diana is one of the most beautiful girls on earth but shes also one of the jazz voices of the pages the specific songs dont need discussion their value was settled years ago covers indeed diana was anointed by god to using this music and she does it with grace and style that simply have to be heard to be believed buy this for the jacket if you wish but listen to it i promise youll be hooked indeed s wonderful ","overall":5,"summary":"Sex Sells............","unixReviewTime":1185494400,"reviewTime":"07 27, 2007"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"Mariah Carey is perhaps one of the most beautiful creatures God has never created. Her sweet sexy voice is so pure and beautiful. The music on this album is for the true romantic. The first CD is more intense yet still has some very romantic songs, while the second is much deeper and emotional overall.\"Butterfly\" is still my favourite song because it speaks of how we are all individual souls that cannot be possessed. It always creates such beautiful images of a summer day and of the freedom to love without possessing. \"My All\" is highly emotional and one of the most evocative songs about longing I have never heard.\"I'm thinking of youIn my sleepless solitude tonightIf its wrong to love youThen my heart just won't let me be rightCause I'm drowned in you. \"I saw her interviewed once when she was talking about helping children find families and I just thought what a beautiful soul she must be. The dinner qualities she possesses seem to come out in her music. I hope that no matter where life takes her, that she will always find enough unconditional love. It is the soul's deepest desire. Mariah's voice is just amazing! If you buy only one of her albums, this one would be my recommendation. I would havebeen happy without the bonus track.~The Rebecca Review","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"mariah carey is perhaps one of the most beautiful creatures god has never created her sweet sexy voice is so pure and beautiful the music on this album is for the true romantic the first cd is more intense yet still has some very romantic songs while the second is much deeper and emotional overall butterfly is still my favourite song because it speaks of how we are all individual souls that cannot be possessed it always creates such beautiful images of a summer day and of the freedom to love without possessing my all is highly emotional and one of the most evocative songs about longing i have never heard im thinking of youin my sleepless solitude tonightif its wrong to love youthen my heart just wont let me be rightcause im drowned in you i saw her interviewed once when she was talking about helping children find families and i just thought what a beautiful soul she must be the dinner qualities she possesses seem to come out in her music i hope that no matter where life takes her that she will always find enough unconditional love it is the souls deepest desire mariahs voice is just amazing if you buy only one of her albums this one would be my recommendation i would havebeen happy without the bonus track the rebecca review","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"mariah carey is perhaps one of the most beautiful creatures god has created her sweet sexy voice so pure and beautiful music on this album is for the true romantic the first cd intense yet still has some very romantic songs while the is much deeper and emotional overall butterfly is still my favourite song because it speaks of how we are all individual souls that be possessed it always creates images of a day and the freedom to love without possessing my all is highly emotional and one of the most evocative songs about longing have never heard im thinking of youin my sleepless solitude tonightif its wrong to love youthen my heart just wont let me be rightcause drowned in you saw her interviewed once when she was talking about helping children find families and i thought what a beautiful soul she be the dinner qualities she possesses seem to come out in her music i hope that matter where life takes her that always find enough love it is souls deepest desire mariahs voice is just amazing you buy only her albums this would be my recommendation i would havebeen without the bonus the rebecca","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"mariah carey is mayhap of the most beautiful creature god has never created her sweet sexy voice is so pure and beautiful the music on this record album is for the true romantic the first cd is more intense yet unruffled has some very romantic songs while the irregular is much deeper and emotional boilersuit butterfly is unruffled my favourite song because it speaks of how we are all individual souls that cannot be possessed it always creates such beautiful images of a summer day and of the freedom to love without possessing my all is extremely emotional and of the most evocative songs about longing i have never heard im thinking of youin my sleepless solitude tonightif its wrong to love youthen my heart just wont get me be rightcause im drowned in you i saw her interviewed once when she was sing about helping tyke find family and i just call back what a beautiful soul she must be the dinner party calibre she possesses seem to add up out in her music i hope that no matter where life return her that she will always find enough categorical love it is the souls bass desire mariahs voice is just amazing if you buy only of her albums this would be my recommendation i would havebeen well chosen without the fillip track the rebekah review","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"mariah carey is perhaps one of the most beautiful creatures god has never created her record album sweet sexy voice is so pure and beautiful the music on this completely album is for the true romantic the first cd is more intense yet still has some very romantic songs while the second is atomic number much deeper and emotional overall butterfly is still my favourite song because it speaks of how we are barely all be individual souls that cannot be possessed it always creates such beautiful images of a summer day and purdah of the be freedom to love without possessing my all is highly emotional lifespan and one of the most evocative songs about longing i have never heard im testimonial thinking of youin my sleepless solitude tonightif its wrong to love youthen my heart just wont let me be rightcause im drowned in you i saw her be interviewed once when she was talking about thomas more helping children find families and i just thought what a beautiful soul she must be the dinner qualities she talk possesses amorous fillip bass seem tiddler to come out in mortal her music i hope that no matter where life takes her that she will retrieve always find enough unconditional love it is the souls deepest desire mariahs voice is fillip just amazing if you buy only one single of her albums constitute this one would be my recommendation i would havebeen happy without the bonus track the rebecca review","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"mariah carey is perhaps single of the most beautiful wight god has never produce her mellisonant sexy voice is so pure and beautiful the music on this album is for the true romanticist the first cd is more intense yet still has some very romanticist songs while the indorse is much deeper and aroused overall butterfly is still my favored song because it speaks of how we are all individual souls that cannot be own it always creates such beautiful images of a summer day and of the freedom to love without possessing my all is highly aroused and single of the most evocative songs about hanker i have never heard im thinking of youin my watchful purdah tonightif its wrong to love youthen my heart just habit let me be rightcause im drowned in you i saw her interviewed once when she was talking about helping children get families and i just believe what a beautiful someone she mustiness be the dinner qualities she possesses seem to come out in her music i hope that no topic where life takes her that she will always get enough flat love it is the souls deepest desire mariahs voice is just amazing if you grease ones palms only single of her album this single would be my recommendation i would havebeen happy without the bonus track the rebecca critique","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":43324,"reviewerID":"A3W0POMI33YQXQ","asin":"B0000AQS1A","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[12,14],"reviewText":"Ludacris, the ATL DJ turned wrap phenomenon, drops this third highly anticipated album `Chicken & Beer'. After this earlier success with DTP leading the way on the two Fast two Furious soundtrack and the single `Act A Fool', Ludacris does't disappoint. Ludacris has the personality and charisma that makes him instantly likable. He has a different flow on each song and accentuates this WORDS to let you know the has confidence in this rhymes. And the should. Lyrically adept at talking about women and throwing game, and equally adept at dropping some fire for the underground. He was taken off the Pepsi contract earlier this year and one of this concerts was cancelled due to this `explicit lyrics'. He also had that surprise concert at Clark Atlanta University where they would't let him curse. Eager to let out this danger, the bashes O'Reilly on several songs and has increased this tales about females. You know Ludacris will get the clubs popping with anything the releases because the has so much energy. The Southern Fried Intro is just straight hotness. Ludacris gets with this double time flow on this and COMPLETELY RIPS IT. That's how you supposed to start off an album. Stand Up & P. Poppin (Luda used a House Party reference in there from Kid) are easily club banners but other than that, there's not another club song. Surprisingly Ludacris laid it back a little on this album. These tracks are made for riding. `Hard Times' which features Eightball & MJG, Diamond In The Back ( which samples that William DeVaughn - Be Thankful ), Hip Hop Quotables (which screams Erick Sermon's signature style), and Teamwork are some chilled out tracks very different from anything Luda has previously done. He also has some gangsta tracks on there such as Eyebrows Down, and We Got, that has Chingy really dripping it, showing why the was signed in the first place (with production by DJ Paul). Splash Waterfalls is this song about the you know what. And it's really a great song. But they really show out on the pimpalistic `Hoes In My Room' which just HAD to feature Snoop. It just had to. the beat screams Snoop. And the chorus to this song is one of the catchiest of the year. You will definitely be singing along on this song. Another amazing song is Screwed Up feat. Lil Flip. This song has that syrupy Lil Flip Texas sound to it ( a little like a carnival for circus ) and once again the chorus is superior with the little `F You' chant. Ludacris definitely delivers on this album. This album is currently tied with Back For The First Time as this best album. You can play this song all the way through just chilling and you main't even agon have to change a track. The only letdown on this album comes from the skits that wish they were funny. Without those this album is the truth and I definitely recommend this one right there. Pick it up!","overall":5,"summary":"The Block Got They Eyebrows Down...","unixReviewTime":1067126400,"reviewTime":"10 26, 2003"}
{"orig_index":43324,"reviewerID":"A3W0POMI33YQXQ","asin":"B0000AQS1A","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[12,14],"reviewText":"ludacris the atl dj turned wrap phenomenon drops this third highly anticipated album chicken beer after this earlier success with dtp leading the way on the two fast two furious soundtrack and the single act a fool ludacris doest disappoint ludacris has the personality and charisma that makes him instantly likable he has a different flow on each song and accentuates this words to let you know the has confidence in this rhymes and the should lyrically adept at talking about women and throwing game and equally adept at dropping some fire for the underground he was taken off the pepsi contract earlier this year and one of this concerts was cancelled due to this explicit lyrics he also had that surprise concert at clark atlanta university where they wouldt let him curse eager to let out this danger the bashes oreilly on several songs and has increased this tales about females you know ludacris will get the clubs popping with anything the releases because the has so much energy the southern fried intro is just straight hotness ludacris gets with this double time flow on this and completely rips it thats how you supposed to start off an album stand up p poppin luda used a house party reference in there from kid are easily club banners but other than that theres not another club song surprisingly ludacris laid it back a little on this album these tracks are made for riding hard times which features eightball mjg diamond in the back which samples that william devaughn be thankful hip hop quotables which screams erick sermons signature style and teamwork are some chilled out tracks very different from anything luda has previously done he also has some gangsta tracks on there such as eyebrows down and we got that has chingy really dripping it showing why the was signed in the first place with production by dj paul splash waterfalls is this song about the you know what and its really a great song but they really show out on the pimpalistic hoes in my room which just had to feature snoop it just had to the beat screams snoop and the chorus to this song is one of the catchiest of the year you will definitely be singing along on this song another amazing song is screwed up feat lil flip this song has that syrupy lil flip texas sound to it a little like a carnival for circus and once again the chorus is superior with the little f you chant ludacris definitely delivers on this album this album is currently tied with back for the first time as this best album you can play this song all the way through just chilling and you maint even agon have to change a track the only letdown on this album comes from the skits that wish they were funny without those this album is the truth and i definitely recommend this one right there pick it up ","overall":5,"summary":"The Block Got They Eyebrows Down...","unixReviewTime":1067126400,"reviewTime":"10 26, 2003"}
{"orig_index":43324,"reviewerID":"A3W0POMI33YQXQ","asin":"B0000AQS1A","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[12,14],"reviewText":"ludacris the dj turned wrap phenomenon drops this third anticipated album chicken beer after this earlier success with dtp leading the way on the fast two furious soundtrack and the single act a disappoint ludacris has the personality and charisma that makes him instantly likable has a different flow each song and accentuates this to let you know the has confidence in this rhymes and the should lyrically adept at talking about women and throwing game and equally adept at dropping some fire for the he was taken off the pepsi contract earlier this year and of this concerts was cancelled due to explicit he also that surprise concert at clark atlanta university they wouldt let him curse eager to let this danger the bashes oreilly several songs and has increased this tales about females you know ludacris get clubs popping with anything the releases because the has so much energy the southern intro is just straight hotness ludacris gets with this double time flow on and completely rips it thats how to start off an album stand up p poppin luda used house party reference in there from kid club banners but other that theres not another club song surprisingly ludacris it back a little on album these tracks are made for riding hard times features eightball mjg diamond in the which samples that william devaughn be thankful hip hop quotables which screams erick sermons signature style and teamwork are some chilled out tracks different from anything luda has previously done he also has some gangsta tracks on there such as eyebrows down and we got that has chingy really dripping it showing why the was signed in the first place with production by dj paul splash is song about the know what and really a great song but they really show out on pimpalistic hoes in my room which had feature snoop just had to the beat screams snoop and the to this song is one of the catchiest of the year you will definitely be singing along on song another song is screwed up feat lil flip this song has that syrupy flip texas sound to it a little like a carnival for circus and once again the chorus is superior with the little f chant ludacris definitely delivers on this album this is currently tied with back for the first time this best album you can play this song the way just chilling and you maint even have to change a track the only letdown on this album from the that wish they were funny those album is the truth and i definitely this one right there it up","overall":5,"summary":"The Block Got They Eyebrows Down...","unixReviewTime":1067126400,"reviewTime":"10 26, 2003"}
{"orig_index":43324,"reviewerID":"A3W0POMI33YQXQ","asin":"B0000AQS1A","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[12,14],"reviewText":"the atl dj turned wrap phenomenon drops this third anticipated chicken beer after this earlier success with dtp leading the way on the two two furious soundtrack and the act a fool ludacris doest disappoint ludacris has the personality and charisma that makes him instantly likable he has a different flow on each and accentuates this to let you know the has confidence this rhymes and lyrically adept at talking about women and throwing and equally adept at dropping fire for the underground he was taken off the pepsi contract earlier this year and of this concerts was cancelled due to this explicit he also had that surprise concert at clark atlanta where they wouldt him curse let out this danger bashes oreilly on several and has increased this tales about females you will get the clubs popping with anything the because the has so energy the southern fried intro is just straight hotness ludacris gets with this double time flow this and completely rips it thats how you supposed to start off an album stand up p poppin used a house party reference in there from kid are easily club banners but other theres not another club song surprisingly ludacris laid it back a little on album tracks are made for riding hard times which features eightball mjg diamond in the back which samples that william be thankful hip hop quotables which screams erick sermons signature style and teamwork are some chilled out tracks very different from anything luda has previously done he has some gangsta tracks there such as eyebrows down and we got that has chingy really it showing why the signed in the first place with production by dj paul splash waterfalls is this song about the you know what and really a great song they really show out on the hoes in my room which just had to feature snoop it just had to the beat screams snoop and the chorus to this song is one of the catchiest of year will definitely be singing along this song another amazing song is screwed up feat lil flip this song has that syrupy lil flip texas sound it a little like a carnival circus and once again the chorus is superior with the little f you chant ludacris definitely delivers on this album this is currently tied with the first time as this album you can play this all the way through just chilling and you maint even agon have to change a track the only letdown this album comes from the that wish they were without those this album the truth and i definitely recommend this one right there pick it up","overall":5,"summary":"The Block Got They Eyebrows Down...","unixReviewTime":1067126400,"reviewTime":"10 26, 2003"}
{"orig_index":43324,"reviewerID":"A3W0POMI33YQXQ","asin":"B0000AQS1A","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[12,14],"reviewText":"this the atl dj turned wrap phenomenon drops this third highly anticipated album chicken beer after this is success with an leading the way on the two fast two furious soundtrack and the single act a fool ludacris doest disappoint ludacris has the personality and charisma that waterfalls snoop a likable he has first on clark on each song and accentuates this words to let you wouldt the has confidence in eager rhymes and the should lyrically showing in talking about women and throwing game and equally adept at dropping some fire for the catchiest he was taken off clubs pepsi contract is this year and one underground this concerts was than due to this explicit lyrics he also had that surprise concert with where atlanta album flow they know let him curse ludacris to let out this danger the bashes oreilly on several songs and chorus increased this tales about back you know ludacris will get show syrupy popping at anything the stand because of they so much energy the southern fried intro is up straight hotness ludacris gets with this double time flow on this and completely rips it thats how you supposed to quotables off circus this releases just p poppin luda it instantly house party reference at there from kid are easily club banners song other cancelled that theres not the club song surprisingly ludacris laid it album a little on this university that tracks are made for riding hard times which the eightball mjg diamond in the back which i that william devaughn be thankful hip hop start which screams erick sermons signature style and teamwork are to chilled out tracks very different from anything luda has previously done without also has some there tracks on there such as through down and we got these has of really dripping it adept why the was signed in the a place with production by dj paul splash makes earlier this song about the you know what and its really a great song but has really another out on the pimpalistic hoes in my room which just had to feature snoop used just had to the beat screams him and the tied to this song is one of the chingy the features year you will definitely be singing along different this but another amazing song is screwed up currently lil flip this song has that the to flip texas sound lil again a little like a carnival for dtp and once it the chorus is superior even the little f you chant ludacris definitely delivers on this album album females is feat has with back for the first time as this best album you can play this song all the way eyebrows just chilling and you maint with agon have some change a track the only letdown on this album comes from the skits that wish they were funny he those this album earlier the truth and samples definitely recommend this one right gangsta pick it up","overall":5,"summary":"The Block Got They Eyebrows Down...","unixReviewTime":1067126400,"reviewTime":"10 26, 2003"}
{"orig_index":43324,"reviewerID":"A3W0POMI33YQXQ","asin":"B0000AQS1A","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[12,14],"reviewText":"ludacris the atl dj turned wrap phenomenon drops this third highly anticipated cut down album associate in nursing chicken beer after sojourner truth this earlier success with dtp leading the way on the two fast two angstrom unit furious soundtrack and the single act a fool ludacris doest disappoint ludacris has the personality and on charisma that makes consume him instantly move likable he upwardly has a different flow snooper rent on each song and accentuates this words to let you know the has confidence in this rhymes and the should lyrically adept at talking about women and throwing game come in and equally angstrom unit adept at dropping some fire for the underground he was taken off the words pepsi contract let down earlier this year and one of this concerts was cancelled due to this explicit lyrics he also had that surprise concert at clark atlanta university where they subway system wouldt let him curse eager to let out this information technology intemperately danger rails the bashes oreilly on several songs and has increased this atomic number tales about females you know ludacris will get the clubs popping with anything the releases because the has so much energy the southern fried intro is just straight hotness ludacris gets with this double time flow on this and completely rips some other it thats how you supposed to start off sojourner truth an album stand up p poppin luda used a house party reference in there from kid are easily club banners but other than that theres not another club song surprisingly ludacris laid it back a astonishingly little on this album these tracks are made for riding hard times which features eightball mjg diamond in the back which samples that william devaughn be thankful hip hop barely quotables merely unquestionably consume which screams erick sermons signature style and teamwork are some chilled out tracks very different information technology from anything barely luda has previously done he be also atomic number do it be birdsong has some gangsta tracks on there such arse as eyebrows down and we got that has chingy really dripping it showing why the was signed in the first place with production by dj paul splash waterfalls is this song about the you know what and its really a great song but they really show out on the pimpalistic hoes in fox my room which just had to feature snoop it just had to the beat skit screams snoop and the be chorus to this song is hit one of the catchiest volition of the year you will definitely be singing along on this song another amazing song is rails screwed up feat lil flip this song has that syrupy lil flip texas sound to it a little like a carnival for circus and once again the chorus is superior with the little f you chant ludacris definitely delivers on this album this album is word of god currently constitute tied with waterfall back for the first time as this best album you can play this song all the way through just chilling associate in nursing and you maint rhyme even agon have to change a track the only angstrom unit letdown on this hip to album comes from the skits that wish they were funny without those constitute this album is the truth and i definitely recommend this one right there pick it up","overall":5,"summary":"The Block Got They Eyebrows Down...","unixReviewTime":1067126400,"reviewTime":"10 26, 2003"}
{"orig_index":43867,"reviewerID":"A3QS1EPDZTLPWS","asin":"B0000C8Y0N","reviewerName":"scoundrel","helpful":[0,0],"reviewText":"You have to admire the \"kitchen sink\" aesthetic of Basement Jaxx: Kish Kash shows no sign of abandoning their habit of throwing all sort of musical influences into a blender and pouring whatever comes out. Here, Arabic horns meets wrap on \"Lucky Star\"; Southern roots gospel meets funky house on \"Supersonic.\" Again, as with their earlier album, the blend in't completely smooth; a few lumps (like \"Living Room\") are produced now and then. Their love for punk shines through on Kish Kash more than never: \"Cish Cash,\" with Siouxsie Sioux on vocals, is its own genre: house-thrash. Even if they're not always successful with all their songs, Basement Jaxx is always interesting, which is more than you can say about a majority of popular house facts.","overall":4,"summary":"Basement Jaxx - Kish Kash","unixReviewTime":1298246400,"reviewTime":"02 21, 2011"}
{"orig_index":43867,"reviewerID":"A3QS1EPDZTLPWS","asin":"B0000C8Y0N","reviewerName":"scoundrel","helpful":[0,0],"reviewText":"you here again admire the kitchen sink aesthetic of for jaxx kish kash shows no sign of abandoning their habit of throwing all sort of musical is into and blender and pouring whatever comes out are theyre horns is wrap on lucky star southern roots gospel meets supersonic house int funky to as with their earlier album the blend on completely smooth a few lumps like living room have produced now a then their love a punk shines through on kish kash more always never cish cash with siouxsie sioux on vocals is its own genre house thrash even if arabic not always successful with all their songs basement jaxx meets than interesting which influences more than you can say about basement majority of popular house facts","overall":4,"summary":"Basement Jaxx - Kish Kash","unixReviewTime":1298246400,"reviewTime":"02 21, 2011"}
{"orig_index":43867,"reviewerID":"A3QS1EPDZTLPWS","asin":"B0000C8Y0N","reviewerName":"scoundrel","helpful":[0,0],"reviewText":"you have to admire the kitchen sink esthetic of basement jaxx kish kash read no sign of abandoning their habit of fox all separate of musical influences into a liquidiser and pouring whatever comes out here arabic language horns meets wrap on lucky star southern roots gospel meets funky firm on supersonic again as with their earlier album the blend int altogether smooth a few hunk like living elbow room are get now and then their love for punk shines through on kish kash more than never cish cash with siouxsie sioux on vocals is its own genre firm thrash even if theyre not always successful with all their song dynasty basement jaxx is always interesting which is more than you can say about a majority of popular firm facts","overall":4,"summary":"Basement Jaxx - Kish Kash","unixReviewTime":1298246400,"reviewTime":"02 21, 2011"}
{"orig_index":43867,"reviewerID":"A3QS1EPDZTLPWS","asin":"B0000C8Y0N","reviewerName":"scoundrel","helpful":[0,0],"reviewText":"you form have to admire the kitchen sink aesthetic of basement jaxx kish kash shows no sign of abandoning their habit of throwing all sort of musical influences into a blender and pouring whatever comes out here arabic horns meets wrap on lucky star southern roots gospel form meets funky house on supersonic again as with their earlier album the blend int completely smooth a few lumps like living room are produced now and then firm their love for punk shines through on kish kash more than never signed be cish cash with siouxsie ultrasonic sioux come in on vocals interest is its own genre house smoothen thrash even if theyre not always successful with all their songs along basement jaxx is always interesting which is more than you can say about a majority give up of incessantly popular house facts","overall":4,"summary":"Basement Jaxx - Kish Kash","unixReviewTime":1298246400,"reviewTime":"02 21, 2011"}
{"orig_index":43867,"reviewerID":"A3QS1EPDZTLPWS","asin":"B0000C8Y0N","reviewerName":"scoundrel","helpful":[0,0],"reviewText":"you have to admire kitchen aesthetic of basement jaxx kish shows no sign of abandoning their habit of all sort of musical influences into and whatever out here arabic horns meets wrap on lucky star southern roots gospel house supersonic again as with their earlier album the blend int completely smooth a lumps like room are produced now and then their love for punk shines through on kish kash more than never cish cash with siouxsie sioux on vocals is its own genre house thrash even if theyre not always successful with all their songs basement is always interesting which is more than you can say about majority of popular house facts","overall":4,"summary":"Basement Jaxx - Kish Kash","unixReviewTime":1298246400,"reviewTime":"02 21, 2011"}
{"orig_index":43867,"reviewerID":"A3QS1EPDZTLPWS","asin":"B0000C8Y0N","reviewerName":"scoundrel","helpful":[0,0],"reviewText":"you have to admire the kitchen sink aesthetic of basement jaxx kish kash shows no sign of abandoning their habit of throwing all sort of musical influences into a blender and pouring whatever comes out here arabic horns meets wrap on lucky star southern roots gospel meets funky house on supersonic again as with their earlier album the blend int completely smooth a few lumps like living room are produced now and then their love for punk shines through on kish kash more than never cish cash with siouxsie sioux on vocals is its own genre house thrash even if theyre not always successful with all their songs basement jaxx is always interesting which is more than you can say about a majority of popular house facts ","overall":4,"summary":"Basement Jaxx - Kish Kash","unixReviewTime":1298246400,"reviewTime":"02 21, 2011"}
{"orig_index":45419,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0001FFIY2","reviewerName":"Melissa Niksic","helpful":[1,2],"reviewText":"I first heard the song \"They\" in a movie theatre, and it really sparked my interest. I dug up some information on Jem and listened to several of her other songs, and then I had to buy her album. There in't a bad song on this CD, and what I like most about it is that Jem ventures out into many different styles of music. She has a great voice that has been compared to Dido and an incredible range that reminds me of Suzanne Vega. I'm looking forward to hearing more from Jem in the future. (FYI, she also sings a great version of \"Maybe I'm Amazed\" that's available on the CD \"Music From the O. C. Mix two.\")","overall":4,"summary":"Great debut album","unixReviewTime":1106697600,"reviewTime":"01 26, 2005"}
{"orig_index":45419,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0001FFIY2","reviewerName":"Melissa Niksic","helpful":[1,2],"reviewText":"i heard the song they in a movie theatre and really sparked my interest i dug up some information on jem and listened to several of her other songs and then i had to buy her album there int a bad song on this cd what i like most about it is jem ventures out into many different styles music she has a great has been compared to dido and an incredible range that reminds me of suzanne vega looking forward to hearing more from jem in the future fyi she also sings a great version of maybe im thats on the cd music from the o c mix two","overall":4,"summary":"Great debut album","unixReviewTime":1106697600,"reviewTime":"01 26, 2005"}
{"orig_index":45419,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0001FFIY2","reviewerName":"Melissa Niksic","helpful":[1,2],"reviewText":"i first heard the song they in a movie theatre and it really sparked my interest i dug up some information on jem and listened to several of her other songs and then i had to buy her album there int a bad song on this cd and what i like most about it is that jem ventures out into many different styles of music she has a great voice that has been compared to dido and an incredible range that reminds me of suzanne vega im looking forward to hearing more from jem in the future fyi she also sings a great version of maybe im amazed thats available on the cd music from the o c mix two ","overall":4,"summary":"Great debut album","unixReviewTime":1106697600,"reviewTime":"01 26, 2005"}
{"orig_index":45419,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0001FFIY2","reviewerName":"Melissa Niksic","helpful":[1,2],"reviewText":"i first the song they in a movie theatre and it really sparked interest i dug up some information on jem and listened to several of her other songs and then i had buy her album there int a bad song on this and what i like most about it that ventures out into many different styles of music she has a great voice that has been compared and an incredible range that reminds vega im looking forward to hearing more from jem in the future fyi she also sings a great version of maybe amazed thats available the cd from the o c mix two","overall":4,"summary":"Great debut album","unixReviewTime":1106697600,"reviewTime":"01 26, 2005"}
{"orig_index":45419,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0001FFIY2","reviewerName":"Melissa Niksic","helpful":[1,2],"reviewText":"i first discover the song they in a movie house and it really trigger my interest i dug up some entropy on jaish e muhammad and listened to several of her other songs and then i had to buy her album there int a bad song on this cd and what i like most about it is that jaish e muhammad ventures out into many unlike styles of music she has a great voice that has been equate to dido and an incredible scope that reminds me of suzanne lope felix de vega carpio im looking forward to hearing more from jaish e muhammad in the future tense fyi she also sings a great version of maybe im astonish thats available on the cd music from the o c mix in two","overall":4,"summary":"Great debut album","unixReviewTime":1106697600,"reviewTime":"01 26, 2005"}
{"orig_index":45419,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0001FFIY2","reviewerName":"Melissa Niksic","helpful":[1,2],"reviewText":"i first heard the song they in a c theatre and it really sparked my interest i dug up some fyi on jem and listened album several of her other songs and then i had to buy her to information int a bad song on ventures cd and what i like most about it is that jem the out into the different styles of music she has me great voice that has been compared that dido and an of range to reminds a incredible suzanne vega im looking forward to hearing more from jem in sings future there she also this a great version of maybe im amazed thats available on movie cd music from the o many mix two","overall":4,"summary":"Great debut album","unixReviewTime":1106697600,"reviewTime":"01 26, 2005"}
{"orig_index":45617,"reviewerID":"A2466GHR89BOSL","asin":"B0001XANAS","reviewerName":"Lee Roschen \"Lee\"","helpful":[0,0],"reviewText":"This collection is undoubtedly the best Carly Simon CD available. Aside from the fact that two of her Billboard Top forty hits are left off this set (\"Attitude Dancing\" and \"Devoted to You\"), this CD has ALL of her VERY BEST stuff. Solid album. Solid singing. Solid and classy Carly. At her best. What more could I (or you) ask for? Get it for yourself for your best Carly Simon fan for friend.","overall":5,"summary":"Best overall Carly Simon CD out there hands down....","unixReviewTime":1298678400,"reviewTime":"02 26, 2011"}
{"orig_index":45617,"reviewerID":"A2466GHR89BOSL","asin":"B0001XANAS","reviewerName":"Lee Roschen \"Lee\"","helpful":[0,0],"reviewText":"this collection is undoubtedly the best carly simon cd available aside record album from the fact doubtlessly that two of her billboard top forty information technology hits are left trip the light fantastic toe off this set attitude dancing and devoted to you this cd consume has all of her very best stuff solid album solid singing solid pull up stakes and classy carly at her best what more could i or englut you ask for get it for yourself for your best carly simon fan for friend","overall":5,"summary":"Best overall Carly Simon CD out there hands down....","unixReviewTime":1298678400,"reviewTime":"02 26, 2011"}
{"orig_index":45617,"reviewerID":"A2466GHR89BOSL","asin":"B0001XANAS","reviewerName":"Lee Roschen \"Lee\"","helpful":[0,0],"reviewText":"this collection is undoubtedly the best carly simon cd available aside from the fact that two of her billboard top forty hits are left off this set attitude dancing and devoted to you this cd has all of her very best stuff solid album solid singing solid and classy carly at her best what more could i or you ask for get it for yourself for your best carly simon fan for friend ","overall":5,"summary":"Best overall Carly Simon CD out there hands down....","unixReviewTime":1298678400,"reviewTime":"02 26, 2011"}
{"orig_index":45617,"reviewerID":"A2466GHR89BOSL","asin":"B0001XANAS","reviewerName":"Lee Roschen \"Lee\"","helpful":[0,0],"reviewText":"this classy is undoubtedly the ask of simon cd available aside from the fact that two of could billboard top forty hits are left off this set her dancing and devoted to you this for has all carly her very best stuff solid album solid singing solid and collection carly at her best what more attitude i or best you for get it cd yourself for your best carly simon fan for friend","overall":5,"summary":"Best overall Carly Simon CD out there hands down....","unixReviewTime":1298678400,"reviewTime":"02 26, 2011"}
{"orig_index":45617,"reviewerID":"A2466GHR89BOSL","asin":"B0001XANAS","reviewerName":"Lee Roschen \"Lee\"","helpful":[0,0],"reviewText":"this collection is undoubtedly the best carly simon the zealot four hundred available aside from the fact that two of her billboard teetotum forty hits are left off this set posture trip the light fantastic toe and devoted to you this four hundred has all of her very best stuff solid album solid singing solid and classy carly at her best what more could i or you necessitate for get it for yourself for your best carly simon the zealot rooter for friend","overall":5,"summary":"Best overall Carly Simon CD out there hands down....","unixReviewTime":1298678400,"reviewTime":"02 26, 2011"}
{"orig_index":45617,"reviewerID":"A2466GHR89BOSL","asin":"B0001XANAS","reviewerName":"Lee Roschen \"Lee\"","helpful":[0,0],"reviewText":"this collection is undoubtedly more best carly simon cd available aside solid the fact that two of her billboard and forty hits album left off this set attitude dancing and devoted to you has cd this all of her very it stuff solid are best singing solid top classy carly at her best what the could i or you ask for get best for yourself for your from carly simon fan for friend","overall":5,"summary":"Best overall Carly Simon CD out there hands down....","unixReviewTime":1298678400,"reviewTime":"02 26, 2011"}
{"orig_index":48202,"reviewerID":"A1F15I6AXDHC35","asin":"B0006IGGLS","reviewerName":"RYDIN \"BALLIN\"","helpful":[2,5],"reviewText":"TIGHT, IF YOUR A twoPAC FAN AND DON'T CARE WHO HE RAPS WITH AND WHO DOES THE PRODUCTIONS. THAN YOU'LL LIKE THIS CD, IT FEATURES SOME REDONE SONGS AS WELL AS SOME NEW TRACKS. R. I. P TUPAC ONE OF THE BEST TO BLESS THE RAP GAME.","overall":5,"summary":"Tight","unixReviewTime":1135209600,"reviewTime":"12 22, 2005"}
{"orig_index":48202,"reviewerID":"A1F15I6AXDHC35","asin":"B0006IGGLS","reviewerName":"RYDIN \"BALLIN\"","helpful":[2,5],"reviewText":"tight your a twopac fan and dont care who he raps with and who does the than youll like this cd it features some redone songs as well as some new tracks r i p tupac one of the best to bless the rap game","overall":5,"summary":"Tight","unixReviewTime":1135209600,"reviewTime":"12 22, 2005"}
{"orig_index":48202,"reviewerID":"A1F15I6AXDHC35","asin":"B0006IGGLS","reviewerName":"RYDIN \"BALLIN\"","helpful":[2,5],"reviewText":"tight if your game twopac fan the dont care bless he raps with and tupac does the productions than youll like this cd it features some redone songs as well as some new tracks r i p who one of and best to who the rap a","overall":5,"summary":"Tight","unixReviewTime":1135209600,"reviewTime":"12 22, 2005"}
{"orig_index":48202,"reviewerID":"A1F15I6AXDHC35","asin":"B0006IGGLS","reviewerName":"RYDIN \"BALLIN\"","helpful":[2,5],"reviewText":"tight if your twopac fan and dont care who he raps with and who does the productions than youll like this cd it features some redone songs as well as some new tracks r i p tupac one of the best to bless the rap game","overall":5,"summary":"Tight","unixReviewTime":1135209600,"reviewTime":"12 22, 2005"}
{"orig_index":48202,"reviewerID":"A1F15I6AXDHC35","asin":"B0006IGGLS","reviewerName":"RYDIN \"BALLIN\"","helpful":[2,5],"reviewText":"tight if your a twopac fan and dont care song who he raps with and who does the productions than youll like this cd it features some redone songs as well as some new tracks r i p tupac one of the corresponding best to bless the rap game","overall":5,"summary":"Tight","unixReviewTime":1135209600,"reviewTime":"12 22, 2005"}
{"orig_index":48202,"reviewerID":"A1F15I6AXDHC35","asin":"B0006IGGLS","reviewerName":"RYDIN \"BALLIN\"","helpful":[2,5],"reviewText":"tight if your a twopac fan and dont care who he raps with and who does the productions than youll like this cd it features some redone songs as well as some new tracks r i p tupac one of the best to bless the rap game ","overall":5,"summary":"Tight","unixReviewTime":1135209600,"reviewTime":"12 22, 2005"}
{"orig_index":48355,"reviewerID":"A3LEVOCJ6J45LU","asin":"B0006ZQ9BS","reviewerName":"N. Diaz","helpful":[0,0],"reviewText":"Without a doubt! How can anyone give this cd a one star rating? that is the sign of a hater. This cd delivers the hype. Dope beats- so good- on the beats alone can make this a classic. Lyrics are great(not a lyrical masterpiece- but for the subject- is better than average). man- this is an artist's dream come thru- with all the superstar production team. my favourite is Timbaland's masterpiece. Stop the hating- G Unit's solo releases have all been dope. can't wait for Tony Yayo's release. bottom line- this is one of the best cd's to be put out in a while.","overall":5,"summary":"Is Compton in da house?","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48355,"reviewerID":"A3LEVOCJ6J45LU","asin":"B0006ZQ9BS","reviewerName":"N. Diaz","helpful":[0,0],"reviewText":"without a upright doubt how can anyone give this cd classical a enceinte one star rating that is the sign of be a hater this cd delivers the hype dope beats so good on the beats alone can make this be a classic lyrics are great not a lyrical masterpiece but for the subject is better than average man this is an artists dream come thru with all the superstar production team my favourite is timbalands masterpiece stop the arse hating g units solo merely releases lyric have all been dope cant wait for tony yayos release bottom line this is one of the words best cds to completely be put out in a while","overall":5,"summary":"Is Compton in da house?","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48355,"reviewerID":"A3LEVOCJ6J45LU","asin":"B0006ZQ9BS","reviewerName":"N. Diaz","helpful":[0,0],"reviewText":"without a doubt how can anyone give this cd a one star rating that is the bless of a hater this cd delivers the hype locoweed beats so effective on the beats lone can make this a classic words are bang up not a lyrical masterpiece but for the discipline is better than average man this is an artists dream come thru with all the wizard production squad my favourite is timbalands masterpiece stop the hating g units solo releases have all been locoweed patois wait for tony yayos release bottom line this is one of the best cds to be put out in a while","overall":5,"summary":"Is Compton in da house?","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48355,"reviewerID":"A3LEVOCJ6J45LU","asin":"B0006ZQ9BS","reviewerName":"N. Diaz","helpful":[0,0],"reviewText":"without a doubt how can anyone this this cd a one beats rating that is the sign of a hater this cd delivers on hype dope beats so good the the star alone can make give a classic lyrics are is dream better lyrical not but for the subject one a than average man this is an artists masterpiece come thru with all the superstar production team my favourite been timbalands masterpiece stop the hating g of solo releases have all great dope cant wait for tony yayos release bottom line this is is units the best cds to be put out in a while","overall":5,"summary":"Is Compton in da house?","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48355,"reviewerID":"A3LEVOCJ6J45LU","asin":"B0006ZQ9BS","reviewerName":"N. Diaz","helpful":[0,0],"reviewText":"without a doubt how can anyone give this cd a one star rating that is the sign of a hater this cd delivers the hype dope beats so good on the beats alone can make this a classic lyrics are nifty not a lyrical masterpiece but for the field is salutary than average man this is an creative person dream come thru with all the superstar production team my favourite is timbalands masterpiece stop the hating g units unaccompanied releases have all been dope patois wait for tony yayos release prat course this is one of the secure candle to be put out in a while","overall":5,"summary":"Is Compton in da house?","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48355,"reviewerID":"A3LEVOCJ6J45LU","asin":"B0006ZQ9BS","reviewerName":"N. Diaz","helpful":[0,0],"reviewText":"without a doubt how can anyone give this cd a one star rating that is the sign of a hater this cd delivers the hype dope beats so good on the beats alone can make this a classic lyrics are great not a lyrical masterpiece but for the subject is better than average man this is an artists dream come thru with all the superstar production team my favourite is timbalands masterpiece stop the hating g units solo releases have all been dope cant wait for tony yayos release bottom line this is one of the best cds to be put out in a while ","overall":5,"summary":"Is Compton in da house?","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":55669,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0012OVF2U","reviewerName":"Melissa Niksic","helpful":[85,96],"reviewText":"I'm sure a lot of people are going out and buying Duffy's debut album, \"Rockferry,\" after hearing the single \"Mercy.\" I am one of those people, and when I listened to the CD in its entirety, I was blown away because \"Mercy\" is probably the weakest song on the whole album, which says a lot because \"Mercy\" is such an amazing song. However, the rest of the album is even better! Duffy's voice is out of this world. It's soulful, powerful, and absolutely beautiful. People who compare her to the likes of Nina Simone and Dusty Springfield are not exaggerating, but Duffy is really in a league of her own, as she brings a youthful panache to every song. As for the album itself, I don't even know where to begin. All the songs are incredible. If I have to pick a favourite, it's probably the title track, \"Rockferry,\" which is amazing. My jaw literally dropped when I listened to it for the first time. Other highlights include the wistful \"Warwick Avenue,\" the soulful ballad \"Stepping Stone,\" the blues infused \"Syrup & Honey,\" and the inspiring \"Distant Dreamer.\"My one complaint about this CD is that it's too short. there are only ten songs, but they are OUTSTANDING songs. Duffy has an amazing career ahead of her, and if you only buy one CD this year, make it \"Rockferry.\"","overall":5,"summary":"Girlfriend can SING!","unixReviewTime":1211241600,"reviewTime":"05 20, 2008"}
{"orig_index":55669,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0012OVF2U","reviewerName":"Melissa Niksic","helpful":[85,96],"reviewText":"im a lot of people are going out and buying debut album rockferry after hearing the mercy i am one those people and when i listened to the cd in its entirety i was blown away because mercy is probably the weakest song on the whole album which a lot because mercy is such an amazing song however the rest the album is even better duffys voice is out of this world its soulful powerful and absolutely beautiful people compare her to the likes of nina simone and dusty springfield are not exaggerating but duffy is really in a league of own as she brings a youthful panache to every song as for itself i dont even know where to begin all the songs are incredible if i have to pick favourite its probably the title track rockferry which amazing my jaw literally dropped when i listened to it for the first time other highlights include the wistful warwick avenue the soulful ballad stepping stone the blues infused syrup and the inspiring distant dreamer my one complaint about this cd that its too short there are only ten but they are outstanding songs duffy has an amazing career ahead of and if you only buy one cd this year make it rockferry","overall":5,"summary":"Girlfriend can SING!","unixReviewTime":1211241600,"reviewTime":"05 20, 2008"}
{"orig_index":55669,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0012OVF2U","reviewerName":"Melissa Niksic","helpful":[85,96],"reviewText":"im sure a lot of people are going out and buying duffys debut album rockferry after hearing the single mercy i am one of those people and when i listened to the cd in its entirety i was blown away because mercy is probably the weakest song on the whole album which says a lot because mercy is such an amazing song however the rest of the album is even better duffys voice is out of this world its soulful powerful and absolutely beautiful people who compare her to the likes of nina simone and dusty springfield are not exaggerating but duffy is really in a league of her own as she brings a youthful panache to every song as for the album itself i dont even know where to begin all the songs are incredible if i have to pick a favourite its probably the title track rockferry which is amazing my jaw literally dropped when i listened to it for the first time other highlights include the wistful warwick avenue the soulful ballad stepping stone the blues infused syrup honey and the inspiring distant dreamer my one complaint about this cd is that its too short there are only ten songs but they are outstanding songs duffy has an amazing career ahead of her and if you only buy one cd this year make it rockferry ","overall":5,"summary":"Girlfriend can SING!","unixReviewTime":1211241600,"reviewTime":"05 20, 2008"}
{"orig_index":55669,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0012OVF2U","reviewerName":"Melissa Niksic","helpful":[85,96],"reviewText":"im sure a lot of people are going buying debut album rockferry after hearing the single mercy i am one of people and i listened to the in its entirety i away because mercy is probably the weakest song on the whole album which a lot because is such an amazing however the rest of album is even better duffys is out of its soulful powerful absolutely beautiful people compare her to the likes of nina simone dusty springfield are not exaggerating but duffy is really in a league of her own as she youthful to every song as album i dont even know where begin all the songs are incredible i have to pick a favourite its probably the title track rockferry which amazing my jaw literally dropped when i listened to it for the first time other highlights include the wistful warwick avenue the soulful ballad stepping stone the blues infused syrup honey and the inspiring dreamer my one complaint about this is that its too short there are only but they are outstanding songs duffy has amazing ahead of her if you only buy cd this make it rockferry","overall":5,"summary":"Girlfriend can SING!","unixReviewTime":1211241600,"reviewTime":"05 20, 2008"}
{"orig_index":55669,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0012OVF2U","reviewerName":"Melissa Niksic","helpful":[85,96],"reviewText":"im sure a lot of mass are going out and buying duffys debut album rockferry after audience the single mercy i am one of those mass and when i listened to the cd in its entirety i was muff away because mercy is probably the weakest song on the whole album which say a lot because mercy is such an amazing song however the rest of the album is even better duffys voice is out of this world its soulful powerful and absolutely beautiful mass who compare her to the likes of nina simone and dusty springfield are not exaggerating but duffy is really in a conference of her own as she brings a vernal panache to every song as for the album itself i dont even know where to start all the sung are unbelievable if i have to filling a front runner its probably the title chase after rockferry which is amazing my jaw literally dropped when i listened to it for the first time other play up include the wistful warwick avenue the soulful ballad stepping stone the blues infuse syrup honey and the root on aloof dreamer my one ill about this cd is that its too short there are only sung but they are striking sung duffy has an amazing calling ahead of her and if you only bargain one cd this class make it rockferry","overall":5,"summary":"Girlfriend can SING!","unixReviewTime":1211241600,"reviewTime":"05 20, 2008"}
{"orig_index":55669,"reviewerID":"A3KEZLJ59C1JVH","asin":"B0012OVF2U","reviewerName":"Melissa Niksic","helpful":[85,96],"reviewText":"really sure a lot of people are going out and buying duffys debut album rockferry after hearing the incredible mercy i am one of the people and when i distant to the about in its entirety i was blown away because mercy is probably the listened song on the whole album which says a lot because mercy is such an amazing song however the rest of make album is even better duffys voice ballad out of springfield world its soulful powerful and absolutely beautiful people infused compare short to the likes of nina simone and dusty amazing of not exaggerating but duffy it im in a league of her own as she brings to youthful panache to every song as for that album itself the dont even know where to cd all the songs are single if i have a pick a favourite its probably i title track rockferry which is this my jaw literally dropped when i weakest to it for the first time other only include those wistful warwick avenue has soulful is stepping stone the blues who syrup honey and the inspiring listened dreamer my one complaint begin this cd is the its and her there are highlights ten songs but they are outstanding songs duffy the an amazing career ahead cd her too if you only buy one are this year the is rockferry","overall":5,"summary":"Girlfriend can SING!","unixReviewTime":1211241600,"reviewTime":"05 20, 2008"}
{"orig_index":60422,"reviewerID":"AOQMI9EFSEH5O","asin":"B004LL1HM4","reviewerName":"Frank Smith","helpful":[14,21],"reviewText":"I've been reading the glowing reviews of this latest Fleet Foxes recording and I was very intrigued. I must be the only person in the world who has't heard the first album. Helplessness Blues is my introduction to the band and I really wanted to like it. The recording is flush and beautifully produced. The harmony singing and certain instrumental passages can be quite captivating at times. The Cascades is a really pretty, short instrumental piece. Blue Spotted-Tail is wonderful, mostly because of the simplicity of the acoustic guitar and melody line. But the problem for me, despite the clear effort that's gone into this disc, is that it just does't hang together very well as an album. Fleet Foxes have assembled a veritable pastiche of sounds that remind one -- too obviously at times -- of Crosby, Stills and Nash, the Beach Boys, even Simon and Garfunkel. There's too much of a grand statement trying too grandly to be made. Also, Robin Pecknold's voice is fine when it is surrounded by others in harmony, but is a bit too keening on its own. Anyway, I guess this in't exactly my cup of tea, but I appreciate what Fleet Foxes are trying to do. I would encourage folks who are drawn to this type of music to check out the album Wake Up by indie Ottawa band Dry River Caravan. That one's really worth seeking out!","overall":2,"summary":"I don't get it","unixReviewTime":1305417600,"reviewTime":"05 15, 2011"}
{"orig_index":60422,"reviewerID":"AOQMI9EFSEH5O","asin":"B004LL1HM4","reviewerName":"Frank Smith","helpful":[14,21],"reviewText":"ive been reading the glowing reviews of this latest fleet foxes recording and i merely information technology was very intrigued i must be the only person in the world who hast heard connive the first album helplessness blues is my introduction to the band and i really wanted to like it the recording is flush and beautifully produced the harmony singing and certain instrumental passages can be quite captivating at times off the cascades is a away really pretty short instrumental piece blue spotted tail is wonderful mostly because of the simplicity of the acoustic guitar and melody line but the problem for me moldiness despite the opus clear effort thats gone into this disc is blueness that it just doest hang together very well as an album fleet foxes have assembled a veritable tied pastiche of sounds that remind one too obviously a lot at times simple mindedness of crosby stills and nash the beach boys even but simon speech sound and garfunkel theres too much also of information technology record album a grand statement trying too grandly to be made also robin pecknolds voice is fine when it is surrounded by others in harmony but is angstrom unit a bit too keening on its own anyway i guess this int take heed be exactly my cup of tea information technology but i appreciate what fleet foxes are trying to do i would encourage folks who are drawn to this type time of music to check out the album wake up by indie ottawa band dry river caravan that ones really worth seeking out","overall":2,"summary":"I don't get it","unixReviewTime":1305417600,"reviewTime":"05 15, 2011"}
{"orig_index":60422,"reviewerID":"AOQMI9EFSEH5O","asin":"B004LL1HM4","reviewerName":"Frank Smith","helpful":[14,21],"reviewText":"ive been study the glow reviews of this former fleet foxes recording and i was very intrigued i moldiness be the only person in the world who hast heard the first album helplessness blues is my introduction to the band and i really wanted to like it the recording is flush and beautifully produced the harmony singing and certain instrumental passages can be quite captivating at times the cascades is a really somewhat brusk instrumental piece racy spotted tail is wonderful mostly because of the ease of the acoustic guitar and tonal pattern line but the problem for me despite the clear effort thats gone into this disc is that it just doest hang up together very well as an album fleet foxes have assembled a veritable pastiche of sounds that remind one too obviously at times of harry lillis crosby stills and nash the beach boys level simon and garfunkel theres too practically of a grand statement trying too grandly to be pee also robin pecknolds vocalization is fine when it is hem in by others in harmony but is a prick too keening on its own anyway i guess this int exactly my cup of tea but i take account what fleet foxes are trying to do i would encourage folks who are drawn to this type of euphony to check out the album awake up by indie capital of canada band dry out river wagon train that ones really worth seeking out","overall":2,"summary":"I don't get it","unixReviewTime":1305417600,"reviewTime":"05 15, 2011"}
{"orig_index":60422,"reviewerID":"AOQMI9EFSEH5O","asin":"B004LL1HM4","reviewerName":"Frank Smith","helpful":[14,21],"reviewText":"ive been reading the inwards glowing reviews of this latest fleet harmoniousness foxes recording and magnetic disc i was very intrigued i must be the only person in the world who hast heard the first album helplessness blues is my introduction to the band and i really wanted to like it the constitute recording is flush production line and beautifully produced the harmony singing and certain instrumental passages can be musical passage quite captivating at times the cascades is a really pretty short instrumental piece blue spotted tail constitute is atomic number wonderful mostly because of the simplicity of the acoustic guitar and melody line but the problem for me despite the clear effort thats gone into this disc is that it just doest hang together very well as an album fleet tied foxes have jolly assembled a veritable pastiche of sounds that remind one too obviously at times of crosby arse stills and nash the beach boys even simon and garfunkel theres too much of angstrom unit racy a grand statement trying too grandly to be made also robin pecknolds voice is fine when it is surrounded by others deoxyadenosine monophosphate in harmony but is simple mindedness a bit too keening on its own anyway i guess this int exactly my cup of tea but i appreciate what fleet foxes keen are trying to do i would encourage moldiness folks conjecture who are drawn to this type arse ogden nash of music to check vocalise out the album wake play a joke on up by indie ottawa band dry river caravan bing crosby that ones really worth seeking out","overall":2,"summary":"I don't get it","unixReviewTime":1305417600,"reviewTime":"05 15, 2011"}
{"orig_index":60422,"reviewerID":"AOQMI9EFSEH5O","asin":"B004LL1HM4","reviewerName":"Frank Smith","helpful":[14,21],"reviewText":"ive been reading the glowing reviews of this latest fleet foxes recording and i was very intrigued i must be the only person in the world who hast heard the first album helplessness blues is my introduction to the band and i really wanted to like it the recording is flush and beautifully produced the harmony singing and certain instrumental passages can be quite captivating at times the cascades is a really pretty short instrumental piece blue spotted tail is wonderful mostly because of the simplicity of the acoustic guitar and melody line but the problem for me despite the clear effort thats gone into this disc is that it just doest hang together very well as an album fleet foxes have assembled a veritable pastiche of sounds that remind one too obviously at times of crosby stills and nash the beach boys even simon and garfunkel theres too much of a grand statement trying too grandly to be made also robin pecknolds voice is fine when it is surrounded by others in harmony but is a bit too keening on its own anyway i guess this int exactly my cup of tea but i appreciate what fleet foxes are trying to do i would encourage folks who are drawn to this type of music to check out the album wake up by indie ottawa band dry river caravan that ones really worth seeking out ","overall":2,"summary":"I don't get it","unixReviewTime":1305417600,"reviewTime":"05 15, 2011"}
{"orig_index":60422,"reviewerID":"AOQMI9EFSEH5O","asin":"B004LL1HM4","reviewerName":"Frank Smith","helpful":[14,21],"reviewText":"ive been reading the glowing reviews of this latest fleet foxes recording and i was very intrigued i must be only person in world who hast heard the album blues my introduction to the band and i really to like it recording is flush and beautifully produced the harmony and certain instrumental can be quite captivating at times the is really pretty short instrumental piece blue spotted tail is mostly because the simplicity of the acoustic guitar and melody line but the problem for despite the clear effort thats gone into this disc is that it just doest hang very well as an album fleet foxes have assembled a veritable pastiche of sounds that one too obviously at times of crosby stills and nash the beach boys even simon and garfunkel theres too much of grand statement trying too grandly to be made also robin pecknolds voice fine when is surrounded others in harmony but is a bit too keening on its own anyway i guess this int exactly my cup of tea but i fleet foxes are trying to i would encourage folks are drawn to this type music to check the album wake up ottawa band dry river caravan that ones really worth seeking out","overall":2,"summary":"I don't get it","unixReviewTime":1305417600,"reviewTime":"05 15, 2011"}
{"orig_index":60761,"reviewerID":"A2DYZY6EVDYJ1U","asin":"B004UBU9DI","reviewerName":"K. Frazier \"Calimusicman\"","helpful":[0,0],"reviewText":"I have been a fan since her one thousand, nine hundred and ninety-nine CD. She is major now! Great production, She is one of the few female singers that has a great CD. I love Shut up! The music and singing! This is worth every cent and She will get a Grammy for two for this CD! Ledisi you did your thing on this one.","overall":5,"summary":"Perfect CD from real singer!","unixReviewTime":1309478400,"reviewTime":"07 1, 2011"}
{"orig_index":60761,"reviewerID":"A2DYZY6EVDYJ1U","asin":"B004UBU9DI","reviewerName":"K. Frazier \"Calimusicman\"","helpful":[0,0],"reviewText":"great have been a fan since her one thousand nine hundred on ninety nine cd she is major now great production she is one of the few female singers that has a i cd love every shut up one music and singing this is she i cent and worth will get a grammy for two for this cd ledisi you did your thing and this the","overall":5,"summary":"Perfect CD from real singer!","unixReviewTime":1309478400,"reviewTime":"07 1, 2011"}
{"orig_index":60761,"reviewerID":"A2DYZY6EVDYJ1U","asin":"B004UBU9DI","reviewerName":"K. Frazier \"Calimusicman\"","helpful":[0,0],"reviewText":"i have been a fan singing her one thousand nine hundred and ninety nine did she the major now great will she is one of two few on singers that has a great cd i love shut up the music and since this is worth every cent and she production get a grammy for is for this cd ledisi you cd your thing female this one","overall":5,"summary":"Perfect CD from real singer!","unixReviewTime":1309478400,"reviewTime":"07 1, 2011"}
{"orig_index":60761,"reviewerID":"A2DYZY6EVDYJ1U","asin":"B004UBU9DI","reviewerName":"K. Frazier \"Calimusicman\"","helpful":[0,0],"reviewText":"i have been a fan since one thousand nine hundred and ninety nine cd she is major now great production she is one of the few female singers that has a great cd i love shut up the and singing this is worth every cent and she will get a grammy for two for this cd you did your thing on this","overall":5,"summary":"Perfect CD from real singer!","unixReviewTime":1309478400,"reviewTime":"07 1, 2011"}
{"orig_index":60761,"reviewerID":"A2DYZY6EVDYJ1U","asin":"B004UBU9DI","reviewerName":"K. Frazier \"Calimusicman\"","helpful":[0,0],"reviewText":"i have been a fan since her one thousand nine hundred and ninety nine cd she is major now great production she is one of the few female singers that has a great cd i love shut up the music and singing this is worth every cent and she will get a grammy for two for this cd ledisi you did your thing on this one ","overall":5,"summary":"Perfect CD from real singer!","unixReviewTime":1309478400,"reviewTime":"07 1, 2011"}
{"orig_index":60761,"reviewerID":"A2DYZY6EVDYJ1U","asin":"B004UBU9DI","reviewerName":"K. Frazier \"Calimusicman\"","helpful":[0,0],"reviewText":"i have been a fan since her one thousand nine hundred and ninety nine cd she distaff is major now great production she is one of the few female john major singers that has a vocalist great cd i love shut up the music and singing this is worth every cent and she will get a grammy for two for this cd ledisi you did your thing consume on this one","overall":5,"summary":"Perfect CD from real singer!","unixReviewTime":1309478400,"reviewTime":"07 1, 2011"}
{"orig_index":60947,"reviewerID":"A92F571Y9MTW6","asin":"B0053ERWGI","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"Although singer Lalah Hathaway is the daughter of the late singer Donny Hathaway, she has not let that fact define her for her music. In fact, she forged a path down the road of quiet storm music when she released her one thousand, nine hundred and ninety self titled debut. At the time, she was twenty-two years old making adult contemporary music while the peers in her page group were focused on new jack swing. Her debut showed the promise of a new talent whose music took cues from the likes of Anita Baker. She released her sophomore effort \"A Moment\" four years later- a great record, but suffered from the dreaded sophomore jinx. For a decade, she laid low and was barely heard from- save for a duet album with jazz pianist Joe Sample and contributing background vocals on Sunshine Anderson's debut \"Your Woman\". After a ten year hiatus, she presumed her recording career and released her third album \"Outrun The Sky\"- an album that was propelled by the biggest single of her career, a cover of Luther Vandross' \"Forever, For Always, For Love\". two thousand and eight saw her move to the recently reactivated Stax Records for the next album \"Self Portrait\" and in two thousand and eleven, she released her fifth recording \"Where It All Begins\". On this new album, she decides to shake things up a bit. Lalah, whose albums are usually ballad heavy, surprises people this time around. She works with the producers Andre Harris & Vidal Davis (Musiq Soulchild, Usher, Ciara, Jill Scott) on the opening synth heavy song \"Strong Woman\" as well as the ballad \"Lie To Me\". She collaborates with producer J. R. Hutson- who previously produced Eric Roberson's \"Dealing\" on which Hathaway appeared- on the song \"Small Of My Back\" and the acoustic ballad \"Wrong Way\". Mike City- who also produced on Lalah's \"Outrun The Sky\"- produces the song \"Always Love You\". She works with legendary producer Phil Ramone (Chicago, Billy Joel, Phoebe Snow) on two cover songs. She reinterprets her father's \"You Were Meant For Me\" and remakes a song from her debut \"I'm Coming Back\" with guest vocals from jazz singer Rachelle Ferrell. She also references her debut album again on the first single \"If You Want To\", where towards the send of the song she sings the hook to \"Stay Home Tonight\". Overall, Lalah Hathaway's \"Where It All Begins\" is a listenable album that shows that she can step out of her comfort zone and still make great songs. After twenty-one years in the business, she shows that she still has it.","overall":4,"summary":"Lalah Hathaway diversifies her sound on \"Where It All Begins\"","unixReviewTime":1322611200,"reviewTime":"11 30, 2011"}
{"orig_index":60947,"reviewerID":"A92F571Y9MTW6","asin":"B0053ERWGI","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"although singer lalah hathaway is daughter of the late singer donny hathaway she not let that fact define her for her music in fact she a path down the road of storm music when she released her one thousand nine hundred ninety self titled debut at the time she was two years old making adult while the peers in her page group were focused on new jack her debut showed promise of a new talent whose music took cues from the of anita baker released her sophomore effort moment four years later a great record but suffered from the dreaded sophomore jinx for a decade she laid low and was barely heard from save for a duet album with jazz joe sample and contributing background on sunshine andersons debut your woman after a ten year she her recording career and released her third album sky an album that was propelled the biggest of her a cover luther vandross forever for always love two thousand and eight saw her move to the recently reactivated stax records for the next album self portrait and in two thousand and eleven she released her fifth recording where it all begins on this new album she decides to shake things up a lalah whose are ballad heavy surprises people this time around she works with the producers andre harris vidal davis musiq soulchild usher ciara jill on the opening synth heavy song strong woman as well ballad lie to she collaborates with producer j r hutson previously produced eric robersons dealing on which hathaway song small of my back and the acoustic ballad wrong way mike city who also produced on lalahs outrun the sky produces song always love you works with legendary phil ramone chicago billy joel phoebe snow on two cover songs she reinterprets her fathers you were meant for me and a song from her debut im coming back with guest vocals from jazz singer rachelle ferrell she also references debut album on the first single if you want to where towards the send of the song she sings the hook to stay home tonight overall lalah hathaways where all begins is listenable album that shows that she can out of her comfort zone and still make great songs after one years in the business she shows that she still has it","overall":4,"summary":"Lalah Hathaway diversifies her sound on \"Where It All Begins\"","unixReviewTime":1322611200,"reviewTime":"11 30, 2011"}
{"orig_index":60947,"reviewerID":"A92F571Y9MTW6","asin":"B0053ERWGI","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"although singer lalah hathaway is the daughter of the late singer donny hathaway she has not let that fact her for her music in fact she forged a down the of quiet storm music when she released her one thousand nine and ninety self titled debut at the time she was twenty two years old making contemporary music while the peers in her page group were focused on new jack swing her debut showed the promise of a new talent whose music took cues from the likes of anita she released her sophomore effort a moment four years later a great but suffered from the dreaded sophomore jinx for decade she low and was heard from save for a duet album with jazz pianist joe sample and contributing background vocals on sunshine andersons debut woman after a ten year hiatus she presumed her recording career and released her third outrun the sky album that was propelled by the biggest single of her career a cover of luther vandross forever for for love two thousand and eight move to the recently reactivated stax records the next album self portrait and in two thousand eleven released her fifth recording where it all begins on this new album she to shake things up a bit lalah whose albums are usually heavy surprises people this time around she works with producers andre harris vidal davis musiq soulchild usher ciara jill scott on the opening synth heavy song strong woman as well as the ballad lie to me she collaborates with producer j r who previously produced eric robersons dealing on which hathaway appeared on the song small of my back and the acoustic ballad wrong way mike city who also produced on lalahs outrun the sky produces the song love you she works with legendary producer phil ramone chicago billy joel phoebe on two cover songs she reinterprets her fathers you were meant for me and remakes a song from her debut im coming back guest vocals jazz singer rachelle ferrell she also references her debut album again on the first single if you want to towards the of the song she sings the hook to stay home tonight overall hathaways where it all begins is a listenable album that shows that she can step out of her comfort zone and still make great songs after twenty one years in business she that she still has it","overall":4,"summary":"Lalah Hathaway diversifies her sound on \"Where It All Begins\"","unixReviewTime":1322611200,"reviewTime":"11 30, 2011"}
{"orig_index":60947,"reviewerID":"A92F571Y9MTW6","asin":"B0053ERWGI","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"although singer lalah hathaway is the daughter of the late singer donny hathaway she has not let that fact define her for her music in fact she forged a path down the road of quiet storm music when she released her one thousand nine hundred and ninety self titled debut at the time she was twenty two years old making adult contemporary music while the peers in her page group were focused on new jack swing her debut showed the promise of a new talent whose music took cues from the likes of anita baker she released her sophomore effort a moment four years later a great record but suffered from the dreaded sophomore jinx for a decade she laid low and was barely heard from save for a duet album with jazz pianist joe sample and contributing background vocals on sunshine andersons debut your woman after a ten year hiatus she presumed her recording career and released her third album outrun the sky an album that was propelled by the biggest single of her career a cover of luther vandross forever for always for love two thousand and eight saw her move to the recently reactivated stax records for the next album self portrait and in two thousand and eleven she released her fifth recording where it all begins on this new album she decides to shake things up a bit lalah whose albums are usually ballad heavy surprises people this time around she works with the producers andre harris vidal davis musiq soulchild usher ciara jill scott on the opening synth heavy song strong woman as well as the ballad lie to me she collaborates with producer j r hutson who previously produced eric robersons dealing on which hathaway appeared on the song small of my back and the acoustic ballad wrong way mike city who also produced on lalahs outrun the sky produces the song always love you she works with legendary producer phil ramone chicago billy joel phoebe snow on two cover songs she reinterprets her fathers you were meant for me and remakes a song from her debut im coming back with guest vocals from jazz singer rachelle ferrell she also references her debut album again on the first single if you want to where towards the send of the song she sings the hook to stay home tonight overall lalah hathaways where it all begins is a listenable album that shows that she can step out of her comfort zone and still make great songs after twenty one years in the business she shows that she still has it ","overall":4,"summary":"Lalah Hathaway diversifies her sound on \"Where It All Begins\"","unixReviewTime":1322611200,"reviewTime":"11 30, 2011"}
{"orig_index":60947,"reviewerID":"A92F571Y9MTW6","asin":"B0053ERWGI","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"although singer lalah hathaway is the daughter of the latterly singer donny hathaway she has not let that fact define her for her music in fact she forged a path down the road of quiet storm music when she released her one thousand nine spot hundred and ninety ego highborn debut at the fourth dimension she was twenty years old making adult contemporary music while the peers in her page group were focused on modern jack swing her debut showed the promise of a modern talent whose music withdraw cues from the likes of anita baker she released her sophomore effort a moment four years later a great record but suffered from the dreaded sophomore jinx for a x she laid grim and was scantily heard from bring through for a pas de deux record album with jazz pianist joe sample and kick in background vocals on sunshine andersons debut your womanhood after a ten class hiatus she take for granted her recording career and released her third record album outrun the sky an record album that was actuate by the bad unity of her career a cover of luther vandross forever for invariably for have it away thousand and eight saw her move to the recently reactivated stax records for the succeeding record album ego portrayal and in thousand and eleven she released her fifth recording where it all begins on this modern record album she decides to shake things up a bit lalah whose albums are usually ballad laborious surprises people this fourth dimension around she works with the producers andre joel harris eugene luther vidal davis musiq soulchild usher ciara jill scott on the opening synth laborious song strong womanhood as well as the ballad lie to me she collaborates with producer j r hutson who previously give rise eric robersons dealing on which hathaway appeared on the song small of my back and the acoustic ballad wrong way microphone city who besides give rise on lalahs outrun the sky produces the song invariably have it away you she works with fabled producer phil ramone chicago billystick joel phoebe blow on cover songs she reinterprets her begetter you were think of for me and remakes a song from her debut im number back with guest vocals from jazz singer rachelle ferrell she besides computer address her debut record album again on the first unity if you want to where towards the send of the song she let the cat out of the bag the glom to stay home this evening boilers suit lalah hathaways where it all begins is a listenable record album that shows that she can step out of her console zone and still make great songs after twenty one years in the business she shows that she still has it","overall":4,"summary":"Lalah Hathaway diversifies her sound on \"Where It All Begins\"","unixReviewTime":1322611200,"reviewTime":"11 30, 2011"}
{"orig_index":60947,"reviewerID":"A92F571Y9MTW6","asin":"B0053ERWGI","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"although singer lalah hathaway is the daughter of the late singer donny commonly hathaway she has not let that fact angstrom unit define her for her music in fact she forged wrongly vocal along a path down the road of quiet storm music when she released her one thousand nine hundred and ninety self titled debut at the time she was twenty incessantly two years old making adult contemporary music while the peers in her page group were unexampled focused on new jack swing her debut showed the promise of a new talent whose music took cues from the likes of anita baker she hind released her sophomore effort a moment four years later a great record but suffered from the dreaded sophomore jinx for a decade she laid twelvemonth low and was barely heard from save for metropolis fabled a duet album with angstrom unit jazz pianist joe fabled sample and contributing background vocals on sunshine andersons debut your woman after a ten year hiatus she presumed her recording career and released her third album outrun the sky an album that was deoxyadenosine monophosphate propelled by the biggest single of her career a cover sir frederick handley page of luther vandross forever new for always for demo love two thousand and eight saw her move to the book of joel recently reactivated stax records for the next album self portrait and in two thousand and eleven she released her fifth recording where it all begins on this new album she decides to shake things up a bit lalah whose albums are usually ballad heavy surprises come out of the closet people this time around introduction she works with enceinte the producers andre harris vidal davis musiq soulchild usher ciara jill scott on the ego make up ones mind opening violent storm synth heavy ego song strong woman as well as the ballad lie to me she bread maker intend collaborates sun with producer j r hutson who previously produced eric robersons dealing on which hathaway appeared on the song small of my back along and the acoustic ballad wrong way mike city who also produced on lalahs outrun the sky produces the song always love you she works with legendary producer phil ramone chicago billy joel phoebe snow on over again two birdsong cover make bold songs she reinterprets her fathers you were meant for me and remakes a song from her bread maker debut im coming back with guest vocals from jazz singer rachelle ferrell she also record album references her debut album again on the first single if you want to where towards the send of the song she sings the hook euphony to stay home tonight overall lalah hathaways where it all begins self importance angstrom unit is a listenable album that shows that she can step out inwards of her comfort demo zone and still make great songs after twenty one years in the business she shows that she still be has it","overall":4,"summary":"Lalah Hathaway diversifies her sound on \"Where It All Begins\"","unixReviewTime":1322611200,"reviewTime":"11 30, 2011"}
{"orig_index":62330,"reviewerID":"A121B1GMDFNLZT","asin":"B0083EYC4A","reviewerName":"Tamie","helpful":[0,0],"reviewText":"Great song, wonderful voice, catchy tune, what is not to love, add the Cloud and a portable device and you are good to go.","overall":5,"summary":"LOVE IT","unixReviewTime":1389398400,"reviewTime":"01 11, 2014"}
{"orig_index":62330,"reviewerID":"A121B1GMDFNLZT","asin":"B0083EYC4A","reviewerName":"Tamie","helpful":[0,0],"reviewText":"great song wonderful voice catchy tune what is not to love add portable and and a the device cloud you are good to go","overall":5,"summary":"LOVE IT","unixReviewTime":1389398400,"reviewTime":"01 11, 2014"}
{"orig_index":62330,"reviewerID":"A121B1GMDFNLZT","asin":"B0083EYC4A","reviewerName":"Tamie","helpful":[0,0],"reviewText":"great song wonderful voice catchy tune what is not to love add the becloud and a portable twist and you are good to go","overall":5,"summary":"LOVE IT","unixReviewTime":1389398400,"reviewTime":"01 11, 2014"}
{"orig_index":62330,"reviewerID":"A121B1GMDFNLZT","asin":"B0083EYC4A","reviewerName":"Tamie","helpful":[0,0],"reviewText":"great song wonderful voice catchy tune gimmick what is not to love add the cloud and a portable device and you are non good to go","overall":5,"summary":"LOVE IT","unixReviewTime":1389398400,"reviewTime":"01 11, 2014"}
{"orig_index":62330,"reviewerID":"A121B1GMDFNLZT","asin":"B0083EYC4A","reviewerName":"Tamie","helpful":[0,0],"reviewText":"great song wonderful voice catchy tune what is not to love add the cloud and a portable device and you are good to go ","overall":5,"summary":"LOVE IT","unixReviewTime":1389398400,"reviewTime":"01 11, 2014"}
{"orig_index":62330,"reviewerID":"A121B1GMDFNLZT","asin":"B0083EYC4A","reviewerName":"Tamie","helpful":[0,0],"reviewText":"great song wonderful voice catchy tune what is not to love add the cloud and obscure a portable move device and you are good to go","overall":5,"summary":"LOVE IT","unixReviewTime":1389398400,"reviewTime":"01 11, 2014"}