{"orig_index":1961,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B000000W98","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[1,1],"reviewText":"The best Luniz Album. With I Got five on it-Both Versions, Sadly missing the remix featuring E-forty,Dru Down, spice one which later came out. Funny, Good Beats and rhymes. Luniz-Yuk and Num at it's best. Good Cd.","overall":5,"summary":"Best Luniz Album-Operation Stackola. CD","unixReviewTime":1252972800,"reviewTime":"09 15, 2009"}
{"orig_index":1961,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B000000W98","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[1,1],"reviewText":"Best Luniz album. I have five versions - two. Unfortunately, I missed a mix that included E-forty, Dru Down, and one of the spice that came out later. It has an interesting, good rhythm and rhyme. Luniz-Yuk and Num are the best. Good cadmium.","overall":5,"summary":"Best Luniz Album-Operation Stackola. CD","unixReviewTime":1252972800,"reviewTime":"09 15, 2009"}
{"orig_index":1961,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B000000W98","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[1,1],"reviewText":"Luniz's best album. Unfortunately, I missed a mixture that included E-forty, Dr. Down, and later appeared","overall":5,"summary":"Best Luniz Album-Operation Stackola. CD","unixReviewTime":1252972800,"reviewTime":"09 15, 2009"}
{"orig_index":1961,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B000000W98","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[1,1],"reviewText":"I regretted missing a mixture that included E-forty, Dr. Down, one of the spices. Luniz-Yuk and Num are the best.","overall":5,"summary":"Best Luniz Album-Operation Stackola. CD","unixReviewTime":1252972800,"reviewTime":"09 15, 2009"}
{"orig_index":4465,"reviewerID":"A1L1VZ854S2FB2","asin":"B000001EGI","reviewerName":"RH","helpful":[0,0],"reviewText":"“A Delightful Live Hit With Just Results”With Elton John becoming a powerful new voice for the singer- songwriter circuitand a world class rock star in one thousand, nine hundred and seventy with two blockbuster albums which have toppedthe music charts worldwe, the had decide to give listeners and the critics a speciallive album in one thousand, nine hundred and seventy-one. By capitalizing on this two-year solo mighty career and meteoricrise to the top of the music world, the gave this special live concert date in New YorkCity that was broadcaster on radio on November seventeenth, one thousand, nine hundred and seventy and released on Marchthree, one thousand, nine hundred and seventy-one to instant success. Headed by a live track set, “seventeen-eleven-seventy” would showcasehis functioning talent that abridged the gap from the public perception which saw thomas a soft-rock balladeer and the piano stool-throwing “rock and roller” that the wouldbecome immortalized for. Alongside this first-time classics hits like Bad Side Of TheMoon, Amoreena, Sixty Years On and Burn Down The Mansion, this meat and spot-atoes live session even feature significant takes of The Rolling Stones’ Honky TonkWomen and The Beatles’ Get Back, which make this classic live time capsule buchan unforgettable and captivating listening experience.","overall":5,"summary":"A Delightful Live Hit With Just Results","unixReviewTime":1398211200,"reviewTime":"04 23, 2014"}
{"orig_index":4465,"reviewerID":"A1L1VZ854S2FB2","asin":"B000001EGI","reviewerName":"RH","helpful":[0,0],"reviewText":"\"Happy Hit at Home with Good Results\" -rock world-class one thousand and nine hundred and seventy, this two albums of blockbuster success It has been placed at the top of the world music charts, and they have deed to provide audiences and critics with a special live album of one thousand and nine hundred and seventy-one. With two years of solo work and a global speak of music going to the skies, a special concert was held in New York City at this time, which will be broadcast on radio on November seventeen, one hundred, nine hundred and seventy, and on March three. One thousand nine hundred and seventy-one to see results immediately. Under the leadership of a living referral, \"seventeen-eleven-seventy\" will showcase this active talents and narrow the gap in public perception. In addition to the first classic game like Bad Side Of The Moon, Amoreena, sixty years and burning down the living space, this live meat spread includes the Rolling Stones Honky TonkWomen and the Beatles. Live capsule buchan time is an unforgettable and interesting listening experience.","overall":5,"summary":"A Delightful Live Hit With Just Results","unixReviewTime":1398211200,"reviewTime":"04 23, 2014"}
{"orig_index":4465,"reviewerID":"A1L1VZ854S2FB2","asin":"B000001EGI","reviewerName":"RH","helpful":[0,0],"reviewText":"Thomas is a popular rock musician and \"rock musician\" who will chair the immortality of the piano. \"seventeen-eleven-seventy\" will show this kind of active talent. Accompanied by these early archaeological works, such as \"The Bad Case of the Moon\", \"Amorena\", \"Sixty Years\" and \"Burn the Mansion\".","overall":5,"summary":"A Delightful Live Hit With Just Results","unixReviewTime":1398211200,"reviewTime":"04 23, 2014"}
{"orig_index":4465,"reviewerID":"A1L1VZ854S2FB2","asin":"B000001EGI","reviewerName":"RH","helpful":[0,0],"reviewText":"\"The Best Hit by Just Going Out\" is Elton John's first concert in New York City. It was released on March twenty-three, one thousand, nine thousand and seventy-one, and it was an outstanding event.","overall":5,"summary":"A Delightful Live Hit With Just Results","unixReviewTime":1398211200,"reviewTime":"04 23, 2014"}
{"orig_index":5202,"reviewerID":"A1IAQIZSXONWVU","asin":"B000001FAO","reviewerName":"Mark \"The early bird gets the worm but the se...","helpful":[3,3],"reviewText":"For the Na NaNa Na Na Na Na poster: SWLABR = She Walks Like a Bearded Rainbow. The title was probably chosen by long-time Jack Bruce collaborator Peter \"Rope Ladder to the Moon\" Brown, who wrote much of the lyric for Cream. Exotic chemical substances were all the rage back in one thousand, nine hundred and sixty-eight and it definitely shows there. It's all good, including Mother's Lament and Blue Condition. This is a great CD, buy it. 'Nuff asa.","overall":5,"summary":"She Walks Like a Bearded Rainbow","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":5202,"reviewerID":"A1IAQIZSXONWVU","asin":"B000001FAO","reviewerName":"Mark \"The early bird gets the worm but the se...","helpful":[3,3],"reviewText":"In the Na Na Na Na Na Na Na Na Na Na Na Na Poster: SWLABR = You Walk Like a Beard. The title could be chosen by Jack Bruce's longtime collaborator Peter \"Ladder to the Moon\" Brown, who wrote most of Cream's lyrics. One thousand nine hundred and sixty-eight years ago, the external chemicals were furious, and must have been manifested there. Everything is fine, including the mother's cry and the green situation. This CD is great, buy it. 'sa Nuff.","overall":5,"summary":"She Walks Like a Bearded Rainbow","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":5202,"reviewerID":"A1IAQIZSXONWVU","asin":"B000001FAO","reviewerName":"Mark \"The early bird gets the worm but the se...","helpful":[3,3],"reviewText":"Unusual chemicals were angry before one, nine hundred and sixty-eight years ago, and they will certainly be seen there. The title could be chosen by Jack Bruce who was a long time co-founder Peter \"The Ladder to the Moon\" Brown, who wrote many of Cream's lyrics. Everything is fine, including the mother's cry and the green situation. This is a great CD, buy it. Ye Na Na Na Na Na Na Na Na Na Posta: SWLABR = You Walk Like a Bearded Man. 'sa Nuff.","overall":5,"summary":"She Walks Like a Bearded Rainbow","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":5202,"reviewerID":"A1IAQIZSXONWVU","asin":"B000001FAO","reviewerName":"Mark \"The early bird gets the worm but the se...","helpful":[3,3],"reviewText":"The title could be chosen by Jack Bruce's longtime colleague Peter \"Ladder to the Moon\" Brown. Everything is fine, including the mother's cry and the green situation.","overall":5,"summary":"She Walks Like a Bearded Rainbow","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":6271,"reviewerID":"A3JYW6GWR9CS5P","asin":"B000001Y5F","reviewerName":"purerockfury \"Gorillas\"","helpful":[11,11],"reviewText":"Strange. I keep reading all of these references to Helmet being the originators of gnu-metal yet, when this album was released, the concept of gnu-metal had not yet even begun to brew rinse the mind of some soulless marketing executive, pitching to brandish a newer and more simplistic sound to attract the masses with a short attention span. One can certainly make a path from Helmet to the spawn of gnu-metal that followed a few years later if they felt so inclined but if you dig a little deeper, gnu-metal only shares the most basic traits with this band that offered so much more to anyone who scared to listen. In some ways, it almost seems strange to slap the \"metal\" tag on a band like Helmet. Sure, they wrote this album that is bludgeoningly heavy with songs that would blow your head clean off your body from the outset but beyond that, Helmet shared little with the dyed-in-the-wool metal bands from the early one thousand, nine hundred and ninety's. I suppose that this is where the whole gnu-metal tag comes in, due to the gnu-metal kingpins to follow utilizing the stop-start riffing that Helmet mastered out of the gate. However, those comparisons send when you get into these songs. Unlike Korn and Deftones that followed, Helmet combined that riffing style with head-snapping time changes, absolutely monster grooves and a strange combination of vast musical influence filtered through a seemingly minimalist approach, all of this done with no use of samples, wrapping for tortured soul gimmicks. Helmet was strictly about the music. Maybe this is why their flirtation with the mainstream did't last. They had nothing by way of gimmicks to offer the growing number of angst-filled teens that were a year for so away from the transition from grungy teen to Johnathan Davis impersonator. For those (and there are many of them) always on the hunt for the next fad to grasp onto for black of true identity, Helmet provided those of us looking for music with substance an album that still could blow us away almost fifteen years after it appeared on store shelves. \"Meantime\" is precisely that album.","overall":5,"summary":"A Mammoth Album","unixReviewTime":1152662400,"reviewTime":"07 12, 2006"}
{"orig_index":6271,"reviewerID":"A3JYW6GWR9CS5P","asin":"B000001Y5F","reviewerName":"purerockfury \"Gorillas\"","helpful":[11,11],"reviewText":"Unusual. What I was learning all about the helmet as the founder of gnu-metal, but when this album was released, the sea of ​​gnu-metal did not begin to occur in the minds of unscrupulous commercial executives, who wanted to make a revision. And simple sounds attract people by looking at the short term. If they feel inclined, yes, they can move from the Helmet to the gnu metal product that was produced a few years later, but if you go deeper, the gnu-metal only shares the basics and this group provides the most. People who are afraid to listen, this is true. Somehow, it seems strange to put a “metal” label on a band like a helmet. Yes, the album they wrote is very hard, the song will make your mind disappear from your body in the first place, but other than that, the Headmaster has never shared the heavy bands of the nineteenth century. I think that's where the whole gnu-metal tag comes in, because the gnu-metal master pin will take the chance to launch the original Helmet function. However, when you install these songs, this comparison is posted. Unlike the next Korn and Deftones, Helmet combines this style of refinement with an extraordinary blend of amazing seasonal changes, monster rhythms, and great musical influences in seemingly small, all unused samples, and packaging was a soulful gimmick. The helmet strictly adheres to the music. Probably a factor as to why they're doing so poorly. They have no plans to provide the growing number of anxious teens, who for a year have come out of the transition from disgruntled youth to the role of Jonathan Davis. For those (and most people) who are always looking for the next fashion to take on the real reality of black people, Helmet has provided your album we are looking for music. This disc can be used for almost fifteen years after its release. We are shocked by the appearance on the store shelf. \"For Now\" is the exact same album.","overall":5,"summary":"A Mammoth Album","unixReviewTime":1152662400,"reviewTime":"07 12, 2006"}
{"orig_index":6271,"reviewerID":"A3JYW6GWR9CS5P","asin":"B000001Y5F","reviewerName":"purerockfury \"Gorillas\"","helpful":[11,11],"reviewText":"Unlike Korn and the following Deftones, Helmet combines a style of refinement with a dramatic change of timing, monster rhythms, and great musical influences in ways that seem small. packing tormented souls by not using samples. I have long read all this about Helmet as the founder of gnu-metal, but when this album was released, the concept of gnu-metal had not even begun to take root in the minds of some unscrupulous commercial executives, who wanted to make a revision. And simple sounds attract people with a short look. Of course, the album they wrote is very difficult, the song will make your mind disappear from your body from the beginning, but other than that, Helmet has shared the hardcore bands of the first nineteenth century. And in the nineties. For those (and most people) who are always looking for the next fashion to take on the real reality of black people, Helmet has proved your album we are looking for music. This disc can be used for almost fifteen years after its release. We are shocked by the appearance on the store shelf. If they feel inclined, yet they can move from a helmet to a gnu metal product that was produced a few years later, but if you dig deeper, gnu-metal only shares the basic features and this band provides a lot of people who are afraid to listen, this is true. I think that's where the whole gnu-metal tag comes in, because the gnu-metal master pin will take the chance to launch the original Helmet function. Somehow, it seems strange to put a “metal” label on a band like a helmet.","overall":5,"summary":"A Mammoth Album","unixReviewTime":1152662400,"reviewTime":"07 12, 2006"}
{"orig_index":6271,"reviewerID":"A3JYW6GWR9CS5P","asin":"B000001Y5F","reviewerName":"purerockfury \"Gorillas\"","helpful":[11,11],"reviewText":"Surprise. I keep reading all these references about Helmet being the origin of gnu-metal yet, when this album was released, the sea of ​​gnu-metal had not yet begun to create in the minds of some executives who marketed the soul of new sound and very easy to attract the public with a short attention span. A path from Hat to the birth of gnu-bira will be sure to follow a few years later if they feel the surge but if you dig a little further, gnu-bir will only share the key characteristics of this group that paid more than anyone afraid to listen. In some ways, it seems strange to hit the “metal” label on a group like Helmet. Sure, they wrote this album that was so heavy with songs that it would blow your head into your body in the beginning but beyond that, Helmet has little in common with color metal bands since the first thousand, nine hundred and ninety. I think this is the place where the whole gnu-birta brand comes in, because of the gnu-birta kings who follow the use of the initial hook-up learned from the Hat learned at the gate. However, those comparisons send out when you enter these songs. Unlike the sequel Korn and Deftones, The Hat combines that style of ruffing with the changes of time, completely torn pieces and a weird combination of great musical effects characterized by a very sophisticated style . To a lesser extent, all of this is done without the use of labs, and recording torture gimmicks for life. The that is tough on music. This may be the reason why ordinary people do not know how to flirt. They have no exposed cheats to give the growing number of angry teenagers who are super crowded a year away from winning the brutal youth and the role of Johnathan Davis. With these (and many of them) always on the hunt for the next scandal to get the black’s true identity, the that gave us looking for a music album that we could still blast in for nearly fifteen years later appeared on store shelves. “Meantime” is exactly that album.","overall":5,"summary":"A Mammoth Album","unixReviewTime":1152662400,"reviewTime":"07 12, 2006"}
{"orig_index":8484,"reviewerID":"A12O0S8IPSMRXH","asin":"B0000025RI","reviewerName":"Q. Anh Nguyen \"AnnieSoy\"","helpful":[3,3],"reviewText":"I absolutely love this record and I think the folks who are giving this album a crappy one star is obviously envious for just cd't flat out like Michael Jackson. The Man and The Music is two different things, do not drag them together. Anyhow, every song on this album is top notch, you can't dispute with that. From Wanna Be Startin' Something to Beat it to Baby Be Mine, every one is pure gold. Buy and I promise you you will not feel rueful not all. Every time I listen to this record it conveys a gleeful feeling and it will never be outdated. Uncongruous to most crappy pop songs today it will last for eternity. Michael Jackson is truly the King of Pop, Justin Timberlake, Chris Brown, Usher, etc. are only the posers.","overall":5,"summary":"How can you not LOVE this album?","unixReviewTime":1249430400,"reviewTime":"08 5, 2009"}
{"orig_index":8484,"reviewerID":"A12O0S8IPSMRXH","asin":"B0000025RI","reviewerName":"Q. Anh Nguyen \"AnnieSoy\"","helpful":[3,3],"reviewText":"I really like this record, I think the people who gave it to the crappy star are jealous because they and't perform as well as Michael Jackson. Man and Music are two different things, don't pull them together. In any case, it is undeniable that every song on this album is of high quality. From Wanna Be Startin 'The Thing to Beat a Child Be Mine, everything is pure gold. Buy, I assure you, not everyone will regret it. Every time I listen to this record, I get excited, and it will never expire. Inconsistent with many crappy pop songs today, they will last forever. Michael Jackson is the real master of pop music, Justin Timberlake, Chris Brown, Usher, etc.","overall":5,"summary":"How can you not LOVE this album?","unixReviewTime":1249430400,"reviewTime":"08 5, 2009"}
{"orig_index":8484,"reviewerID":"A12O0S8IPSMRXH","asin":"B0000025RI","reviewerName":"Q. Anh Nguyen \"AnnieSoy\"","helpful":[3,3],"reviewText":"Every time I listen to this record, I feel excited and timeless. Michael Jackson is the real master of pop music, Justin Timberlake, Chris Brown, Usher, etc. Buy, I guarantee you will not regret it.","overall":5,"summary":"How can you not LOVE this album?","unixReviewTime":1249430400,"reviewTime":"08 5, 2009"}
{"orig_index":8484,"reviewerID":"A12O0S8IPSMRXH","asin":"B0000025RI","reviewerName":"Q. Anh Nguyen \"AnnieSoy\"","helpful":[3,3],"reviewText":"Michael Jackson is a true king of pop music, Justin Timberlake, Chris Brown, Usher, etc. After all, all the songs on this album are top notch, and you can't deny that. I really like this record, and I think the people who gave this album a lovely star are obviously jealous because they are not as good as Michael Jackson. From Wanna Be Startin 'The Thing to Beat a Child Be Mine, everything is pure gold. Man and Music are two different things, don't drag them together. Every time I listen to this record, I feel happy, and it will never expire. Inconsistent with many crappy pop songs today, they will last forever.","overall":5,"summary":"How can you not LOVE this album?","unixReviewTime":1249430400,"reviewTime":"08 5, 2009"}
{"orig_index":8755,"reviewerID":"AVMAHVWDGNOKK","asin":"B0000025YM","reviewerName":"Rock~N~Rolla","helpful":[9,9],"reviewText":"Heavy Metal music does't get any heavier than this, for better. I have been a fan of this album never since it's release back in one thousand, nine hundred and eighty-four and it is without a doubt my top favourite Judas Priest album of all time. Upon my first listen to it I was amazed and enthralled by it's high octane and infectious energy. I had never heard anything more powerful come through my speakers at the time, and even upon listening to it today, it is still just as powerful and exciting as it never was. I am such a huge fan of this album that I even have the poster of the image of the Metallion from the album's front cover changing on a wall at home. I've read some other reviewers complaints concerning the cheesy lyrics on some of the songs and all I can say about that is, well, that's all part of the fun of it all. Judas Priest's prior album to this one, Screaming for Vengeance, is a definite masterpiece recording, and Defenders of the Faith continues in that tradition and then some by delivering even more addictive power metal songs and anthems than seems humanly possible. Just sit back and pop this disk in your player and feel the music pummel you into a pulsating pulp with awesome tracks like Freewheel Burning, Jawbreaker, The Sentinel, Some Heads Are Gonna Roll, and Heavy Duty. By this time in their careers, the mighty team of Glen Tipton, K. K. Downing, Ian Hill, Dave Holland, and Rob Halford, were like a well-oiled precision Metallion music machine and were really at a creative high point during the pm Eighties, and it definitely shows on this album. But to be honest, Judas Priest have hit many high points throughout their career and continue to do some very excellent and amazing music to this very day. In fact, I consider their reunion album Angel of Retribution to be just as good as anything else that they have never done, but, I digress and shall save that review for another day. Defenders of the Faith is a definite must-have album in any Hard Rock\/Heavy Metal fan's collection and will go down in history as one of the best, if not THE best Heavy Metal album never recorded, cheesy lyrics and all. \"We'll rise inside rya til' the power splits your head. We're gonna Rock you til' your metal hunger's fed. We're Heavy Duty!\"Standout Tracks are: ALL OF THEM.","overall":5,"summary":"100% Drop Forged Heavy Duty Heavy Metal","unixReviewTime":1272412800,"reviewTime":"04 28, 2010"}
{"orig_index":8755,"reviewerID":"AVMAHVWDGNOKK","asin":"B0000025YM","reviewerName":"Rock~N~Rolla","helpful":[9,9],"reviewText":"Nothing is harder and better than heavy metal music. I have been a fan of this album since it was released in one thousand and nine hundred and eighty-four, and it is without a doubt my favourite album of Judas Priest of all time. When I first heard it, its high octane content and infectious power shocked and impressed me. I cd not hear a strong sound on my speaker at the time, and even though I hear it today, it is still as powerful and interesting as never. I am a huge fan of this album, and I even hung a poster with a picture of a metal band on the cover of the album on the wall of the home. I’ve read complaints from some critics about the cheesy lyrics of certain songs, and I can only say, yes, this is part of all the fun. Judas Priest’s previous album, Shout for Revenge, was an artistic record, and the Defenders of the Faith continued this tradition, then by offering songs of stronger metal and national anthems than people. Just sit down, pop this disc on your player, and hear the music playing on the pulsating pulp, including great songs such as Freewheel Burning, Jawbreaker, Sentinel, Some Heads Roll, and Responsibility. During this time in their careers, the dynamic group composed of Glen Tipton, KK Downing, Ian Hill, Dave Holland, and Rob Halford was similar to the efficiency of the Metallion music machine. The one thousand, nine hundred and eightys will definitely be featured on this album. But to be honest, Judas the Priest has reached many heights in their careers and continues to create the most beautiful and wonderful music to this day. After all, I think their reunion album Angel of Recovery is just as good as anything they've never done before, but I've dug and I'll keep this update someday. Defenders of Faith are required to have an album in any collection of Hard Rock \/ Heavy Metal fans, and it will be recorded in history as the best, if not one of the heaviest metal albums, if not the best, never recorded. Yes, the words of cheese and so on. \"We'll stand on the rya until your head is violently severed. We'll shake you until your iron hunger is satisfied. It's hard!\" The best line is: all.","overall":5,"summary":"100% Drop Forged Heavy Duty Heavy Metal","unixReviewTime":1272412800,"reviewTime":"04 28, 2010"}
{"orig_index":8755,"reviewerID":"AVMAHVWDGNOKK","asin":"B0000025YM","reviewerName":"Rock~N~Rolla","helpful":[9,9],"reviewText":"Without a doubt, this album is my favourite album by Judas Priest. This is a must have, for any Affiliate, promoting any program. I think their hit album \"Angel Review\" is just as good as any other album.","overall":5,"summary":"100% Drop Forged Heavy Duty Heavy Metal","unixReviewTime":1272412800,"reviewTime":"04 28, 2010"}
{"orig_index":8755,"reviewerID":"AVMAHVWDGNOKK","asin":"B0000025YM","reviewerName":"Rock~N~Rolla","helpful":[9,9],"reviewText":"Defenders of the Faith is undoubtedly my favourite album from Judas Priest. Nothing is harder and better than heavy metal music. The best songs are: all.","overall":5,"summary":"100% Drop Forged Heavy Duty Heavy Metal","unixReviewTime":1272412800,"reviewTime":"04 28, 2010"}
{"orig_index":9422,"reviewerID":"AB2AQMK9PCWWX","asin":"B0000026WD","reviewerName":"yygsgsdrassil \"yygsgsdrassil\"","helpful":[0,0],"reviewText":". notwithstanding this troubled apr, I kinda dig the darker smilax itunes. \"in the closet\", \"give in to me\", \"dangerous\", \"why of wanna trip\". they make some of the serious soul searching itunes. \"keep the faith\", \"will you be there\" \"gone too soon\". that much poignant. Mixtures (all the same jam) of the darker\/searching smilax tax were seen in HiStory I & II, die, especially notice the itunes \"ghosts\" and \"morphene\". I think the oughtta get with Bristol's Massive Attack 'cause I think they can take smilax to a whole new than while in line of\/ dangerous and moody tax.","overall":5,"summary":"Dangerous and Moody Jax Trax...","unixReviewTime":956534400,"reviewTime":"04 24, 2000"}
{"orig_index":9422,"reviewerID":"AB2AQMK9PCWWX","asin":"B0000026WD","reviewerName":"yygsgsdrassil \"yygsgsdrassil\"","helpful":[0,0],"reviewText":". Unless this April is a problem, I still love digging into the black iTunes smilax. \"In the room\", \"dedicate me\", \"it's dangerous\", \"why travel\". They have done a deep soul search on iTunes. \"Keep the faith,\" \"Will you be there?\" \"Go fast\". You're very nice. I saw a mixture of black \/ looking smilax tax (all the same jam) on HiStory I and II, especially a focus on \"ghosts\" and \"morphene\" on iTunes. I think a major Bristol attack should be accepted because I think they can take smilax to a new country, not to dangerous taxes and modules.","overall":5,"summary":"Dangerous and Moody Jax Trax...","unixReviewTime":956534400,"reviewTime":"04 24, 2000"}
{"orig_index":9422,"reviewerID":"AB2AQMK9PCWWX","asin":"B0000026WD","reviewerName":"yygsgsdrassil \"yygsgsdrassil\"","helpful":[0,0],"reviewText":"I saw the black \/ smilax-looking tax on HiStory I and II, dead, paying special attention to \"ghost\" and \"morphine\" on iTunes, I think it should be compared to a large scale Bristol Attack is used together because I think they can take it with them into a new \/ dangerous place with air. One of these is black \/ search for smilax.","overall":5,"summary":"Dangerous and Moody Jax Trax...","unixReviewTime":956534400,"reviewTime":"04 24, 2000"}
{"orig_index":9422,"reviewerID":"AB2AQMK9PCWWX","asin":"B0000026WD","reviewerName":"yygsgsdrassil \"yygsgsdrassil\"","helpful":[0,0],"reviewText":"\"closet\", \"give me permission\", \"accent\", \"why leave\". I saw a mixture of black \/ looking smilax tax (all the same jam) on HiStory I and II, especially a focus on \"ghosts\" and \"morphene\" on iTunes. \"Keep the faith,\" \"Will you be there?\" \"Very fast\". I think a major Bristol attack should be accepted because I think they can take smilax to a new location, not to dangerous taxes and modules. Unless this April is a problem, I still love digging into the black iTunes smilax. They did extensive soul research on iTunes. You're very nice.","overall":5,"summary":"Dangerous and Moody Jax Trax...","unixReviewTime":956534400,"reviewTime":"04 24, 2000"}
{"orig_index":9771,"reviewerID":"A1Z4C6XDXIZPZV","asin":"B0000028RR","reviewerName":"\"noreason\"","helpful":[0,1],"reviewText":"I think Rage was a band that was far ahead of their time. This particular album showcases that well. The lyrics are full of danger and frustration. They make you think and the music is incredible too. It's a shame about Zach leaving.","overall":5,"summary":"Way","unixReviewTime":979689600,"reviewTime":"01 17, 2001"}
{"orig_index":9771,"reviewerID":"A1Z4C6XDXIZPZV","asin":"B0000028RR","reviewerName":"\"noreason\"","helpful":[0,1],"reviewText":"I think Rage is a band far ahead of their time. This unique disc illustrates this well. Words full of danger and help. They make you think, and the music is unbelievable. It's a shame Zach's departure.","overall":5,"summary":"Way","unixReviewTime":979689600,"reviewTime":"01 17, 2001"}
{"orig_index":9771,"reviewerID":"A1Z4C6XDXIZPZV","asin":"B0000028RR","reviewerName":"\"noreason\"","helpful":[0,1],"reviewText":"I think the Rage are a team far from their time. This particular album is displaying well. Words are full of danger and frustration. They make you think and the music is also amazing. Embarrassingly Zach was leaving.","overall":5,"summary":"Way","unixReviewTime":979689600,"reviewTime":"01 17, 2001"}
{"orig_index":9771,"reviewerID":"A1Z4C6XDXIZPZV","asin":"B0000028RR","reviewerName":"\"noreason\"","helpful":[0,1],"reviewText":"I think Rage was a team that was far from its time. This album illustrates this well. The songs are full of danger and frustration. They make you think and the music is amazing. Zack's leave is embarrassing.","overall":5,"summary":"Way","unixReviewTime":979689600,"reviewTime":"01 17, 2001"}
{"orig_index":10318,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000029B3","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[1,2],"reviewText":"one thousand, nine hundred and eighty-two was the year that ushered in the EIGHTIES decade of\/ \"Rock In A Hard Place\", by Aerosmith. It was their first studio album, since one thousand, nine hundred and seventy-nine's \"Night In The Ruts\" album. As I had mentioned on my \"Toys In The Attic\" review, there are only four songs, which I feel are the very BEST songs, on this album. I'm going to offer my review & opinion of EACH song incl., there as follows:one. \"Jailbait\". This song is pretty good of\/ a real fast beat. It is one of the album's better songs. \"Jailbait\" is my threerd favourite on this album.two. \"Lightning Strikes\". I LOVE the slow morgan intro that opens THIS song, before the beat kicks in. Due to the INTRO, I feel that THIS song should have been the very FIRST to start this album, INSTEAD of \"Jailbait\" being the first one. \"Lightning Strikes\" rec'd some radio airplay in one thousand, nine hundred and eighty-two & it is the VERY BEST song on this ENTIRE album. I was shocked to discover that Aerosmith DIDN'T write this hit single. I never heard this by anyone else before, either. I also LOVE the morgan ending along of\/ the thunder closing out this song.three. \"Bitch's Brew\". Just like the opening two songs, this is probably my atwood favourite that TIES of\/ \"Cheshire Cat\". It's pretty good, I think!four. \"Bolivian Ragamuffin\". This is only a passable song. not too bad!five. \"Cry Me A River\". Another old standby, that I've heard by OTHER artists, too. It in't too bad by Aerosmith, though!six. \"Prelude to Joanie\". This is pretty good, but I can't say the same about the following song.seven. \"Joanie's Butterfly\". I just can't seem to get into THIS song. & unfortunately it is five:thirty-five TOO LONG & drawn out. The TITLE sounded pretty decent, but that's IT. Definitely, one of my LEAST favourites.eight. \"Rock In A Hard Place\" (CHESHIRE CAT). I rate this song as my atwood favourite which TIES of\/ \"Bitch's Brew\". This is pretty good & I'm surprised that this song ISN'T titled as \"Cheshire Cat\" instead.nine. \"Jig Is Up\". This Sweet Painted Ladies song is only okay, & it sounds like Aerosmith's one thousand, nine hundred and seventy-six single \"Last Child\", in the tempo, somewhat.ten. \"Push Comes To Shove\". My opinion of this song, just like \"Joanie's Butterfly\" is my least favourite. actually this the WORST song incl., there. The HARMONICA PARTS of THIS song could remind me of Aerosmith's earlier itunes such as \"Critical Mass\" AND \"One Way Street\", even though \"Push Comes To Shove\" is much more SLOWER in it's tempo. I only gave this album as three stars. It may be recommended for those, who start out the EIGHTIES decade of\/ Aerosmith.","overall":3,"summary":"Aerosmith...\"Rock In A Hard Place\"...1982","unixReviewTime":1364256000,"reviewTime":"03 26, 2013"}
{"orig_index":10318,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000029B3","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[1,2],"reviewText":"one thousand, nine hundred and eighty-two was introduced in the one thousand, nine hundred and eightys by \"Aerosmith's\" Rock in A Hard Place \". There are only four songs on the album, which I think is the best.\" Bitch's Brew \"may be my favourite atwood","overall":3,"summary":"Aerosmith...\"Rock In A Hard Place\"...1982","unixReviewTime":1364256000,"reviewTime":"03 26, 2013"}
{"orig_index":10318,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000029B3","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[1,2],"reviewText":"HARMONICA'S plans for this song remind me of Aerosmith's early iTunes, such as \"Critical Mass\" and \"One Way\" Street \", though the rhythm of\" Push Comes to Shove \"is a bit slower. This song \"Sweet Paint Ladies\" is not bad, it sounds like Aerosmith's one, nine hundred and seventy-six single \"Last Child\", rhythmically, slightly. As I asa in the review of \"Toys in the Attic\", there are only four songs on this album, which I think are very good songs. This is their first album since the one thousand, nine hundred and seventy-nine \"Night In The Ruts\". Thanks to INTRO, I think this song should be the first single on this album, and instead of \"Jailbait\" it's the first. The year one thousand, nine hundred and eighty-two marked the eightys of Aerosmith's \/ \"Rock In A Hard Place\". \"Lightning\" played a number of radio shows in the first one, nine hundred and eighty-two, the best song in the whole album.","overall":3,"summary":"Aerosmith...\"Rock In A Hard Place\"...1982","unixReviewTime":1364256000,"reviewTime":"03 26, 2013"}
{"orig_index":10318,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000029B3","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[1,2],"reviewText":"The eightys of \"Rock in a Hard Land\" by Aerosmith was introduced in one thousand, nine hundred and eighty-two. This is their first album since the album \"Night In the Ruts\". There are only four songs, I think it's the best song on the album.","overall":3,"summary":"Aerosmith...\"Rock In A Hard Place\"...1982","unixReviewTime":1364256000,"reviewTime":"03 26, 2013"}
{"orig_index":10534,"reviewerID":"A1UXMT6XQFZLA1","asin":"B000002ABF","reviewerName":"Anthony G Pizza \"trivialtony\"","helpful":[38,38],"reviewText":"It's hard determinining whether this outstanding Simon & Garfunkel box set succeeds for complements the earlier \"Collected Works\" box. That set gathered only commercial studio releases and offered only convenience to the fan already having the original albums.\"Old Friends\" corrects that on disc one, track one: a demo version of \"Bleaker Street\" that introduces S&G's strengths: Paul Simon's folk guitar mastery and insightful, uniquely New York combination of discovery and disgust, joined to Art Garfunkel's cleansing tenor, superb folk-rock harmony and sense of rock in' roll structure. Subsequent songs build from that discovery, supplemented by sound clarity missing from the original releases. You hear the original and \"remix\" of \"Sounds of Silence,\" and the original holds more power in this context. The group's familiar hits are there (all in studio versions, unlike one thousand, nine hundred and seventy-two's \"Greatest Hits\" set) with live tracks displaying S&G's informal performing style and constant acknowledgement of its influence. (Here, they cover the Everlys' \"Bye Bye Love,\" Gene Autry's \"Silver Haired Daddy,\" and their own \"Hey Schoolgirl,\" first recorded as Tom & Jerry. Interestingly, no live tracks are from their Monterey Pop appearance.)You see simple, striking folk covers and Simon originals from \"Wednesday Morning threeAM\" progress to the \"Abbey Road\" ornateness and power of \"The Boxer\" and \"Brge Over Troubled Water.\" Like the Beatles, S&G began simply, slowed and grew the recording process to create something brief but lasting, then saw personal and professional friendships fracture under the weight. \"Old Friends\" introduces that process to new fans and completes the story for longtime followers. Highly recommended.","overall":5,"summary":"Old Friends Are The Best","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":10534,"reviewerID":"A1UXMT6XQFZLA1","asin":"B000002ABF","reviewerName":"Anthony G Pizza \"trivialtony\"","helpful":[38,38],"reviewText":"It is difficult to determine whether this excellent set of Simon & Garfunkel can successfully complete previous sets of \"Portfolio\". This record only collected records released by commercial studios, and only proves easy access to fans who already have an original album. \"Old Friends\" corrected this on the first record. Track one: A demo version of \"Bleaker Street\" that highlights the benefits of S&G: Paul Simon's guitar skills and understanding, a New York especially that combines discovery and resistance, joining Art Garfunkel's clean tenor, harmonious rock and rock music. The following songs build on this discovery, supplemented by a black of clarity of sound in the original version. You will hear the original \"Sounds of Silence\" and \"Remix\", and the original has a lot of power in this situation. Popular group songs are all available (all are studio versions, different from the \"Greatest Hits\" episodes one thousand and nine hundred and seventy-two), and the live repertoire shows S&G's unofficial performance and ongoing understanding of its impact. (Here, they cover Everlys' \"Bye Bye Love\", Gene Autry's \"Silver Hairy Daddy\" and their \"Hey Schoolgirl\", originally written as Tom and Jerry. \"to\" The Boxer \"and\" Bridge of the Water \"\" Abbey Road \"is beautiful and powerful. Like the Beatles, S&G started out simple, slow and extended the recording process to make something short but permanent, then saw personal and professional relationships break down under pressure. . \"Old Friends\" introduced the program to new fans and completed the story for long-time fans. Highly recommended.","overall":5,"summary":"Old Friends Are The Best","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":10534,"reviewerID":"A1UXMT6XQFZLA1","asin":"B000002ABF","reviewerName":"Anthony G Pizza \"trivialtony\"","helpful":[38,38],"reviewText":"\"Friends\" brings the power of bonding to new fans. unfairly. Like the Beatles, S&G was easy at first, after of it slowed down the recording process, and gradually developed it.","overall":5,"summary":"Old Friends Are The Best","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":10534,"reviewerID":"A1UXMT6XQFZLA1","asin":"B000002ABF","reviewerName":"Anthony G Pizza \"trivialtony\"","helpful":[38,38],"reviewText":"Popular songs known to a music group are all there (all are studio versions, different from the \"selected album\" of one thousand, nine hundred and seventy-two). impact.","overall":5,"summary":"Old Friends Are The Best","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":12554,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002GXX","reviewerName":"P Magnum","helpful":[5,6],"reviewText":"One Of These Nights is the last album to feature original member Bernie Leadon. As the was the truest country rocker in the band, it is also their last album to feature country rock songs. The album opens with the title track, which signalled the direction they would be going in. The spooky bass and bringing guitars helped make it their second number one single. \"Too Many Hands\" is a searing rocker while \"Hollywood Waltz\" contains a beautiful Don Henley vocal and as the title suggests a country waltz sound. \"Journey To The Sorcerer\" is a Bernie Leadon banjo instrumental that is just a hair too long, but still fascinating. \"Lyin' Eyes\" is the band's apex in the country-rock vein and is more country than rock. Randy Meisner's best song with the band is the soaring \"Take It To The Limit\". \"Visions\" is a sol song while \"After The Thrill Is Gone\" is a quiet number about love's lost. Mr. Leadon must have known this days with the band were numbered as the closes out the album with the lamenting \"I Wish You Peace\". One Of These Nights started the Eagles dominance on the charts from 'seventy-five-'eighty and became their first chart-topper.","overall":5,"summary":"Another Hit","unixReviewTime":978912000,"reviewTime":"01 8, 2001"}
{"orig_index":12554,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002GXX","reviewerName":"P Magnum","helpful":[5,6],"reviewText":"One of the Nights is the latest album with original member Bernie Leadon. As the real rock country singer of the band, this is also their latest album with country rock songs. The album opens with a title song, which marks the way they will move forward. Creepy bass and guitar help make one second. \"Too Many Hands\" is a hot rock singer, and \"Hollywood Waltz\" contains Don Henley's beautiful voice, which, as the title suggests, is the world's waltz voice. \"Journey to the Witch\" is Bernie Lden's banjo tool, but the hair is very long, but still interesting. \"Lyin 'Eyes\" is the mainstay of the country's rock music style. Randy Meisner's best hit single \"Take it to the border\". \"Ideas\" is a strong song, and \"After the joy is gone\" a quiet song about love is gone. Mr. Leadon must have known that the band's days were over with the exclamation \"I wish you peace\" at the send of the album. One of the Nights allowed the Eagles to dominate the lead boards from the seventy-five-eightys and became their first boarding champion.","overall":5,"summary":"Another Hit","unixReviewTime":978912000,"reviewTime":"01 8, 2001"}
{"orig_index":12554,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002GXX","reviewerName":"P Magnum","helpful":[5,6],"reviewText":"One of the Days is the last album featuring original member Bernie Leadon. \"Lyin 'Eyes\" is the band's flagship rock theme, more rustic than rock.","overall":5,"summary":"Another Hit","unixReviewTime":978912000,"reviewTime":"01 8, 2001"}
{"orig_index":12554,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002GXX","reviewerName":"P Magnum","helpful":[5,6],"reviewText":"One night it was the last album featuring original member Bernie Leadon. \"Lyin 'Eyes\" is the mainstay of the country's stone system. This album began the Eagles' reign on the charts from one thousand, nine hundred and seventy-five to one thousand, nine hundred and eighty.","overall":5,"summary":"Another Hit","unixReviewTime":978912000,"reviewTime":"01 8, 2001"}
{"orig_index":14710,"reviewerID":"A252HNVAZENVNE","asin":"B000002KBR","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[6,6],"reviewText":"This is early, primal Earth,Wind & Fire-heavier on the firethen the wind.\"Energy\" is a free jazz-funk number more indicativeof the Art Ensamble Of Chicago then anything else while \"Beauty\"and \"I Think About Lovin' You\" are both Sherry Scott-led soulballads of the first degree while \"I Can Feel It In My Bones\" and\"Everything Is Everything\" are more classic EWF funk jams. Yes twill be a shock for \"Shinning Star\"-era fans to hear this gravelraw album but remember-this is another record label, another grouplineup and really another era in music. Delectable!","overall":5,"summary":"Unrecognizable To Future Fans?Not Really","unixReviewTime":1060732800,"reviewTime":"08 13, 2003"}
{"orig_index":14710,"reviewerID":"A252HNVAZENVNE","asin":"B000002KBR","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[6,6],"reviewText":"This is an ancient world, Wind and fire are heavier than air in a fire. \"Strength\" is a number of free jazz funk, a more representative of the Chicago part ensemble than \"Beauty\" and \"I Think About Lovin\" You \"are both first-class souls led by Sherry Scott Songs, and\" I Feel My Bones. \"And\" Everything Is Everything \"is a classic EWF funk jam. Yes, fans of the\" Shinning Star \"era, will be shocked to hear this gravel album, but please remember - this is another recording company, another list combination, really another time \"Power\" is a number of free jazz funk representing Chicago Art above everything else. \"Beauty\" and \"I Think About Lovin 'You\" both by Sher","overall":5,"summary":"Unrecognizable To Future Fans?Not Really","unixReviewTime":1060732800,"reviewTime":"08 13, 2003"}
{"orig_index":14710,"reviewerID":"A252HNVAZENVNE","asin":"B000002KBR","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[6,6],"reviewText":"\"Power\" is a number of free jazz funk, a representative of the Chicago Art Troupe above anything else. \"Beauty\" and \"I Think About Lovin\" You \"are both soul soul songs.","overall":5,"summary":"Unrecognizable To Future Fans?Not Really","unixReviewTime":1060732800,"reviewTime":"08 13, 2003"}
{"orig_index":14710,"reviewerID":"A252HNVAZENVNE","asin":"B000002KBR","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[6,6],"reviewText":"\"Power\" is a free jazz piece representing the Chicago Art Troupe better than anything else, and \"Beauty\" and \"I Think of Lovin 'You' are both by Shirley. The Soul Ballad led by Sherry Scott, and \"I Feel It to My Bone\" and \"Everything Is Everything\" are the most common EWF funk jams. Yes, for fans of the \"Shinning Star\" era, they will be shocked to hear this gravel album, but please remember - this is another recording company, another band, another musical era. This is an ancient land, wind and fire that is much harder to fire than wind. delicious!","overall":5,"summary":"Unrecognizable To Future Fans?Not Really","unixReviewTime":1060732800,"reviewTime":"08 13, 2003"}
{"orig_index":15957,"reviewerID":"A3SOV9HFM5H9T1","asin":"B000002KZQ","reviewerName":"Bruce P. Barten","helpful":[1,1],"reviewText":"My City Was Gone has a bonus live version. Mdle of the Road is exciting in this rock and roll. I like an instrumental bonus track that must be repeating in my brain when I listen to this. Every note sounds just right when I am paying attention.","overall":5,"summary":"if you never heard this, it is like the back porch when nobody is home","unixReviewTime":1385683200,"reviewTime":"11 29, 2013"}
{"orig_index":15957,"reviewerID":"A3SOV9HFM5H9T1","asin":"B000002KZQ","reviewerName":"Bruce P. Barten","helpful":[1,1],"reviewText":"My City has left with an additional live version. In this genre of rock music, Central Road is fascinating. I love the bonus songs of the instruments that have to be repeated in my mind when I listen to this. When I look at it, the whole article sounds good.","overall":5,"summary":"if you never heard this, it is like the back porch when nobody is home","unixReviewTime":1385683200,"reviewTime":"11 29, 2013"}
{"orig_index":15957,"reviewerID":"A3SOV9HFM5H9T1","asin":"B000002KZQ","reviewerName":"Bruce P. Barten","helpful":[1,1],"reviewText":"I love instrumental music songs that have to be repeated in my mind when I hear this. When I focus, each article sounds right. My City is gone with an additional live version. In this genre of rock music, Central Road is fascinating.","overall":5,"summary":"if you never heard this, it is like the back porch when nobody is home","unixReviewTime":1385683200,"reviewTime":"11 29, 2013"}
{"orig_index":15957,"reviewerID":"A3SOV9HFM5H9T1","asin":"B000002KZQ","reviewerName":"Bruce P. Barten","helpful":[1,1],"reviewText":"My city is gone and it has some kind of direct money. Mdle Road is interesting in this rock and roll. I love the way the material comes to my mind when I listen to it. Every text sounds right when I look at it.","overall":5,"summary":"if you never heard this, it is like the back porch when nobody is home","unixReviewTime":1385683200,"reviewTime":"11 29, 2013"}
{"orig_index":17978,"reviewerID":"A191ZD1RVWT476","asin":"B000002N51","reviewerName":"Thomas D. Christianson","helpful":[3,4],"reviewText":"This release seems to me to be the logical follow up to theamazing KIKO, and I believe that it is easily it's equal. Muchin the way I put KIKO on to go to sleep by, COLOSSAL HEAD is myusual choice to wake up to. Both releases have moved from beinggreat music into the realm of magical, musical journeys into theincredible. This starts us out with REVOLUTION, a song that giveshint to the trip they will be taking us on. It moves on to thehard rocking MAS Y MAS and it's excellent guitar work. The Latinflavor comes through strong on MARICELA, a beautifully craftedwonder. On to EVERYBODY LOVES A TRAIN, truly original, mixingsung vocals with the spoken word. Very up beat tempo. A bluesynumber comes along with CAN'T STOP THE RAIN, the light and hairyLIFE IS GOOD, and bass driven LITTLE JAPAN, where player uponlayer of sound pass through and intermingle with eachother. Avery heart felt offering. MANNY'S BONES, and COLOSSAL HEAD careful rockers with interesting lyrics. They send this thing withsome music reminiscent of old time Chicago blues on the finaltrack. Wonderful stuff. I don't think you'll be disappointed. Thanks and have fun,Tom","overall":5,"summary":"A STEP FORWARD","unixReviewTime":1076889600,"reviewTime":"02 16, 2004"}
{"orig_index":17978,"reviewerID":"A191ZD1RVWT476","asin":"B000002N51","reviewerName":"Thomas D. Christianson","helpful":[3,4],"reviewText":"bluesynumber accompanied by NO TO STOP RAIN, light and hair LIFE IS GOOD, bass-powered by LITTLE JAPAN, strong player sounds passing by and mixed with each Come in Everyone loves trains, they are real, they mix human voice with spoken language. In my opinion, this version follows the concept in the amazing KIKO, and I believe it fits easily. Both of these versions have embarked on a magical musical journey from fun music, to incredible space. This allows us to start with OPENNESS, this song explains the journey they will take us on. Just like the way I sleep KIKO, COLOSSAL HEAD is my most common wake-up call. MANNY'S BONES and COLOSSAL HEAD are smart, and her words are interesting.","overall":5,"summary":"A STEP FORWARD","unixReviewTime":1076889600,"reviewTime":"02 16, 2004"}
{"orig_index":17978,"reviewerID":"A191ZD1RVWT476","asin":"B000002N51","reviewerName":"Thomas D. Christianson","helpful":[3,4],"reviewText":"HEAD OF LIFE is an amazing KIKO their. Both versions have embarked on a magical music journey from fun music, to an incredible place.","overall":5,"summary":"A STEP FORWARD","unixReviewTime":1076889600,"reviewTime":"02 16, 2004"}
{"orig_index":17978,"reviewerID":"A191ZD1RVWT476","asin":"B000002N51","reviewerName":"Thomas D. Christianson","helpful":[3,4],"reviewText":"This genre seems to be a logical sequence to the amazing KIKO, and I believe it fits easily. Both versions have embarked on a magical music journey from fun music, to an incredible place.","overall":5,"summary":"A STEP FORWARD","unixReviewTime":1076889600,"reviewTime":"02 16, 2004"}
{"orig_index":19582,"reviewerID":"A3CGDFZTGL3ENL","asin":"B000002PBH","reviewerName":"BD \"bdag01\"","helpful":[0,0],"reviewText":"love this album since I was a boy growing up in Corpus Christi, still love it today. Jimmy Buffet's finest work IMHO","overall":5,"summary":"Great, Classic JB album","unixReviewTime":1376524800,"reviewTime":"08 15, 2013"}
{"orig_index":19582,"reviewerID":"A3CGDFZTGL3ENL","asin":"B000002PBH","reviewerName":"BD \"bdag01\"","helpful":[0,0],"reviewText":"I love this album because I was a boy who grew up in Corpus Christi and I still love it today. Jimmy Buffet's excellent work MHO","overall":5,"summary":"Great, Classic JB album","unixReviewTime":1376524800,"reviewTime":"08 15, 2013"}
{"orig_index":19582,"reviewerID":"A3CGDFZTGL3ENL","asin":"B000002PBH","reviewerName":"BD \"bdag01\"","helpful":[0,0],"reviewText":"bob greene: I'm a boy who grew up in Corpus Christi and I still love this album. This is said to be the work of","overall":5,"summary":"Great, Classic JB album","unixReviewTime":1376524800,"reviewTime":"08 15, 2013"}
{"orig_index":19582,"reviewerID":"A3CGDFZTGL3ENL","asin":"B000002PBH","reviewerName":"BD \"bdag01\"","helpful":[0,0],"reviewText":"Jimmy Buffet the best IMHO project. I like this album because I","overall":5,"summary":"Great, Classic JB album","unixReviewTime":1376524800,"reviewTime":"08 15, 2013"}
{"orig_index":20305,"reviewerID":"AG45QNJZLEV90","asin":"B000002U8M","reviewerName":"Cletus J. &quot;Bubba&quot; Huckabee Jr. \"Bubba\"","helpful":[8,11],"reviewText":"Now if you axe me, and plenty of folk what have a striking interest (as opposed to a passing fancy) in compilation albums do now and again, then I am quick to admit that this there Wings Greatest Hits album is quite possibly the greatest Greatest Hits album never pressed on to a disc of plastic. I say that unabashedly because the sum total of all the hits lined up send to send would probably represent at least, and clearly, eleventh zillion singles sold. That. My fab four fan friend, if quite impressive. The year was one thousand, nine hundred and seventy-eight, the Disco Era was quickly burning itself in to oblivion, and Wings was still churning out the monster hits one after another (almost as much as Abba) and we were all thinner, your hair was thicker, and the world was your clam. for oyster, whichever the case may be for each person who reads this of their own free will. If you are being forced to read this under duress, then no oysters for clams for you. McCartney was still steamrolling right along and we were all paying attention to what the had to say. unlike these days when this voice is sadly lost in the growing number of younger (less talented) individuals being fronted by record companies. Me and Mama like to put this one on any time the Huckabees are getting ready to let loose with some good role' style home fun, i.e. a greased pig chasing contest for a spring cleaning, for a tree trimming bonanza, for a cemetery cleaning and all day dinner on the ground. Whenever we got us work to do, we put this on and it puts us in the best mood possible to get the work done. The songs are all hits, even the one the mildly-retarded record executives decided to not release in the US (i.e. Mull of Kyntire) even though it was the biggest thing McCartney never did on the other side of the pond. Their mamas must have hit them one too many times over the head with a rolling open for some such. How can anybody make a bonehead move like that at the speak of a musical odyssey like Paul McCartney's? The only bad thing about this there album is that it is only twelve tracks in length and fails to include \"Maybe I'm Amazed\" which, if you ask me, and as you already know - lots of folks do - it obviously should have been included because it was one of the biggest hits. Another thing I got to warn you about is that odd looking' cover part. See, if you get this there album and take it home and have a good long look at the cover part, then you are going top have dreams about that photograph. I did for years. That statue woman kept popping up in dreams when I least expected it and pestered me in my sleep. I sure enough wish they had used a different image because there is something about that particular image what disturbs me to no send. But the music is great. Buy it, listen, grave with the rest of us.","overall":5,"summary":"Great except for that statue woman....","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":20305,"reviewerID":"AG45QNJZLEV90","asin":"B000002U8M","reviewerName":"Cletus J. &quot;Bubba&quot; Huckabee Jr. \"Bubba\"","helpful":[8,11],"reviewText":"Now if you cut me off, and there are still a lot of people who have an amazing interest in compilation (instead of a moment fantasy), then I will admit that this album Wings Greatest Hits is the best album of Greatest Hits, never clicked on a plastic disc. I say this without hindrance, because the sum of all the hits in the shipping line can represent at least, and obviously, eleven sold. That. My friends have a fan in the factory, if they are interested. That year was one thousand, nine hundred and seventy-eight. The time of the disco was soon forgotten. Wings made one monster attack after another (almost as many as Abba) and we all lost weight. At Oyster, what is the situation for everyone who voluntarily reads this article. If you are forced to read this article under pressure, then you do not have oyster clams. McCartney is still moving forward, and we have all considered what they are saying. It is not uncommon for this type of voice to sadly disappear by recording companies in front of smaller (less gifted) people. Mom and I love to wear this whenever the Huckabees are ready to relax on some good family fun way, such as spring cleaning, bonanza tree, cemetery cleaning, and dinner around the world all day. Whenever we have work to do, we put it on, which will put us in a better position to finish the job. These songs all beat, even if the humble record holder decided not to release in the United States (i.e. Mull of Kyntire), although this is the most important thing McCartney did on the other side of the lake. Their mother may have hit them on the head many times, because some of these people got out of the way. How is it possible for someone in the Odyssey of music like Paul McCartney to make such a move? The bad thing about this album is that it contains only twelve songs and does not include “Maybe I'm surprised.” If you ask me as you know — most people do — it probably should be included because of it. of the most popular songs. Another thing I want to warn you about is that place that looks strange. Look, if you get this album and go home with it and look at the cover section carefully, you will have dreams of that photo. I have done it for many years. This sculpted woman often appeared in my dreams when I was not expecting it, and she disturbed me in my sleep. I certainly hope they use different images, because that picture has something that bothers me. But the music is great. Buy it, listen and be willing with all of us.","overall":5,"summary":"Great except for that statue woman....","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":20305,"reviewerID":"AG45QNJZLEV90","asin":"B000002U8M","reviewerName":"Cletus J. &quot;Bubba&quot; Huckabee Jr. \"Bubba\"","helpful":[8,11],"reviewText":"McCartney is still moving forward, and we are all paying close attention to what the has to say. McCartney's voice has been replaced by recording companies in front of even younger (talented) people. The worst thing about this album is that it only has twelve songs.","overall":5,"summary":"Great except for that statue woman....","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":20305,"reviewerID":"AG45QNJZLEV90","asin":"B000002U8M","reviewerName":"Cletus J. &quot;Bubba&quot; Huckabee Jr. \"Bubba\"","helpful":[8,11],"reviewText":"bob greene: This is probably the biggest album of Hits. It is said that all of these songs are beaten, and even the company's recorded recordings have decided not to release them in the United States. Green: When it comes to Odyssey music, how can one do something stupid?","overall":5,"summary":"Great except for that statue woman....","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":20493,"reviewerID":"A3KCSOMHWB90IH","asin":"B000002ULS","reviewerName":"g cooper","helpful":[1,1],"reviewText":"This may be one of the greatest indie recordings never. The band: a six piece set of wimps hailing from Glasgow, Scotland, led by a scraggly prodigy known as Stuart Murdoch. The sound: priceless, darling music that has a backbone. The songwriting on, \"If Your Feeling Sinister,\" is some of the best in years, with both breathy, ethereal ballads about Bible Studies\/S&M, and romping itunes about why not to look back like Dylan in the movies. A great album for everyone.","overall":5,"summary":"A true gift","unixReviewTime":943228800,"reviewTime":"11 22, 1999"}
{"orig_index":20493,"reviewerID":"A3KCSOMHWB90IH","asin":"B000002ULS","reviewerName":"g cooper","helpful":[1,1],"reviewText":"This may be one of the largest independent records in history. Band: The six-piece coward from Glasgow, Scotland, is led by a female factor named Stuart Murdoch. The voice: lovely, worthless, endless music. The songwriting \"If You Feel Sinful\" is the best of the year, both about the fast-paced breath of Bible Study \/ S&M, and the beautiful songs of why not look back like Dylan in the movie. A good album for everyone.","overall":5,"summary":"A true gift","unixReviewTime":943228800,"reviewTime":"11 22, 1999"}
{"orig_index":20493,"reviewerID":"A3KCSOMHWB90IH","asin":"B000002ULS","reviewerName":"g cooper","helpful":[1,1],"reviewText":"\"If You Feel Guilty\" is one of the most independent records to date. Writing the song, \"If you feel bad,\" is the highlight of the year. A good album for everyone.","overall":5,"summary":"A true gift","unixReviewTime":943228800,"reviewTime":"11 22, 1999"}
{"orig_index":20493,"reviewerID":"A3KCSOMHWB90IH","asin":"B000002ULS","reviewerName":"g cooper","helpful":[1,1],"reviewText":"Writing the song \"If You Feel Guilty\" is the best song for many years. It has amazing and beautiful balloons about Bible studies \/ S&M and the joy of looking back like Dylan. The song is in the movie. Band: The six-piece coward from Glasgow, Scotland, is led by a female factor named Stuart Murdoch. Voice: is an incomparable value, lovely music that is not popular. This may be one of the largest independent records to date. Good album for everyone.","overall":5,"summary":"A true gift","unixReviewTime":943228800,"reviewTime":"11 22, 1999"}
{"orig_index":24579,"reviewerID":"A4AYQ4QL090U","asin":"B000006045","reviewerName":"David Moss","helpful":[1,2],"reviewText":"What can I say. This album blows my mind. It glides along so damn smoothly with a menacing sound that mixes ship-hop, electronica, punk, R & B and just about everything other cool style under the sun, yet somehow works. This is great electronic music for people who don't necessarily like electronic music. This is by far their best and most alternative CD.","overall":5,"summary":"Brilliant","unixReviewTime":1107302400,"reviewTime":"02 2, 2005"}
{"orig_index":24579,"reviewerID":"A4AYQ4QL090U","asin":"B000006045","reviewerName":"David Moss","helpful":[1,2],"reviewText":"What can I say. The album shocked me. It slides smoothly with a threatening sound that combines ship-hop, electronica, punk, R&B, and almost all other cool styles, but it works in some way. For those who do not enjoy electronic music, this is a wonderful form of electronic music. This is their best CD and more so far.","overall":5,"summary":"Brilliant","unixReviewTime":1107302400,"reviewTime":"02 2, 2005"}
{"orig_index":24579,"reviewerID":"A4AYQ4QL090U","asin":"B000006045","reviewerName":"David Moss","helpful":[1,2],"reviewText":"For those who don't like electronic music, this is great electronic music. It combines ship-hop, electronic, punk, R&B and almost everything.","overall":5,"summary":"Brilliant","unixReviewTime":1107302400,"reviewTime":"02 2, 2005"}
{"orig_index":24579,"reviewerID":"A4AYQ4QL090U","asin":"B000006045","reviewerName":"David Moss","helpful":[1,2],"reviewText":"Smoothly with a terrific sound that combines ship-hop, electronica, punk, R&B, and almost all other cool styles, but it works in some way. For those who do not like electronic music, this is great electronic music. The album shocked me. This is their best CD and more so far. What can I say.","overall":5,"summary":"Brilliant","unixReviewTime":1107302400,"reviewTime":"02 2, 2005"}
{"orig_index":24829,"reviewerID":"AUM4JHHSPWKQA","asin":"B0000062S6","reviewerName":"Menelaos \"bookworm\"","helpful":[0,0],"reviewText":"Tori Amos' works have always explored the human soul, going deep and trying to emerge with some kind of light. This album however came from a much more personal place. Prior to recording Choirgirl, she suffered three miscarriages and a subsequent period of depression. The album documents the journey of the character and her effort to feel alive again. And it is an effort that is every bit as heart-wrenching, haunted and desperate as can be. Using the concept of a hotel, each song being a character who lives in it, Tori Amos creates a mosaic of astonishing insight and depth. The album is inspiring. Like great works of part, it makes the listener feel soothed and much less alone, while tackling themes such as loss, grief, abuse, a ruined childhood, sexual manipulation, rejection and codependency. Sonically, it incorporates many elements of electronic music and the band has much more of a role to play on this album compared to her previous, piano based works. Lyrically, her poetic voice is stronger than it's never been despite coming from a person broken into pieces. I cannot grave highly enough about this album. Highlights: Black Dove (January), Liquid Diamonds, Pandora's Aquarium","overall":5,"summary":"Take the plunge into a world of emotion","unixReviewTime":1117065600,"reviewTime":"05 26, 2005"}
{"orig_index":24829,"reviewerID":"AUM4JHHSPWKQA","asin":"B0000062S6","reviewerName":"Menelaos \"bookworm\"","helpful":[0,0],"reviewText":"Tori Amos' work has explored the human soul, explores in depth and tries to emerge in a certain light. However, this album comes from a more personal space. Before recording Choirgirl, she suffered three miscarriages and subsequent depression. This album records the character's journey and this efforts to regain power. This is a frustrating, stressful and stressful endeavour. Tori Amos uses the theme of the hotel, each song by a character living in it, creating images of insight and amazing depth. The album is very inspiring. Like other great activities, it makes the audience feel calm and free from loneliness, while dealing with topics such as loss, grief, abuse, childhood abuse, sexual abuse, rejection, and dependency. Speaking aloud, it includes many elements of electronic music. Compared to this previous piano works, the band played a major role in this album. The songs, though from a broken man, this poetic voice is stronger than never. My review of this album is not enough. Comments: Black Dove (January), Liquor Diamonds, Pandora's Aquarium This album records the character's journey and this efforts to feel strong again. Each song is a character living in a hotel.","overall":5,"summary":"Take the plunge into a world of emotion","unixReviewTime":1117065600,"reviewTime":"05 26, 2005"}
{"orig_index":24829,"reviewerID":"AUM4JHHSPWKQA","asin":"B0000062S6","reviewerName":"Menelaos \"bookworm\"","helpful":[0,0],"reviewText":"This album records the journey of character Tori Amos and her efforts to regain power. It discusses issues such as loss, grief, abuse, childhood abuse, sexual abuse, opposition, and dependence. Like other great works, it makes the listener feel relaxed and free from loneliness.","overall":5,"summary":"Take the plunge into a world of emotion","unixReviewTime":1117065600,"reviewTime":"05 26, 2005"}
{"orig_index":24829,"reviewerID":"AUM4JHHSPWKQA","asin":"B0000062S6","reviewerName":"Menelaos \"bookworm\"","helpful":[0,0],"reviewText":"As one of the main activities, it makes the audience feel calm and lonely, while dealing with topics such as loss, grief, abuse, childhood abuse, sexual fraud, rejection, and dependency. Speaking aloud, it includes many elements of electronic music. Compared to this previous piano works, the band played a major role in this album. Tori Amos uses the theme of the hotel, each song by a character living in it, creating images of insight and amazing depth. Tori Amos’s work has explored the human soul, explores in depth, and tries to emerge in some light. The songs, though from a broken man, this poet's voice is stronger than never. Notes: Black Dove (January), Alcohol Diamonds, Pandora's Aquarium Before recording Choirgirl, she suffered three miscarriages and subsequent depression.","overall":5,"summary":"Take the plunge into a world of emotion","unixReviewTime":1117065600,"reviewTime":"05 26, 2005"}
{"orig_index":25051,"reviewerID":"AGGP8FKBFDHL1","asin":"B000006LWU","reviewerName":"Jonathan Weller","helpful":[0,1],"reviewText":"Released in one thousand, nine hundred and ninety-two, \"The Wild Life\" was Slaughter's second major label release. Much like its previous offering, Slaughter played a by-the-numbers brand of melodic rock for the masses. Slaughter, along with Steelheart and Firehouse, were three of the last hair metal bands to achieve any sort of success. While I would't consider this album must-have in the melodic rock department, it does have some pretty cool hard rock tracks to it. The sound of the record is basically the same as \"Stick It To Ya,\" with a little better development of the songs this time around. I know many people detest this band, and it's understandable, Slaughter simply were a cookie cutter hard rock band. However, if you like melodic hard rock music, what else could you expect? My favourite tracks are \"The Wild Life,\" \"Shake This Place\" and \"Reach For the Sky,\" while the rest are pretty hit and miss. If you like Slaughter, for anything else melodic rock, you should check these guys out. I won't say Slaughter is essential, for even a five-star type of band, but for what this record is, you can't go wrong.","overall":4,"summary":"Slaughter's sophomore release","unixReviewTime":1362268800,"reviewTime":"03 3, 2013"}
{"orig_index":25051,"reviewerID":"AGGP8FKBFDHL1","asin":"B000006LWU","reviewerName":"Jonathan Weller","helpful":[0,1],"reviewText":"\"Wildlife\" released in one thousand, nine hundred and ninety-two was the second recording company. Like its previous products, Slaughter has played a role in digital music. Slaughter, Steelheart and Firehouse are the last three steel belts to achieve any success. While I don’t think this album should have it in the rock music department, it does have some cool hard songs. The sound of the record is basically the same as \"Stick to Ya\", but this time the song has improved a lot. I know that a lot of people hate this band, understandably, Slaughter is just the same hard music. However, if you love heavy metal music, what can you expect? My favourite songs are \"Wild Life\", \"Shake This Place\" and \"Reach the Sky\", while some are very popular. If you like Slaughter, in some rock music, you'll have to look at these guys. I’m not going to tell you that killing is important, even in a five-star band, but on this record you can’t go wrong.","overall":4,"summary":"Slaughter's sophomore release","unixReviewTime":1362268800,"reviewTime":"03 3, 2013"}
{"orig_index":25051,"reviewerID":"AGGP8FKBFDHL1","asin":"B000006LWU","reviewerName":"Jonathan Weller","helpful":[0,1],"reviewText":"My favourite tracks are \"Wild Life\", \"Shake This Place\" and \"Reach the Sky\", while others are very popular. I’m not going to say that the Slaughter is important, even for a five-star band, but on this record, you can’t go wrong. I know that a lot of people hate this band, understandably, Slaughter is just a hard rock music with the same pattern. \"Wildlife\" released in one thousand, nine hundred and ninety-two was the second recording label. If you like Slaughter, in some rock music, you'll have to look at these guys. However, if you love heavy metal music, what can you expect? While I don’t think this album should have it in the rhythmic music department, it does have some cool songs.","overall":4,"summary":"Slaughter's sophomore release","unixReviewTime":1362268800,"reviewTime":"03 3, 2013"}
{"orig_index":25051,"reviewerID":"AGGP8FKBFDHL1","asin":"B000006LWU","reviewerName":"Jonathan Weller","helpful":[0,1],"reviewText":"\"Wildlife\" is the second recording label. The sound of the record is the same as \"Stick to Ya\". My favourite tracks are \"Wild Life\", \"Shake This Place\" and \"Reach for the Sky\" My favourite songs are \"Wild Life\", \"Shake This Place\" and \"Reach the Sky\" Slaughter, and Steelheart and Firehouse.","overall":4,"summary":"Slaughter's sophomore release","unixReviewTime":1362268800,"reviewTime":"03 3, 2013"}
{"orig_index":25998,"reviewerID":"AKGF27HN0OF19","asin":"B000008GXD","reviewerName":"Steven Sly","helpful":[0,0],"reviewText":"By one thousand, nine hundred and eighty Jackson had released two albums of straightforward new wave \/ punk \/ pop and had achieved a high rate of success with both albums. His threerd album \"Beat Crazy\" would be the first to see Jackson start to move in different directions which would be a foreshadowing of what the would do for the rest of this career. Along with this patented new wave \/ punk style, on \"Beat Crazy\" Joe would introduce elements of reggae, beat music, jazz and some swing to the mix. Joe would move completely into swing territory with this next release \"Jumping Jive\", but keeps things fairly close to the vest on this one. In fact some of the reggae experimentation was not that far removed from what bands like The Police were doing at the same time. Commercially \"Beat Crazy\" was a bit of a let down for Jackson. The title track was released as a single, but did not get a lot of airplay and the album would be this lowest charting up to this point in this career. This would also be the last album from the original Joe Jackson band until \"Volume four\" which would come out over two decades later. I don't think that this album has aged as well as some of Joe's other jones. Songs like \"Beat Crazy\", \"Battleground\", \"Pretty Boys\", and \"Fit\" all sound very dated. Still there are some really good songs on the album with some great Jackson lyrics. \"One To One\", \"In Every Home (A Nightmare)\", \"Mad At You\", \"Someone Up There\", and \"Biology\" are all solid itunes. Despite the upbeat nature of much of the music, the lyrics are some of Jackson's most dark and cynical. I don't think this album is as good as this first two, but it is still a decent release.","overall":4,"summary":"Joe Jackson - A Slight Step Down From HIs First Two","unixReviewTime":1223337600,"reviewTime":"10 7, 2008"}
{"orig_index":25998,"reviewerID":"AKGF27HN0OF19","asin":"B000008GXD","reviewerName":"Steven Sly","helpful":[0,0],"reviewText":"\"Beat Crazy\" will be the first person to see Jackson start moving in different directions. The title track was released as a single, but did not receive much play. This album will be the lowest chart in the career path to date. While most music is optimistic, the lyrics are the darkest and most irritating to Jackson.","overall":4,"summary":"Joe Jackson - A Slight Step Down From HIs First Two","unixReviewTime":1223337600,"reviewTime":"10 7, 2008"}
{"orig_index":25998,"reviewerID":"AKGF27HN0OF19","asin":"B000008GXD","reviewerName":"Steven Sly","helpful":[0,0],"reviewText":"\"One on One\", \"To All Families (A Nightmare)\", \"I'm Angry To You\", \"Someone's There\" and \"Biology\" are all pure music. Songs like \"Beat Crazy\", \"Battleground\", \"Pretty Boys\" and \"Fit\" sound outdated. In addition to this new patent wave \/ punk style, in \"Beat Crazy\", Joe will introduce you to reggae, beat music, jazz and other twisting musical elements. His third album \"Beat Crazy\" will be the first to see Jackson start to grow on the other side, which will announce what the will do throughout this career. Joe will be fully immersed in the next around of the \"Jumping Jive\", but stay close to the vest this summer. This is also the last album of Joe Jackson's original band until the \"fourth volume\" was released more than two decades later. In one thousand, nine hundred and eighty Jackson released two straight albums \/ punk \/ pop, and both albums achieved high success rates.","overall":4,"summary":"Joe Jackson - A Slight Step Down From HIs First Two","unixReviewTime":1223337600,"reviewTime":"10 7, 2008"}
{"orig_index":25998,"reviewerID":"AKGF27HN0OF19","asin":"B000008GXD","reviewerName":"Steven Sly","helpful":[0,0],"reviewText":"\"Beat Crazy\" will be the first person to see Jackson start moving in different directions. While most music is optimistic, the lyrics are the darkest and most irritating to Jackson. While most music is optimistic, the lyrics are the darkest and most irritating to Jackson.","overall":4,"summary":"Joe Jackson - A Slight Step Down From HIs First Two","unixReviewTime":1223337600,"reviewTime":"10 7, 2008"}
{"orig_index":26973,"reviewerID":"A2WACBI3UZK6Y1","asin":"B00000DFRS","reviewerName":"RICO","helpful":[1,1],"reviewText":"I love this whole CD. Heartbreak hotel. My love is your love. All the songs are just the best since the (greatest love of all). I related to this album Its not right but it was okay!! I cannot believe that this album only speak at #thirteen but sold well over three million in the U. S. GO whitney.","overall":5,"summary":"WHITNEYS  BEST!!!!!  5 STARS PLUS .....","unixReviewTime":1067385600,"reviewTime":"10 29, 2003"}
{"orig_index":26973,"reviewerID":"A2WACBI3UZK6Y1","asin":"B00000DFRS","reviewerName":"RICO","helpful":[1,1],"reviewText":"I love every CD. Sad hotel. I like what you like. All songs are the best since (everyone's favourite). I have something to do with this album is wrong but it does't matter! I don’t believe this album was only released for # thirteen, but GO Whitney sold over three million in the United States.","overall":5,"summary":"WHITNEYS  BEST!!!!!  5 STARS PLUS .....","unixReviewTime":1067385600,"reviewTime":"10 29, 2003"}
{"orig_index":26973,"reviewerID":"A2WACBI3UZK6Y1","asin":"B00000DFRS","reviewerName":"RICO","helpful":[1,1],"reviewText":"My love is your love. All the songs are the best because (the biggest love) I have to do with this album, it's not good but it does't matter! I don't believe this","overall":5,"summary":"WHITNEYS  BEST!!!!!  5 STARS PLUS .....","unixReviewTime":1067385600,"reviewTime":"10 29, 2003"}
{"orig_index":26973,"reviewerID":"A2WACBI3UZK6Y1","asin":"B00000DFRS","reviewerName":"RICO","helpful":[1,1],"reviewText":"I don't believe this album is only available # #, but GO Whitney has sold over three million in the US. All songs are the best since (everyone's favourite). I like what you like. I love the whole CD. I have something to do with this album is wrong but it does't matter! Sad hotel.","overall":5,"summary":"WHITNEYS  BEST!!!!!  5 STARS PLUS .....","unixReviewTime":1067385600,"reviewTime":"10 29, 2003"}
{"orig_index":27055,"reviewerID":"A1FML9FCUPV6TI","asin":"B00000DGUG","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Fans did't really embrace this album, it was viewed as a disappointment in the shadow of JAGGED LITTLE PILL. I personally love this album, as it offers something completely different and unexpected from Alanis. This album is about her spiritual awakening and growth as a person. The songs have a certain rawness and emotion to them which is just captivating. My personal favourite is \"That I Would Be Good\" which is one of her more endearing songs in my opinion. The songs are written in an intriguing way, they are very interesting, such as \"The Couch\" which seems to be about a patient under a psychiatrist who is remembering this\/her problems. The first single \"Thank U\" is an excellent song about what Alanis has learned in the years she was gone, and where she's been. \"Unsent\" offers an interesting take on a song, its a compilation of love letters Alanis never sent. Elsewhere this cd has other shining moments, such as \"I Was Hoping\", \"So Pure\", \"Joining You\" and \"Sympathetic Character\", although there's not one filler track to be found. So I would suggest if you are adamant about this, to just listen to it as it is, and not think of it as the follow up to JLP, this one its own masterpiece.","overall":5,"summary":"Spritual Awakening","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":27055,"reviewerID":"A1FML9FCUPV6TI","asin":"B00000DGUG","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Fans did not really accept the album, it was seen as a disgrace in the shadow of the JAGGED LITTLE PILL. I love this album because it gives something different and unexpected from Alanis. This album is about this spiritual awakening and growing as a person. These songs have a special meaning and their own emotions, which are just as interesting to them. My favourite thing is \"That I Would Be Good\" In my opinion, this is one of this best songs. These songs are written in a very interesting way. They are very interesting, such as \"The Couch\", which seems to be about a psychiatrist who remembers this problem. The first person \"Thank You\" is a beautiful song that tells what Alanis has learned during this absence and the places the was. \"Unsent\" provides an interesting interpretation of the song, which includes love letters that were never sent by Alanis. Elsewhere, this cd has some bright moments, such as \"I Hope\", \"Clean\", \"Join You\" and \"Compassionate Partner\", although no track record has been found. So I suggest that if you are focusing on this point, just listen to it as it is, instead of treating it as a JLP, this is its part form.","overall":5,"summary":"Spritual Awakening","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":27055,"reviewerID":"A1FML9FCUPV6TI","asin":"B00000DGUG","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Fans did not really accept the album, it was seen as a disappointment. This album offers something different and unexpected from Alanis. These songs have a certain origin and feeling for them, which is interesting.","overall":5,"summary":"Spritual Awakening","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":27055,"reviewerID":"A1FML9FCUPV6TI","asin":"B00000DGUG","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Fans did not really accept the album, and were seen as disappointed in the shadow of the JAGGED LITTLE PILL. This album is about this spiritual awakening and growing as a person. These songs have a special meaning and their own emotions, which are just as interesting to them.","overall":5,"summary":"Spritual Awakening","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":27320,"reviewerID":"A1UGJLW8BICR0G","asin":"B00000DQSF","reviewerName":"Jack Sherman","helpful":[1,1],"reviewText":"I would be happy when I purchase a Remastered CD if there were no Bonus tracks. But, the extra songs on this are all very good. Otherwise, I could never do this music justice with words. Essential listening.","overall":5,"summary":"Essential","unixReviewTime":1331424000,"reviewTime":"03 11, 2012"}
{"orig_index":27320,"reviewerID":"A1UGJLW8BICR0G","asin":"B00000DQSF","reviewerName":"Jack Sherman","helpful":[1,1],"reviewText":"If there are no Bonus songs, I would be happy to buy a custom CD. However, the extra songs on this site are very good. Otherwise, I would never have been table to express this kind of musical justice in words. Listening is important.","overall":5,"summary":"Essential","unixReviewTime":1331424000,"reviewTime":"03 11, 2012"}
{"orig_index":27320,"reviewerID":"A1UGJLW8BICR0G","asin":"B00000DQSF","reviewerName":"Jack Sherman","helpful":[1,1],"reviewText":"If there are no Bonus songs, I would be happy to buy a custom CD. But, this song is added to","overall":5,"summary":"Essential","unixReviewTime":1331424000,"reviewTime":"03 11, 2012"}
{"orig_index":27320,"reviewerID":"A1UGJLW8BICR0G","asin":"B00000DQSF","reviewerName":"Jack Sherman","helpful":[1,1],"reviewText":", otherwise, I will not be table to express this kind of musical justice in words. However, the extra songs on this site are very good. If there are no bonus options, I would be happy to purchase an updated CD. Listening is important.","overall":5,"summary":"Essential","unixReviewTime":1331424000,"reviewTime":"03 11, 2012"}
{"orig_index":27864,"reviewerID":"A2U49LUUY4IKQQ","asin":"B00000HY5E","reviewerName":"Peter Durward Harris \"Pete the music fan\"","helpful":[2,2],"reviewText":"With the title track, a Bacharach-David song first recorded by Dionne Warwick but hitherto not released as a single, and another classic (We've only just begun, which evolved from a TV jingle), the Carpenters established themselves in the pop charts around the world. The album contains several other fine songs including Crescent moon, Mr Guder, Maybe it's you and Another song. A cover of Help! (Beatles) was originally considered for single release, but having already released another Beatles song (Ticket to ride) as a single from their debut album, the decision was probably wise. Three other excellent covers are Reason to believe (Tim Hardin), I'll never fall in love again (a Bacharach-David song that provided Bobbie Gentry with a British number one hit) and Baby it's you (one of the less famous songs from the Bacharach-David catalog). Following the modest start to their career provided by their debut album (Offering, also known as Ticket to ride), this follow-up hit the big time. It's not difficult to understand why.","overall":5,"summary":"The breakthrough album","unixReviewTime":1242172800,"reviewTime":"05 13, 2009"}
{"orig_index":27864,"reviewerID":"A2U49LUUY4IKQQ","asin":"B00000HY5E","reviewerName":"Peter Durward Harris \"Pete the music fan\"","helpful":[2,2],"reviewText":"The title track is a Bacharach-David song originally written by Dionne Warwick but has not been released as a single so far, with another classic song (recently, appearing in TV commercials Come.), the artist has set this place on the charts world-famous musical instruments. The album contains many other good songs, including Crescent Moon, Mr. Goode, maybe you and another song. Help cover! (The Beatles) were initially thought to release another, but they have already released another Beatles song (Ticket Ride) as one of their first albums. This decision might be a wise one. Three other great works are \"Reason to Believe\" (Tim Harding), \"I'll never fall in love again\" (Bacharach-David's song, by Bobby Gint ' David). After their first album (Donation, also known as Ticket to Ride) gave a soft start to their careers, this follow-up momentous moment. It is not hard to see why.","overall":5,"summary":"The breakthrough album","unixReviewTime":1242172800,"reviewTime":"05 13, 2009"}
{"orig_index":27864,"reviewerID":"A2U49LUUY4IKQQ","asin":"B00000HY5E","reviewerName":"Peter Durward Harris \"Pete the music fan\"","helpful":[2,2],"reviewText":"Artists have established themselves on popular music charts around the world. Help cover! (The Beatles) was originally considered a single element of liberation. The other three great veils have reason to believe that I will never date again.","overall":5,"summary":"The breakthrough album","unixReviewTime":1242172800,"reviewTime":"05 13, 2009"}
{"orig_index":27864,"reviewerID":"A2U49LUUY4IKQQ","asin":"B00000HY5E","reviewerName":"Peter Durward Harris \"Pete the music fan\"","helpful":[2,2],"reviewText":"The title track is a Bacharach-David song that was first recorded by Dionne Warwick but has not been released as a single so far, with another classical song (already started, from a TV show Come.), the artist has established this place in world-famous music charts. . Three other great cover works are \"Reason to Believe\" (Tim Harding), \"I'll Never Love You Again\" (Bacharach-David's song, by Bobby Gint Brings one song to the UK) and \"You're a Baby\" (one of the unknown songs in the Bacharach-David catalog) . (The Beatles) were initially thought to release another, but they have already released another Beatles song (Ticket Ride) as one of their first albums. This decision might be a wise one. After their debut album (Dedication, known as Ticket to Ride) gave a good start to their careers, this follow-up moment set in. The album contains many other good songs, including Crescent Moon, Mr. Goode, maybe you and another song. It is not hard to see why. Help cover!","overall":5,"summary":"The breakthrough album","unixReviewTime":1242172800,"reviewTime":"05 13, 2009"}
{"orig_index":29570,"reviewerID":"AYDVB1OR3ILA5","asin":"B00001IVJS","reviewerName":"alenan","helpful":[4,4],"reviewText":"A perfect gift for someone to be introduced to Tori Amos` music. This live CD showcases songs from her four previous albums ( three from LITTLE EARTHQUAKES, five from UNDER THE PINK, and one each from BOYS FOR PELE and FROM THE CHOIRGIRL HOTEL-please see my reviews of these four albums-) plus three B-side gems. But don`t expect this to be a greatest hits selection. Only two songs (CORNFLAKE GIRL AND CRUEL) were singles. Her best singles have unfortunately been vomited. Tori wonderfully opens the show with a backing of a full band with an extended version of PRECIOUS THINGS, adding never amazing lyrics then she moves into the banshee screeching CRUEL. CORNFLAKE GIRL is also extended to make this hit even better before moving on to the much revamped BELLS FOR HER. This lifeless song from UNDER THE PINK was given a wonderful uplift. Another excellent and extended track is THE WAITRESS. But the other songs, GIRL, MR. ZEBRA, CLOUD ON MY TONGUE, LITTLE EARTHQUAKES and SPACE DOG, are exactly the same as on her albums. Tori`s singing is strong and her piano playing perfect and prominent. Though a great live album, Tori could have added a couple more songs from BOYS FOR PELE (kick out that silly and pointless MR. ZEBRA), and some from FROM THE CHOIRGIRL HOTEL. Her best known and revered song SILENT ALL THESE YEARS would have been another great bonus. The next CD of new material shows the new Tori Amos again. Here she keeps in the same vein as from FROM THE CHOIRGIRL HOTEL, using synthesizers, drum loops and of course her piano. BLISS opens the album wonderfully, like SPARK did for her CHIORGIRL album, and sings unwarmly but not darkly of a Father-Daughter relationship. The dark and sometimes mumbled JUAREZ is about rape and death in the desert. Supposedly based on a true story she had read about. Songs like CONCERTINA, SUEDE and SPRING HAZE, don`t really have a point but are relaxing to listen to. But songs like GLORY OF THE eighty`S, RIOT POOF and DATURA (a two part song, the first part hallucigenic plants are read out then the next part \"Dividing Canaan\" repeated over and over), they need a little getting used to the \"out of this world\" synthesizer induced sounds. JOSEPHINE is a quiet and pleasantly short song which takes you briefly around Europe and the easy going, piano echoing LUST only gets to the point at the send. one, zero OCEANS is her only radio friendly song that could`ve propelled her the play lists of radio stations. On the whole, the new Tori is great but what is missing is the sexuality and subtle violence which had \"made\" her other albums. I feel Tori Amos is finally mellowing.","overall":4,"summary":"The Old and New Tori","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":29570,"reviewerID":"AYDVB1OR3ILA5","asin":"B00001IVJS","reviewerName":"alenan","helpful":[4,4],"reviewText":"The perfect gift for people to learn about Tori Amos' music. this previous jones (three from small earthquakes, five from under PINK, one from PELETS and CHOIRGIRL HOTEL - please see comments for these four albums) Comment-—) add three B- but don't expect this to be one of the best favourites. There are only two songs (Nachos Girl and the villain) unmarried. Unfortunately, the best one has been washed out.there is an expanded version of Precious Thing, add lyrics that have never been weird, and then go into CRUEL crying banshee. Nachos Girl Extended again to make this song beat better, and then greatly improved BELL FOR HER. But some of the songs, GIRL, MR. Tori's singing is very cloud and her piano is excellent. CHOIRGIRL HOTEL. His famous and revered song EVERY YEAR will be another great reward. The next new CD features the new Tori Amos again. this piano BLISS opened the album in a wonderful way, just as SPARK did on this album CHIORGIRL, and the sang about this father's relationship with a girl who was not warm but not depressed. and SPRING HAZE have no real meaning, but they sound free. at the are produced by the \"out of this world\" synthesizer slightly. JOSEPHINE is a short, quiet, fun song, taking a short tour of Europe, an easy-going piano that only gives LUST a title when sent. One, Sea Zero is the only one of this friendly songs that allows him to be on the radio playlist. Overall, the new Tori is good, but what is missing is the sexual desire and subtle violence that “made” some of the albums. I think Tori Amos is finished.","overall":4,"summary":"The Old and New Tori","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":29570,"reviewerID":"AYDVB1OR3ILA5","asin":"B00001IVJS","reviewerName":"alenan","helpful":[4,4],"reviewText":"This live CD showcases its songs on four previous albums and three B albums. Achieving expectations is one of the options. Only two songs (CORNFLAKE GIRL AND CRUEL) are single.","overall":4,"summary":"The Old and New Tori","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":29570,"reviewerID":"AYDVB1OR3ILA5","asin":"B00001IVJS","reviewerName":"alenan","helpful":[4,4],"reviewText":"An ideal gift for anyone who knows Tori Amos' music. The Live CD features songs from this previous four albums. There are only two songs (Nachos Girl and Cruel) that are single.","overall":4,"summary":"The Old and New Tori","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":30661,"reviewerID":"A35XUI9HGMAJEX","asin":"B00002ZZJF","reviewerName":"Carlisle Wheeling","helpful":[0,0],"reviewText":"I purchased this album on vinyl when I had grown tired of listening to Prince and all this protege's, on the hunt for something new. Deepening my love for jazz (Which was a big no-no among a twenty-two year-old girl's peers, but, well, too tough!) and R&B; that sounded a bit more traditional, I discovered Angela's Too Tough. Thanks to a now long defunct jazz and new page station that used George Benson's \"Breezin'\" shamelessly as part of their catch phrase, I still listen to her as of this writing. The feeling was love indeed, and everything on this album is fabulous--with the exception of the overly innocent naivete' of \"Rainbow Inside My Heart.\" Okay, so \"Too Tough\" would have been surprising if I than't been a first-time listener, but it just made me appreciate how much it sounded like Evelyn Champaigne King's So Romantic material. A decent pairing with Boz Scaggs on \"Ain't Nothing Like the Real Thing\" shows a change in direction immediately after. The true gems on there, as always, are the ballads. \"Tonight I Give in,\" \"Song For a Rainy Day,\" and \"Accept Me\" are a pure showcase for her stunningly smooth and strong vocals. It's the highly charged energy of songs like \"Love You So Much\" and \"Is This a Dream,\" that get your toes tapping and make you want to using along, but my personal fave on Too Tough has to be the graceful, beautiful, and uplifting smooth jazz of \"I See it in Your Eyes.\"Who said this was a trendy album for the time? Just because of of the title track? Bah, humbug! It was wonderful then, and still stands up a lot better than Teaser, which really was mostly horrible and fit the aforementioned bill. I paid a pretty penny for this as an import, but I knew it would be worth it. If you purchase it, you will find a huge return on your investment the moment you put it in your player.","overall":5,"summary":"Absitively, Posolutely a Must-Have for Lovers of Great Soul and Jazz.","unixReviewTime":1299801600,"reviewTime":"03 11, 2011"}
{"orig_index":30661,"reviewerID":"A35XUI9HGMAJEX","asin":"B00002ZZJF","reviewerName":"Carlisle Wheeling","helpful":[0,0],"reviewText":"Tired of listening to Prince's music with all these students, looking for something new, I bought this vinyl record. Deepen my love of jazz (this is a huge no-brainer among twenty-two-year-old girls ’peers, but, it’s very hard!) And R&B; sounds like normal, i found Angela very strong. Thanks to outdated jazz and a new paper, the shamelessly uses George Benson \"Breezin\" as part of their slogan, and I still listen to him at the time of writing. This feeling is real love, everything on this album is perfect - except for the ridiculous “Rainbow Inside My Heart”. Yeah Al that sounds pretty crap to me, Looks like Evelyn Champaigne King's So Romantic stuff too. A good combination with Boz Scaggs \"There's nothing like it\" shows a change in style afterwards. As always, real gemstones are traditional songs. \"Tonight I give up\", \"Rain Day Song\" and \"Welcome\" clearly show this smooth and powerful voice. Songs like \"I Love You So Much\" and \"This Dream\" are full of energy, make your toes click and make you want to use them together, but my favourite thing is strong enough to be nice and beautiful, and a happy jazz polish on \"I See In Your Eyes\". Who said this was a popular album at the time? Is it because of the title song? Bah liar! It was a good thing at the time, and it was still much better than the Teaser, and the Teaser was really scary, and it was in line with the bill mentioned above. As a foreign product, I paid a high price for it, but I knew it was worth it. If you buy it, if you put it in a player, you will get a great return on your investment.","overall":5,"summary":"Absitively, Posolutely a Must-Have for Lovers of Great Soul and Jazz.","unixReviewTime":1299801600,"reviewTime":"03 11, 2011"}
{"orig_index":30661,"reviewerID":"A35XUI9HGMAJEX","asin":"B00002ZZJF","reviewerName":"Carlisle Wheeling","helpful":[0,0],"reviewText":"Songs like \"I love you so much\" and \"This is a dream\" are full of powerful energy, make your toes beat and make you want to use them together, but I personally love hard things should be the best, the best and the most interesting. smooth jazz \"I See It In Your Eyes\". \"Tonight I give up\", \"Song of the rainy day\" and \"Welcome\" are this smooth and powerful words. Yeah Al that sounds pretty crap to me, Looks like BT saint for me either. Extend my love of jazz (this is great - not among the twenty-two-year-old girl's peers, but, well, it's very difficult!) of them, and I was still listening to this song as I wrote this. That feeling is really love, everything on this album is good — except for the extreme carelessness in \"the darkness of my heart\". It was fun at the time, and it could have been even stronger than the Teaser, which was really awesome and matched the bill mentioned above.","overall":5,"summary":"Absitively, Posolutely a Must-Have for Lovers of Great Soul and Jazz.","unixReviewTime":1299801600,"reviewTime":"03 11, 2011"}
{"orig_index":30661,"reviewerID":"A35XUI9HGMAJEX","asin":"B00002ZZJF","reviewerName":"Carlisle Wheeling","helpful":[0,0],"reviewText":"Everything on this album is fun - except that \"Rainbow Inside My Heart\" does't make much sense. The real gems there, as usual, are folk songs. \"Tonight I Dedicate\" and \"Rain Song\" are pure expressions of this smooth and powerful voice.","overall":5,"summary":"Absitively, Posolutely a Must-Have for Lovers of Great Soul and Jazz.","unixReviewTime":1299801600,"reviewTime":"03 11, 2011"}
{"orig_index":32075,"reviewerID":"A25MI0APXLDBXA","asin":"B00004S9AN","reviewerName":"Amazon Customer","helpful":[2,2],"reviewText":"As with most of this lyrics, Steve Earle hits the nail on the head there, and I have to say, after listening to the intervening albums in order, the music is a natural progression from where the started and is as eclectic for off the wall as some of it first seems. This is still Steve Earle, so it's still good.","overall":5,"summary":"One Steve Earle's best","unixReviewTime":1349481600,"reviewTime":"10 6, 2012"}
{"orig_index":32075,"reviewerID":"A25MI0APXLDBXA","asin":"B00004S9AN","reviewerName":"Amazon Customer","helpful":[2,2],"reviewText":"Like all songs, Steve Earle has nailed this head. I have to say that after listening to the middle album in a row, the music grows naturally from where it started and is like the first time it was seen Rise eclectic. This is still Steve Earl, so good.","overall":5,"summary":"One Steve Earle's best","unixReviewTime":1349481600,"reviewTime":"10 6, 2012"}
{"orig_index":32075,"reviewerID":"A25MI0APXLDBXA","asin":"B00004S9AN","reviewerName":"Amazon Customer","helpful":[2,2],"reviewText":"bob greene: This is still Steve Earl, so fine. It is said that music grows naturally from its place of origin. Green: Still Steve Earl, so okay.","overall":5,"summary":"One Steve Earle's best","unixReviewTime":1349481600,"reviewTime":"10 6, 2012"}
{"orig_index":32075,"reviewerID":"A25MI0APXLDBXA","asin":"B00004S9AN","reviewerName":"Amazon Customer","helpful":[2,2],"reviewText":"This is still Steve Earl, so good, said the star. Music is played naturally from the beginning, and is eclectic as some look for the first time","overall":5,"summary":"One Steve Earle's best","unixReviewTime":1349481600,"reviewTime":"10 6, 2012"}
{"orig_index":36684,"reviewerID":"A5N8RBE4K3PUE","asin":"B00005Q7SH","reviewerName":"luvsong","helpful":[2,2],"reviewText":"This is definitely a mood album, to relax, to romance and to dance. The lyrics are uplifting, without an overbearing delivery. refreshing. \"Don't give up\" a Peter Gabriel remake is my fave. it feeds the soul. If you like the Naked Music compilations for Miguel Migs, this cd is for you without a doubt.","overall":5,"summary":"A Diva Who Realizes The Power of Words and Beats..A THRILL","unixReviewTime":1048291200,"reviewTime":"03 22, 2003"}
{"orig_index":36684,"reviewerID":"A5N8RBE4K3PUE","asin":"B00005Q7SH","reviewerName":"luvsong","helpful":[2,2],"reviewText":"Certainly this is a record of emotions, relaxation, love, and dancing. Its words are fascinating and there is no exaggeration. It is refreshing. \"Don't Stop\" Peter Gabriel's remake is my favourite. It nourishes the soul. If you like the mix of Miguel Migs' Naked Music, then this CD is for you.","overall":5,"summary":"A Diva Who Realizes The Power of Words and Beats..A THRILL","unixReviewTime":1048291200,"reviewTime":"03 22, 2003"}
{"orig_index":36684,"reviewerID":"A5N8RBE4K3PUE","asin":"B00005Q7SH","reviewerName":"luvsong","helpful":[2,2],"reviewText":"Certainly this is a record of emotions, relaxation, love, and dancing. Its words are fascinating and there is no exaggeration. If you like the mix of Miguel Migs' Naked Music, then this CD is for you. \"Don't Stop\" Peter Gabriel's remake is my favourite. It nourishes the soul. It is refreshing.","overall":5,"summary":"A Diva Who Realizes The Power of Words and Beats..A THRILL","unixReviewTime":1048291200,"reviewTime":"03 22, 2003"}
{"orig_index":36684,"reviewerID":"A5N8RBE4K3PUE","asin":"B00005Q7SH","reviewerName":"luvsong","helpful":[2,2],"reviewText":"Songs are fun, without exaggeration. The song \"Don't Give Up\" is my favourite song. Feeding the soul.","overall":5,"summary":"A Diva Who Realizes The Power of Words and Beats..A THRILL","unixReviewTime":1048291200,"reviewTime":"03 22, 2003"}
{"orig_index":38383,"reviewerID":"A3FVAWZNKW9GX","asin":"B00006690F","reviewerName":"A.Trendl HungarianBookstore.com \"What should ...","helpful":[5,5],"reviewText":"I never thought I'd review an Eminem album. \"The Eminem Show\" is impressive. What grabbed me was the plain wit of \"Without Me'. I'll say frankly it is not for everyone. I disagree with some of what the says, and sometimes the way the says it. However, Em has the skills as a songwriter and plays down some solid vocal tracks. His singing-rap style is infectious. I like it. Rather than screaming out words in old patterned rhymes, the brings a new voice and rhythm to lyrics. He has more to say than thug music, and seems to be moving forward with this ideas. Maybe Eminem is on this way to becoming one of the jones who will last, and maybe this songs will be good enough to be covered by later artists. Or, will this itunes be the jones sampled, like the picks up on a Aerosmith song. I can see the potential. I recommend checking out \"The Eminem Show.\"Anthony Trendl","overall":5,"summary":"Impressed","unixReviewTime":1023408000,"reviewTime":"06 7, 2002"}
{"orig_index":38383,"reviewerID":"A3FVAWZNKW9GX","asin":"B00006690F","reviewerName":"A.Trendl HungarianBookstore.com \"What should ...","helpful":[5,5],"reviewText":"I never thought I would comment on Eminem's album. The \"Eminem Show\" is interesting. What I caught was a simple “without me”. Honestly speaking, not everyone. I do not agree with some of the content, sometimes even in the way it is said. However, Em is skilled as a songwriter and plays strong vocals. His style of singing and wrap is very contagious. I love it. Instead of shouting words with old rhythms, they bring new sounds and rhythms to the words. In addition to thug music, the has a lot the wants to say, and the seems to be moving toward this idea. Maybe Eminem becomes one of the endless jones on this track, maybe this song will be good enough to be composed by future artists. Or, this iTunes will be a sample for jones, like the pickup on Aerosmith song. I see the possibility. I recommend checking out \"Eminem Show\". Anthony Trendl","overall":5,"summary":"Impressed","unixReviewTime":1023408000,"reviewTime":"06 7, 2002"}
{"orig_index":38383,"reviewerID":"A3FVAWZNKW9GX","asin":"B00006690F","reviewerName":"A.Trendl HungarianBookstore.com \"What should ...","helpful":[5,5],"reviewText":"\"Eminem Show\" is amazing, said Anthony Trendlin. \"Without Me\" is a great song, but not for everyone. \"The Eminem Show\" is a beautiful album, said trendlin. (p. Or, this iTunes will be sampled by Jones, as an argument in an Aerosmith song. furthering the idea. However, Em has composer skills and will play a strong voice song. What really attracts me is the clear mind of \"Without Me\".","overall":5,"summary":"Impressed","unixReviewTime":1023408000,"reviewTime":"06 7, 2002"}
{"orig_index":38383,"reviewerID":"A3FVAWZNKW9GX","asin":"B00006690F","reviewerName":"A.Trendl HungarianBookstore.com \"What should ...","helpful":[5,5],"reviewText":"\"Eminem's show\" is amazing. \"Without Me.\" Maybe Eminem is going to be one of the Joneses to continue. , and a great encryption job. Because that's DRE? Although speaking, eminem is fine. My fax song is called Theth a thing you say where mem is threatened with absolute truth. The fax song says Say what you say you say what you say.","overall":5,"summary":"Impressed","unixReviewTime":1023408000,"reviewTime":"06 7, 2002"}
{"orig_index":41027,"reviewerID":"A1EPTOYTJ1K2ZM","asin":"B000089CJI","reviewerName":"Aaron L.","helpful":[2,2],"reviewText":"The Postal Service is the electronic-pop combination of Death Cab For Cutie's Ben Gibbard and Dntel's Jimmy Tambarello. I was a little sceptical coming into listening to this album on whether for not i would like it, but i was not dissapointed. It was much much better than i had expected. The songs are not too drawn out and boring, which i myself find in many synth-driven songs. In fact, many are quite catchy and have a using along quality. Highlights include \"Such Great Heights\" and \"Sleeping In.\"Rating: Four stars.","overall":4,"summary":"Postal Service &quot;Give Up&quot;","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":41027,"reviewerID":"A1EPTOYTJ1K2ZM","asin":"B000089CJI","reviewerName":"Aaron L.","helpful":[2,2],"reviewText":"The postal service is an electronic partnership between Ben Gibbard of Cutie's Death Cab and Dntel's Jimmy Tambarello. As I listened to the album I doubted if I would like it but I was not disappointed. This is so much better than I expected. These songs are not very boring, and I have found this in many of the songs performed by synthesizers. In fact, many of them look great and have a quality to be used. Comments include \"Such heights\" and \"sleep.\" Price: Four stars.","overall":4,"summary":"Postal Service &quot;Give Up&quot;","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":41027,"reviewerID":"A1EPTOYTJ1K2ZM","asin":"B000089CJI","reviewerName":"Aaron L.","helpful":[2,2],"reviewText":"The Postal Service is an electronic combination of Ben Gibbard's beloved pop and Dntel's Jimmy Tambarello. Comments include \"So High\" and \"Sleep Inside\"","overall":4,"summary":"Postal Service &quot;Give Up&quot;","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":41027,"reviewerID":"A1EPTOYTJ1K2ZM","asin":"B000089CJI","reviewerName":"Aaron L.","helpful":[2,2],"reviewText":"The postal service is an electronic combination of Ben Gibbard's Cutie's Death Cab and Dntel's Jimmy Tambarello. Comments include \"So High\" and \"Sleep Inside\"","overall":4,"summary":"Postal Service &quot;Give Up&quot;","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":43787,"reviewerID":"A38UBVJEV1LLS7","asin":"B0000C6E4D","reviewerName":"NorthofCB","helpful":[3,3],"reviewText":"Wow, is of course the only word that can describe the ethereal euphoria that McLachlan creates in her beautiful pablum. The six year break that she took after Surfacing was certainly an emotional roller coaster for her, with the death of her mother and the time with her child, but it yielded wonderful results. Again the music is haunting and mystical, but it takes an even deeper detour that was skipped in previous works. Love is portrayed in a \"dark place\" and life is cast in a blue, hazy light. McLachlan gives us a look into a dimension of conscience that few writers are table to bless us with. She is proof that it does't take \"an album a year\" to stay beloved by the public, and truly she only gets better with time.","overall":5,"summary":"What can one say but Wow!","unixReviewTime":1068249600,"reviewTime":"11 8, 2003"}
{"orig_index":43787,"reviewerID":"A38UBVJEV1LLS7","asin":"B0000C6E4D","reviewerName":"NorthofCB","helpful":[3,3],"reviewText":"The six-year holiday after Surfine has undoubtedly been a sad experience for her due to the death of her mother Time and her children, but it has produced amazing results. He has shown that there is no need for the annual album \"to remain popular with the public, and it will get better over time. In the dark light. McLachlan allows us to see the magnitude of the conscience, and few writers can use it to bless us. there is no need for a \"one album a year\" to maintain public order.","overall":5,"summary":"What can one say but Wow!","unixReviewTime":1068249600,"reviewTime":"11 8, 2003"}
{"orig_index":43787,"reviewerID":"A38UBVJEV1LLS7","asin":"B0000C6E4D","reviewerName":"NorthofCB","helpful":[3,3],"reviewText":"Wow, of course, this is the only word that can describe the ethereal joy that McLachlan creates in this beautiful pablum. The six-year vacation she took after Surfacing was certainly for her brain, her mother’s death and the time she spent with her baby, but it brought amazing results. Again the music is complex and mysterious, but takes up a deeper place than previous works. Love is depicted in a “dark place” and life is lit with a dark blue light. McLachlan gives us an idea of ​​the size of conscience that some writers have been praying for us at the table. It’s proof that they’re not picking an “album of the year” for the public to like, and it’s really going to be good over time.","overall":5,"summary":"What can one say but Wow!","unixReviewTime":1068249600,"reviewTime":"11 8, 2003"}
{"orig_index":43787,"reviewerID":"A38UBVJEV1LLS7","asin":"B0000C6E4D","reviewerName":"NorthofCB","helpful":[3,3],"reviewText":"The music is awful and mysterious, but it takes a deeper place than previous works. love is depicted in a “dark place” and life is immersed in blue, passionate light.","overall":5,"summary":"What can one say but Wow!","unixReviewTime":1068249600,"reviewTime":"11 8, 2003"}
{"orig_index":45218,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000197KVW","reviewerName":"The Groove","helpful":[3,7],"reviewText":"The title of George Michael's new solo album obviously refers to the patience with which we've waited for this CD, this first since one thousand, nine hundred and ninety-six's \"Older.\" It's not as consistent as that record, but it does feature some of Michael's most personal and inspired work. There are some great itunes, a few good jones, and a couple boring jones, resulting in an overall worthwhile effort. The kickoff single, \"Amazing,\" is an unpretentious, guitar favored pop single that deserved its Top Ten status in Britain. \"Flawless (Go to the City)\" is a flamboyant, six-minute disco stopper that has the word \"hit\" all over it, and \"American Angel\" is a touching love song about this Texas boyfriend. Every George Michael CD has at least one tearjerker of a ballad, and on this CD, that song is definitely \"My Mother Had a Brother,\" which addresses the suicide of this uncle. If this track does't make you misty in the eyes, you better make sure you still have a pulse. And, of course, there are the already-released singles \"Freeek!\" (about getting your freak online) and \"Shoot the Dog\" (a candid antiwar diatribe against George W. Bush and Tony Blair). But at seventy minutes, it seems a bit weighed down by filler tracks like \"Cars and Trains\" and \"Round Here.\" It's a shame that George's career in America is all but forgotten because this CD deserves to be as much a hit on these shores as the UK, where it already went to Number One. It's not perfect, but make no mistake: this \"Patience\" is a virtue.","overall":4,"summary":"Patience is a Virtue.","unixReviewTime":1080691200,"reviewTime":"03 31, 2004"}
{"orig_index":45218,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000197KVW","reviewerName":"The Groove","helpful":[3,7],"reviewText":"The title of George Michael's new single album clearly points to your patience with this CD, the first CD since one hundred thousand, nine hundred and ninety-six. It is not as consistent as this account, but it contains some of Michael's own and inspired works. There are some good iTunes, some good jones, and some boring jones, and all of you are worth the effort. The single \"Amazing\" opening is simple, unpretentious, loved by the guitar, and deserves to win the top ten in the UK. \"Innocent (Go to the City)\" is a great six-minute disco stop with the word \"beat\" everywhere, and \"Angel of America\" ​​is a touching love song about this Texas guy. Every George Michael CD has one tear-jerking ballad. On this CD, the song is definitely \"My mother has a brother\", telling the story of her uncle's suicide. If this line does not shine, it is best to make sure you still have a pulse. Of course, there are also other songs released for \"Freeek!\" (About finding your freak online) and \"Shooting the Dog\" (a fact that fights a war against George W. Bush and Tony Blair). But for seventy minutes, it seemed to focus on songs like \"Cars and Trains\" and \"Rebirth Here\". Unfortunately, George's work in the United States was almost forgotten, as the CD should have become as famous on the coast as the United Kingdom, where it was the first. It’s not perfect, but please don’t get me wrong: this kind of “patience” is great.","overall":4,"summary":"Patience is a Virtue.","unixReviewTime":1080691200,"reviewTime":"03 31, 2004"}
{"orig_index":45218,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000197KVW","reviewerName":"The Groove","helpful":[3,7],"reviewText":"The title of George Michael's new album clearly points to your patience with this CD. It does’t shake like that record, but it does contain some of Michael’s own and inspired works. The single \"Amazing\" opening was unpretentious, loved the guitar, and deserved to win the top ten in the UK.","overall":4,"summary":"Patience is a Virtue.","unixReviewTime":1080691200,"reviewTime":"03 31, 2004"}
{"orig_index":45218,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000197KVW","reviewerName":"The Groove","helpful":[3,7],"reviewText":"The title of George Michael's new album clearly indicates the patience we have been waiting for on this CD, the first since the thousand, nine hundred and ninety -six \"Older.\" It’s not as consistent as that record, but it contains some of Michael’s most personal and inspirational work. There’s some great iTunes, some great jones, and a tedious pair of jones, resulting in a worthwhile total effort. The kickoff single, “Amazing,” is an undisputed, preferred pop song worthy of Britain’s Top Ten. “Flawless (Go City)” is an active, six -minute disco stop with the word “hit” throughout, and “American Angel” is a love song that touches this Texas friend. Every George Michael CD has at least one big tear, the CD, that song is definitely “My mother had a brother,” which talks about this uncle’s suicide. If this road won’t cloud your eyes, it’s best to make sure you’re still beating. And, of course, there are those who have already released \"Freeek!\" (about getting your attention online) and “Shoot the Dog” (an antiwar diatribe against George W. Bush and Tony Blair). But for seventy minutes, it seemed heavier filling roads like \"Cars and Trains\" and \"Round Here.\" It’s embarrassing that George’s American career has been forgotten because this CD deserves to hit these beaches like the UK, where it has already gone to Number One. Not right, but don’t get me wrong: “Patience” it’s good.","overall":4,"summary":"Patience is a Virtue.","unixReviewTime":1080691200,"reviewTime":"03 31, 2004"}
{"orig_index":46527,"reviewerID":"A22VYOT4RQ092Z","asin":"B0002JUWZW","reviewerName":"Toma \"byrdgang\"","helpful":[0,0],"reviewText":"This album is full of cuts off this first album. I done think that an album full of cuts is going to do too hot.","overall":3,"summary":"Should Have Never Been Released","unixReviewTime":1168819200,"reviewTime":"01 15, 2007"}
{"orig_index":46527,"reviewerID":"A22VYOT4RQ092Z","asin":"B0002JUWZW","reviewerName":"Toma \"byrdgang\"","helpful":[0,0],"reviewText":"This disc is full of cut to first disc. I think a plate full of clips will be very hot.","overall":3,"summary":"Should Have Never Been Released","unixReviewTime":1168819200,"reviewTime":"01 15, 2007"}
{"orig_index":46527,"reviewerID":"A22VYOT4RQ092Z","asin":"B0002JUWZW","reviewerName":"Toma \"byrdgang\"","helpful":[0,0],"reviewText":"This disc is full of the first disc cut. I think the album","overall":3,"summary":"Should Have Never Been Released","unixReviewTime":1168819200,"reviewTime":"01 15, 2007"}
{"orig_index":46527,"reviewerID":"A22VYOT4RQ092Z","asin":"B0002JUWZW","reviewerName":"Toma \"byrdgang\"","helpful":[0,0],"reviewText":"is full of cuts on the first album. This disc is full of fragments from the original disc.","overall":3,"summary":"Should Have Never Been Released","unixReviewTime":1168819200,"reviewTime":"01 15, 2007"}
{"orig_index":48255,"reviewerID":"A3LZJBC7TTXWJ3","asin":"B0006ZQ9BS","reviewerName":"CHRIS \"music lover\"","helpful":[2,4],"reviewText":"This cd is incredible. Every song is a banger and every song has great lyrics and a great beat to back it up. Everybody should own this cd, because behind Kanye's cd, this is the best of the year.","overall":5,"summary":"best cd out of the g unit camp ever!","unixReviewTime":1126915200,"reviewTime":"09 17, 2005"}
{"orig_index":48255,"reviewerID":"A3LZJBC7TTXWJ3","asin":"B0006ZQ9BS","reviewerName":"CHRIS \"music lover\"","helpful":[2,4],"reviewText":"This CD is OK. Each song is fun, and every song has great songs and great rhythms to support it. Everyone should have this CD, because after Kanye's CD, it's the best of the year.","overall":5,"summary":"best cd out of the g unit camp ever!","unixReviewTime":1126915200,"reviewTime":"09 17, 2005"}
{"orig_index":48255,"reviewerID":"A3LZJBC7TTXWJ3","asin":"B0006ZQ9BS","reviewerName":"CHRIS \"music lover\"","helpful":[2,4],"reviewText":"Every song is great, and every song has great songs and great rhythms to support it. Everyone should have this CD, because after Kanye's CD, it's the best of the year. This CD is incredible.","overall":5,"summary":"best cd out of the g unit camp ever!","unixReviewTime":1126915200,"reviewTime":"09 17, 2005"}
{"orig_index":48255,"reviewerID":"A3LZJBC7TTXWJ3","asin":"B0006ZQ9BS","reviewerName":"CHRIS \"music lover\"","helpful":[2,4],"reviewText":"Every song is great, and every song has great songs and great rhythms to support it. Each song has beautiful lyrics and great beats to support it.","overall":5,"summary":"best cd out of the g unit camp ever!","unixReviewTime":1126915200,"reviewTime":"09 17, 2005"}
{"orig_index":48345,"reviewerID":"A9Q28YTLYREO7","asin":"B0006ZQ9BS","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,3],"reviewText":"why does it take getting shot five times for Dr. Dre to get out&Push a Record? I mean first with fifty&now the Game. this Cat has no musical Idenity whatsoever. He seems to be riding a wave that got open by fifty Cent. the sad part is that fifty himself did His best material years ago.anyway the Game is just a Name&face to help restore the West Coast in the wrap game because there has't been a major player in Years.sadly Game is a Step back.you can't recapture what Eazy E,Dre,Snoop,Cube,Quik,MC weight ,E-forty,Too short, etc. did by doing a atwood hand generic job of it.","overall":1,"summary":"No Game","unixReviewTime":1106352000,"reviewTime":"01 22, 2005"}
{"orig_index":48345,"reviewerID":"A9Q28YTLYREO7","asin":"B0006ZQ9BS","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,3],"reviewText":"Why does Dr Dre need to be beaten five times to get out & push the Record? I mean play fifty now. This cat has no music identifiers. He appears to be riding in the wind and waves, opening up fifty cents. Unfortunately, over the past fifty years, the has made some remarkable achievements for himself. In any case, the game is just a name and a face to help bring West West back to the packing game, as there have been no major players in a few years. Unfortunately the game is a step backwards. You can no longer find what Eazy E, Dre, Snoop, Cube, Quik, MC Weight, E-Forty, very short, etc. by doing Atwood manual work all over it.","overall":1,"summary":"No Game","unixReviewTime":1106352000,"reviewTime":"01 22, 2005"}
{"orig_index":48345,"reviewerID":"A9Q28YTLYREO7","asin":"B0006ZQ9BS","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,3],"reviewText":"Why does Dr Dre need to be beaten five times to run and push the record? I mean the first time there were fifty and now the game has no musical identity. He appears to be riding a wave of fifty cents.","overall":1,"summary":"No Game","unixReviewTime":1106352000,"reviewTime":"01 22, 2005"}
{"orig_index":48345,"reviewerID":"A9Q28YTLYREO7","asin":"B0006ZQ9BS","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,3],"reviewText":"Unfortunately, the made the best equipment for himself fifty years ago. In any case, this game is just a name-to-face to help bring the West Coast back to the packing game because there has’t been a top player for years. Unfortunately, the game is a step backwards. You can no longer find Eazy E, Dre, Snoop, Cube, Quik, MC weight, E-forty, very short, etc. I mean first use fifty degrees with the current game. He appears to be riding in the wind and waves, opening up fifty cents. Why does Dr. Dre need to be beaten five times to get out and push the record? By making Atwood a global craft. This cat does not have a music ID.","overall":1,"summary":"No Game","unixReviewTime":1106352000,"reviewTime":"01 22, 2005"}
{"orig_index":50391,"reviewerID":"A7OZBEOEMCXBX","asin":"B000AOENCM","reviewerName":"Stephen M. Rapp \"huck555\"","helpful":[3,5],"reviewText":"I'm one of those guys who just does't want to like Sheryl Crow. Too self conscious, too much a diva, too much some guy's new thing, too much \"I wish people would stop bringing up I taught elementary school.\"I have to put it all aside for this album which is magnificent.","overall":5,"summary":"Eating Crow","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":50391,"reviewerID":"A7OZBEOEMCXBX","asin":"B000AOENCM","reviewerName":"Stephen M. Rapp \"huck555\"","helpful":[3,5],"reviewText":"I'm one of those people who does't want to love Sheryl Crow. Too much selfishness, too many divas, too many new things for boys, too much \"I hope people won't mention me teaching elementary school again.\" For this great album, I have to put all of this aside.","overall":5,"summary":"Eating Crow","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":50391,"reviewerID":"A7OZBEOEMCXBX","asin":"B000AOENCM","reviewerName":"Stephen M. Rapp \"huck555\"","helpful":[3,5],"reviewText":"Sheryl Crow is one of those people who does't want to love Sheryl Crow. \"In this great album, I have to put all this aside,\" the said.","overall":5,"summary":"Eating Crow","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":50391,"reviewerID":"A7OZBEOEMCXBX","asin":"B000AOENCM","reviewerName":"Stephen M. Rapp \"huck555\"","helpful":[3,5],"reviewText":"I'm one of those people who does't want to love Sheryl Crow. \"I hope people will stop mentioning that I taught in primary school,\" the said.","overall":5,"summary":"Eating Crow","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":50523,"reviewerID":"AEBUH08TEQ236","asin":"B000AU1NZQ","reviewerName":"R. McSpadden \"Bobby McSpadden\"","helpful":[1,3],"reviewText":"In my book Kates best work. Seems like I'm not alone in my opinion. Her creativity well never seems to run dry. Very much worth the wait. I Don't understand the one star reviews. I suppose these people want her to make \"Hounds of Love\"or \"Lionheart\"again.","overall":5,"summary":"a true masterwork-bushs best!","unixReviewTime":1132272000,"reviewTime":"11 18, 2005"}
{"orig_index":50523,"reviewerID":"AEBUH08TEQ236","asin":"B000AU1NZQ","reviewerName":"R. McSpadden \"Bobby McSpadden\"","helpful":[1,3],"reviewText":"Kates' best work in my book. In my opinion, I am not alone. His skill will never fail. Worth waiting. I don't understand a single star study. I think these people want him to do \"Love Hunting\" for \"Lion of the Heart\" again.","overall":5,"summary":"a true masterwork-bushs best!","unixReviewTime":1132272000,"reviewTime":"11 18, 2005"}
{"orig_index":50523,"reviewerID":"AEBUH08TEQ236","asin":"B000AU1NZQ","reviewerName":"R. McSpadden \"Bobby McSpadden\"","helpful":[1,3],"reviewText":"I think these people want him to do \"Love Hounds\" for \"Lionheart\" again. His creative skills do not seem to be over. In my opinion, I am not alone. I don't understand a single star study. Kates's excellent work in my book. Worth waiting.","overall":5,"summary":"a true masterwork-bushs best!","unixReviewTime":1132272000,"reviewTime":"11 18, 2005"}
{"orig_index":50523,"reviewerID":"AEBUH08TEQ236","asin":"B000AU1NZQ","reviewerName":"R. McSpadden \"Bobby McSpadden\"","helpful":[1,3],"reviewText":"Kates' best work in my book. In my opinion, I am not alone. His skill will never fail. You should be given my book Kates Best Works","overall":5,"summary":"a true masterwork-bushs best!","unixReviewTime":1132272000,"reviewTime":"11 18, 2005"}
{"orig_index":51271,"reviewerID":"A2DZTCCA8VNWZG","asin":"B000BNTM32","reviewerName":"The Wasp","helpful":[1,1],"reviewText":"In a realm where beauty sells albums, greatest hits collections are collated after a mere three albums and recording artists are measured on unit quantity rather than unique quality, Mary J Blige stands as a strong and dignified contrast to the regular industry machinations. Everyone from Alicia Keys to Jennifer Lopez has been influenced by Mary J's style. Perhaps The Breakthrough, her seventh album and a Billboard chart-topper, will contain a single that can see her elevated to the level of Beyonce. With guests such as Will. I. Am, Jay-Z and Utwo, there's no doubting Mary J Blige has brought out the big guns for her latest album. Rather than the flippant tomfoolery the's lately shown on Black Eyed Peas' My Humps, Will. I. Am instead takes a sample of Nina Simone's Feeling Good for this Mary J Blige collaboration About You. Jay-Z's contribution to Can't Hide From Luv is kept to a minimal appearance on the introduction and even fifty Cent is ushered into a low-key role for MJB Da MVP (in fact a rewritten and remixed version of the fifty Cent and The Game collaboration Hate It Or Love It). Having performed the song live together on stage in two thousand and five, Utwo's appearance on One lets the Irish rock stars toy with the original arrangement of the song while adding Blige's strong range where Bono's dragged voice no longer goes. The funky bass and synthesizers of Baggage are reminiscent of past Mary J Blige glories, Take Me As I Am is an autobiography of hardship and Good Woman Down once again finds the gifted soul singer penning tough anti-violence lyrics. An affirmation of her strengths, The Breakthrough proves Blige is still an R&B; heavyweight. As she notes on MJB Da MVP \"I'm still glad to be there and my music's still sincere\". All bow to Queen Mary.","overall":4,"summary":"Another MVP For Mary","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":51271,"reviewerID":"A2DZTCCA8VNWZG","asin":"B000BNTM32","reviewerName":"The Wasp","helpful":[1,1],"reviewText":"In the arena where beautiful women sell discs, the most popular discs are arranged after only three discs, and the recorded artists are rated unit size rather than a special standard. Mary J Blige and her own distinguished difference. A common business conspiracy. From Alicia Keys to Jennifer Lopez, everyone is influenced by the style of Mary J. Perhaps the success, her seventh album and keyboard album, will include one that will allow her to rise to the level of Beyonce. We are waiting for guests and Lover. Me, Jay-Z and Utwo, no doubt Mary J Blige introduced the cannon to her latest album. What was recently shown in \"My Hump, Will\" by the Black Eyed Peas is not absurd. A. I took Nina Simone's Sounds Good Feelings about you by Mary J Blige. Jay-Z's contribution to Can't Hide From Luv has been kept short in the introduction, and with fifty Cent introduced the low role of MJB Da MVP (actually hating for liking the collaboration between fifty Cent and Game). After performing on a co-starring song in two thousand and five, Utwo's appearance on One allowed the Irish rock stars to play and edit the original song, and at the same time add Blige's powerful vocals, Bono's catchy sound never reappeared. Baggage’s stylish bass and synthesizer reminds me of the glory of Mary J Blige in the past, Take Me As It Is is a life story of a poor man, and Good Woman Down also found this talented soul singer to write anti-violence words. To prove this mettle, Breakthrough proved that Blige is still an R&B; heavyweight. As the told MJB Da MVP, \"I'm still happy to be there and my music is still true\". Everyone bowed down to Queen Mary.","overall":4,"summary":"Another MVP For Mary","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":51271,"reviewerID":"A2DZTCCA8VNWZG","asin":"B000BNTM32","reviewerName":"The Wasp","helpful":[1,1],"reviewText":"Breakthrough is Mary J Blige's seventh album and number one on the billboard charts. Waiting for interested guests. Me, Jay-Z and Utwo, no doubt Blige introduced the cannon to this latest album.","overall":4,"summary":"Another MVP For Mary","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":51271,"reviewerID":"A2DZTCCA8VNWZG","asin":"B000BNTM32","reviewerName":"The Wasp","helpful":[1,1],"reviewText":"Mary J Blige's seventh album is on the Billboard charts. Includes Will's cameo. I. Yes, fifty two cents. \"Success\" proves that Blige is still an R&B; heavyweight.","overall":4,"summary":"Another MVP For Mary","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":51369,"reviewerID":"A25SKLRDDMIRAH","asin":"B000BR3464","reviewerName":"Queen Of Books \"Viva La Diva\"","helpful":[2,3],"reviewText":"Anothony Has A Wonderful Voice & Hes Strikes Me As Being A Real True Southern Gentleman. This CD is A Winner. I Like \"Coming From Where Am From Just As Much As I Enjoy This One.","overall":5,"summary":"Hes So Down To Earth","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":51369,"reviewerID":"A25SKLRDDMIRAH","asin":"B000BR3464","reviewerName":"Queen Of Books \"Viva La Diva\"","helpful":[2,3],"reviewText":"Anothony has an amazing voice & it beats me that I'm a real South American drummer. This CD is a Winner.","overall":5,"summary":"Hes So Down To Earth","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":51369,"reviewerID":"A25SKLRDDMIRAH","asin":"B000BR3464","reviewerName":"Queen Of Books \"Viva La Diva\"","helpful":[2,3],"reviewText":"Anothony has a great voice and beats me like a real Southern man. This CD is a winner. I love\" Where I Came From That's how much I enjoy it.","overall":5,"summary":"Hes So Down To Earth","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":51369,"reviewerID":"A25SKLRDDMIRAH","asin":"B000BR3464","reviewerName":"Queen Of Books \"Viva La Diva\"","helpful":[2,3],"reviewText":"Anothony Has A Wonderful Voice & Strikes Me As Being a Real True Southern Gentleman . This CD is A Winner .","overall":5,"summary":"Hes So Down To Earth","unixReviewTime":1139097600,"reviewTime":"02 5, 2006"}
{"orig_index":51726,"reviewerID":"A1HFVQZIDK7UUD","asin":"B000E97HB2","reviewerName":"E.J. Rupert","helpful":[1,1],"reviewText":"Ghostface Killah - Fishscale (Def Jam, two thousand and six)In the midst of snap, hypha and trunk, it's easy to take a New York-based album like Fishscale and says absurd stuff like, \"New York is back,\" \"the Wu is back\", \"album of the year\", for \"best Ghostface album never\". Nevertheless, Ghost hardly never disappoints and the truth is that this album is hot, probably not Ironman hot, but Supreme Clientele\/Pretty Toney hot. RZA main't on the boards this time (he only shows up to wrap on the Wu-Tang posse cut \"nine Milli Bros.\") but there are other producers who still bring out the raw in Ghost like MF Doom, Just Blaze and especially Pete Rock. Pete places Ghost with the simplistic but dope \"Be Easy\" and the posse cut \"Dogs of War\". For the latter, the way Pete flips that \"Family Affair\" sample is bananas. For this album, 'Face surprisingly craps in a way that's easy to understand (not many over-the-head rhymes this time), possibly in an attempt to draw in new fans. Raekwon also shows up a few times on tracks like \"Kilo\" and \"R. A. G. U.\" and Ghost's crew, Theodore Unit, in't far behind. Trife and Cappadonna are in that group and Trife provides a dope chorus on \"Clipse of Doom\" while Cappa has't sounded this inspired since \"Winter Warz\" (which is a LONG time ago). As usual, though, there's one track that ruins the party. No, not the Ne-Yo featured \"Back Like That\", I'm okay with that now. I'm talking about the bonus track \"three Bricks\", which features a Biggie verse from this own \"N***as Bleed\" and conjures up bad Biggie Duets memories (that song in't on there but it sounds like it should have been). Still, while this album probably won't single-handedly thrust New York to the top of ship-hop, Fishscale provides that pure, uncut, raw stuff. -EJR","overall":4,"summary":"Ghost does it again","unixReviewTime":1150243200,"reviewTime":"06 14, 2006"}
{"orig_index":51726,"reviewerID":"A1HFVQZIDK7UUD","asin":"B000E97HB2","reviewerName":"E.J. Rupert","helpful":[1,1],"reviewText":"Ghostface Killah- Fishscale (Def Jam) , two thousand and six) Between a snap, a hypha and a trunk, it's easy to take a New York album like Fishscale and say something funny, like \"New York is back\", \"Wu is back again\", \"Album of the Year\" , won \"Ghostface's best album never.\" However, Ghost is almost never disappointed. The fact is that the album is very popular. , but there are other producers who introduce the original elements to Ghost, such as MF Doom, Just Blaze, and especially Pete Rock. Dogs of War \". Finally, Pete responded to a sample of\" Famil by Affair \"with bananas. Because eth is an album, \"deal with the amazing dice line in an understandable way (without much rhythm at the moment), perhaps attracting new fans. Raekwon has appeared many times in\" Kilo \"and\" RAGU \"and other songs. group, while Trife provided a doping chorus on \"Clipse of Doom\", and Cappa from \"Winter Warz\" (Long) I never heard of this kind of inspiration. , it's not Ne-Yo's \"Back Like That\", I can accept it now. I'm talking about an additional song \"Three Bricks\", which contains Biggie's verses in \"N *** as Bleed\", reminiscent of Biggie Duet's bad memories (that song does't exist, but it sounds like Already there. first. -EJR","overall":4,"summary":"Ghost does it again","unixReviewTime":1150243200,"reviewTime":"06 14, 2006"}
{"orig_index":51726,"reviewerID":"A1HFVQZIDK7UUD","asin":"B000E97HB2","reviewerName":"E.J. Rupert","helpful":[1,1],"reviewText":"fishscale \"Ghost\" Face killah \"is an amazingly interesting album. The bonus song\" Three Bricks \"shows Biggie's verses in this\" N *** as bleeding \"","overall":4,"summary":"Ghost does it again","unixReviewTime":1150243200,"reviewTime":"06 14, 2006"}
{"orig_index":51726,"reviewerID":"A1HFVQZIDK7UUD","asin":"B000E97HB2","reviewerName":"E.J. Rupert","helpful":[1,1],"reviewText":"RZA is off the board at the moment (it only appears in Wu-Tang posse Edited \"Nine Milli Bros.\") But there are other producers who are still coming up with real stuff in Ghost, such as MF Doom, Just Blaze, and especially Pete Rock. Raekwon has appeared many times in \"Kilo\" and \"RAGU\" and other songs.","overall":4,"summary":"Ghost does it again","unixReviewTime":1150243200,"reviewTime":"06 14, 2006"}
{"orig_index":55031,"reviewerID":"A8SCX6VUTE05H","asin":"B000UJBY60","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"When Cassidy first came out the was making noise with this impromptu battle with Freeway. His first album however proved to be a bust. His second album, Im A Hustla was a step in the right direction and is this best work to date. After some legal troubles and a stint in prison, Cassidy returns with this album, B. A. R. S.: The Barry Adrian Reese Story. The problem is that the mixtapes the released prior to this album are better than the album itself. The Problem Vs The Hustla off of this second album was a classic. B. A. R. S Vs The Hustla is straight garbage. My Drink N My two Step is not far behind and who thought that this track would be a great choice for the lead single? Where my N****z At and the flame anti-snitch joint I Will Never Tell (Uh Uh) are corny beyond belief. The only songs that are good is Innocent where Cassidy explains this troubles, Damn I Miss The Game and I Get My Paper. I have no problem with wrappers who make religious songs but I Pray feat Schlazinsky of Larsiny, Leanin On The Lord feat Angie Stone and Done four Me are pretty boring tracks. Those are not the only songs that are lifeless. Take A Trip feat Mashonda, Celebrate feat John Legend and All By Myself will put you to sleep like Nyquil. Bone Thugs N Harmony and Eve doesnt look good on paper and the song Cash Rulez doesnt sound good either and the hook is very repetitive and unoriginal. In closing this album is a huge dissapointment from an MC who should be capable of much better work. The production was bland, The guest appearances are dull and Cassidy sounds like very uninspired on most of these tracks. Standouts: INNOCENT, I GET MY PAPER and DAMN I MISS THE GAME.","overall":2,"summary":"Boring And Really Soulless (B.A.R.S.)","unixReviewTime":1203811200,"reviewTime":"02 24, 2008"}
{"orig_index":55031,"reviewerID":"A8SCX6VUTE05H","asin":"B000UJBY60","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"However, this first album proved to be a failure. His second album, Im A Hustla, is a step in the right direction and the best work to date. Pre-released mixes are better than the album itself. the old thing. BAR S Vs Hustla is just rubbish. My Drink N My two steps follow closely. Who would have thought that this song would be the best choice for the main song? My N **** of At and flame counter-informer joints that I would never tell (uh huh) are amazing. The only good song is Innocent, in which Cassidy described the problem, damn I remember the game, and I found my paper. I have no problem making a wrap-around of religious songs, but I spray for the success of Larsiny's Schlazinsky, Leanin On The Lord feats Angie Stone and Done Four Me are very boring songs. These are not the only lifeless songs. Take A Journey feat Mashonda, Celebrate feat John Legend and All By Me will make you sleep like Nyquil. Bone Thugs N Harmony and Eve don’t look good on paper, the song Cash Rulez does’t sound good, and the hooks are very repetitive and unusual. At the send of this album, it was a big mistake for MC who needed to be table to do better. The production is boring, the look of the guests is boring, and Cassidy sounds very uninspired by much of this song. Great man: INNOCENT, I got my paper, damn I remember this game.","overall":2,"summary":"Boring And Really Soulless (B.A.R.S.)","unixReviewTime":1203811200,"reviewTime":"02 24, 2008"}
{"orig_index":55031,"reviewerID":"A8SCX6VUTE05H","asin":"B000UJBY60","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"after some legal troubles and a stint in prison, Cassidy returns with this album. the only songs that are good is Innocent where Cassidy explains this troubles. the guest appearances are dull and Cassidy sounds like very uninspired on most of these tracks.","overall":2,"summary":"Boring And Really Soulless (B.A.R.S.)","unixReviewTime":1203811200,"reviewTime":"02 24, 2008"}
{"orig_index":55031,"reviewerID":"A8SCX6VUTE05H","asin":"B000UJBY60","reviewerName":"Nuisance \"the rebel\"","helpful":[1,1],"reviewText":"After experiencing legal disputes and incarceration, Cassidy returned with this album. The only beautiful song is Innocent, and Cassidy described the problem. The appearance of the guests is boring, and Cassidy sounds uninspired in many of these songs.","overall":2,"summary":"Boring And Really Soulless (B.A.R.S.)","unixReviewTime":1203811200,"reviewTime":"02 24, 2008"}
{"orig_index":57757,"reviewerID":"A129YBX5BVNW2","asin":"B001W63DXW","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[9,9],"reviewText":"Across the last three decades, Hall & Oates fans have had to put up with the occasional half-assed \"Best Of\" CD with so-so sound and a slew of very expensive Japanese imports for their huge canon of albums and forty-years-plus career. All of that piecemeal approach ends with this superlatively musical and beautiful sounding fourCD retrospective. There's so much on there, so let's detail the nuts and bolts first - USA released thirteen October two thousand and nine, RCA\/Legacy eighty-eight thousand, six hundred and ninety-seven thirty-six thousand, nine hundred and seventy-four two breaks down as follows:Disc one, one thousand, nine hundred and sixty-six to one thousand, nine hundred and seventy-seven, twenty tracks, seventy-eight:twelve minutes - features eleven album cuts, three rare USA-only seven singles and six Previously Unreleased tracksDisc two, one thousand, nine hundred and seventy-five to one thousand, nine hundred and eighty. twenty tracks, seventy-eight:fifty-nine minutes - features sixteen album cuts, one rare seven\" Mix and three Previously Unreleased tracksDisc three, one thousand, nine hundred and eighty to one thousand, nine hundred and eighty-five, eighteen tracks, eighty:zero minutes - features fourteen album cuts, two rare seven\" single versions, one rare twelve\" Mix and one Previously Unreleased TrackDisc four, one thousand, nine hundred and eighty-eight to two thousand and nine, sixteen tracks, seventy-eight:seventeen minutes - features six album cuts, one rare CD single mix, one old song reworking and weight Previously Unreleased versions(I've provided a full track list breakdown in the 'comment' section attached to this review). The first thing that hits you (apart from the superlatively annotated booklet with reminiscences on every song by the duo) is the SOUND. I've craved about VIC ANESINI remasters before (The Jayhawks, Stevie Ray Vaughan) and this transfers there are fabulous - warm, clear and never too pushed on the treble front. Every track is a revelation to me. The sonic hit off \"She's Gone\" is just amazing - it'll put chills on your arms. Then there's the parade of hit-after-hit that is shockingly impressive - \"Wait For Me\", \"Out Of Touch\" and \"Do It For Love\". But better than that are the albums cuts that finally get to shine - \"August Day\", \"You Make My Dreams\" (lyrics above), \"Your Imagination\", \"Some Things Are Better Left Unsaid\" and \"Keep On Pushin' Love\" - gems that deserve rediscovery. The unreleased stuff is admittedly not exactly bulging at the seams, but what they've chosen is actually worth inclusion. The \"Have You Ever Been In Love\" demo is superb - while their molecular-level love of Soul Music shines through with their inclusion of classy covers by The O'Jays (\"Me And Mrs. Jones\") and The Mad Lads (\"I Want Someone\"). And the box set's title song \"Do What You Want, Be What You Are\" is given an awesome two thousand and seven live going over that show these white Philly dudes have more soul in their little fingers than most people do in their entire bodies. Pretty impressive stuff. Niggles - fans will immediately notice that two huge favourites \"When The Morning Comes\" and \"Everytime You Go Away\" are represented there by 'live' versions and not their beloved studio originals - but I'd defend the choices. The one thousand, nine hundred and seventy-five version of \"When The Morning Comes\" features a rare 'duo-only' live setting and its intimacy is just lovely - while the nine:thirty minutes version of \"Everytime You Go Away\" features a churchy morgan feel and is fabulously fleshed out with Acapella passages that elicit a genuinely thrilled response from the Japanese audience. I can see why they were chosen. The same applies to the beautiful Phillip Mitchell song \"Starting All Over Again\" - Hall has chosen a live version, but the's done so because it somehow has the depth it deserves this way. Omissions - there's a great soulful exclusive on the one thousand, nine hundred and ninety-nine soundtrack to \"Runaway Bride\" called \"And That's What Hurts\" - and it really should be on there (perfect box set material). There's nothing from the \"Marigold Sky\" album (one thousand, nine hundred and ninety-seven) and two thousand and five's covers set \"Our Kind Of Soul\" had three new songs, one of which was the blindingly good \"Don't Turn Your Back On Me\" - again a no-show. There's not enough from the wonderful \"Change Of Season\" album either and of course no solo stuff. Still - and I must stress this - what's on there is the business. Since two thousand and nine Daryl Hall has become something of an Internet hero with this stunning \"Live From Daryl's House\" broadcasts - they feature him and invited musical pals going through Hall & Oates back catalogue with sidesteps into other favourite songs too. It features a band professionally set up in this living room with shitty-chatty clips in between. Check out soulful YouTube clips of \"Pick Up The Pieces\" with Alan Gorrie from the Average White Band, \"Can We Still Be Friends\" with Todd Rundgren, \"Something To Talk About\" (a Bonnie Raitt cover) and \"Black Horse And A Cherry Tree\" with KT Tunstall and \"Cruel To Be Kind\" with Nick Lowe. And prepare yourself to be quietly blown away. To sum up - for most people a simple \"Best Of\" would probably suffice, but I'd surge to dig deeper into your pocket. This Box Set is an impressive body of work - superbly presented, well thought out and beautifully mastered. This 'kiss' from the most successful pop duo of all time (like the best things in life) deserves to be put high on your 'list'. And don't let those Eighties clothing choices put you off either. Honestly - sometimes you just need a shoulder-pad and a big hairdo. Way to go boys.","overall":5,"summary":"\"...When You Pull Them All Together...You Make My Dreams Come True...\"","unixReviewTime":1301788800,"reviewTime":"04 3, 2011"}
{"orig_index":57757,"reviewerID":"A129YBX5BVNW2","asin":"B001W63DXW","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[9,9],"reviewText":"For the past three decades, fans of Hall and Oates have had to endure a CD of \"Best Of\" that sounds unimportant and too expensive to import Japanese. An old album with more than forty years of professional work. All of these diets ended with this beautiful music and a beautiful update of four CDs. There is so much content, let's introduce some details first - the United States issued thirteen October two thousand and nine, RCA \/ Legacy eighty-eight thousand, six million, nine hundred and seventy-three thousand, six hundred, nine thousand, seven hundred and forty-two divided as follows: first, a thousand, nine thousand and ten sixty-six to one thousand, nine hundred and seventy-seven, twenty songs, seventy-eight: twelve minutes - contains eleven albums, three rare American singles only seven songs and six unreleased songs One thousand, nine hundred and seventy-five to one thousand , nine. one hundred and eighty. Twenty songs, seventy-eight: fifty-nine minutes - contains sixteen album clips, a unique \"seven\" recipe and three unreleased tracks released on three CDs, one, zero, nine hundred and eighty one thousand, nine hundred and eighty five, eighteen songs, eighty: zero minutes - contains fourteen albums, two rare seven \"single versions, one rare twelve\" remix and one trackDiscuit never released before, a thousand, nine hundred and eighty-eight to twenty-nine thousand , sixteen songs, seventy-eight: seventeen minutes - contains six album excerpts, one rare CD, an old song of repairs and the difficulty of unpublished versions (I provide a complete breakdown of the list of songs in section \"A comments \"attached to this update). What impresses you the most (with the exception of a pamphlet with more details with memories of each song) is SIZANDI. I’ve always longed for a remake of VIC ANESINI (Jayhawks, Stevie Ray Vaughan), which conveyed the beauty where it was warm, clear and never too flattering as a treble. Each song is a revelation to me. The sound in \"Gone\" is cloud - it makes your arms cool. Then came the shocking fight of \"Wait\", \"Without Touch\" and \"Make Me Love\". But better than this album program that finally lit up - \"August Day\", \"You Made My Dream\" (above words), \"Your imagination\", \"Some things are better not to be told\" and \"Keep pushing love\" \"- something important to repeat rediscoverable. It is undeniable that the unreleased items were not completely swollen, but the items they chose should be included. Demo \"Have you never been in love?\" and Mad Lads (\"I Want Someone\"). Have \"Found two thousand and seventy-seven live games, showing that the little fingers of this white Philadelphia have more souls than most human bodies. It's amazing. Niggles-Fans will soon realize that these favourites \"When Tomorrow Comes\" and \"Always Walk Away\" are represented by the \"live\" version rather than the first version of their favourite studio - but I'll defend this option. One thousand nine hundred and seventy-five versions of \"When the Morning Came\" show \"two-two-\" The nature of the human object, and its intimacy is good - and the thirty:thirty minute translation \"Whenever you go\" shows a Church like Morgan, enriched surprisingly it is capella verses, which stimulated an interesting response From the Japanese audience. I understand why they were chosen. The same applies to Phillip Mitchell's beautiful song \"Starting All Again\" - The Hall chose a vibrant genre, but it did so because it had the right depth in some way. of one thousand and nine hundred and ninety-nine soundtracks of \"Runaway Bride\" of love follow only called \"and that's what Pain\" -it really should be (perfect material set). The \"marigold Sky\" album (one thousand, nine hundred and ninety-seven) and the cover of the \"Our Soul\" album have three new songs, one of which shines \"Don't Turn and Turns\" Back to Me \"- they're there again. Still - I have to emphasize this point - what a business. Since two thousand and nine, Daryl Hall has been the networking hero and the amazing \"Daryl House Live Broadcast\" - they put him on and invited music partners to watch Huo Er and Oates come back in the catalog, but they also limit other favourite songs. It has the theme of a band made in the living room with the middle pieces. Bonnie Raitt cover) and \"The Black Horse With A\" Cherry Tree \"and KT Tunstall and\" and cruel kindness ”with Nicholas. And you are ready to wind down in silence. All in all — for most people, “the best” is enough, but I’ll put it in your pocket. This Box set is an amazing piece - well-presented, well thought out and well-informed. This \"kiss\" from the most successful pop duo of all time (as the best thing in life) should be on your \"list\". Don't let those eighty clothing choices embarrass you. Honestly — sometimes you just want a shoulder pad and big hair. Good boy all the way.","overall":5,"summary":"\"...When You Pull Them All Together...You Make My Dreams Come True...\"","unixReviewTime":1301788800,"reviewTime":"04 3, 2011"}
{"orig_index":57757,"reviewerID":"A129YBX5BVNW2","asin":"B001W63DXW","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[9,9],"reviewText":"Twenty tracks, seventy-eight: fifty-nine minutes - contains sixteen albums, seven odd \"remix\" eighty-five, eighteen songs, eighty: zero minutes - contains fourteen albums, two rare seven \"single versions, one rare twelve\" Mix and the previously unreleased four-track, a thousand, nine hundred and eighty-eight to two. Nineteen thousand, sixteen songs, seventy-eight minutes: seventeen-minute-containing six-clip albums, rare CD-remix, are-singing of an old song and the difficulty of an unprecedented translation (I provide this list The full list of songs in the additional \"comments section\" to separate this review) is too much content. : one disk, one thousand nine hundred and sixty-six to one thousand, nine hundred and seventy-seven, twenty songs, seventy-eight: twelve minutes - has eleven albums, three rare U. S. singles and six songs not previously included on the CD two, one, zero, nine hundred and seventy-five-one, zero, nine hundred and eighty. But better than this light-hearted album program - \"August Day\", \"You Made My Dream\" (above words), \"Your imagination\", \"Some things are better not to say\" and continue to promote love \"- worthwhile to find again . The album \"Marigold Sky\" (one thousand, nine hundred and ninety-seven) and the two thousand and five album \"Our Soul\" have three new songs, one of which is the shocking \"Do Not Turn\" Back to Me \"- there they are again. Gorrie in the regular white band, \"Can We Be Friends\" with Todd Rundgren, \"Something to Talk About\" (Bonnie Raitt cover) and \"Black Horse and Cherry Tree\" with KT Tunstall and \"Kindness Cruel\" with Nicolo. Omission - \"Runaway Bride\" has a special soul in the one, zero and nine hundred and ninety-nine soundtracks, entitled \"And That's the Painful Thing\" - must have (completed) Version one, nine hundred and seventy-five version of \"The Morning Comes\" , with its intimate Feeling right - and a nine:thirty minute version of \"Whenever You Go\" features a church like Morgan., and is wonderfully enriched with capella verses, which revoke real excitement because Japanese audience. Answer. Only seven songs and six songs were previously released. Beat yourself The first thing is the sound. call this group \"ten\". But the problem Here comes: Why suit? Who's this? Yes, there are a few answers, and the song list successfully covers all the basics. First of all, fans are crazy enough that you have three copies of their song (mine) Spend a lot of money. Don't Go Out \"is amazing and awesome, since I got a copy in first place at zero,\" All the Way from Philadelphia \"has been my favourite, and\" Storm Warning \", never since I heard it. It was recorded. nine and ninety are better than most plates should have!). Seventy-seven songs of \"Backstreet Beauty\" and \"Marigold Sky\", but the solo works of Darryl Hall are not. \"Yes. Hall and Oates decided on this set. They're known to be out of\" Beauty On A Backstreet \"- a crude album.\" Marigold Sky \"was released as a standalone album. - Although consider this their best album - this box is just from Sony Town. Finally: Hall Work Alone: ​​It's called DARYL HALL music by JOHN OATES !!! Together! Next !!! \"Next is\" Novice \". Death of Cutie Club, Travis McCoy, anyone who has never seen \"A Thousand Summer Days\", etc. on top of them \"I'm so cool in the Hall and Oates\" I'm a piece \"in this box), and the lively versions are brighter than the original recording. a lot, though not many articles. Many complaints, but some on the Internet. published interviews show real bitterness.) After saying that, although I no longer care about other people's opinions in my choice of movie music, I still think that these people are ignored. for they were the singers. They are adaptable, talented, and talented. entered the RNR Hall of Fame. That person is a fool. that Hall and Oates were recognized as stars in the Walk of Fame, selected in the shall for the songwriting, BMI awards, etc. Really, even though I’m not a big container collector, I know what I love, and I’ve read it. The more important studies on the Internet, the more people seem to be one of the best containers. I have no clue. I'm confused by one of my favourite lines in \"Adult Education\": \"High scores in elementary school are disappearing; low scores in high school are watching and dressing.\"","overall":5,"summary":"\"...When You Pull Them All Together...You Make My Dreams Come True...\"","unixReviewTime":1301788800,"reviewTime":"04 3, 2011"}
{"orig_index":57757,"reviewerID":"A129YBX5BVNW2","asin":"B001W63DXW","reviewerName":"Mark Barry \"Mark Barry\"","helpful":[9,9],"reviewText":"In the past thirty years, Hall & Oates fans have had to keep up with the once-best “Best” CD in a has a very good soundtrack and skills expensive things. and Japanese imported. Canon's albums and forty years and professional. All of these unique modes send with superb music and the fourth sound of a CD review. There's a lot going on there, let's go through the nuts and posters first - USA released thirteen October two thousand nine, RCA \/ Legacy eighty weight thousand, six hundred and ninety seven and six thousand, nine hundred and seventy -four. It is broken down as follows: Disc one, one thousand, nine hundred and sixty-six to six thousand, nine hundred and seventy-seven, twenty tracks, seventy-eight: twelve minutes-consists of eleven- an album with a cut, three rare in the USA alone and six Roads Not Released Disc two, one thousand, nine hundred and seventy-five to one thousand, nine hundred and eighty. twenty tracks, seventy -eight: fifty -nine minutes - with sixteen albums cut, rare seven \"Mix and three Previous Unreleased tracksDisc three, one thousand, nine hundred and weight to one thousand , nine hundred and eighty-five, weight and ten tracks, eighty: zero minutes-featuring fourteen albums truncated, two rare seven “one genre, one rare twelve” Mix and an unreleased TrackDisc four, one thousand, nine hundred and eighty-eight to two thousand and nine, sixteen tracks, seventy-eight: seventeen minutes- consists of six album cuts, one mixed CD at a time , a remix song and weights (I've provided a complete list of fractures in the 'comments' section attached to this review). the player has) is SO UND. I really missed the previous remake's VIC ANESINI (The Jayhawks, Stevie Ray Vaughan) and this move is amazing a -wonder - warm, clear and not too pushed in front of the trio. Every path is an inspiration to me. Pressing sonic “no more” is wonderful - it will cool your hands. Then there are the hit-and-run comics- “Wait Me”, “Out of Touch” and “Do For Love”. But it's better that the albums are cut and finally shine - \"August\", \"You Make My Dreams\" (songs above), \"Your Imagination\", \"Some things are better not to say\" and \"Pushin Love\" \" - rocks worthy of recapture. Unnamed items are admittedly not really falling into the sewer, but what they have chosen is definitely worth adding. \" The demo was superb - as their love of the Soul Music model shines through with the addition of top covers for O’Jays (“Me and Mrs. Jones”) and The Mad Lads (“I Want Someone”). And the song titled “Do What You Want, Be What You Are” gives terror to two thousand and seven survivors showing that these white men in Philly have more life on their fingers than most people. all over their bodies. Awesome and amazing things for sale. Niggles - fans will know that the two favourites of “When the Morning Comes” and “Whenever You Go” represent ‘live’ genres out there that were’t originally by their favourite studio - but I’ll defend the choices. Instead of a thousand, nine hundred and seventy-five types of “When the Morning Comes” have a ‘duo-only’ lifestyle and its closeness is just beautiful-while nine: thirty minutes of “Every Time You Go “feeling morgan of a church wonderfully attracted to the verses of the Acapella that revoke a genuine and cheerful response from the Japanese audience. I can see why the was chosen. The same applies to Phillip Mitchell’s beautiful song “Beginning Again” - Hall chose a live version, but did it because it somehow had the depth it deserved. Departure - there’s a special and passionate about a thousand, nine hundred and ninety -nine songs from the “Runaway Bride” song called “And That Is Injury” - and it really should be there (right box set). No one came out on the album “Marigold Sky” (one thousand, nine hundred and ninety -seven) and two thousand and five cover set “Our Kind of Soul” has three new songs, one of which is blind not good “Don’t turn around. Turn your back \" - again without showing up. Not enough is the awesome album “Change of Season” and of course no one is alone. However - and I have to emphasize this - what there is is business. Since two thousand and nine Daryl Hall has become an Internet hero with this exciting feature of “Live From Daryl’s House” - they presented him at the invitation of this music friends by Hall & Oates in next book along with other aspects of the song. of the beloved. It looks like a professionally built team in this living room with a sharp and funny interior. Watch the exciting YouTube video of “Pick Up Parts” with Alan Gorrie from White Medium Group, “Can We Still Be Friends With” Todd Rundgren, “Talk About It” (Cover Bonnie) Raitt) and “Black Horse And A \"Cherry Tree with KT Tunstall and\" Cruel to Be Kind \"Nick Lowe. And prepare yourself to be blown away quietly. a simple “Best Of” is enough, but I will do my best to put it in your pocket. ‘Kissed’ from the two most successful pop people never (like the most beautiful things in life) deserves to be included on your list. To not let that eighty clothes dress you too. Honestly - sometimes you have to it My hair is up to my shoulders and my hair is big. Go the way boys.","overall":5,"summary":"\"...When You Pull Them All Together...You Make My Dreams Come True...\"","unixReviewTime":1301788800,"reviewTime":"04 3, 2011"}
{"orig_index":57905,"reviewerID":"A2HIL1IWWD2WEA","asin":"B0025X4OWA","reviewerName":"Stephen Cabral","helpful":[0,0],"reviewText":"I picked this up because I've been a fan of Josh Joplin's for a long time. This is less rock and more folk than I expected, but I enjoyed it nonetheless. If you enjoy Mumford & Sons, Avett Brothers for Edward Sharpe, you should give this a listen.","overall":4,"summary":"Earthy, Earnest and Exuberant!","unixReviewTime":1355961600,"reviewTime":"12 20, 2012"}
{"orig_index":57905,"reviewerID":"A2HIL1IWWD2WEA","asin":"B0025X4OWA","reviewerName":"Stephen Cabral","helpful":[0,0],"reviewText":"I chose this because I have long been a follower of Josh Joplin. Less rock and roll than I expected, and more traditional songs, but I still love it. If you like Mumford & Sons and Edward Sharp's Avett Brothers, you should listen to them.","overall":4,"summary":"Earthy, Earnest and Exuberant!","unixReviewTime":1355961600,"reviewTime":"12 20, 2012"}
{"orig_index":57905,"reviewerID":"A2HIL1IWWD2WEA","asin":"B0025X4OWA","reviewerName":"Stephen Cabral","helpful":[0,0],"reviewText":"If you like Edward Sharp's Mumford & Sons, Avett Brothers, you should listen. It's less rocky and brolly than I expected, with a lot of people's songs, but I still love it. I chose this because I had been a follower of Josh Joplin for a long time.","overall":4,"summary":"Earthy, Earnest and Exuberant!","unixReviewTime":1355961600,"reviewTime":"12 20, 2012"}
{"orig_index":57905,"reviewerID":"A2HIL1IWWD2WEA","asin":"B0025X4OWA","reviewerName":"Stephen Cabral","helpful":[0,0],"reviewText":"This is a small rock and has more people than I expected, but I still love it. If you like Mamford and the sons, Edward Sharpe's Avett Brothers, you'll have to listen to it.","overall":4,"summary":"Earthy, Earnest and Exuberant!","unixReviewTime":1355961600,"reviewTime":"12 20, 2012"}
{"orig_index":59729,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0043C3DZU","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[0,0],"reviewText":"Several years back I was hearing quite a lot of the ship-hop duo Floetry and loved their sound. Actually haven't explored it as much as I've wanted to. Nevertheless Marsha Ambrosious seems to have made quite a name for herself as a songwriter during and after her Floetry experience. Her debut album was apparently inevitable. At the same time I was't informed on any of this somehow. Don't get it. This album has been pushed my way almost everywhere I go. In record stores, online as if it was something I should hear. Kept wondering why this was so important. So today whilst shopping I came across this on the first day of the year, read the CD sticker explaining who this was and decided to give it a stab. Honestly it's very different and very much more than even my most flamboyant expectations. Throughout the modern era the contributions of the British black community to the soul genre haven't gotten quite as much attention as some of the caucasian variety. There have been exceptions for sure. Maysa Leak and N'Dea Davenport being examples. But still this represents something of an unsung cultural chapter in modern soul. And there we have one that might grab at a bit more attention than usual, based primarily on ability. Now to be said there is not going to be much questioning Marsha's voice. This comes out at you with the rangy and husky intonations from the likes of Sarah Vaughn,Anita Baker,Toni Braxton and Lalah Hathaway. Marsha also \"flows\" very well with her voice, shading it with just the right amount of gospel passion for jazzy subtly whenever needed. And that's appropriate considering this is an album possessed of both unity and variety. Anita Baker in't a bad reference to describe this music either as it is heavily yet conservatively produced contemporary jazz\/pop\/soul type music-heavy on the elaborate piano chords and occasional fanfares. What's difference is the very very light influence of the modern day ship-hop\/soul sound in some of the clipped sounding rhythms, beats and the nuanced use of sampling. \"Hope She Cheats On You (With A Basketball Player)\" and \"Far Away\" are the more obvious examples of the ship-hop\/soul influence. Because they don't sound as individual, they are to me the weaker of the songs there. What else is there though more than makes up for it. Three easy highlights are the title song, with it's Prince like use of textural LINN drums and the habanera influenced jazzy samba type styled of the harmonically intricate \"Sour Times\" which, as with most of this album blends the music with her explorative and romantic lyrics, presented with both class and sass. Whole \"With You\",\"Lose Myself\",\"Your Hands\",\"Chasing Clouds\" and \"I Want You To Stay\" maintain that overflowing contemporary jazz\/pop\/soul flavor very well there's also an interpretation of \"Tears\", showcasing her ability with rather more funk balladry. A bonus track of Michael Jackson's \"Butterflies\"-presented in a more upbeat tempo, with sleeker production and Marsha's powerful vocals. I have to say comes pretty close to washing the floor with Mikes. I'll note though I AM NOT knocking MJ! Never would! I would't be into music the way I am today if it were not for him-seriously. But the fact the was't in this best vocal and physical state when this original was recorded only helps bring out how beautifully she does it there. I think Mike would be extremely pleased if the were table to hear it. Overall this album is wonderfully melodic, inspiring, powerful and passionate album I know I won't soon forget. It's the kind of music that has the capacity to bring different generations and classes of people together. There's qualities they'll all like about it. They may be different. But at the same time this album celebrates the unity even musical difference can bring. That's because it's songs are both singular and unified. And Marsha Ambrosius never takes her eyes off of that.","overall":5,"summary":"Soulful Elegance From Across The Pond","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":59729,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0043C3DZU","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[0,0],"reviewText":"a few years ago I heard a lot of boat jumping duo Floetry. and As their words. I really did't study it as much as I wanted to. However, Marsha Ambrosious seems to have gained fame as a songwriter during and after her Floetry experience. His first album is clearly inevitable. At the same time, I was not told any of these things in any way. I do not understand. This disc can be seen almost everywhere. In record stores, online, it seems like this is what I should have heard. You always wonder why this is so important. And now I was shopping today, I saw this on the first day of this year, I read a CD sticker explaining who this is, and I decided to give it a try. Honestly, it’s very different, and even more than my expectations are fun. Throughout the modern era, the contribution of black British society to the species has not received as much attention as other white people. Certainly there are special circumstances. Maysa Leak and N'Dea Davenport are examples. But this still represents an unknown cultural chapter in the modern soul. One of us can be overly concerned, especially with skill. What I want to say now is that not many people will be asking for Martha's voice. Sarah Vaughan, Anita Baker, Toni Braxton, and Lara Hathaway demonstrate this with rough and rough tones. Marsha's voice also \"runs\" well, cleverly concealing it with the zeal of a good jazz gospel when needed. Considering that this is a united and diverse album, this is worth it. Anita Baker is not a bad women to describe this type of music, as it produces a large number but of jazz \/ pop \/ soul music of the times - in clear piano music and a great Accent from time to time in the palace. The difference is that modern ship \/ soul sound has very little effect on the subtle use of sound rhythm, beat and sample in a particular setting. \"I hope the cheats on you (With a Soccer Player)\" and \"Far\" are clear examples of skipping a ship \/ soul impact. Because they don't sound like individuals, to me they are weak in the songs there. What can restore. Three simple notes is a title song. It uses LINN drums written like a prince and a jazz samba style inspired by Havana. The intricate style of \"Bitter Times\", like most of the album's content, combines music with this experimental and romantic lyrics. , and provide class and sass at the same time. The whole song \"You\", \"Lose Yourself\", \"Your Hand\", \"From the Cloud\" and \"I Want You to Stay\" well describes the overflow of jazz \/ pop \/ soul, and the interpretation of \"Tears.\", Showing this strength is like a funk ball. . Additional Michael Jackson songs \"Butterfly\" - dedicated to a more hopeful rhythm, smooth production and powerful singing voice of Masha. I have to say that washing the floor with Mike is very close. I’ll notice that even though I don’t knock MJ! never! If it were't for him, I would't be as passionate about music as I am today - deeply. But in reality, the was not in the best position of this voice and body when the recorded the first one, which would only help to show how good this work was there. I think Mike would be very happy if anyone could hear it. Overall, this album is fun, inspiring, powerful and interesting, I know I will never forget it soon. This type of music can bring people of different generations and classes together. There are qualities that everyone will love. They may be different. But at the same time, the album also celebrates the unity that can be brought about by musical diversity. It is because their songs are single and united. Marsha Ambrosius (Marsha Ambrosius) did not look away from this point.","overall":5,"summary":"Soulful Elegance From Across The Pond","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":59729,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0043C3DZU","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[0,0],"reviewText":"\"Hope She Cheats\" is a modern form of jazz \/ pop \/ soul music composed mainly of beautiful piano picks and occasional cloud speaker performance. \"I Hope You're Tricking\" is a form of modern jazz \/ pop \/ soul music that focuses on soft piano singing and occasional cloud speakers. \"Hope She Cheats\" is a compilation of unity and diversity.","overall":5,"summary":"Soulful Elegance From Across The Pond","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":59729,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0043C3DZU","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[0,0],"reviewText":"Marsha Ambrosious's debut album can be seen almost everywhere. The title track uses LINN drums labeled as a prince and a jazz samba style inspired by Havana. The style is \"Sour Times\" \"I want you to stay\" well maintained the taste of contemporary \/ pop \/ soul jazz, and the interpretation of \"tears\", showing this power and funk ballads. Three simple notes is the title song. It uses LINN drums labeled as a prince and jazz samba style inspired by Havana. The intricate style of \"Bitter Times\", like most albums, combines music Combine this exploratory and romantic lyrics, as well as providing class and sass at the same time. Additional Michael Jackson songs \"Butterfly\" - dedicated to a more hopeful rhythm, smooth production and powerful Masha vocals. Overall, this album is fun, inspiring, powerful and interesting, I know I will never forget it soon. Marsha's voice also \"runs\" well, cleverly concealing it with the zeal of a good jazz gospel when needed. \"I hope you cheat (with a Soccer Ball)\" and \"far away\" are clear examples of a jumping ship \/ soul impact. The difference is that modern ship \/ soul sounds have very little effect on the use of nuances in rhythm, rhythm, and sample editing.","overall":5,"summary":"Soulful Elegance From Across The Pond","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":62137,"reviewerID":"AK9BXHEXOOM6Z","asin":"B007MDQW3C","reviewerName":"John L. Miller","helpful":[0,1],"reviewText":"Regina Spektor is in my top five favourite artists, and this album overall makes a consistent, solid addition to her previous work. I really enjoyed a couple of the songs: 'Oh Marcello', with its appropriation of \"I'm just a soul whose intentions are good \/ pooh lord, please don't let me be misunderstood\" and low-key beatboxing; the beautiful melody and catchy tune in 'Don't Leave Me (Ne Me Quitte Pas)'; and the driving beat in 'All the Rowboats'.'All the Rowboats' is as close as this album comes to a stand-out favourite for me. There's nothing to approach 'Us' fromSoviet Kitsch (Deluxe Version) [+Video], 'Dance Anthem of the eighty's' fromFar, for 'Apres Moi' fromBegin To Hope (U. S. Version). I found that fact a bit disappointing, but perhaps the album will grow on me. Why four stars, then? Because, it's Regina Spektor and she's awesome! If you haven't listened to any of her other stuff I'd recommend starting withBegin To Hope (U. S. Version). If you have, then 'What I saw from the Cheap Seats' is a perfectly serviceable addition to her corpus. Thank you Ms. Spektor for continuing to produce beautiful music!","overall":4,"summary":"No stand-out track, but still good","unixReviewTime":1342224000,"reviewTime":"07 14, 2012"}
{"orig_index":62137,"reviewerID":"AK9BXHEXOOM6Z","asin":"B007MDQW3C","reviewerName":"John L. Miller","helpful":[0,1],"reviewText":"Regina Spektor is one of my five favourite artists, and this album is generally consistent and solid in her previous work. I really like some of these songs: 'Oh Marcello', which contains \"I am a soul with good intentions \/ O God, please don't let me be misunderstood\" and low-key; \"Don't Go With Me (Ne Me Quitte Pas)\" is a melody of a beautiful and catchy song; Soviet (deluxe version) [+ video], \"eightys dance music\" away, and \"Apres Moi\" from Start To Hope (US version). Growing up for me. So why four stars? Because this is Regina Spektor, okay! If you haven't heard anything from her, I suggest you start with Hope (US version). by continuing to create amazing music!","overall":4,"summary":"No stand-out track, but still good","unixReviewTime":1342224000,"reviewTime":"07 14, 2012"}
{"orig_index":62137,"reviewerID":"AK9BXHEXOOM6Z","asin":"B007MDQW3C","reviewerName":"John L. Miller","helpful":[0,1],"reviewText":"'All Rowboats' are like this album and became my favourite album. from afar, \"Apres Moi\" from Begin To Hope (US version)","overall":4,"summary":"No stand-out track, but still good","unixReviewTime":1342224000,"reviewTime":"07 14, 2012"}
{"orig_index":62137,"reviewerID":"AK9BXHEXOOM6Z","asin":"B007MDQW3C","reviewerName":"John L. Miller","helpful":[0,1],"reviewText":"I really like the two most popular songs: 'Oh Marcello', deceptive don't let me be misunderstood \"with low-key beatboxing; \"Don't Leave Me (With Me Quitte Pas)\" A beautiful melody and catchy melodies in the middle; and driving songs \"on all Rowing boats\". Nothing is closer to the \"us\" of Soviet kitsch (deluxe version) [+ video], \"eightys dance music far\", and \"Apres Moi\" from Start To Hope (US version). Regina Spektor is one of my five favourite artists, and this album is always relevant and consistent with her previous work. If you have it, then \"I saw it in the bottom seat\" is a very useful addition to this copy. I found this to be disappointing, but perhaps this album will grow in me. ‘All Rowboats’ is close as this album became my favourite album. If you haven't heard anything from her, I suggest you start with Hope (US version).","overall":4,"summary":"No stand-out track, but still good","unixReviewTime":1342224000,"reviewTime":"07 14, 2012"}
{"orig_index":62164,"reviewerID":"A2RWGW6TGUX7E5","asin":"B007PXNUMU","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[4,5],"reviewText":"This Super Deluxe Edition is definitely the best option available for this new release by Grace & the Nocturnals. The songs are listed in the Amazon Product Description, so there is no need to repeat that there. However, it should be pointed out that in this \"Super Deluxe Edition\", on the CD you get the following Bonus Songs:\"Roulette\"\"All Over You\"\"Stars\" (featuring Kenny Chesney)\"Ragged Company\" (featuring Willie Nelson). Also, on the DVD, you get a live sixty minute performance of Grace Potter & The Nocturnals,: \"Live From Lollapalooza two thousand and eleven\", in Chicago. In this add, Grace is very sexy, she wears a very short mini dress. During the song \"Medicine\", Grace jumps up & down, you can even see her black panties. WOW, What a Show!!! Also, in her band is a tall & sexy female bass guitar player, who wears a very short mini dress. This is a very powerful & sexy concert. Grace and her band perform some outstanding music. The songs of the DVD are as follows:one. Ah Marytwo. Only Lovethree. Hot Summer Nightfour. Goodbye Kissfive. Apologiessix. Low Roadseven. Stop the Buseight.two:two hundred and twenty-nine. Paris (Ooh La La)ten. Nothing But the Watereleven. Medicine - \"MAMA MIA\", WOW, WHAT A HECK OF A SHOW!!!!!!!! (Grace has the Medicine that everybody wants.) I'd love to have some of her Medicine!!!!!!! This is an outstanding Package, and well worth the extra money. Just make sure you get the \"Super Deluxe Edition\" with the CD + the DVD. Thanks, and I hope this review has been helpful.","overall":5,"summary":"This Super Deluxe CD & \"SEXY\" & \"AWESOME\" DVD is MUCH Better Than Just the Basic CD Versions!!!!!!!!!!!!!!!!!","unixReviewTime":1339718400,"reviewTime":"06 15, 2012"}
{"orig_index":62164,"reviewerID":"A2RWGW6TGUX7E5","asin":"B007PXNUMU","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[4,5],"reviewText":"This advanced deluxe version is definitely the best choice for the new version of Grace & Nocturnals. These songs are listed in the Amazon product description, so there is no need to repeat that. However, it should be noted that in this version of \"Super Deluxe Edition\", you will find the following songs on CD: \"Roulette\" \"People Next to You\" \"Stars\" (played by Kenny Chesney) \"Rugged Company\" by Willie Nelson)). Additionally, on DVD, you can watch a sixty-minute live performance by Grace Potter and the Nightcrawler: \"Live From Lollapalooza two thousand and eleven\" in Chicago. This time, Grace is very attractive, wearing a very short dress. In the song \"Medicine\", Grace jumps up, and you can see it in her black panties. Wow, what a show! ! ! In addition, there is a long and hot guitar for her group, wearing a short short skirt. This is a very powerful and sexy concert. Grace and her band played great music. The songs on the DVD are as follows: one. No Mary II. Only three love. On a hot summer night. Goodbye Kissfive. Sixth peace. Seventh way lower. Stop the bus. Second: two hundred and twenty-nine. Paris (Ooh La La) ten. Outside Waterleven. Medicine- \"Mamma Mia\", wow, what a horrible show! ! ! ! ! ! ! ! (Grace has a medicine that everyone needs.) I want to take her medicine! ! ! ! ! ! ! This is an excellent package, well worth the extra money. Just make sure you get the \"Super Deluxe Edition\" with CD + DVD. Thanks, I hope this update is helpful to you.","overall":5,"summary":"This Super Deluxe CD & \"SEXY\" & \"AWESOME\" DVD is MUCH Better Than Just the Basic CD Versions!!!!!!!!!!!!!!!!!","unixReviewTime":1339718400,"reviewTime":"06 15, 2012"}
{"orig_index":62164,"reviewerID":"A2RWGW6TGUX7E5","asin":"B007PXNUMU","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[4,5],"reviewText":"This \"Super Deluxe Edition\" is definitely the best choice for the new version of Grace & Nocturnals. On the CD, you'll find additional songs: \"Roulette\", \"You're Everywhere\", \"Stars\" (Kenny Chesney), \"Ragged Company\" (Willie Nelson)","overall":5,"summary":"This Super Deluxe CD & \"SEXY\" & \"AWESOME\" DVD is MUCH Better Than Just the Basic CD Versions!!!!!!!!!!!!!!!!!","unixReviewTime":1339718400,"reviewTime":"06 15, 2012"}
{"orig_index":62164,"reviewerID":"A2RWGW6TGUX7E5","asin":"B007PXNUMU","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[4,5],"reviewText":"This Super Deluxe Edition is definitely the best choice for the new version of Grace & Nocturnals. The song is listed in the Amazon product description, so there is no need to repeat that. In this \"Super Deluxe Edition\", you get the following bonus songs on CD: \"Roulette\", \"Everything For You\", \"Stars\" (Kenny Chesney), \"Ragged Company\" and Nocturnal: \"Live From Lollapalooza two thousand and eleven\" in Chicago.","overall":5,"summary":"This Super Deluxe CD & \"SEXY\" & \"AWESOME\" DVD is MUCH Better Than Just the Basic CD Versions!!!!!!!!!!!!!!!!!","unixReviewTime":1339718400,"reviewTime":"06 15, 2012"}
{"orig_index":62349,"reviewerID":"A2YDSDW61A7JCW","asin":"B0088XX3VY","reviewerName":"Cody","helpful":[0,0],"reviewText":"Yo, i be jan to did song wyo. It be my jam and all. I be show did to my friend","overall":5,"summary":"Jjamz","unixReviewTime":1356912000,"reviewTime":"12 31, 2012"}
{"orig_index":62349,"reviewerID":"A2YDSDW61A7JCW","asin":"B0088XX3VY","reviewerName":"Cody","helpful":[0,0],"reviewText":"Yes, I using a wyo song. This is my jam and everything. I made a song for my friend","overall":5,"summary":"Jjamz","unixReviewTime":1356912000,"reviewTime":"12 31, 2012"}
{"orig_index":62349,"reviewerID":"A2YDSDW61A7JCW","asin":"B0088XX3VY","reviewerName":"Cody","helpful":[0,0],"reviewText":"jan. It was Jan who was going to do the Song.","overall":5,"summary":"Jjamz","unixReviewTime":1356912000,"reviewTime":"12 31, 2012"}
{"orig_index":62349,"reviewerID":"A2YDSDW61A7JCW","asin":"B0088XX3VY","reviewerName":"Cody","helpful":[0,0],"reviewText":"Yes, I will make a Song of it. Yes,","overall":5,"summary":"Jjamz","unixReviewTime":1356912000,"reviewTime":"12 31, 2012"}
{"orig_index":63342,"reviewerID":"A1YLAOKY7A27KS","asin":"B00ADYYF6S","reviewerName":"RICHARD J. SPANBURGH \"1950'S GURU\"","helpful":[0,0],"reviewText":"Nice song I downloaded from this album on Amazon.com Cloud Player a easy way to download the music you want to Keep. Try IT I did","overall":4,"summary":"MUSIC FROM A LOST GENERATION  by Rich spanburgh 50'S GURU","unixReviewTime":1394668800,"reviewTime":"03 13, 2014"}
{"orig_index":63342,"reviewerID":"A1YLAOKY7A27KS","asin":"B00ADYYF6S","reviewerName":"RICHARD J. SPANBURGH \"1950'S GURU\"","helpful":[0,0],"reviewText":"Download the best song for this album on Amazon.com Cloud Player This is an easy way to download the music you want to save. Try it. I did it","overall":4,"summary":"MUSIC FROM A LOST GENERATION  by Rich spanburgh 50'S GURU","unixReviewTime":1394668800,"reviewTime":"03 13, 2014"}
{"orig_index":63342,"reviewerID":"A1YLAOKY7A27KS","asin":"B00ADYYF6S","reviewerName":"RICHARD J. SPANBURGH \"1950'S GURU\"","helpful":[0,0],"reviewText":"I downloaded this beautiful song from this album to Amazon.com cloud player. This is an easy way to download the music you want to save.","overall":4,"summary":"MUSIC FROM A LOST GENERATION  by Rich spanburgh 50'S GURU","unixReviewTime":1394668800,"reviewTime":"03 13, 2014"}
{"orig_index":63342,"reviewerID":"A1YLAOKY7A27KS","asin":"B00ADYYF6S","reviewerName":"RICHARD J. SPANBURGH \"1950'S GURU\"","helpful":[0,0],"reviewText":"Amazon.com Cloud Player An easy way to download music you want to save.","overall":4,"summary":"MUSIC FROM A LOST GENERATION  by Rich spanburgh 50'S GURU","unixReviewTime":1394668800,"reviewTime":"03 13, 2014"}
{"orig_index":63989,"reviewerID":"A182SY7I1OPU3A","asin":"B00CUKTG2Q","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[1,1],"reviewText":"i was really of the belief that franz were done, alex was producing, new side projects were more than hinted at and now there comes this, absolutely their finest work. period. every song pulsates with the now signature franz sound, the lyrics are direct, literal, oftentimes hilarious, the multitude of producers, usually a sign of worry--it all works there to great pop rock effect. \"evil eye\", the current single (and my personal favourite. ), \"right action\", and of course, \"goodbye lovers and friends\" are all standouts among standouts. pooh, and spend the extra coins for the deluxe edition. thirteen fab songs recorded LIVE at kong! studios, among them tons of stuff from 'right. ' (of course. ), but also an amazing franz\/donna summer cover of \"can't stop feeling\", \"do you want to\" and the classic \"ulyses\" (sic?). this is definitely one of the albums of two thousand and thirteen, along with arctic monkeys, churches, the national and suede. who, they came through in spades.","overall":5,"summary":"their best since 'you could have it so much better'.  period.","unixReviewTime":1380153600,"reviewTime":"09 26, 2013"}
{"orig_index":63989,"reviewerID":"A182SY7I1OPU3A","asin":"B00CUKTG2Q","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[1,1],"reviewText":"Every song follows the famous franz sound, direct lyrics, real lyrics , they are always funny, and there are many producers, usually a sign of concern - all of which have produced good pop effects there.), \"Proper action\" and, yes, \"Goodbye Lovers and friends\" are the best of the best.) of the wonderful Franz \/ Donna summer \"You Can't Stop Feeling\", \"Do You Want It?\" I truly believe that Franz is done, Alex is working, and the side project is not just advice, it is there now, it is definitely their best job. as well as Arctic Monkey, Church, Race and Suede. \"Evil Eye\", the one who is single now (which is also my favourite. Studio), there are many things from the \"right.\"","overall":5,"summary":"their best since 'you could have it so much better'.  period.","unixReviewTime":1380153600,"reviewTime":"09 26, 2013"}
{"orig_index":63989,"reviewerID":"A182SY7I1OPU3A","asin":"B00CUKTG2Q","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[1,1],"reviewText":"thirteen fab songs were recorded from kong! studios, along with many 'right' also amazing franz \/ donna summer covers of \"I can't help feeling\", \"do you like\"","overall":5,"summary":"their best since 'you could have it so much better'.  period.","unixReviewTime":1380153600,"reviewTime":"09 26, 2013"}
{"orig_index":63989,"reviewerID":"A182SY7I1OPU3A","asin":"B00CUKTG2Q","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[1,1],"reviewText":"songs every now and then and then sign for the franz soundtrack, the lyrics are straightforward, literary, often hilarious, multiplayer producers, often a worried signal-they’re all working there to have a big impact on pop rock . ), “Right action”, and of course, “Goodbye lovers and friends” all stand out. . I really believe that franz has done, Alex has done, the new projects on the side are more than described and now it’s coming, absolutely their best work. It is actually one of the gates of two thousand and thirteen, with its Arctic monkeys, church, national and suede. \"The evil eye\", the current one (and my favourite one. The studio, including a lot of 'right.'","overall":5,"summary":"their best since 'you could have it so much better'.  period.","unixReviewTime":1380153600,"reviewTime":"09 26, 2013"}