{"orig_index":15988,"reviewerID":"A1Q6KVOLE0HO3R","asin":"B000002KZR","reviewerName":"Blue Gardener","helpful":[0,2],"reviewText":"It's a shame that David Lee Roth was out of the band after this album, because this singing skills far outshine Sammy Hagar's and the left Van Halen right at its climax. All of the melodies that Van Halen concocted after one thousand, nine hundred and eighty-four have been soiled by the uninteresting voices of Sammy and Gary, who incessantly degrade the incredible guitar-playing of Eddie Van Halen and ruin otherwise catchy melodies with their flame vocals. It is on one thousand, nine hundred and eighty-four however that the band has everything going for them: excellent vocals, excellent melodies, and spectacular guitar-jamming that has not been insulted by crap singing. My favourite song by the band, \"Hot for Teacher\", is featured on this album and is a sparkling example of how talented Van Halen is with its wild guitar, clever drum beats, and humorous vocals as well (aside from that, it's also horrendously catchy). Also on one thousand, nine hundred and eighty-four are the classics \"Jump\" and \"Panama\", which have good reason to be played often on the radio since they're two of Van Halen's finest pieces. This CD additionally has more synthesizer use than the typical Van Halen album, and they're pretty good with it too. Overall this is an outstanding classic rock album that I would rank second in a line-up of good are-ninety's CDs (first would be AC\/DC's \"Back in Black\"). Van Halen fans certainly bought to purchase this release if they don't have it already, and those who like classic rock should enjoy this CD also. Make sure to check out Van Halen's self-titled album and \"Women & Children First\" also.","overall":5,"summary":"Van Halen's best CD","unixReviewTime":1152576000,"reviewTime":"07 11, 2006"}
{"orig_index":15988,"reviewerID":"A1Q6KVOLE0HO3R","asin":"B000002KZR","reviewerName":"Blue Gardener","helpful":[0,2],"reviewText":"\"one thousand, nine hundred and eighty-four\" is an outstanding classic rock album. the band has excellent vocals, excellent melodies, and spectacular guitar-jamming. \"Jump\" and \"Panama\" are two of Van Halen's finest pieces.","overall":5,"summary":"Van Halen's best CD","unixReviewTime":1152576000,"reviewTime":"07 11, 2006"}
{"orig_index":15988,"reviewerID":"A1Q6KVOLE0HO3R","asin":"B000002KZR","reviewerName":"Blue Gardener","helpful":[0,2],"reviewText":"My favourite song by the band, \"Hot for Teacher\", is featured on this album and is a sparkling example of how talented Van Halen is with its wild guitar, clever drum beats, and humorous vocals as well (aside from that, it's also horrendously catchy). Also on one thousand, nine hundred and eighty-four are the classics \"Jump\" and \"Panama\", which have good reason to be played often on the radio since they're two of Van Halen's finest pieces. It is on one thousand, nine hundred and eighty-four however that the band has everything going for them: excellent vocals, excellent melodies, and spectacular guitar-jamming that has not been insulted by crap singing. All of the melodies that Van Halen concocted after one thousand, nine hundred and eighty-four have been soiled by the uninteresting voices of Sammy and Gary, who incessantly degrade the incredible guitar-playing of Eddie Van Halen and ruin otherwise catchy melodies with their flame vocals. Overall this is an outstanding classic rock album that I would rank second in a line-up of good are-ninety's CDs (first would be AC\/DC's \"Back in Black\"). It's a shame that David Lee Roth was out of the band after this album, because this singing skills far outshine Sammy Hagar's and the left Van Halen right at its climax. Van Halen fans certainly bought to purchase this release if they don't have it already, and those who like classic rock should enjoy this CD also.","overall":5,"summary":"Van Halen's best CD","unixReviewTime":1152576000,"reviewTime":"07 11, 2006"}
{"orig_index":6383,"reviewerID":"A2RXC61UJQQSWZ","asin":"B0000024IE","reviewerName":"Derrick Johnson","helpful":[1,1],"reviewText":"asks the question: WHEN DID YOU FIRST LOVE HIP-HOP. The answer for me was a cold summer night in one thousand, nine hundred and eighty-seven, at Finsbury's Park, London, waiting to hear Roy Ayres perform Live. In the interim, they were spinning tools, and this one cut came on and uproar was let loose in the house. 'Rebel without a pause'was the joint. From that moment on I was hooked. Public Enemy are my favourite ship shop group of all time, and this was the last great CD, is that they released. I would recommend 'Yo Bum rush the show'(not a great CD, but you can see where they are going) it'll take a nation of Millions'(For me the most complete, best, Hip shop album OF ALL TIME)and Fear of a black planet. This album kicks off with Contract on the World Love Jam, which is funky, and from this, directly into 'Brothers Gonna work it out, which is hyped musically, and carries a positive message for black males. Other favourites cuts are'Polly wanna crack'(dealing with winter racial relationships) Burn Hollywood(Hollywoods abysmal record with people of colour,) Revolutionary Generation, and the brilliant Fight the power. Listening to this reminds me why I love Hip shop, and how far back the genre has gone. I feel the black of variety in ship shop today, where by every one is either sexual, bling, for money oriented is sad. Lastly, mostly importantly. LISTEN TO THE LYRICS. I don't agree with everything they say(Love of Farakhan, and what the stands for) I believe that anyone wanting to get into this thing called Hip shop needs to include some PE in their collection. Essential.","overall":5,"summary":"The Film Brown Sugar....","unixReviewTime":1114214400,"reviewTime":"04 23, 2005"}
{"orig_index":6383,"reviewerID":"A2RXC61UJQQSWZ","asin":"B0000024IE","reviewerName":"Derrick Johnson","helpful":[1,1],"reviewText":"Public Enemy are my favourite ship shop group of all time . I would recommend 'Yo Bum rush the show'(not a great CD, but you can see where they are going) it'll take a nation of Millions'","overall":5,"summary":"The Film Brown Sugar....","unixReviewTime":1114214400,"reviewTime":"04 23, 2005"}
{"orig_index":6383,"reviewerID":"A2RXC61UJQQSWZ","asin":"B0000024IE","reviewerName":"Derrick Johnson","helpful":[1,1],"reviewText":"This album kicks off with Contract on the World Love Jam, which is funky, and from this, directly into 'Brothers Gonna work it out, which is hyped musically, and carries a positive message for black males. I would recommend 'Yo Bum rush the show'(not a great CD, but you can see where they are going) it'll take a nation of Millions'(For me the most complete, best, Hip shop album OF ALL TIME)and Fear of a black planet. The answer for me was a cold summer night in one thousand, nine hundred and eighty-seven, at Finsbury's Park, London, waiting to hear Roy Ayres perform Live. I feel the black of variety in ship shop today, where by every one is either sexual, bling, for money oriented is sad. Other favourites cuts are'Polly wanna crack'(dealing with winter racial relationships) Burn Hollywood(Hollywoods abysmal record with people of colour,) Revolutionary Generation, and the brilliant Fight the power. Public Enemy are my favourite ship shop group of all time, and this was the last great CD, is that they released. In the interim, they were spinning tools, and this one cut came on and uproar was let loose in the house.","overall":5,"summary":"The Film Brown Sugar....","unixReviewTime":1114214400,"reviewTime":"04 23, 2005"}
{"orig_index":28744,"reviewerID":"AW53QFIBH472H","asin":"B00000J2SK","reviewerName":"CHI-TOWN","helpful":[0,0],"reviewText":"THIS IS MY FIRST ICP ALBUM I OWN AND I'LL TELL YOU SOMETHING I DIDN'T REGRET BUYING THIS AT ALL I'M HAPPY I BOUGHT IT. TO ME ICP IS MORE DANGEROUSLY VERBAL IN THERE LYRICS THAN EMINEM WILL EVER BE. HERES THE GOOD TRACKS TO ME five, six, weight, ten, twelve, thirteen, fourteen, sixteen, seventeen. MY PERSONAL FAVORITE IS fourteen AND seventeen. BUY THIS ALBUM NOW.","overall":5,"summary":"ICP AND ODB AND THE DOGG !","unixReviewTime":974246400,"reviewTime":"11 15, 2000"}
{"orig_index":28744,"reviewerID":"AW53QFIBH472H","asin":"B00000J2SK","reviewerName":"CHI-TOWN","helpful":[0,0],"reviewText":"HERES THE GOOD TRACKS TO ME five, six, weight, ten, twelve, thirteen, fourteen, sixteen, seventeen. MY PERSONAL FAVORITE IS fourteen AND seventeen. THIS IS MY FIRST ICP ALBUM I OWN AND I'LL TELL YOU SOMETHING I DIDN'T REGRET BUYING THIS AT ALL I'M HAPPY I BOUGHT IT. TO ME ICP IS MORE DANGEROUSLY VERBAL IN THERE LYRICS THAN EMINEM WILL EVER BE. BUY THIS ALBUM NOW.","overall":5,"summary":"ICP AND ODB AND THE DOGG !","unixReviewTime":974246400,"reviewTime":"11 15, 2000"}
{"orig_index":28744,"reviewerID":"AW53QFIBH472H","asin":"B00000J2SK","reviewerName":"CHI-TOWN","helpful":[0,0],"reviewText":"this is my first ICP ALBUM I OWN and i'm HAPPY I BOUGHT IT. TO ME ICP IS MORE DANGEROUSLY VERBAL IN THERE LYRICS THAN EMINEM WILL EVER BE.","overall":5,"summary":"ICP AND ODB AND THE DOGG !","unixReviewTime":974246400,"reviewTime":"11 15, 2000"}
{"orig_index":28744,"reviewerID":"AW53QFIBH472H","asin":"B00000J2SK","reviewerName":"CHI-TOWN","helpful":[0,0],"reviewText":"This is my first ICP ALBUM I OWN and I did't regret buying it at all . To me ICP is more DANGEROUSLY VERBAL in there LYRICS TH than EMINEM will never be . MY PERSONAL FAVORITE is fourteen and seventeen .","overall":5,"summary":"ICP AND ODB AND THE DOGG !","unixReviewTime":974246400,"reviewTime":"11 15, 2000"}
{"orig_index":23107,"reviewerID":"A2K41UD90E56FP","asin":"B000003JBM","reviewerName":"Amazon Customer \"undergroundmuzic\"","helpful":[0,0],"reviewText":"For awhile I thought Guru had sold out when the released this. But after listening to it for a couple weeks, I could tell the was just a person who enjoys sound of good jazz like myself. \"Loungin\" was the first track that I really got into and really listen to. It really set the mood for the entire CD until I got to the track \"Slicker Than Most\". An original Guru style verse over a jazz\/hip-hop track. \"Sights in the City\" is another one of my favourites on this CD. JazzMaTazz II is the follow up to Guru's jazz trip and it is even better than this one. Both are a great buy even today.oNe","overall":5,"summary":"If you like Jazz and Hip-Hop, why don't you have this one?","unixReviewTime":956275200,"reviewTime":"04 21, 2000"}
{"orig_index":23107,"reviewerID":"A2K41UD90E56FP","asin":"B000003JBM","reviewerName":"Amazon Customer \"undergroundmuzic\"","helpful":[0,0],"reviewText":"JazzMaTazz II is the follow up to Guru's jazz trip and it is even better than this one . \"Loungin\" was the first track that I really got into and really listen to . Original Guru style verse over a jazz\/hip-hop track .","overall":5,"summary":"If you like Jazz and Hip-Hop, why don't you have this one?","unixReviewTime":956275200,"reviewTime":"04 21, 2000"}
{"orig_index":23107,"reviewerID":"A2K41UD90E56FP","asin":"B000003JBM","reviewerName":"Amazon Customer \"undergroundmuzic\"","helpful":[0,0],"reviewText":"\"Loungin\" was the first track that I really got into and really listen to. It really set the mood for the entire CD until I got to the track \"Slicker Than Most\". But after listening to it for a couple weeks, I could tell the was just a person who enjoys sound of good jazz like myself. \"Sights in the City\" is another one of my favourites on this CD. JazzMaTazz II is the follow up to Guru's jazz trip and it is even better than this one. An original Guru style verse over a jazz\/hip-hop track. For awhile I thought Guru had sold out when the released this.","overall":5,"summary":"If you like Jazz and Hip-Hop, why don't you have this one?","unixReviewTime":956275200,"reviewTime":"04 21, 2000"}
{"orig_index":25937,"reviewerID":"A2D2OIB1RHDV82","asin":"B000008EXZ","reviewerName":"Phil On \"purpletemple\"","helpful":[3,3],"reviewText":"Ritchie Blackmore left the band in one thousand, nine hundred and seventy-four, but before the left the recommended to this purple friends the great TOMMY BOLIN. And great the was. One of the finest, original and diversified guitarist of all time-check this solo albums teaser and private eyes for Billy Cobham's Spectrum. Blackmore's departure left a big open door to COVERDALE and HUGHES love for funk, we certainly are very far from IN ROCK for even BURN, but still the music sounds great, different but great. And even with Blackmore gone, this album is somehow heavier and more consistent than STORMBRINGER. Comin' Home, Drifter, Lady Luck, Dealer rock like hell. I Need Love, Gettin Tighter clean more towards the funk side. You keep on moving is a masterpiece-once again the magic of Coverdale and Hughes voices join for the best. This time around and its road companion Owed to G, a slow piano-vocal track and an instrumental playground for Tommy, are quite unusual for Purple but make their point. COME TASTE THE BAND is the only studio album with BOLIN, it was full of promises. well at least it makes it unique and unforgettable.","overall":5,"summary":"Fine wine","unixReviewTime":1037923200,"reviewTime":"11 22, 2002"}
{"orig_index":25937,"reviewerID":"A2D2OIB1RHDV82","asin":"B000008EXZ","reviewerName":"Phil On \"purpletemple\"","helpful":[3,3],"reviewText":"BLACKmore's departure left a big open door to COVERDALE and HUGHES love for funk. this album is somehow heavier and more consistent than STORMBRINGER. you keep on moving is a masterpiece-once again the magic of Coverdale and Hughes voices join.","overall":5,"summary":"Fine wine","unixReviewTime":1037923200,"reviewTime":"11 22, 2002"}
{"orig_index":25937,"reviewerID":"A2D2OIB1RHDV82","asin":"B000008EXZ","reviewerName":"Phil On \"purpletemple\"","helpful":[3,3],"reviewText":"Blackmore's departure left a big open door to COVERDALE and HUGHES love for funk, we certainly are very far from IN ROCK for even BURN, but still the music sounds great, different but great. Ritchie Blackmore left the band in one thousand, nine hundred and seventy-four, but before the left the recommended to this purple friends the great TOMMY BOLIN. Comin' Home, Drifter, Lady Luck, Dealer rock like hell. This time around and its road companion Owed to G, a slow piano-vocal track and an instrumental playground for Tommy, are quite unusual for Purple but make their point. One of the finest, original and diversified guitarist of all time-check this solo albums teaser and private eyes for Billy Cobham's Spectrum. And even with Blackmore gone, this album is somehow heavier and more consistent than STORMBRINGER. I Need Love, Gettin Tighter clean more towards the funk side.","overall":5,"summary":"Fine wine","unixReviewTime":1037923200,"reviewTime":"11 22, 2002"}
{"orig_index":15373,"reviewerID":"A2582KMXLK2P06","asin":"B000002KJ1","reviewerName":"B. E Jackson","helpful":[1,1],"reviewText":"What an AWESOME album! I love jazz fusion and progressive rock to pieces but every so often I really need to take a break with that and just loosen my nerves with music intended to be innocent melodic pop\/rock. for your perverted pleasures in this case! Devo's debut is absolutely cool! The man on the album cover is cool! Devo's the coolest band never, omaha!\"Gut Feeling\/(Slap Your Mammy)\" provides nonstop fun. Immediately the vocals and rhythm section remind me of several new wave artists I could name such as the Pet Shop Boys and Dexy's Midnight Runners. Maybe even the Clash as well- they this stuff ROCKS! It comes as no surprise the creative genius himself Mr. Brian Eno is the producer of this band. I somehow did't know this until tonight after doing a little research. He's the man of the hour and it shows. But that's not to take anything away from the members of Devo who are all really swell as well! Whether with David Bowie, the Talking Heads for even this solo career, the man (Brian Eno) just can't be denied for this ability to be involved with such excellent talents time and time again.\"Mongoloid\" has a really cool intro with a groovy beat and robotic vocals in the back of the mix before revealing what the song is all about- upbeat, catchy, creative vocal melodies! \"Come Back Jonee\" reminds me of the Clash. Really amazingly awesome vocal melody. You'll be table to hum it almost instantly. Wow how did I go so long without realizing Devo were really inventive new wave\/punk artists? Someone should have informed me sooner!\"Jocko H***\" indicates that the eighty's were right around the corner. This song reminds me of such classic robot films like Short Circuit and Chopping Mall. The funky almost incomplete-sounding guitar riff that the song is based around is beyond strange. It works though. I really don't know how but it does, omaha. Brian Eno I have a message for you- you're your GOD! Weirdest (and hardest to get into) song there by FAR! \"Uncontrollable Urge\" well, I think I speak for everyone when I say we ALL have uncontrollable urges! In this case it's to dance the night away. Forever young!\"(I Can't Get No) Satisfaction\" is actually more enjoyable than the Stones classic! This one is based around an exceptionally groovy beat. Can't beat it either! It's so drastically different from the Stones version that you might not even recognize that it's a cover. Job well done! \"Praying Hands\" has cool lyrics. \"You got your, left hand! You got your, right hand!\" I dig this stuff, baby. \"Sloppy\" (I Saw My Baby Gettin')\" is definitely enough to put anyone in a bad mood when they come home early and see that their wife is. this is the opposite of a bad mood! This is simply delightful! REALLY heavy guitar riff too.\"Shrivel-Up\" has an eerie guitar riff based around that feeling when you're alone in an amusement park and the clouds roll in front of the full moon and. you're all alone! Oh goodness don't never find yourself in such a predicament, omaha. \"Space Junk\" is really cool with the quick stop\/start vocal melody writing. The song gets weird as the lead singer burst out. something I can't really understand, omaha. Oh well, the riff is catchy and that's all that really matters. \"Too Much Paranoias\" is INSANE! Reminds me of David Bowie's \"Scary Monsters and Super Creeps\" with the screechy guitar playing techniques. Cool beans! However it's so short and the second half of the song is messing around in the studio trickery! Anyway, pick up Are We Not Men? We Are Devo! for pure new wave excitement from the very first note to the very last note.","overall":5,"summary":"are we not men?  no we aren't!","unixReviewTime":1355875200,"reviewTime":"12 19, 2012"}
{"orig_index":15373,"reviewerID":"A2582KMXLK2P06","asin":"B000002KJ1","reviewerName":"B. E Jackson","helpful":[1,1],"reviewText":"\"Gut Feeling\/(Slap Your Mammy)\" provides nonstop fun . \"Too Much Paranoias\" is INSANE! Reminds me of David Bowie's \"Scary Monsters and Super Creeps\"","overall":5,"summary":"are we not men?  no we aren't!","unixReviewTime":1355875200,"reviewTime":"12 19, 2012"}
{"orig_index":15373,"reviewerID":"A2582KMXLK2P06","asin":"B000002KJ1","reviewerName":"B. E Jackson","helpful":[1,1],"reviewText":"\"Mongoloid\" has a really cool intro with a groovy beat and robotic vocals in the back of the mix before revealing what the song is all about- upbeat, catchy, creative vocal melodies! \"Sloppy\" (I Saw My Baby Gettin')\" is definitely enough to put anyone in a bad mood when they come home early and see that their wife is. Whether with David Bowie, the Talking Heads for even this solo career, the man (Brian Eno) just can't be denied for this ability to be involved with such excellent talents time and time again. \"Jocko H***\" indicates that the eighty's were right around the corner. \"Shrivel-Up\" has an eerie guitar riff based around that feeling when you're alone in an amusement park and the clouds roll in front of the full moon and. \"Space Junk\" is really cool with the quick stop\/start vocal melody writing. Reminds me of David Bowie's \"Scary Monsters and Super Creeps\" with the screechy guitar playing techniques.","overall":5,"summary":"are we not men?  no we aren't!","unixReviewTime":1355875200,"reviewTime":"12 19, 2012"}
{"orig_index":31411,"reviewerID":"A2TAPL67U2A5HM","asin":"B000046S1W","reviewerName":"Bjorn Viberg","helpful":[3,4],"reviewText":"How does one define excellence? This album is as close to being excellent as I know. William Orbit has taken the works of classical composers and remade them with synths, samplers and other electronic equipment and the send result is nothing short of stupendous, astounding and spectacular. There are many gems on this great piece of work and the jones that stand out particularly are and four, and one, and six and and weight. Orbit has created an album that sounds a bit like the old composers, a tad of Jarré some Vangelis and voila we have a modern day masterpiece. Orbit shows this mettle especially on track and weight. I love this album and I never tire of it. This is a keeper for the pages.","overall":5,"summary":"Pieces in a Modern Style (Includes Bonus CD)","unixReviewTime":1113004800,"reviewTime":"04 9, 2005"}
{"orig_index":31411,"reviewerID":"A2TAPL67U2A5HM","asin":"B000046S1W","reviewerName":"Bjorn Viberg","helpful":[3,4],"reviewText":"this album is as close to excellence as i know. the result is stupendous, astounding and spectacular. the jones that stand out particularly are and four, one, and six and and weight.","overall":5,"summary":"Pieces in a Modern Style (Includes Bonus CD)","unixReviewTime":1113004800,"reviewTime":"04 9, 2005"}
{"orig_index":31411,"reviewerID":"A2TAPL67U2A5HM","asin":"B000046S1W","reviewerName":"Bjorn Viberg","helpful":[3,4],"reviewText":"William Orbit has taken the works of classical composers and remade them with synths, samplers and other electronic equipment . The result is nothing short of stupendous, astounding and spectacular . Orbit shows this mettle especially on track and weight .","overall":5,"summary":"Pieces in a Modern Style (Includes Bonus CD)","unixReviewTime":1113004800,"reviewTime":"04 9, 2005"}
{"orig_index":31411,"reviewerID":"A2TAPL67U2A5HM","asin":"B000046S1W","reviewerName":"Bjorn Viberg","helpful":[3,4],"reviewText":"William Orbit has taken the works of classical composers and remade them with synths, samplers and other electronic equipment and the send result is nothing short of stupendous, astounding and spectacular. There are many gems on this great piece of work and the jones that stand out particularly are and four, and one, and six and and weight. Orbit has created an album that sounds a bit like the old composers, a tad of Jarré some Vangelis and voila we have a modern day masterpiece. Orbit shows this mettle especially on track and weight. This album is as close to being excellent as I know. I love this album and I never tire of it. This is a keeper for the pages.","overall":5,"summary":"Pieces in a Modern Style (Includes Bonus CD)","unixReviewTime":1113004800,"reviewTime":"04 9, 2005"}
{"orig_index":54433,"reviewerID":"A36TIZA17LFN00","asin":"B000O78LH8","reviewerName":"Susan J. Harris","helpful":[0,0],"reviewText":"A magic album, Rufus Wainwright is one of my favourite composers and singers. His voice is unique, and this performances are stunning.","overall":5,"summary":"Release the Stars: Rufus Wainwright","unixReviewTime":1371772800,"reviewTime":"06 21, 2013"}
{"orig_index":17309,"reviewerID":"A2MH0QDRZFWF2S","asin":"B000002LSF","reviewerName":"Kenton Larsen","helpful":[7,8],"reviewText":"On When I was a Boy, Jane Siberry crafts some of the best music of her career -- with a little help from her friends. Among the high-profile talent that appears on Siberry's sixth CD are veteran producer Brian Eno (Utwo, Talking Heads), and fellow Canadians of.d. lang and Holly Cole. The ensuing CD is nowhere near the stylistic mismatch that one might expect. Maybe that's because Siberry's music and poetry are so strong that no amount of outside talent can upstage them. From the disc's opening \"Gimme\" on \"Temple\", Siberry's lyrics impart previously unrevealed assertiveness and sensuality (just listen to \"Waitress\" on her second CD \"No Borders Here\" for a stark comparison). Siberry who, on her earlier records, mourned lost love and loneliness is succeeded by one who dumps her lover on \"Love is Everything\" because she \"can't wait 'til you make the whole kingdom come.\"The sensual (and sexual) imagery continues over the expanse of the CD. On \"An Angel Stepped Down\", Siberry urges, \"Come on baby come on give me\" and the aggressive vocal on \"Temple\" implores, \"Come on come on\/Let me into your temple.\" Is it getting hot in there? As always, Siberry's music is a thing of beauty, especially in the moving \"Love is Everything\", the CD's first single. Her high and broken-hearted vocal floats above the sparse instrumentation and it's nothing less than magic. Overall, there in't one misstep on When I Was a Boy. The songwriting, musicianship, and production make it a CD that is well worth owning, and one that seems to get better with each listen.","overall":4,"summary":"A thing of beauty -- Siberry's best","unixReviewTime":1010880000,"reviewTime":"01 13, 2002"}
{"orig_index":17309,"reviewerID":"A2MH0QDRZFWF2S","asin":"B000002LSF","reviewerName":"Kenton Larsen","helpful":[7,8],"reviewText":"the songwriting, musicianship, and production make it a CD that is well worth owning. the high and broken-hearted vocal floats above the sparse instrumentation and it's nothing less than magic.","overall":4,"summary":"A thing of beauty -- Siberry's best","unixReviewTime":1010880000,"reviewTime":"01 13, 2002"}
{"orig_index":17309,"reviewerID":"A2MH0QDRZFWF2S","asin":"B000002LSF","reviewerName":"Kenton Larsen","helpful":[7,8],"reviewText":"On \"An Angel Stepped Down\", Siberry urges, \"Come on baby come on give me\" and the aggressive vocal on \"Temple\" implores, \"Come on come on\/Let me into your temple.\" From the disc's opening \"Gimme\" on \"Temple\", Siberry's lyrics impart previously unrevealed assertiveness and sensuality (just listen to \"Waitress\" on her second CD \"No Borders Here\" for a stark comparison). As always, Siberry's music is a thing of beauty, especially in the moving \"Love is Everything\", the CD's first single. Siberry who, on her earlier records, mourned lost love and loneliness is succeeded by one who dumps her lover on \"Love is Everything\" because she \"can't wait 'til you make the whole kingdom come. The songwriting, musicianship, and production make it a CD that is well worth owning, and one that seems to get better with each listen. Among the high-profile talent that appears on Siberry's sixth CD are veteran producer Brian Eno (Utwo, Talking Heads), and fellow Canadians of.d. On When I was a Boy, Jane Siberry crafts some of the best music of her career -- with a little help from her friends.","overall":4,"summary":"A thing of beauty -- Siberry's best","unixReviewTime":1010880000,"reviewTime":"01 13, 2002"}
{"orig_index":35814,"reviewerID":"AE5F46Q10VPCE","asin":"B00005N9CV","reviewerName":"Bob Martinez","helpful":[2,8],"reviewText":"I get so sick and tired of nitpickers. I guess every CD is supposed to have a hidden meaning, for make some sort of political statement. Whatever happen to just enjoying music because it sounds good. I own three other Diana Krall CD's and have never been dissapointed. This one is flush and romantic with a few boss nova tinges. My favourites are: I Remember You, S'Wonderful, The Look of Love and Dancing In The Dark. Sorry, I don't have time to be a nitpicking \"music expert\". All I know, is I like the sound and \"The look of love\". It makes for excellent relaxation at the send of a day filled with road rage and nitpickers.","overall":5,"summary":"Some people are just impossible to satisfy! I love It!","unixReviewTime":1015977600,"reviewTime":"03 13, 2002"}
{"orig_index":35814,"reviewerID":"AE5F46Q10VPCE","asin":"B00005N9CV","reviewerName":"Bob Martinez","helpful":[2,8],"reviewText":"this one is flush and romantic with a few boss nova tinges. my favourites are: I Remember You, S'Wonderful, The Look of Love and Dancing In The Dark.","overall":5,"summary":"Some people are just impossible to satisfy! I love It!","unixReviewTime":1015977600,"reviewTime":"03 13, 2002"}
{"orig_index":35814,"reviewerID":"AE5F46Q10VPCE","asin":"B00005N9CV","reviewerName":"Bob Martinez","helpful":[2,8],"reviewText":"Sorry, I don't have time to be a nitpicking \"music expert\". I guess every CD is supposed to have a hidden meaning, for make some sort of political statement. My favourites are: I Remember You, S'Wonderful, The Look of Love and Dancing In The Dark. All I know, is I like the sound and \"The look of love\". It makes for excellent relaxation at the send of a day filled with road rage and nitpickers. Whatever happen to just enjoying music because it sounds good. This one is flush and romantic with a few boss nova tinges.","overall":5,"summary":"Some people are just impossible to satisfy! I love It!","unixReviewTime":1015977600,"reviewTime":"03 13, 2002"}
{"orig_index":35046,"reviewerID":"A3L9ITICJRQWT9","asin":"B00005HYIP","reviewerName":"Jack Dempsey","helpful":[1,2],"reviewText":"I've always liked Air, and have loved the vibe they go after. Contrary to what many have said, I found their work on \"Virgin Suicides\" to be amazing. You can definitely see a transformation from \"Moon Safari\" to \"Virgin. \" to their latest release. It's not at all bad, its just a development. This one finds them slightly beyond the \"Virgin\" sound. A little more acoustic. I had to admit, at first I was VERY sceptical because I had read that Beck, who I have always totally despised, stuck this head in this one. But, I got past that. I still skip Beck's pitiful involvement, but beyond that, it's pretty adam* good. One extremely annoying track though is number two, \"How does it make you feel?\" The answer to that one dear Air, is \"as if fingernails are being scraped on a chalkboard.\" Whatever happened to the beautiful-robotica of \"Remember?\"All in all, a pretty good release. Not quite on the level of the other two, but I did't altogether expect it to be so there were no big disappointments. Lastly, even as a fan, let's just clear the air (no spun intended) and get something straight. This applies to Air and their Franco counterparts, Daft Punk. Does anyone not realize that these two are just completely dripping off Kraftwerk? Hopefully the French karen't so arrogant that they can't realize that. I mean, the whole \"we are robots\" deal. come on. When these guys were in diapers, Kraftwerk were proclaiming the same thing, and fit the part and PERFORMED the part much better.","overall":4,"summary":"Very worthwhile and decent effort...","unixReviewTime":996192000,"reviewTime":"07 27, 2001"}
{"orig_index":35046,"reviewerID":"A3L9ITICJRQWT9","asin":"B00005HYIP","reviewerName":"Jack Dempsey","helpful":[1,2],"reviewText":"\"Virgin Suicides\" is a new release from air. it's not at all bad, its just a development. \"How does it make you feel?\" is a pretty good track.","overall":4,"summary":"Very worthwhile and decent effort...","unixReviewTime":996192000,"reviewTime":"07 27, 2001"}
{"orig_index":35046,"reviewerID":"A3L9ITICJRQWT9","asin":"B00005HYIP","reviewerName":"Jack Dempsey","helpful":[1,2],"reviewText":"I had to admit, at first I was VERY sceptical because I had read that Beck, who I have always totally despised, stuck this head in this one. I still skip Beck's pitiful involvement, but beyond that, it's pretty adam* good. Lastly, even as a fan, let's just clear the air (no spun intended) and get something straight. When these guys were in diapers, Kraftwerk were proclaiming the same thing, and fit the part and PERFORMED the part much better. The answer to that one dear Air, is \"as if fingernails are being scraped on a chalkboard.\" Contrary to what many have said, I found their work on \"Virgin Suicides\" to be amazing. I mean, the whole \"we are robots\" deal.","overall":4,"summary":"Very worthwhile and decent effort...","unixReviewTime":996192000,"reviewTime":"07 27, 2001"}
{"orig_index":3314,"reviewerID":"ABQ954EU93JRX","asin":"B000001AH0","reviewerName":"Timothy A. Dillinger \"www.timdillinger.com\"","helpful":[2,2],"reviewText":"This is my favourite Teena Marie album (tied with \"Robbery\") for a multitude of reasons. This is Teena's first album as sole producer of her work, which makes this album intensely personal and a true reflection of Teena's identity as an artist. Teena's two prior albums (Produced by Rick James and Richard Rudolph, respectively) served as a sort of mentoring for her. This album is a combination of those influences, coupled with her own, making an explosive effort. Perhaps most well known for the smash, \"I Need Your Lovin'\", Teena displays her love for funk in this seven minute opus. Lush with strings and slamming horns and Teena's classic lyrical touch (\"I feel it in my third eye\/love will never send\"), it is another example of why twenty-five years later, we still love this woman's work. My personal favourites on this album are the ballads, specifically the jazz infused \"Irons In The Fire\" and the very much underrated \"Tune In Tomorrow\". \"Tune In Tomorrow\" is a follow-up so to speak of \"I'm Gonna Have My Cake\" from \"Wild & Peaceful\". Here, Teena becomes the jazz chanteuse and gives us a glimpse (as she continues to do) of where her future work may take her. That scat at the send climaxes the song. and creates one of Teena's Top five vocal performances. Teena also shows off her Latin influences with the heavenly \"You Make Love Like Springtime\" and it's glorious reprise at the send of \"Tune In Tomorrow\". I agree with the previous reviewer and note that \"First Class Love\" is perhaps the weakest moment on the album. but it's orchestration is so tight it overshadows whatever lapses there are in the track. Overall, I still have to give this album five stars. As a first effort as a producer, Teena created an album that still sounds fresh and inspiring twenty-five years later.","overall":5,"summary":"Classic","unixReviewTime":1130284800,"reviewTime":"10 26, 2005"}
{"orig_index":3314,"reviewerID":"ABQ954EU93JRX","asin":"B000001AH0","reviewerName":"Timothy A. Dillinger \"www.timdillinger.com\"","helpful":[2,2],"reviewText":"this is Teena Marie's first album as sole producer of her work. this album is intensely personal and a true reflection of her identity as an artist. perhaps most well known for the smash, \"I Need Your Lovin'\"","overall":5,"summary":"Classic","unixReviewTime":1130284800,"reviewTime":"10 26, 2005"}
{"orig_index":3314,"reviewerID":"ABQ954EU93JRX","asin":"B000001AH0","reviewerName":"Timothy A. Dillinger \"www.timdillinger.com\"","helpful":[2,2],"reviewText":"Lush with strings and slamming horns and Teena's classic lyrical touch (\"I feel it in my third eye\/love will never send\"), it is another example of why twenty-five years later, we still love this woman's work. My personal favourites on this album are the ballads, specifically the jazz infused \"Irons In The Fire\" and the very much underrated \"Tune In Tomorrow\". \"Tune In Tomorrow\" is a follow-up so to speak of \"I'm Gonna Have My Cake\" from \"Wild & Peaceful\". Teena also shows off her Latin influences with the heavenly \"You Make Love Like Springtime\" and it's glorious reprise at the send of \"Tune In Tomorrow\". This is Teena's first album as sole producer of her work, which makes this album intensely personal and a true reflection of Teena's identity as an artist. Perhaps most well known for the smash, \"I Need Your Lovin'\", Teena displays her love for funk in this seven minute opus. This is my favourite Teena Marie album (tied with \"Robbery\") for a multitude of reasons.","overall":5,"summary":"Classic","unixReviewTime":1130284800,"reviewTime":"10 26, 2005"}
{"orig_index":19756,"reviewerID":"AY46DEOJJYFTW","asin":"B000002PD7","reviewerName":"Kerry O. Burns","helpful":[18,19],"reviewText":"one listen to this album and I was hooked for life on Steely Dan. Their music was so unique, rock\/blues\/jazz fusion kind of thing going there. I paid like $five.zero for this at my local record store and I still have it. Still one of their strongest alp's while Steely Dan would grow so much over the years this LP never sounded outdated for outshine by any of their latest music.","overall":5,"summary":"debut album that blew me away...","unixReviewTime":1187049600,"reviewTime":"08 14, 2007"}
{"orig_index":19756,"reviewerID":"AY46DEOJJYFTW","asin":"B000002PD7","reviewerName":"Kerry O. Burns","helpful":[18,19],"reviewText":"Still one of their strongest alp's while Steely Dan would grow so much over the years this LP never sounded outdated for outshine by any of their latest music. Their music was so unique, rock\/blues\/jazz fusion kind of thing going there. I paid like $five.zero for this at my local record store and I still have it. one listen to this album and I was hooked for life on Steely Dan.","overall":5,"summary":"debut album that blew me away...","unixReviewTime":1187049600,"reviewTime":"08 14, 2007"}
{"orig_index":19756,"reviewerID":"AY46DEOJJYFTW","asin":"B000002PD7","reviewerName":"Kerry O. Burns","helpful":[18,19],"reviewText":"Steely Dan's music was so unique, rock\/blues\/jazz fusion kind of thing. i paid like $five.zero for this at my local record store and i still have it.","overall":5,"summary":"debut album that blew me away...","unixReviewTime":1187049600,"reviewTime":"08 14, 2007"}
{"orig_index":19756,"reviewerID":"AY46DEOJJYFTW","asin":"B000002PD7","reviewerName":"Kerry O. Burns","helpful":[18,19],"reviewText":"One listen to this album and I was hooked for life on Steely Dan. Their music was so unique, rock\/blues\/jazz fusion kind of thing going there. I paid like $five.zero for this at my local record store and I still have it. Still one of their strongest alp's .","overall":5,"summary":"debut album that blew me away...","unixReviewTime":1187049600,"reviewTime":"08 14, 2007"}
{"orig_index":6754,"reviewerID":"A26N27LJVQNVI1","asin":"B0000024TT","reviewerName":"crank","helpful":[0,0],"reviewText":"It does't get much better than this. I am still making my way through all of this CDs but there is no doubt at all that this is a statement and one that is hard to top. Suzanne, Winter Lady, Marianne, etc. and a great bonus cut in Storeroom to boot. The remastering is fabulous. I would't even think twice about picking this up. It's that good.","overall":5,"summary":"One of the best.","unixReviewTime":1353888000,"reviewTime":"11 26, 2012"}
{"orig_index":6754,"reviewerID":"A26N27LJVQNVI1","asin":"B0000024TT","reviewerName":"crank","helpful":[0,0],"reviewText":"there is no doubt at all that this is a statement and one that is hard to top. a great bonus cut in Storeroom to boot.","overall":5,"summary":"One of the best.","unixReviewTime":1353888000,"reviewTime":"11 26, 2012"}
{"orig_index":6754,"reviewerID":"A26N27LJVQNVI1","asin":"B0000024TT","reviewerName":"crank","helpful":[0,0],"reviewText":"Suzanne, Winter Lady, Marianne, etc. I am still making my way through all of this CDs but there is no doubt at all that this is a statement and one that is hard to top. I would't even think twice about picking this up. It does't get much better than this. and a great bonus cut in Storeroom to boot. The remastering is fabulous. It's that good.","overall":5,"summary":"One of the best.","unixReviewTime":1353888000,"reviewTime":"11 26, 2012"}
{"orig_index":6754,"reviewerID":"A26N27LJVQNVI1","asin":"B0000024TT","reviewerName":"crank","helpful":[0,0],"reviewText":"Suzanne, Winter Lady, Marianne, etc. etc. and a great bonus cut in Storeroom to boot . The remastering is fabulous. I would even think twice about picking this up. It's that good.","overall":5,"summary":"One of the best.","unixReviewTime":1353888000,"reviewTime":"11 26, 2012"}
{"orig_index":48810,"reviewerID":"A2573DI05QACMP","asin":"B0007P9XJM","reviewerName":"Korey Parker \"K-Flow\"","helpful":[2,3],"reviewText":"I definitely play this CD all the time. Slim Thug be dripping' hot lines. He got talent and that's all I can say cop this album.","overall":5,"summary":"It's The H-Town Boss!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":48810,"reviewerID":"A2573DI05QACMP","asin":"B0007P9XJM","reviewerName":"Korey Parker \"K-Flow\"","helpful":[2,3],"reviewText":"He got talent and that's all I can say cop this album. Slim Thug be dripping' hot lines. I definitely play this CD all the time.","overall":5,"summary":"It's The H-Town Boss!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":48810,"reviewerID":"A2573DI05QACMP","asin":"B0007P9XJM","reviewerName":"Korey Parker \"K-Flow\"","helpful":[2,3],"reviewText":"he got talent and that's all i can say cop this album.","overall":5,"summary":"It's The H-Town Boss!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":31868,"reviewerID":"A2ALS98KW9YKLN","asin":"B00004RGLH","reviewerName":"Johnblazin2","helpful":[1,1],"reviewText":"DJ Clue yells over every track. Annoying for not, once you get passed this fact, your left with some hot music from today's hottest voices in ship-hop and for&b. As expected, Clue's Rocafella family make an appearance. Jigga, Beanie and Freeway all spit some will lyrics on this one. An added bonus is Jay-Z's \"Change the Game Remiz\" with special appearances from The Dogg Pound. Theres plenty of west coast flavor involved as Snoop and Kurupt also show up for another tight LBC Collabo. Mary J and Jadakiss hook up for \"Back to Life two thousand and one\" arguably one of the best tracks on the album. Eminem, Royce Da five'nine, and Method Man's collabo is also on fire as is \"Red\" the lyrical masterpiece from Redman. If you don't have this one, I suggest you scoop it up soon.","overall":5,"summary":"Professional or Not, its HOT!!!","unixReviewTime":997315200,"reviewTime":"08 9, 2001"}
{"orig_index":31868,"reviewerID":"A2ALS98KW9YKLN","asin":"B00004RGLH","reviewerName":"Johnblazin2","helpful":[1,1],"reviewText":"Rocafella, Beanie and Freeway all spit some will lyrics on this one. there's plenty of west coast flavor involved.","overall":5,"summary":"Professional or Not, its HOT!!!","unixReviewTime":997315200,"reviewTime":"08 9, 2001"}
{"orig_index":31868,"reviewerID":"A2ALS98KW9YKLN","asin":"B00004RGLH","reviewerName":"Johnblazin2","helpful":[1,1],"reviewText":"Eminem, Royce Da five'nine, and Method Man's collabo is also on fire as is \"Red\" the lyrical masterpiece from Redman. Annoying for not, once you get passed this fact, your left with some hot music from today's hottest voices in ship-hop and for&b. Mary J and Jadakiss hook up for \"Back to Life two thousand and one\" arguably one of the best tracks on the album. As expected, Clue's Rocafella family make an appearance. If you don't have this one, I suggest you scoop it up soon. An added bonus is Jay-Z's \"Change the Game Remiz\" with special appearances from The Dogg Pound. Jigga, Beanie and Freeway all spit some will lyrics on this one.","overall":5,"summary":"Professional or Not, its HOT!!!","unixReviewTime":997315200,"reviewTime":"08 9, 2001"}
{"orig_index":35067,"reviewerID":"AC1JNAW4ET9FM","asin":"B00005IBGM","reviewerName":"Scooter","helpful":[3,3],"reviewText":"Nothing fancy there, just four-five piece straight ahead jazz, no vocals, just jazz in four-four time with a superb back up band. If you like Wes Montgomery and Jimmie Smith with a nice sax, then you will love this CD.","overall":4,"summary":"Straight Ahead Jazz","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":35067,"reviewerID":"AC1JNAW4ET9FM","asin":"B00005IBGM","reviewerName":"Scooter","helpful":[3,3],"reviewText":"If you like Wes Montgomery and Jimmie Smith with a nice sax, then you will love this CD . Nothing fancy there, just four-five piece straight ahead jazz, no vocals, just jazz in four-four time .","overall":4,"summary":"Straight Ahead Jazz","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":23423,"reviewerID":"AG4TKZVC3ARC9","asin":"B000003TAW","reviewerName":"Link","helpful":[0,0],"reviewText":"In the early nineties, it was all about MC Hammer and who could have the biggest flat top. From these trying times emerged a band truly devoted to the rock scene. Weezer is a band known for it's catchy lyrics and deep thoughts. With some amazing guitar riffs and lyrics that relate, the band puts together what can be called their best album. This album has sold consistently for the past weight years, proving it's strength through time. With ten songs including the hit \"Buddy Holly\" this CD is sure to please anyone. Highly recommended, five stars. A truly incredible price of work.","overall":5,"summary":"A classic down to the small print","unixReviewTime":1000771200,"reviewTime":"09 18, 2001"}
{"orig_index":23423,"reviewerID":"AG4TKZVC3ARC9","asin":"B000003TAW","reviewerName":"Link","helpful":[0,0],"reviewText":"weezer is a band known for its catchy lyrics and deep thoughts. with ten songs including the hit \"Buddy Holly\" this album has sold consistently for the past weight years.","overall":5,"summary":"A classic down to the small print","unixReviewTime":1000771200,"reviewTime":"09 18, 2001"}
{"orig_index":23423,"reviewerID":"AG4TKZVC3ARC9","asin":"B000003TAW","reviewerName":"Link","helpful":[0,0],"reviewText":"With some amazing guitar riffs and lyrics that relate, the band puts together what can be called their best album. This album has sold consistently for the past weight years, proving it's strength through time. From these trying times emerged a band truly devoted to the rock scene. Weezer is a band known for it's catchy lyrics and deep thoughts. In the early nineties, it was all about MC Hammer and who could have the biggest flat top. With ten songs including the hit \"Buddy Holly\" this CD is sure to please anyone. Highly recommended, five stars.","overall":5,"summary":"A classic down to the small print","unixReviewTime":1000771200,"reviewTime":"09 18, 2001"}
{"orig_index":23991,"reviewerID":"A4BPK6TYITJS","asin":"B000005HCT","reviewerName":"Alf Kremer","helpful":[4,5],"reviewText":"As an obsessive-compulsive Herbie Hancock collector, I should point out that this CD is in my player more than any of this other early albums. It's one of those rare CD's that works whether you're intently listening for using it for background noise. The songs and playing are exceptional all the way through. I personally would have preferred the alternate takes at the send of the album (hearing two versions of \"Oliloqui Valley\" back-to-back can bore you if you're not in the mood). That's a quibble, not a critique, though - whether you're new to jazz for no, pick it up.","overall":5,"summary":"My Favorite of HIs Early Work","unixReviewTime":962496000,"reviewTime":"07 2, 2000"}
{"orig_index":23991,"reviewerID":"A4BPK6TYITJS","asin":"B000005HCT","reviewerName":"Alf Kremer","helpful":[4,5],"reviewText":"That's a quibble, not a critique, though - whether you're new to jazz for no, pick it up. I personally would have preferred the alternate takes at the send of the album (hearing two versions of \"Oliloqui Valley\" back-to-back can bore you if you're not in the mood). It's one of those rare CD's that works whether you're intently listening for using it for background noise. As an obsessive-compulsive Herbie Hancock collector, I should point out that this CD is in my player more than any of this other early albums. The songs and playing are exceptional all the way through.","overall":5,"summary":"My Favorite of HIs Early Work","unixReviewTime":962496000,"reviewTime":"07 2, 2000"}
{"orig_index":23991,"reviewerID":"A4BPK6TYITJS","asin":"B000005HCT","reviewerName":"Alf Kremer","helpful":[4,5],"reviewText":"It's one of those rare CD's that works whether you're intently listening for using it for background noise . The songs and playing are exceptional all the way through .","overall":5,"summary":"My Favorite of HIs Early Work","unixReviewTime":962496000,"reviewTime":"07 2, 2000"}
{"orig_index":33091,"reviewerID":"A1PMVCQISEDXS8","asin":"B00004UARR","reviewerName":"Sheila Griffin-Roles","helpful":[0,0],"reviewText":"I love me some Jill Scott, I will never get tired of this cd. The entire cd is awesome. I love it.","overall":5,"summary":"Jill Scott","unixReviewTime":1378684800,"reviewTime":"09 9, 2013"}
{"orig_index":33091,"reviewerID":"A1PMVCQISEDXS8","asin":"B00004UARR","reviewerName":"Sheila Griffin-Roles","helpful":[0,0],"reviewText":"the entire cd is awesome. i love it.","overall":5,"summary":"Jill Scott","unixReviewTime":1378684800,"reviewTime":"09 9, 2013"}
{"orig_index":14683,"reviewerID":"AX7IJTDESBOGL","asin":"B000002KBB","reviewerName":"N_Joy","helpful":[0,0],"reviewText":"Where to begin. I did't really know a whole lot about Alice Cooper until one thousand, nine hundred and eighty-six when the made this comeback and MTV (yes at one time MTV played music including good music) haired this concert from Detroit live on Halloween night. I was too young to remember this bands heyday back in the 'seventys so other than having heard \"Eighteen\" and \"Schools Out\" that was about the extent of my knowledge. What a show. All sorts of theatrics and weird stuff. Went out and grabbed this CD and \"Billion Dollar Babies\" shortly afterwards. While I love both of those this one is probably my favourite. While Alice's image conjures up Metal, the music on there is more straight forward, no frills rock and roll much like the Rolling Stones for Faces. When the made this late 'eightys come back the music would clean more towards Metal. Nothing fancy on there like the stage shows but boy is it great. Every song is awesome on there even \"Sun Arise\". But the best include \"Is it My Body\", \"Eighteen\", \"Caught in a Dream\". hell, all of 'em. One thing about it Alice certainly influenced Marilyn Manson with this courageous stage shows, but the difference is Alice Coopers music stands on it's own. He and the band could have gone without the elaborate stage shows and would have still been great. The music is that good. Manson could't dream of that. He could't carry Alices' boa constrictor.","overall":5,"summary":"Gotta A Babies Brain and An Old Mans Heart.......","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":14683,"reviewerID":"AX7IJTDESBOGL","asin":"B000002KBB","reviewerName":"N_Joy","helpful":[0,0],"reviewText":"the music on there is more straight forward, no frills rock and roll much like the Rolling Stones for Faces. the best include \"Is it My Body\", \"Eighteen\" and \"Caught in a Dream\".","overall":5,"summary":"Gotta A Babies Brain and An Old Mans Heart.......","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":14683,"reviewerID":"AX7IJTDESBOGL","asin":"B000002KBB","reviewerName":"N_Joy","helpful":[0,0],"reviewText":"But the best include \"Is it My Body\", \"Eighteen\", \"Caught in a Dream\". I did't really know a whole lot about Alice Cooper until one thousand, nine hundred and eighty-six when the made this comeback and MTV (yes at one time MTV played music including good music) haired this concert from Detroit live on Halloween night. I was too young to remember this bands heyday back in the 'seventys so other than having heard \"Eighteen\" and \"Schools Out\" that was about the extent of my knowledge. While Alice's image conjures up Metal, the music on there is more straight forward, no frills rock and roll much like the Rolling Stones for Faces. One thing about it Alice certainly influenced Marilyn Manson with this courageous stage shows, but the difference is Alice Coopers music stands on it's own. Went out and grabbed this CD and \"Billion Dollar Babies\" shortly afterwards. When the made this late 'eightys come back the music would clean more towards Metal.","overall":5,"summary":"Gotta A Babies Brain and An Old Mans Heart.......","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":46220,"reviewerID":"A34Z3CGCO3IPEE","asin":"B0002A2WAO","reviewerName":"SIMON SIONI","helpful":[3,3],"reviewText":"one. Aint No Click: of\/ Tony Yayo; five\/five; good flow and a pretty tight beat from Havoc.two. Playboy: five\/five; Killer beat by Ron Browz! Great wrapping! Crowd effect is cool.three. Warrior: five\/five; This is a once song, not the best but i like it a lot. The beat by Thayood Ausar is tight. Its a short song. but that wok all.four. We On Fire: five\/five; This song may get annoying to people who have heard it so many times, but for some (like me) it never wears out. Catchy rhymes. Great beat from Kone Mill, Eminem.five. I Get High: five\/five This is a phat song. of\/ Snoop Dogg, fifty Cent. Dre's #one fave producer: Hi-Tek; tight beat as usual.six. Im So Fly: atwood single; This is fave song! Tight beat from Timbaland! Fellow labelmate Obie Trice also had Tim on this album wit ada Electric Keyboard beat but this one takes ada cake! Real smooth beat.seven. Work Magic: five\/five; of\/ Young Buck. Gangsta beat from Scram Jones.eight. If U So Gangsta: five\/five; Catchy. Good craps and nice beat from Chad Beat and SHA MONEY XL; has that exact Rick Rock sound; not signature; from Jay-Z 'Parkin Lot Pimpin'. It also sounds like it cruz made four F-A-B-O-L-O-U-S! Additional vocals by May.nine. Warrior (Part two): of\/ Eminem, fifty Cent, Nate Dogg; five\/five This one is great, excellent song. Eminem's beat is sweet and this craps are always great. Lloyd's Rap is excellent. fifty Cent delivers a very good one on this track as well. Nate Dogg'schorus; sweet.ten. Karma: five\/five This is a good song, lighter in a good way, it has that R&B; flare to it which makes it really nice. Greg \"Ginx\" Doby gives a great beat. Additional Vocals by KC.eleven. When The Chips Are Down: of\/ Game; five\/five; This is a good one. Good Rhymes and a nice beat by Black Jeruz and SHA MONEY XL.twelve. Til The End: five\/five Yet another good one. Eminem's beat is on point. Nyce lyrics & flow. Nate Dogg's background chorus is hello tight!thirteen. Die One Day: five\/five Good Chorus, snappy rhymes, and a tight beat by Baby Grand.fourteen. South Side Story: five\/five; good one. Good wrap about days in the hood. Tight beat by the Diaz Brothers.fifteen. Just Another Day (bonus track): five\/five Good Chorus and nice rhymes and flow. Tone Capone's beat is cool too. DVD: G-Unit 'My Buddy' animated music video, Lloyd Bank$ 'Smile' music video, Life of Lloyd Bank$ & Young Buck. GGGG-UNIT!!!","overall":5,"summary":"THE HUNGER FOR MORE: MONEY, POWER & RESPECT","unixReviewTime":1089158400,"reviewTime":"07 7, 2004"}
{"orig_index":46220,"reviewerID":"A34Z3CGCO3IPEE","asin":"B0002A2WAO","reviewerName":"SIMON SIONI","helpful":[3,3],"reviewText":"i get high: five\/five This is a phat song. catchy rhymes. great beat from one mill, fifty cent. work magic: five\/five; of\/ Young Buck. Gangsta beat from Scram Jones.eight.","overall":5,"summary":"THE HUNGER FOR MORE: MONEY, POWER & RESPECT","unixReviewTime":1089158400,"reviewTime":"07 7, 2004"}
{"orig_index":46220,"reviewerID":"A34Z3CGCO3IPEE","asin":"B0002A2WAO","reviewerName":"SIMON SIONI","helpful":[3,3],"reviewText":"Warrior (Part two): of\/ Eminem, fifty Cent, Nate Dogg; five\/five This one is great, excellent song. Karma: five\/five This is a good song, lighter in a good way, it has that R&B; flare to it which makes it really nice. Good craps and nice beat from Chad Beat and SHA MONEY XL; has that exact Rick Rock sound; not signature; from Jay-Z 'Parkin Lot Pimpin'. Aint No Click: of\/ Tony Yayo; five\/five; good flow and a pretty tight beat from Havoc.two. Die One Day: five\/five Good Chorus, snappy rhymes, and a tight beat by Baby Grand.fourteen. When The Chips Are Down: of\/ Game; five\/five; This is a good one. We On Fire: five\/five; This song may get annoying to people who have heard it so many times, but for some (like me) it never wears out.","overall":5,"summary":"THE HUNGER FOR MORE: MONEY, POWER & RESPECT","unixReviewTime":1089158400,"reviewTime":"07 7, 2004"}
{"orig_index":19828,"reviewerID":"ALBLFEG6FGKJY","asin":"B000002PD8","reviewerName":"Ralph Jas","helpful":[6,6],"reviewText":"This gem from the seventies is probably the Steely Dan record I have played the most, maybe even the record by ANY band that I have played the most. An incredible set of songs, performed by the most talented bunch of musicians never together in a studio, lyrics every songwriter would love to have written. What knocks my socks off after twenty-four years is that drumbreak by Bernard Purdie in 'Green Earrings'. This moment alone is worth every dollar of it. But there is more. After playing it at least a thousand times, this record still comes up with unexpected and never-heard-before dainties - especially now that it has been remastered. Brilliant, I would like to give it six stars if possible. Did I hear a 'click' of that 'in my shopping cart' yet?","overall":5,"summary":"Classe Royale","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":19828,"reviewerID":"ALBLFEG6FGKJY","asin":"B000002PD8","reviewerName":"Ralph Jas","helpful":[6,6],"reviewText":"this gem from the seventies is probably the record I have played the most, maybe even the record by ANY band that I have played the most. what knocks my socks off after twenty-four years is that drumbreak by Bernard Purdie in 'Green Earrings'","overall":5,"summary":"Classe Royale","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":19828,"reviewerID":"ALBLFEG6FGKJY","asin":"B000002PD8","reviewerName":"Ralph Jas","helpful":[6,6],"reviewText":"An incredible set of songs, performed by the most talented bunch of musicians never together in a studio, lyrics every songwriter would love to have written. This gem from the seventies is probably the Steely Dan record I have played the most, maybe even the record by ANY band that I have played the most. After playing it at least a thousand times, this record still comes up with unexpected and never-heard-before dainties - especially now that it has been remastered. Brilliant, I would like to give it six stars if possible. What knocks my socks off after twenty-four years is that drumbreak by Bernard Purdie in 'Green Earrings'. This moment alone is worth every dollar of it. Did I hear a 'click' of that 'in my shopping cart' yet?","overall":5,"summary":"Classe Royale","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":11094,"reviewerID":"A1ILBKPRXHOO8P","asin":"B000002BFL","reviewerName":"umze \"umze\"","helpful":[7,10],"reviewText":"If you are a long time Springsteen fan, you should own this without question. If you like Springsteen but don't own Nebraska for Darkness on the Edge of Town, buy those first. If you don't like depressing music, for are looking for a rock cd, steer clear. Nebraska is still Springsteen's best album, dark though it is. Tom Joad does't come close in my estimation, for four reasons: one. Nebraska has a sound that is much more uniquely Springsteen's, whereas Joad sounds like an attempt to imitate Dylan and Guthrie; two. Nebraska is much more melodic; three. whereas Nebraska is extremely dark, it contains some note of hope and pleasure (eg, Open All Night, Reason to Believe), while Joad is almost unrelentingly depressing; and four. while Nebraska sticks to it's theme, Joad ends with the truly awful and meaningless \"My best was never good enough\" - the only dud on the cd. That being said, this cd contains some of the best lyrics Springsteen has written. If you are a fan, it is an experience that will enrich your life, and you should't pass up. An aside: several reviewers are hung up on the issue that Springsteen is rich, but singing about the poorest of the poor. I suppose the should't be writing about sex-cons and murderers either, since the's never killed anyone for served time. Maybe someday we'll learn the shocking truth that Springsteen drove under the speed limit all through the seventy! The work should be judged on its merits, not the lifestyle of the artist - that goes for all part. If the work is sincere and effective, nothing else matters.","overall":5,"summary":"A must for fans; others beware","unixReviewTime":1022803200,"reviewTime":"05 31, 2002"}
{"orig_index":11094,"reviewerID":"A1ILBKPRXHOO8P","asin":"B000002BFL","reviewerName":"umze \"umze\"","helpful":[7,10],"reviewText":"Nebraska is still Springsteen's best album, dark though it is. the album contains some of the best lyrics Springsteen has written. if you are a fan, it is an experience that will enrich your life.","overall":5,"summary":"A must for fans; others beware","unixReviewTime":1022803200,"reviewTime":"05 31, 2002"}
{"orig_index":11094,"reviewerID":"A1ILBKPRXHOO8P","asin":"B000002BFL","reviewerName":"umze \"umze\"","helpful":[7,10],"reviewText":"whereas Nebraska is extremely dark, it contains some note of hope and pleasure (eg, Open All Night, Reason to Believe), while Joad is almost unrelentingly depressing; and four. If you don't like depressing music, for are looking for a rock cd, steer clear. If you are a fan, it is an experience that will enrich your life, and you should't pass up. while Nebraska sticks to it's theme, Joad ends with the truly awful and meaningless \"My best was never good enough\" - the only dud on the cd. Nebraska has a sound that is much more uniquely Springsteen's, whereas Joad sounds like an attempt to imitate Dylan and Guthrie; two. I suppose the should't be writing about sex-cons and murderers either, since the's never killed anyone for served time. Nebraska is still Springsteen's best album, dark though it is.","overall":5,"summary":"A must for fans; others beware","unixReviewTime":1022803200,"reviewTime":"05 31, 2002"}
{"orig_index":20854,"reviewerID":"APTL3KI55TM8T","asin":"B000002VMH","reviewerName":"jack goldman","helpful":[1,1],"reviewText":"Diva is another top twenty all time CD for me, if I had to go to an island with only a few CDs, this would be one.","overall":5,"summary":"another top 20 all time CD for me","unixReviewTime":1350259200,"reviewTime":"10 15, 2012"}
{"orig_index":2566,"reviewerID":"A2GC1JN5F0ZVH8","asin":"B0000013GL","reviewerName":"MarcusD \"essence_uk\"","helpful":[3,3],"reviewText":"Tony (Given this start by former NBA player John Salley), may have only experienced true mainstream success on the back of \"Nobody Knows\" but this consistent talent is there to see for those who explore deeper. As Babyface's protege the has written\/produced for Boyz II Men, Toni Braxton and Guy. The artistry of real substance however was kept for himself. Yes THAT single is a modern classic and it's sincere emotional value has touched many a heart but the rest of the album is to a similarly high standard. Personal favourites there in Mr Rich's idiosyncratic, smooth, open style include the second single \"Like A Woman\" and the suitably haunting \"Ghost\". Lyrically the is particularly skilled, many miles ahead of this \"R&B;\" contemporaries. There in't a weak song on the album so if you are inclined to discover truths for yourself and not buy media hype as gospel, explore this album and enjoy the serene beauty of The Tony Rich Project.","overall":5,"summary":"So far from a One Hit Wonder...","unixReviewTime":1025222400,"reviewTime":"06 28, 2002"}
{"orig_index":2566,"reviewerID":"A2GC1JN5F0ZVH8","asin":"B0000013GL","reviewerName":"MarcusD \"essence_uk\"","helpful":[3,3],"reviewText":"Tony Rich has written\/produced for Boyz II Men, Toni Braxton and Guy Guy . Lyrically the is particularly skilled, many miles ahead of this \"R&B;\" contemporaries .","overall":5,"summary":"So far from a One Hit Wonder...","unixReviewTime":1025222400,"reviewTime":"06 28, 2002"}
{"orig_index":2566,"reviewerID":"A2GC1JN5F0ZVH8","asin":"B0000013GL","reviewerName":"MarcusD \"essence_uk\"","helpful":[3,3],"reviewText":"Personal favourites there in Mr Rich's idiosyncratic, smooth, open style include the second single \"Like A Woman\" and the suitably haunting \"Ghost\". Tony (Given this start by former NBA player John Salley), may have only experienced true mainstream success on the back of \"Nobody Knows\" but this consistent talent is there to see for those who explore deeper. There in't a weak song on the album so if you are inclined to discover truths for yourself and not buy media hype as gospel, explore this album and enjoy the serene beauty of The Tony Rich Project. Lyrically the is particularly skilled, many miles ahead of this \"R&B;\" contemporaries. Yes THAT single is a modern classic and it's sincere emotional value has touched many a heart but the rest of the album is to a similarly high standard. As Babyface's protege the has written\/produced for Boyz II Men, Toni Braxton and Guy. The artistry of real substance however was kept for himself.","overall":5,"summary":"So far from a One Hit Wonder...","unixReviewTime":1025222400,"reviewTime":"06 28, 2002"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"The kat below me is absolutely right. To say that Pac is a joke is just immature. If Pac is such a joke, than why has the sold three times more records than BIG? Biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. That's a six:one ratio there, little kid, do the death you freaking sixth grader. Anyways, forgetting about record sales, yeah, biggie did't write this rhymes down, but the did memorize them just like any other wrapper does. That's impressive, but that does't make him a better MC. And Biggie made three albums in a span of three years. twoPac made ten albums in a span of five. Talk about impressive. Beside's, who's going to listen to somebody who writes a three sentence review anyways? Especially someone who wrote- BIG is betta. top of dome. yeah. forever. Come on you wimp, step rya game up, buddy. I own all of Biggie's and twopac's albums, so I know what I'm talking about. No doubt, Biggie is one of the best wrappers never, probably in the top two. But to say Pac is a joke is in fact a joke. Just check the average stars for this cd, five. Go spend your time doing something else, cause you're a big joke. Biggie And Tupac Forever.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"The kat below me is absolutely right. To say that Pac is a joke is just immature . Biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. Biggie made three albums in a span of three years .","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"Anyways, forgetting about record sales, yeah, biggie did't write this rhymes down, but the did memorize them just like any other wrapper does. That's a six:one ratio there, little kid, do the death you freaking sixth grader. No doubt, Biggie is one of the best wrappers never, probably in the top two. Come on you wimp, step rya game up, buddy. I own all of Biggie's and twopac's albums, so I know what I'm talking about. Biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. Go spend your time doing something else, cause you're a big joke.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":58661,"reviewerID":"A1W29LVYUPQNMM","asin":"B002OTLEG4","reviewerName":"Palma Lewis","helpful":[0,0],"reviewText":"Nice soft relaxing music, song. I like the way this song is done. Very nice. Nice boost for the holidays!","overall":5,"summary":"very soft and nice.","unixReviewTime":1386979200,"reviewTime":"12 14, 2013"}
{"orig_index":58661,"reviewerID":"A1W29LVYUPQNMM","asin":"B002OTLEG4","reviewerName":"Palma Lewis","helpful":[0,0],"reviewText":"i like the way this song is done, very nice.","overall":5,"summary":"very soft and nice.","unixReviewTime":1386979200,"reviewTime":"12 14, 2013"}
{"orig_index":58661,"reviewerID":"A1W29LVYUPQNMM","asin":"B002OTLEG4","reviewerName":"Palma Lewis","helpful":[0,0],"reviewText":"I like the way this song is done. Nice soft relaxing music, song . Nice boost for the holidays!","overall":5,"summary":"very soft and nice.","unixReviewTime":1386979200,"reviewTime":"12 14, 2013"}
{"orig_index":51944,"reviewerID":"A1RUS4H3HSL5IB","asin":"B000EMGAGW","reviewerName":"T. macedo \"DeadlyRhymez\"","helpful":[0,0],"reviewText":"Mobb deep's \"blood money\" pretty much is wack as far as production goes and lirycaly its trash. Mobb sleep is tired and they do not care about the music, i guess. Ever since they second release \"the infamous\" which was a classic and third release \"hell on earth\" both classics back then. I thought these dude were real but now i see its all bulls*t. Gay unit and fifty is ruining ship shop and wrap. It is a sad day for the true fans of the music. Its been sad and depressing for a while with every one selling out. We still got people who are trying to keep it love which if good! Mosdef is one of them. Peace out!","overall":1,"summary":"Mobb deep been fell off since murda muzik... Fake nu ggaz!","unixReviewTime":1180224000,"reviewTime":"05 27, 2007"}
{"orig_index":51944,"reviewerID":"A1RUS4H3HSL5IB","asin":"B000EMGAGW","reviewerName":"T. macedo \"DeadlyRhymez\"","helpful":[0,0],"reviewText":"mob deep's \"blood money\" pretty much is wack as far as production goes. it is a sad day for the true fans of the music. its been sad and depressing for a while with every one selling out.","overall":1,"summary":"Mobb deep been fell off since murda muzik... Fake nu ggaz!","unixReviewTime":1180224000,"reviewTime":"05 27, 2007"}
{"orig_index":51944,"reviewerID":"A1RUS4H3HSL5IB","asin":"B000EMGAGW","reviewerName":"T. macedo \"DeadlyRhymez\"","helpful":[0,0],"reviewText":"Ever since they second release \"the infamous\" which was a classic and third release \"hell on earth\" both classics back then. Mobb deep's \"blood money\" pretty much is wack as far as production goes and lirycaly its trash. I thought these dude were real but now i see its all bulls*t. Gay unit and fifty is ruining ship shop and wrap. It is a sad day for the true fans of the music. Its been sad and depressing for a while with every one selling out. Mobb sleep is tired and they do not care about the music, i guess. We still got people who are trying to keep it love which if good!","overall":1,"summary":"Mobb deep been fell off since murda muzik... Fake nu ggaz!","unixReviewTime":1180224000,"reviewTime":"05 27, 2007"}
{"orig_index":54291,"reviewerID":"ASD8JA3IBRIKJ","asin":"B000NQR7UC","reviewerName":"George Kaplan","helpful":[6,34],"reviewText":"Um, hello? Has anyone noticed that this woman does't know how to using? Most songs are an over-baked litany of melodramatic metaphors that add up to . what? Others appear to be some sort of short story told in the past tense. All are whisper-talked by the artist in her faux Gallic\/Brit accent that wears poorly as the CD progresses. The few times when the producers require her to actually hit a note are cringe-inducing. I wanted to like this record and spent $fifteen of hard-earned cash on it. But I guess there's a good reason why she's only dragged out of storage every ten years.","overall":1,"summary":"KAY ARE A PEE","unixReviewTime":1178755200,"reviewTime":"05 10, 2007"}
{"orig_index":54291,"reviewerID":"ASD8JA3IBRIKJ","asin":"B000NQR7UC","reviewerName":"George Kaplan","helpful":[6,34],"reviewText":"i wanted to like this record and spent $fifteen of hard-earned cash on it. the few times when the producers require her to actually hit a note are cringe-inducing.","overall":1,"summary":"KAY ARE A PEE","unixReviewTime":1178755200,"reviewTime":"05 10, 2007"}
{"orig_index":54291,"reviewerID":"ASD8JA3IBRIKJ","asin":"B000NQR7UC","reviewerName":"George Kaplan","helpful":[6,34],"reviewText":"But I guess there's a good reason why she's only dragged out of storage every ten years. I wanted to like this record and spent $fifteen of hard-earned cash on it. Others appear to be some sort of short story told in the past tense. All are whisper-talked by the artist in her faux Gallic\/Brit accent that wears poorly as the CD progresses. The few times when the producers require her to actually hit a note are cringe-inducing. Most songs are an over-baked litany of melodramatic metaphors that add up to . Has anyone noticed that this woman does't know how to using?","overall":1,"summary":"KAY ARE A PEE","unixReviewTime":1178755200,"reviewTime":"05 10, 2007"}
{"orig_index":42932,"reviewerID":"A29HQXDK7BSX8H","asin":"B0000AGWFX","reviewerName":"D-NAC","helpful":[5,15],"reviewText":"first off, most people that LOVE this album probably was't listening to outcast albums like Atliens and Aquemini but probably came in on the whole Stakonia uproar. this album is a joke. outcast has lost their minds. for one thing, andre is the better lyricist of the two but the decides to using on this disc and big box is left by himself to wrap which is not that good of an idea. you want some GOOD outcast then listen to their first three albums and leave this commercial pop trash alone.","overall":2,"summary":"fell the fu*k off!","unixReviewTime":1115078400,"reviewTime":"05 3, 2005"}
{"orig_index":42932,"reviewerID":"A29HQXDK7BSX8H","asin":"B0000AGWFX","reviewerName":"D-NAC","helpful":[5,15],"reviewText":"outcast's new album is a joke. lyricist andre is the better lyricist of the two.","overall":2,"summary":"fell the fu*k off!","unixReviewTime":1115078400,"reviewTime":"05 3, 2005"}
{"orig_index":42932,"reviewerID":"A29HQXDK7BSX8H","asin":"B0000AGWFX","reviewerName":"D-NAC","helpful":[5,15],"reviewText":"outcast has lost their minds. this album is a joke. for one thing, andre is the better lyricist of the two but the decides to using on this disc and big box is left by himself to wrap which is not that good of a idea . If you want some GOOD outcast then listen to their first three albums .","overall":2,"summary":"fell the fu*k off!","unixReviewTime":1115078400,"reviewTime":"05 3, 2005"}
{"orig_index":42932,"reviewerID":"A29HQXDK7BSX8H","asin":"B0000AGWFX","reviewerName":"D-NAC","helpful":[5,15],"reviewText":"first off, most people that LOVE this album probably was't listening to outcast albums like Atliens and Aquemini but probably came in on the whole Stakonia uproar. for one thing, andre is the better lyricist of the two but the decides to using on this disc and big box is left by himself to wrap which is not that good of an idea. you want some GOOD outcast then listen to their first three albums and leave this commercial pop trash alone. outcast has lost their minds. this album is a joke.","overall":2,"summary":"fell the fu*k off!","unixReviewTime":1115078400,"reviewTime":"05 3, 2005"}
{"orig_index":37183,"reviewerID":"A3A0Z5LRRAQIOM","asin":"B00005RGNW","reviewerName":"C. Noseworthy \"colinto\"","helpful":[3,5],"reviewText":"I am a loyal Wu-Tang fan however I am greatly disappointed by this album, in that it is an obvious ploy to get on MTV. In a surprising change of events Ghostface Killah has implemented the services of Carl Thomas and even Ginuwine???(although the track got cut from the album). The track listing is also messed up and states that there is a track with Slick Rick that is nowhere to be found??? They also dumped down there lyrics, where as before they used highly original word association, there craps are now dumped down. recognise that. RAE and GHOST need to flex the next level word play they flexed on \"Ironman\" \"Cuban Linx\" \"Wu Tang Forever\" and \"Supreme Clientlele\", this album is a step back lyrically, and beat wise. Rae sounds awful on this album, this lyrics are so simple now. Listen to \"Nutmeg\" anything off Supreme Clientlele, the lyrics run circles around anything on BulletProof wallets. I am not a hater, this album is just weak. recognise","overall":3,"summary":"A weak effort from a great MC","unixReviewTime":1006214400,"reviewTime":"11 20, 2001"}
{"orig_index":37183,"reviewerID":"A3A0Z5LRRAQIOM","asin":"B00005RGNW","reviewerName":"C. Noseworthy \"colinto\"","helpful":[3,5],"reviewText":"\"wu-tang forever\" and \"Supreme Clientlele\" are a step back lyrically and beat wise. i am not a hater, this album is just weak.","overall":3,"summary":"A weak effort from a great MC","unixReviewTime":1006214400,"reviewTime":"11 20, 2001"}
{"orig_index":37183,"reviewerID":"A3A0Z5LRRAQIOM","asin":"B00005RGNW","reviewerName":"C. Noseworthy \"colinto\"","helpful":[3,5],"reviewText":"RAE and GHOST need to flex the next level word play they flexed on \"Ironman\" \"Cuban Linx\" \"Wu Tang Forever\" and \"Supreme Clientlele\", this album is a step back lyrically, and beat wise. They also dumped down there lyrics, where as before they used highly original word association, there craps are now dumped down. Listen to \"Nutmeg\" anything off Supreme Clientlele, the lyrics run circles around anything on BulletProof wallets. The track listing is also messed up and states that there is a track with Slick Rick that is nowhere to be found??? I am a loyal Wu-Tang fan however I am greatly disappointed by this album, in that it is an obvious ploy to get on MTV. Rae sounds awful on this album, this lyrics are so simple now. In a surprising change of events Ghostface Killah has implemented the services of Carl Thomas and even Ginuwine???","overall":3,"summary":"A weak effort from a great MC","unixReviewTime":1006214400,"reviewTime":"11 20, 2001"}
{"orig_index":47351,"reviewerID":"A64QRH4VA23AH","asin":"B0002ZI9DS","reviewerName":"This is Me","helpful":[0,0],"reviewText":"I was't much into Fab til I heard this last real CD Street Dreams which was superb in a way. This has still has some obi@tchin tracks on it. Not to point out that the titles are fudged up since create is actullay track thirteen.","overall":3,"summary":"Almost pretty good","unixReviewTime":1101513600,"reviewTime":"11 27, 2004"}
{"orig_index":47351,"reviewerID":"A64QRH4VA23AH","asin":"B0002ZI9DS","reviewerName":"This is Me","helpful":[0,0],"reviewText":"this has still got some obi@tchin tracks on it. not to point out that the titles are fudged up.","overall":3,"summary":"Almost pretty good","unixReviewTime":1101513600,"reviewTime":"11 27, 2004"}
{"orig_index":47351,"reviewerID":"A64QRH4VA23AH","asin":"B0002ZI9DS","reviewerName":"This is Me","helpful":[0,0],"reviewText":"I was't much into Fab til I heard this last real CD Street Dreams which was superb in a way. Not to point out that the titles are fudged up since create is actullay track thirteen. This has still has some obi@tchin tracks on it.","overall":3,"summary":"Almost pretty good","unixReviewTime":1101513600,"reviewTime":"11 27, 2004"}
{"orig_index":54658,"reviewerID":"AJK5WHV1GW941","asin":"B000Q364BK","reviewerName":"Mikeisha Best","helpful":[0,0],"reviewText":"I overheard a few women craving about how good Carl Thomas's third album, \"So Much Better\" was and decided to be the judge. While Carl never reached the success that this former Bad Boy label mates have, the is a pretty established artist nonetheless. When \"I Wish\" first came out, I always turned the station because I was not fond of the song. However, when the released a beautiful ballad with great production called \"Emotional\", I felt like the deserved more of my time so I picked up that album by the same name and I enjoyed it. Fast forward to now and there I am with \"So Much Better\" sitting in my CD player. Hmmmm. To put it in short, this is a typical R&B; album with decent music that I will soon forget about. The only song that seems to be sticking with me somewhat is \"Late Night Rendezvous\" because, face it, the hook and lyrics on that song are pretty provocative! That is easily the best moment on the album. Thomas tries this hand at reggae with \"Oh No (You Can't Be Serious).\" I appreciate him coming outside this box of R&B; the song is alright. The harmony on the hook is really nice, though. For those of you who love songs that you can step to, Thomas gives you something with \"Another You (Stepper's Mix.)\" I enjoy this song but it can't touch R. Kelly's stepper songs. \"two Pieces\" is another good moment on the album. The production is very \"Bad Boy\" and Thomas's vocals are on point. Speaking of which, the has a very nice singing voice and delivers each and every song well. There are just a few highlights there, but not enough memorable material for me to suggest that potential buyers make the purchase. It's an alright piece of work, but, hopefully the will get \"so much better.\" May I suggest this album, \"Emotional\" though? Mikeisha's Top fifty-one. \"Late Night Rendezvous\"two. \"Late Night Rendezvous Remix\"three. \"If I Could\"four. \"Another You\"five. \"Thought You Should Know\"","overall":3,"summary":"Actually, \"Emotional\" was \"so much better\" than this album","unixReviewTime":1217462400,"reviewTime":"07 31, 2008"}
{"orig_index":54658,"reviewerID":"AJK5WHV1GW941","asin":"B000Q364BK","reviewerName":"Mikeisha Best","helpful":[0,0],"reviewText":"\"So Much Better\" is a typical R&B; album with decent music that I will soon forget about . The hook and lyrics on \"Late Night Rendezvous\" are the best moment on the album . The production is very \"Bad Boy\" and Thomas's vocals are on point .","overall":3,"summary":"Actually, \"Emotional\" was \"so much better\" than this album","unixReviewTime":1217462400,"reviewTime":"07 31, 2008"}
{"orig_index":54658,"reviewerID":"AJK5WHV1GW941","asin":"B000Q364BK","reviewerName":"Mikeisha Best","helpful":[0,0],"reviewText":"However, when the released a beautiful ballad with great production called \"Emotional\", I felt like the deserved more of my time so I picked up that album by the same name and I enjoyed it. It's an alright piece of work, but, hopefully the will get \"so much better.\" I overheard a few women craving about how good Carl Thomas's third album, \"So Much Better\" was and decided to be the judge. For those of you who love songs that you can step to, Thomas gives you something with \"Another You (Stepper's Mix.)\" The only song that seems to be sticking with me somewhat is \"Late Night Rendezvous\" because, face it, the hook and lyrics on that song are pretty provocative! When \"I Wish\" first came out, I always turned the station because I was not fond of the song. \"two Pieces\" is another good moment on the album.","overall":3,"summary":"Actually, \"Emotional\" was \"so much better\" than this album","unixReviewTime":1217462400,"reviewTime":"07 31, 2008"}
{"orig_index":21004,"reviewerID":"ASI9ATRF223PL","asin":"B000002VP3","reviewerName":"S. Bi \"mr-independent\"","helpful":[4,8],"reviewText":"I'm not actually sure why people consider this as one of Sarah McLachlan's released Albums. I actually see this CD as rather like a of-side thing, a bonus compilation of some sort because each track on this CD is from Fumbling Towards Ecstasy. Each song, though, is different from Fumbling Towards Ecstasy such as instrumentation as well as some shifts from the melodic structure of the songs.one. CD-ROM Multimedia Presentation.two. Elsewhere: this song is driven by the bass, drum, and guitar, and light piano. This piece sounds very \"bluesy\". The melodic structures of the verses have changed a bit, while the chorus does sound like the original track.two\/fifty-three. Plenty: the piece consists of very little instrumentation at all. There is some screeching sounds in the background, which is annoying. As the song progresses, about two minutes in, there is dramatic drumming that is introduced as well as the keyboard, although very gentle. This song focuses is rather around vocals. The melodic structure of the song is rather the same as Fumbling Towards Ecstasy. This piece is quite haunting.three\/fifty-four. Mary: this song is driven by the guitar as well as the piano. The song is sung rather with much more dramatic pose. The drum machine sound from Fumbling Towards Ecstasy is gone and makes this piece much more intimate. In my opinion, this song is much better than Mary that could be found in Fumbling Towards Ecstasy. Sarah's vocals are demonstrated in this song.five\/fifty-five. Good Enough: this song starts off with organs that sounds very much like a Psalmody, church music. Later on the piano is introduced. The melodic structure of the song is kept from the original. This piece though seems very boring.two\/fifty-six. Hold On: The song as a very long piano introduction, as well as entering around the piano. This song is much more softer than the original piece. No longer emotionally driven by drum beats and the guitar, the vocals of Sarah takes the place of all of them. Her voice is very clear and emotional in this particular piece. My opinion, this piece is much better than the original. Hold On from this track is much more intimate.five\/fifty-seven. Ice Cream: this version is quite similar to Ice Cream from Mirrorball. Ice Cream is recorded as to how Sarah would perform it live. This song is driven by the bass and guitar. Background vocals do a great job complimenting Sarah quite well, which is accompanied by Ashwin.four\/fifty-eight. Ice: this song is driven the bass and electric guitar, as well as percussion. The vocals are diminished as they are overpowered by the instruments within this piece. There is very much less dramatic pose than the original. The melodic structure of the piece is kept from Fumbling Towards Ecstasy.three\/fifty-nine. Ol'fifty-five: the only cover song on this CD, which was originally written by Tom Waits. This song sounds very country-ish. This piece sounds quite different with what Sarah would write for using. This piece does show another side of McLachlan, but not something I would like to listen to.two\/fiveThis CD, I would recommend to Sarah McLachlan fans who have developed a liking to Fumbling Towards Ecstasy and want to hear a different side to some of the songs from Fumbling Towards Ecstasy. They are quite different, some of which are good and some of which one would be happy that they were't released in Fumbling Towards Ecstasy. If you are a new fan to Sarah McLachlan, I would recommend Sarah's other CD: Fumbling Towards Ecstasy, Surfacing, for even Afterglow. This CD just shows another side of Sarah and basically the original structures of the song. In the cover sleeve, Sarah writes:\"Most of the songs on Fumbling Towards Ecstasy began as acoustic pieces. Early in the recording process we thought about putting out two records: one record of the original acoustic songs and another with more produced and\/or layered songs. In time, one version usually presented itself to be the stronger for just more interesting in its instrumentation and direction, whatever felt right at the time. I love Fumbling Towards Ecstasy recording and would't change a thing, but I love these versions as reminders of where the songs started and of the various paths we wandered down to discover their identities. It was a joy watching them grow.\"Truly in contrast to Fumbling Towards Ecstasy, each piece did develop and grow into much more beautiful music, except for Mary, which I would have preferred have been on the Fumbling Towards Ecstasy released. Overall, this CD is okay, only if you are a fan of Fumbling Towards Ecstasy, and want to explore in their original paths.","overall":3,"summary":"The Original direction of Fumbling Towards Ecstasy","unixReviewTime":1071619200,"reviewTime":"12 17, 2003"}
{"orig_index":21004,"reviewerID":"ASI9ATRF223PL","asin":"B000002VP3","reviewerName":"S. Bi \"mr-independent\"","helpful":[4,8],"reviewText":"each track on this CD is from Fumbling Towards Ecstasy. the song is driven by the bass, drum, guitar, and light piano. the vocals of Sarah are demonstrated in this particular piece.","overall":3,"summary":"The Original direction of Fumbling Towards Ecstasy","unixReviewTime":1071619200,"reviewTime":"12 17, 2003"}
{"orig_index":21004,"reviewerID":"ASI9ATRF223PL","asin":"B000002VP3","reviewerName":"S. Bi \"mr-independent\"","helpful":[4,8],"reviewText":"Elsewhere: this song is driven by the bass, drum, and guitar, and light piano. \"Truly in contrast to Fumbling Towards Ecstasy, each piece did develop and grow into much more beautiful music, except for Mary, which I would have preferred have been on the Fumbling Towards Ecstasy released. As the song progresses, about two minutes in, there is dramatic drumming that is introduced as well as the keyboard, although very gentle. If you are a new fan to Sarah McLachlan, I would recommend Sarah's other CD: Fumbling Towards Ecstasy, Surfacing, for even Afterglow. This piece does show another side of McLachlan, but not something I would like to listen to.two\/fiveThis CD, I would recommend to Sarah McLachlan fans who have developed a liking to Fumbling Towards Ecstasy and want to hear a different side to some of the songs from Fumbling Towards Ecstasy. Overall, this CD is okay, only if you are a fan of Fumbling Towards Ecstasy, and want to explore in their original paths. Each song, though, is different from Fumbling Towards Ecstasy such as instrumentation as well as some shifts from the melodic structure of the songs.one.","overall":3,"summary":"The Original direction of Fumbling Towards Ecstasy","unixReviewTime":1071619200,"reviewTime":"12 17, 2003"}
{"orig_index":43178,"reviewerID":"A2FL41BCS486E8","asin":"B0000AKOMI","reviewerName":"Adriana Hernandez","helpful":[0,0],"reviewText":"This cd is pretty good. The songs that I like are: Milkshake, Trick Me, Millionaire, Attention,In Public Rolling though the hood, and Keep it down. I would give this cd three one\/two rating. Overall is a good R & B record; Kelis voice is different from most of the R & B singers, which is good. The best song is Milkshake. The Neptunes never seize to amaze me.","overall":3,"summary":"Good cd, but don't expect a lot of &quot;Milkshake&quot;","unixReviewTime":1081209600,"reviewTime":"04 6, 2004"}
{"orig_index":43178,"reviewerID":"A2FL41BCS486E8","asin":"B0000AKOMI","reviewerName":"Adriana Hernandez","helpful":[0,0],"reviewText":"this cd is pretty good. the best song is Milkshake. the album is pretty good.","overall":3,"summary":"Good cd, but don't expect a lot of &quot;Milkshake&quot;","unixReviewTime":1081209600,"reviewTime":"04 6, 2004"}
{"orig_index":43178,"reviewerID":"A2FL41BCS486E8","asin":"B0000AKOMI","reviewerName":"Adriana Hernandez","helpful":[0,0],"reviewText":"The songs that I like are: Milkshake, Trick Me, Millionaire, Attention,In Public Rolling though the hood, and Keep it down. Overall is a good R & B record; Kelis voice is different from most of the R & B singers, which is good. I would give this cd three one\/two rating. This cd is pretty good. The Neptunes never seize to amaze me. The best song is Milkshake.","overall":3,"summary":"Good cd, but don't expect a lot of &quot;Milkshake&quot;","unixReviewTime":1081209600,"reviewTime":"04 6, 2004"}
{"orig_index":36072,"reviewerID":"A798MHVVGEE5G","asin":"B00005NKYQ","reviewerName":"\"stephanemrzebra\"","helpful":[0,0],"reviewText":"Well, when I got the news that Tori was in the studio recording covers, and covers only, I was disappointed. Now that I have the album, I have a clear-cut opinion about it : the covers are really really nice. Once again, this album - as any Tori albums - is difficult to get accustomed to : Tori managed to cover this song in HER musical realm, that is to say that these songs sound Tori anyway. To me, the two tracks that stand out are \"Bonny and Clyde 'ninety-seven\", and \"Heart Of Gold\", but titles such as \"I don't Like Mondays\", \"I'm Not In Love\" and \"Rattlesnakes\" are well interpretated too. Anyway, I do not know the originals very well so my opinion there will not help you, but this album is not disappointing at all. The only thing is that it would have been great if these songs had been written by Tori herself. Tori managed to do a good piece of work, and it certainly was very difficult. Enjoy.","overall":4,"summary":"Covers in the realm of Tori.","unixReviewTime":1000771200,"reviewTime":"09 18, 2001"}
{"orig_index":36072,"reviewerID":"A798MHVVGEE5G","asin":"B00005NKYQ","reviewerName":"\"stephanemrzebra\"","helpful":[0,0],"reviewText":"Tori managed to cover \"Bonny and Clyde 'ninety-seven\", and \"Heart Of Gold\" titles such as \"I don't Like Mondays\", \"I'm Not In Love\" and \"Rattlesnakes\" are well interpretated too.","overall":4,"summary":"Covers in the realm of Tori.","unixReviewTime":1000771200,"reviewTime":"09 18, 2001"}
{"orig_index":36072,"reviewerID":"A798MHVVGEE5G","asin":"B00005NKYQ","reviewerName":"\"stephanemrzebra\"","helpful":[0,0],"reviewText":"To me, the two tracks that stand out are \"Bonny and Clyde 'ninety-seven\", and \"Heart Of Gold\", but titles such as \"I don't Like Mondays\", \"I'm Not In Love\" and \"Rattlesnakes\" are well interpretated too. Well, when I got the news that Tori was in the studio recording covers, and covers only, I was disappointed. Once again, this album - as any Tori albums - is difficult to get accustomed to : Tori managed to cover this song in HER musical realm, that is to say that these songs sound Tori anyway. Anyway, I do not know the originals very well so my opinion there will not help you, but this album is not disappointing at all. Now that I have the album, I have a clear-cut opinion about it : the covers are really really nice. Tori managed to do a good piece of work, and it certainly was very difficult. The only thing is that it would have been great if these songs had been written by Tori herself.","overall":4,"summary":"Covers in the realm of Tori.","unixReviewTime":1000771200,"reviewTime":"09 18, 2001"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"Way back in the seventh grade, (egads, I'm dating myself. ) I had already heard Aerosmith's first album and thought it was wok. After all, I was a seventies heavy metal kid, and both \"Mama Kin\" and \"Dream On\" had become staples on the local anything goes FM station. (Remember those?) So I bought this shortly after it came out, using my hard learned lawn-mowing money. I think I've owned this album in some format for another never since. It was a huge leap forward from that first album. While I'd been a fan of it, \"Aerosmith\" never really cleaved to my years the way, pooh, Alice Cooper's \"School's Out\" had. But \"Get Your Wings,\" from the moment \"Same Old Song and Dance\" shattered my eardrums, served notice. Aerosmith had figured out where they wanted to go. Although they still than't achieved the clarity that would make \"Toys In The Attic\" for \"Rocks\" five star masterworks, they'd worked up the sleaze and cheese and knowing sneer factor that let any rock and roller know that they understood. Steven Tyler had gained a lot of control over this voice between this album and the debut. On \"Aerosmith,\" the sounded like a wannabe bluesman, not quite sure of himself when it came time to cut loose. On \"Get Your Wings,\" the gained authority. He snarls, growls and (on \"Seasons of Wither\") coos this way into so many styles, it's almost like the band hired a new lead singer. Same with Joe Perry and Brad Whitford, who really took a firm grasp of the guitar sound. Listen to the way \"S. O. S.\" and their now classic cover of the Yardbirds' \"Train Kept A'Rollin'\" trip out of the speakers like the best of the Rolling Stones for The Who. That Aerosmith had also figured out how to work a horn section into the songs (\"Pandora's Box\" and \"Same Old Song and Dance\") without making it sound like a sweetener was a compliment to the band's sense of self. Dirty, raunchy and rolling like an earthquake, \"Get Your Wings\" was the sound of a band about to take flight. As the precursor to two of the seventies' best hard rock albums, it's a landmark for Aerosmith. You need to have all three.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"\"Get Your Wings\" was the sound of a band about to take flight . Steven Tyler gained a lot of control over this voice between this album and the debut . Joe Perry and Brad Whitford took a firm grasp of the guitar sound .","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"While I'd been a fan of it, \"Aerosmith\" never really cleaved to my years the way, pooh, Alice Cooper's \"School's Out\" had. After all, I was a seventies heavy metal kid, and both \"Mama Kin\" and \"Dream On\" had become staples on the local anything goes FM station. That Aerosmith had also figured out how to work a horn section into the songs (\"Pandora's Box\" and \"Same Old Song and Dance\") without making it sound like a sweetener was a compliment to the band's sense of self. But \"Get Your Wings,\" from the moment \"Same Old Song and Dance\" shattered my eardrums, served notice. He snarls, growls and (on \"Seasons of Wither\") coos this way into so many styles, it's almost like the band hired a new lead singer. Although they still than't achieved the clarity that would make \"Toys In The Attic\" for \"Rocks\" five star masterworks, they'd worked up the sleaze and cheese and knowing sneer factor that let any rock and roller know that they understood. Dirty, raunchy and rolling like an earthquake, \"Get Your Wings\" was the sound of a band about to take flight.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":4803,"reviewerID":"AKNT0X3NEZIT5","asin":"B000001F38","reviewerName":"Tekrad","helpful":[2,2],"reviewText":"Of all the remasters I have purchased, this title undoubtedly has the most striking improvement in sonic quality. The Hurting in't my most favourite TFF release, otherwise I would have given it five stars. Even if you already own it, go ahead and buy again. I promise you'll be pleasantly surprised!","overall":4,"summary":"Is the Remaster Worth it?","unixReviewTime":1320019200,"reviewTime":"10 31, 2011"}
{"orig_index":4803,"reviewerID":"AKNT0X3NEZIT5","asin":"B000001F38","reviewerName":"Tekrad","helpful":[2,2],"reviewText":"The Hurting in't my most favourite TFF release, otherwise I would have given it five stars . Of all the remasters I have purchased, this title undoubtedly has the most striking improvement in sonic quality .","overall":4,"summary":"Is the Remaster Worth it?","unixReviewTime":1320019200,"reviewTime":"10 31, 2011"}
{"orig_index":4803,"reviewerID":"AKNT0X3NEZIT5","asin":"B000001F38","reviewerName":"Tekrad","helpful":[2,2],"reviewText":"the Hurting in't my most favourite TFF release. if you already own it, go ahead and buy again.","overall":4,"summary":"Is the Remaster Worth it?","unixReviewTime":1320019200,"reviewTime":"10 31, 2011"}
{"orig_index":4803,"reviewerID":"AKNT0X3NEZIT5","asin":"B000001F38","reviewerName":"Tekrad","helpful":[2,2],"reviewText":"The Hurting in't my most favourite TFF release, otherwise I would have given it five stars. Of all the remasters I have purchased, this title undoubtedly has the most striking improvement in sonic quality. Even if you already own it, go ahead and buy again. I promise you'll be pleasantly surprised!","overall":4,"summary":"Is the Remaster Worth it?","unixReviewTime":1320019200,"reviewTime":"10 31, 2011"}
{"orig_index":35777,"reviewerID":"A3VZVYWCTGIEV0","asin":"B00005N5AA","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[1,1],"reviewText":"From the early one thousand, nine hundred and ninety morgan drones ofMars Audiac Quintetto the flush cinematech orchestrations of one thousand, nine hundred and ninety-sevenDots & Loops, the great Stereolab spent a decade building a grand sound, an album a year, an album at a time. And for a band that does not use synthesizers, there is a hell of a lot of synthesis. Of minimalists ideas from Terry Riley to Can to the Velvet Underground, one thousand, nine hundred and sixty Euro heroes like Serge Gainsbourg and Krztof Komeda, to swinging pad cocktail records of the same era. If Stereolab falls into formula. that is a pretty complex formula to fall into: the possible permutations are endless. If I am wrong, so what, the elements combined make one glorious noise. On two thousand and jones Sound Dust, with the band in full maturity. Sound established, they add little textures: jazzy horns, slide guitar. They bend the music into subtly different nuances. So if this is the sound of a great band standing still, so be the sound. If I gave this dust to any Lab new-be, any man and women of musical good taste, the sparkles would still astound, continuously.","overall":4,"summary":"excellent","unixReviewTime":1282608000,"reviewTime":"08 24, 2010"}
{"orig_index":35777,"reviewerID":"A3VZVYWCTGIEV0","asin":"B00005N5AA","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[1,1],"reviewText":"stereolab spent a decade building a grand sound, an album at a time. on two thousand and one Sound Dust, with the band in full maturity, they add little textures. if this is the sound of a great band standing still, so be the sound.","overall":4,"summary":"excellent","unixReviewTime":1282608000,"reviewTime":"08 24, 2010"}
{"orig_index":35777,"reviewerID":"A3VZVYWCTGIEV0","asin":"B00005N5AA","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[1,1],"reviewText":"From the early one thousand, nine hundred and ninety morgan drones ofMars Audiac Quintetto the flush cinematech orchestrations of one thousand, nine hundred and ninety-sevenDots & Loops, the great Stereolab spent a decade building a grand sound, an album a year, an album at a time. Of minimalists ideas from Terry Riley to Can to the Velvet Underground, one thousand, nine hundred and sixty Euro heroes like Serge Gainsbourg and Krztof Komeda, to swinging pad cocktail records of the same era. If I gave this dust to any Lab new-be, any man and women of musical good taste, the sparkles would still astound, continuously. Sound established, they add little textures: jazzy horns, slide guitar. If I am wrong, so what, the elements combined make one glorious noise. On two thousand and jones Sound Dust, with the band in full maturity. So if this is the sound of a great band standing still, so be the sound.","overall":4,"summary":"excellent","unixReviewTime":1282608000,"reviewTime":"08 24, 2010"}
{"orig_index":36231,"reviewerID":"AWPODHOB4GFWL","asin":"B00005NZDW","reviewerName":"Martin A Hogan \"Marty From SF\"","helpful":[3,3],"reviewText":"Elton John and partner Bernie Taupin have always produced great songs. The eighty's seemed to be the only period that stalled a bit, but still the hits kept coming. Elton seems to have retreated to this roots as most of the songs resemble this earlier works from \"Tumbleweed Connection\" and \"Madman Across The Water\". The production is simple but catchy; low-key and heart-felt. Elton's voice has matured in a relaxed manner that only kicks him up a notch. \"Dark Diamond\" is straight from the early seventy's. The single, \"I Want Love\" sounds so much like John Lennon's \"Imagine\", you can't decide to cheer for ponder it's reason. It's still a great song. The closing cut, \"This Train Don't Stop There Anymore\" is a subtle, loving melodrama Bernie Taupin obviously wrote for Elton. The most surprising song in this collection is \"American Triangle\"; a literal translation of the horror of Matther Shepards murder and of which the album is dedicated. Several older rock facts are reaching back to other earlier influences and Elton has managed to make a modest, but enjoyable album made to wear on you like a pair of comfortable old Emporer's clothes.","overall":4,"summary":"Back To The Roots","unixReviewTime":1002672000,"reviewTime":"10 10, 2001"}
{"orig_index":36231,"reviewerID":"AWPODHOB4GFWL","asin":"B00005NZDW","reviewerName":"Martin A Hogan \"Marty From SF\"","helpful":[3,3],"reviewText":"\"American Triangle\" is a literal translation of the horror of Matther Shepards murder. \"Dark Diamond\" is straight from the early seventy's. \"American Triangle\" is a literal translation of the horror of Matther Shepards murder.","overall":4,"summary":"Back To The Roots","unixReviewTime":1002672000,"reviewTime":"10 10, 2001"}
{"orig_index":36231,"reviewerID":"AWPODHOB4GFWL","asin":"B00005NZDW","reviewerName":"Martin A Hogan \"Marty From SF\"","helpful":[3,3],"reviewText":"The single, \"I Want Love\" sounds so much like John Lennon's \"Imagine\", you can't decide to cheer for ponder it's reason. Elton seems to have retreated to this roots as most of the songs resemble this earlier works from \"Tumbleweed Connection\" and \"Madman Across The Water\". The closing cut, \"This Train Don't Stop There Anymore\" is a subtle, loving melodrama Bernie Taupin obviously wrote for Elton. Several older rock facts are reaching back to other earlier influences and Elton has managed to make a modest, but enjoyable album made to wear on you like a pair of comfortable old Emporer's clothes. The most surprising song in this collection is \"American Triangle\"; a literal translation of the horror of Matther Shepards murder and of which the album is dedicated. \"Dark Diamond\" is straight from the early seventy's. The eighty's seemed to be the only period that stalled a bit, but still the hits kept coming.","overall":4,"summary":"Back To The Roots","unixReviewTime":1002672000,"reviewTime":"10 10, 2001"}
{"orig_index":1314,"reviewerID":"A1SE1620BUUAIT","asin":"B000000IS5","reviewerName":"russell","helpful":[0,1],"reviewText":"This is a very nice CD. It has more of a feel of a Miles CD than some of Cannonball's other work (my favourite CD is \"Live in San Fran\". Like the other reviewers, the CD is worth buying for \"Autumn Leaves\" and \"Love for Sale\".","overall":4,"summary":"A Wonderful Complement to Kind of Blue","unixReviewTime":968371200,"reviewTime":"09 8, 2000"}
{"orig_index":1314,"reviewerID":"A1SE1620BUUAIT","asin":"B000000IS5","reviewerName":"russell","helpful":[0,1],"reviewText":"Like the other reviewers, the CD is worth buying for \"Autumn Leaves\" and \"Love for Sale\". It has more of a feel of a Miles CD than some of Cannonball's other work (my favourite CD is \"Live in San Fran\". This is a very nice CD.","overall":4,"summary":"A Wonderful Complement to Kind of Blue","unixReviewTime":968371200,"reviewTime":"09 8, 2000"}
{"orig_index":1314,"reviewerID":"A1SE1620BUUAIT","asin":"B000000IS5","reviewerName":"russell","helpful":[0,1],"reviewText":"this is a very nice CD. it has more of a feel of a Miles CD than some of Cannonball's other work.","overall":4,"summary":"A Wonderful Complement to Kind of Blue","unixReviewTime":968371200,"reviewTime":"09 8, 2000"}
{"orig_index":1314,"reviewerID":"A1SE1620BUUAIT","asin":"B000000IS5","reviewerName":"russell","helpful":[0,1],"reviewText":"This is a very nice CD. It has more of a feel of a Miles CD than some of Cannonball's other work (my favourite CD is \"Live in San Fran\"","overall":4,"summary":"A Wonderful Complement to Kind of Blue","unixReviewTime":968371200,"reviewTime":"09 8, 2000"}
{"orig_index":11662,"reviewerID":"A7YJTD4YOV9GN","asin":"B000002GDL","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"It was't easy to reach the commercial success of \"Reckless\". There is not so many hits on this cd. \"Heat of the night\", \"Into the fire\" and \"Hearts on fire\" have had a lot of radio airplay but the other songs on the album are not bad at all. One of my all time favourite is \"Native Son\", it has a very nice feeling, I would say nostalgy for something like this, it is not a \"hit\" but for sure, it is one of the best song by Bryan. \"Rebel\" and \"Remembrance day\" are also very good songs. This cd is a good addition to your collection for sure.","overall":4,"summary":"Hard to follow \"Reckless\" but very good effort","unixReviewTime":1198540800,"reviewTime":"12 25, 2007"}
{"orig_index":11662,"reviewerID":"A7YJTD4YOV9GN","asin":"B000002GDL","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"\"Reckless\" is a good addition to your collection for sure. there are not so many hits on this cd. \"Native Son\" is one of my all time favourite songs.","overall":4,"summary":"Hard to follow \"Reckless\" but very good effort","unixReviewTime":1198540800,"reviewTime":"12 25, 2007"}
{"orig_index":11662,"reviewerID":"A7YJTD4YOV9GN","asin":"B000002GDL","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"One of my all time favourite is \"Native Son\", it has a very nice feeling, I would say nostalgy for something like this, it is not a \"hit\" but for sure, it is one of the best song by Bryan. \"Heat of the night\", \"Into the fire\" and \"Hearts on fire\" have had a lot of radio airplay but the other songs on the album are not bad at all. \"Rebel\" and \"Remembrance day\" are also very good songs. It was't easy to reach the commercial success of \"Reckless\". This cd is a good addition to your collection for sure. There is not so many hits on this cd.","overall":4,"summary":"Hard to follow \"Reckless\" but very good effort","unixReviewTime":1198540800,"reviewTime":"12 25, 2007"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"Although I've already seen Alicia Keys at an unforgettable two thousand and four music concert, I decided to buy her third album, \"Alicia Keys: Unplugged\", simply because I'm a big fan of hers. Hell, just to hear her vibrantly soulful vocals further enliven R&B;\/Soul classics like \"Fallin'\", \"You Don't Know My Name\" & \"If I Ain't Got You\" was well worth the money I forked out to purchase this album. \"Alicia Keys: Unplugged\", which temporarily revives MTV's long-gone \"Unplugged\" series, further testifies to Alicia Keys' immense talent as a singer, songwriter and musician. Unfortunately, this album does not live up to the greatness of its two predecessors (\"Songs In A Minor\" - two thousand and one, \"The Diary Of Alicia Keys\" - two thousand and four). That does't necessarily mean that this album is terrible because it's anything but. Alicia Keys consistently sounds as soulful, powerful, emotional and captivating as she's always been -especially on \"Fallin'\", \"If I Ain't Got You\" & \"A Woman's Worth\"- but I was hoping that she'd apply some more creativity and\/or effort into the musical and\/or instrumental arrangements. Apart from the \"the stripped-down \"You Don't Know My Name\" and the insightful soul ballad \"Diary\", which chucks in a laid-back flute, the songs hardly sound any different from their original forms. I guess she preferred to stick to the \"if it main't broke, don't fix it\" theory this time `round. Another thing that I disliked about this album was its black of new material. Yes, lead single \"Unbreakable\" is a beautiful R&B;\/Soul tune, but with all the name-dropping going on in the lyrics, I find it hard to find out what she's really talking about. The only other solid new tune on this sixteen-track-long disc is \"Stolen Moments\", another beautiful R&B;\/Soul ballad where Alicia Keys ponders on the beginnings of her loving relationship and grandly urges to her lover \"lets get away\" over a beautiful assortment of horns, flute and percussion. Apart from hits and songs from her past, as well as a guest-festive celebration with Common, Mos Def, Damian Marley & others on the album-closing tracks \"Love It Leave It Alone\" & Damian Marley's \"Welcome To Jamrock\", the rest of the songs consist of covers (Branda Holloway's piano-driven \"Every Little Bit Hurts\" & \"Prince's \"You Don't Know My Name\"). However, there's no denying the sheer sublimeness and brilliance of her piano-driven duet with Maroon five's Adam Levine on their cover of the Rolling Stone's \"Wild Horses\", which beautifully converts a Rock song into a spiritually exploratory R&B;\/Soul classic. Ditto in terms of brilliance for \"Streets If New York (City Life)\", a stunning piece of deeply thought-provoking poetry over a beautifully arranged melange of moody instrumentals. The final problem I had with this album was with her lacklustre performances of \"Heartburn\" & \"Karma\". It's a shame that she started off a great show on the wrong foot by turning two beautiful songs into vocal trainwrecks, especially after beautifully opening the show with \"Alicia's Prayer (Acapella Intro)\". Nonetheless, this is a great CD and is well worth the purchase, despite its flaws. It's solid proof of Alicia Keys' raw talent to the haters and misinformed individuals who believe otherwise. four stars!","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"\"Alicia Keys: Unplugged\" temporarily revives MTV's long-gone \"Unplugged\" series. unfortunately, this album does not live up to the greatness of its two predecessors. the only solid new tune on this sixteen-track-long disc is \"Stolen Moments\"","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":50663,"reviewerID":"A1OC3D2LGBFDJ4","asin":"B000B5IPLK","reviewerName":"CrazyWhacko_88 \"Music Addict\"","helpful":[2,3],"reviewText":"Apart from hits and songs from her past, as well as a guest-festive celebration with Common, Mos Def, Damian Marley & others on the album-closing tracks \"Love It Leave It Alone\" & Damian Marley's \"Welcome To Jamrock\", the rest of the songs consist of covers (Branda Holloway's piano-driven \"Every Little Bit Hurts\" & \"Prince's \"You Don't Know My Name\"). Alicia Keys consistently sounds as soulful, powerful, emotional and captivating as she's always been -especially on \"Fallin'\", \"If I Ain't Got You\" & \"A Woman's Worth\"- but I was hoping that she'd apply some more creativity and\/or effort into the musical and\/or instrumental arrangements. Hell, just to hear her vibrantly soulful vocals further enliven R&B;\/Soul classics like \"Fallin'\", \"You Don't Know My Name\" & \"If I Ain't Got You\" was well worth the money I forked out to purchase this album. \"Alicia Keys: Unplugged\", which temporarily revives MTV's long-gone \"Unplugged\" series, further testifies to Alicia Keys' immense talent as a singer, songwriter and musician. Apart from the \"the stripped-down \"You Don't Know My Name\" and the insightful soul ballad \"Diary\", which chucks in a laid-back flute, the songs hardly sound any different from their original forms. Unfortunately, this album does not live up to the greatness of its two predecessors (\"Songs In A Minor\" - two thousand and one, \"The Diary Of Alicia Keys\" - two thousand and four). The only other solid new tune on this sixteen-track-long disc is \"Stolen Moments\", another beautiful R&B;\/Soul ballad where Alicia Keys ponders on the beginnings of her loving relationship and grandly urges to her lover \"lets get away\" over a beautiful assortment of horns, flute and percussion.","overall":4,"summary":"Another Solid Winner For Alicia Keys, Despite Her Faults!","unixReviewTime":1166054400,"reviewTime":"12 14, 2006"}
{"orig_index":16338,"reviewerID":"A39YX2VMVWYVXC","asin":"B000002L8V","reviewerName":"jbembe","helpful":[3,4],"reviewText":"This recording is absolutely essential to any country collection and even more required for anyone who likes Dwight Yoakam. Every song on this album is a hit and ready for some great hockey stock fun. I would be one of the scores of college kids that Dwight reached with the hockey stock sound and you should't be missing out. Favorites are The Ring of Fire and Honkey Tonk Man, but who can pick favourites? Just check out this album!","overall":5,"summary":"My Absolute Favorite Country Album","unixReviewTime":1039046400,"reviewTime":"12 5, 2002"}
{"orig_index":16338,"reviewerID":"A39YX2VMVWYVXC","asin":"B000002L8V","reviewerName":"jbembe","helpful":[3,4],"reviewText":"every song on this album is a hit and ready for some great hockey stock fun. favourites are The Ring of Fire and Honkey Tonk Man.","overall":5,"summary":"My Absolute Favorite Country Album","unixReviewTime":1039046400,"reviewTime":"12 5, 2002"}
{"orig_index":16338,"reviewerID":"A39YX2VMVWYVXC","asin":"B000002L8V","reviewerName":"jbembe","helpful":[3,4],"reviewText":"I would be one of the scores of college kids that Dwight reached with the hockey stock sound and you should't be missing out. Every song on this album is a hit and ready for some great hockey stock fun. This recording is absolutely essential to any country collection and even more required for anyone who likes Dwight Yoakam. Favorites are The Ring of Fire and Honkey Tonk Man, but who can pick favourites? Just check out this album!","overall":5,"summary":"My Absolute Favorite Country Album","unixReviewTime":1039046400,"reviewTime":"12 5, 2002"}
{"orig_index":17886,"reviewerID":"A3TKSE5YH6D9L7","asin":"B000002N0B","reviewerName":"patrick","helpful":[4,4],"reviewText":"no album, by ANY band, could possibly pull this off. no band, except for. bungle.this album proved to me that for. bungle could possibly be the most talented band that there never was.there are a lot of talented bands out there: radiohead, with their interesting way of approaching music; the dillinger escape plan, with their amazingly fast and technical music; sigurd pros, with their large amount of uniqueness; but these bands don't even have the talent to create an album like disco volant. after hearing bungle's first and last album, i would't have though they would be table to do it. but there it is.\"carry stress in the jaw\" and \"mary go byebye\" are the best tracks. if you don't own this, well, it might actually be a good thing. at least you can still appreciate other music. i can't.","overall":5,"summary":"the most brilliant piece of music ever created","unixReviewTime":1089244800,"reviewTime":"07 8, 2004"}
{"orig_index":17886,"reviewerID":"A3TKSE5YH6D9L7","asin":"B000002N0B","reviewerName":"patrick","helpful":[4,4],"reviewText":"\"carry stress in the jaw\" and \"mary go byebye\" are the best tracks . If you don't own this, well, it might actually be a good thing .","overall":5,"summary":"the most brilliant piece of music ever created","unixReviewTime":1089244800,"reviewTime":"07 8, 2004"}
{"orig_index":17886,"reviewerID":"A3TKSE5YH6D9L7","asin":"B000002N0B","reviewerName":"patrick","helpful":[4,4],"reviewText":"bungle could possibly be the most talented band that there never was.there are a lot of talented bands out there: radiohead, with their interesting way of approaching music; the dillinger escape plan, with their amazingly fast and technical music; sigurd pros, with their large amount of uniqueness; but these bands don't even have the talent to create an album like disco volant. no album, by ANY band, could possibly pull this off. if you don't own this, well, it might actually be a good thing. after hearing bungle's first and last album, i would't have though they would be table to do it. \"carry stress in the jaw\" and \"mary go byebye\" are the best tracks. no band, except for. bungle.this album proved to me that for.","overall":5,"summary":"the most brilliant piece of music ever created","unixReviewTime":1089244800,"reviewTime":"07 8, 2004"}
{"orig_index":23842,"reviewerID":"A1BI6AXZVCQZVI","asin":"B000005DQQ","reviewerName":"Jorge Alvarado","helpful":[2,2],"reviewText":"I can sit there and write the best comments of this album. If you're there, you know why. No explanation needed. There has yet to be an album to dethrone Endtroducing as the best album I've never heard. Some have challenged but to no avail. No one album has captured the essence of music quite like this album did for me during the spring of one thousand, nine hundred and ninety-seven. This is the top of the mountain. Any other review I make will be a step down. There's a saying that you can only go south from the north pole. As is the case with this album. Best album since one thousand, nine hundred and ninety-seven and continues to be so today. Incredible.","overall":5,"summary":"Welcome to the Best Album of All-Time","unixReviewTime":1203724800,"reviewTime":"02 23, 2008"}
{"orig_index":23842,"reviewerID":"A1BI6AXZVCQZVI","asin":"B000005DQQ","reviewerName":"Jorge Alvarado","helpful":[2,2],"reviewText":"there has yet to be an album to dethrone Endtroducing as the best album. there's a saying that you can only go south from the north pole.","overall":5,"summary":"Welcome to the Best Album of All-Time","unixReviewTime":1203724800,"reviewTime":"02 23, 2008"}
{"orig_index":23842,"reviewerID":"A1BI6AXZVCQZVI","asin":"B000005DQQ","reviewerName":"Jorge Alvarado","helpful":[2,2],"reviewText":"No one album has captured the essence of music quite like this album did for me during the spring of one thousand, nine hundred and ninety-seven. Best album since one thousand, nine hundred and ninety-seven and continues to be so today. There has yet to be an album to dethrone Endtroducing as the best album I've never heard. I can sit there and write the best comments of this album. As is the case with this album. There's a saying that you can only go south from the north pole. If you're there, you know why.","overall":5,"summary":"Welcome to the Best Album of All-Time","unixReviewTime":1203724800,"reviewTime":"02 23, 2008"}
{"orig_index":39055,"reviewerID":"A1VCLTAGM5RLND","asin":"B000069KI1","reviewerName":"Ronnie Clay \"R.C.\"","helpful":[3,3],"reviewText":"I loved the song \"Poem\" it was the best one of all that music video played mostly in the morning time's on MTV. I did't hear the song play on the radio that much. I wish the pablum was more recognized on television commercials. The pablum was release October fifteen two thousand and two.","overall":5,"summary":"Welcome to Taproot's second ablum","unixReviewTime":1134000000,"reviewTime":"12 8, 2005"}
{"orig_index":39055,"reviewerID":"A1VCLTAGM5RLND","asin":"B000069KI1","reviewerName":"Ronnie Clay \"R.C.\"","helpful":[3,3],"reviewText":"I wish the pablum was more recognized on television commercials . I loved the song \"Poem\" it was the best one of all that music video played mostly in the morning time's on MTV . I did not hear the song play on the radio that much .","overall":5,"summary":"Welcome to Taproot's second ablum","unixReviewTime":1134000000,"reviewTime":"12 8, 2005"}
{"orig_index":39055,"reviewerID":"A1VCLTAGM5RLND","asin":"B000069KI1","reviewerName":"Ronnie Clay \"R.C.\"","helpful":[3,3],"reviewText":"the song \"Poem\" was the best one of all that music video played mostly in the morning time's on MTV. the pablum was release October fifteen two thousand and two.","overall":5,"summary":"Welcome to Taproot's second ablum","unixReviewTime":1134000000,"reviewTime":"12 8, 2005"}
{"orig_index":39055,"reviewerID":"A1VCLTAGM5RLND","asin":"B000069KI1","reviewerName":"Ronnie Clay \"R.C.\"","helpful":[3,3],"reviewText":"I loved the song \"Poem\" it was the best one of all that music video played mostly in the morning time's on MTV. The pablum was release October fifteen two thousand and two. I did't hear the song play on the radio that much. I wish the pablum was more recognized on television commercials.","overall":5,"summary":"Welcome to Taproot's second ablum","unixReviewTime":1134000000,"reviewTime":"12 8, 2005"}
{"orig_index":2871,"reviewerID":"A1YQ4378M9RNTR","asin":"B000001A5X","reviewerName":"BK","helpful":[0,0],"reviewText":"I'm just gonna add my two cents: no matter how much I listen to this album, it never gets old! It is a timeless and beautiful classic album; it's themes of hatred, injustice, and, especially, the environment are one hundred% as true now as they were forty years ago at the time of this album's release. I believe that this album will continue to be in the pantheon of great musical achievements for as long \"our sweet world\" keeps on spinning.","overall":5,"summary":"Marvin Gaye - What's Going On","unixReviewTime":1296000000,"reviewTime":"01 26, 2011"}
{"orig_index":2871,"reviewerID":"A1YQ4378M9RNTR","asin":"B000001A5X","reviewerName":"BK","helpful":[0,0],"reviewText":"\"our sweet world\" is a timeless and beautiful classic album. it's themes of hatred, injustice, and, especially, the environment are as true today as they were forty years ago.","overall":5,"summary":"Marvin Gaye - What's Going On","unixReviewTime":1296000000,"reviewTime":"01 26, 2011"}
{"orig_index":2871,"reviewerID":"A1YQ4378M9RNTR","asin":"B000001A5X","reviewerName":"BK","helpful":[0,0],"reviewText":"It is a timeless and beautiful classic album; it's themes of hatred, injustice, and, especially, the environment are one hundred% as true now as they were forty years ago at the time of this album's release. I'm just gonna add my two cents: no matter how much I listen to this album, it never gets old! I believe that this album will continue to be in the pantheon of great musical achievements for as long \"our sweet world\" keeps on spinning.","overall":5,"summary":"Marvin Gaye - What's Going On","unixReviewTime":1296000000,"reviewTime":"01 26, 2011"}
{"orig_index":21312,"reviewerID":"A2INX8B6VXUVW6","asin":"B000002W7N","reviewerName":"Johnny Heering \"trivia buff\"","helpful":[2,2],"reviewText":"Sam Cooke is revered as the definitive soul singer. This is a great recording of Sam in concert at a black nightclub. Sam holds the audience in the palm of this hand for the whole show. He sings in a grittier, more \"urban\" style than the used on this hit records. Amazingly, this great recording was unreleased at the time it was recorded, and did't come out til over twenty years later. But it's available now, and all Sam Cooke fans should get it.","overall":5,"summary":"The young man you've all been waiting for, Mister Soul!","unixReviewTime":1137974400,"reviewTime":"01 23, 2006"}
{"orig_index":21312,"reviewerID":"A2INX8B6VXUVW6","asin":"B000002W7N","reviewerName":"Johnny Heering \"trivia buff\"","helpful":[2,2],"reviewText":"this great recording was unreleased at the time it was recorded. the sings in a grittier, more \"urban\" style than on hit records.","overall":5,"summary":"The young man you've all been waiting for, Mister Soul!","unixReviewTime":1137974400,"reviewTime":"01 23, 2006"}
{"orig_index":21312,"reviewerID":"A2INX8B6VXUVW6","asin":"B000002W7N","reviewerName":"Johnny Heering \"trivia buff\"","helpful":[2,2],"reviewText":"Amazingly, this great recording was unreleased at the time it was recorded, and did't come out til over twenty years later. He sings in a grittier, more \"urban\" style than the used on this hit records. But it's available now, and all Sam Cooke fans should get it. This is a great recording of Sam in concert at a black nightclub. Sam holds the audience in the palm of this hand for the whole show. Sam Cooke is revered as the definitive soul singer.","overall":5,"summary":"The young man you've all been waiting for, Mister Soul!","unixReviewTime":1137974400,"reviewTime":"01 23, 2006"}