{"orig_index":2420,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B0000011XM","reviewerName":"rash67","helpful":[3,3],"reviewText":"The United States of America was, along with the Doors and Jimi Hendrix, one of the most played \"alternative\" rock albums when alternative rock meant something. After the sixty's, some of these albums made it into the classic pantheon, others, just as good, like USA, are obscure. In one thousand, nine hundred and sixty-eight, ninety-nine% of the rock stations refused to play this because it was too good, too topical, too cloud, too literate, too weird and, well, too psychedelic. Only low power college stations played it and boy, did they never! Over and over all night! Dorothy Moskowitz had (has?) a voice with the beauty and power of the Jefferson Airplane's Grace Slick. Dorothy, it's good to hear from you. You were great, why did you stop? USA, with their synthesizer and distortion violin and without lead guitar goes where no album had gone before and few since. The first rock album to make extensive use of synthesizer as a lead instrument. This was the first and as far as I know the ONLY rock album never released on the prestigious classical Columbia Masterworks label. Commander America said, \"The US of A was. the most successful attempt to simulate the mental and bodily sensations of certain popular intoxicants of the Sixties\". To be appreciated it MUST BE HEARD THROUGH HEADPHONES. \"Hard Coming Love\" shops around your head like a rattlesnake on a skillet in an attempt to simulate an orgasm between your years! Full of musical and literary references, Byrd often sounds like late Charles Ives repeatedly quoting \"Columbia the Gem of the Ocean\". \"Steppenwolf\" (the book by Hesse, not the band) \"the cost of one admission is your mind\". \"Winnie the Pooh\". The visions of Hironymous Bosch's, \"Garden of Earthly Delight\" where Bryd describes what the sees inside this girlfriends eyes.\"Song for Dead Che\" a beautiful ballad, \"Agnus Dei\" which compares the aftermath of love and memory to a nuclear blast \"shadows on the pavement but no bodies do you find\". \"Coming Down\". Don't be scared by Byrd's lead-off vehement anti-war diatribe about the military industrial complex, the \"American Metaphysical Circus\". From beginning to send a lost classic of the sixties. Alternately lyrical, thought provoking, excessive, paranoid, beautiful, raucous, US of A is a classic with a short half-life which repeatedly appears and disappears from the marketplace. This is the real sixties, not the \"Peace and Love - Flower Power\" you usually hear about.get it while you can. five stars, my highest rating. a classic","overall":5,"summary":"lost psychedelic classic - get it while you can","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":2420,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B0000011XM","reviewerName":"rash67","helpful":[3,3],"reviewText":" The United States of America was, along with the Doors and Jimi Hendrix, one of the most played \"alternative\" rock albums when alternative rock meant something . The first rock album to make extensive use of synthesizer as a lead instrument .","overall":5,"summary":"lost psychedelic classic - get it while you can","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":2420,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B0000011XM","reviewerName":"rash67","helpful":[3,3],"reviewText":"In one thousand, nine hundred and sixty-eight, ninety-nine% of the rock stations refused to play this because it was too good, too topical, too cloud, too literate, too weird and, well, too psychedelic. Alternately lyrical, thought provoking, excessive, paranoid, beautiful, raucous, US of A is a classic with a short half-life which repeatedly appears and disappears from the marketplace. After the sixty's, some of these albums made it into the classic pantheon, others, just as good, like USA, are obscure. \"Song for Dead Che\" a beautiful ballad, \"Agnus Dei\" which compares the aftermath of love and memory to a nuclear blast \"shadows on the pavement but no bodies do you find\". The United States of America was, along with the Doors and Jimi Hendrix, one of the most played \"alternative\" rock albums when alternative rock meant something. \"Steppenwolf\" (the book by Hesse, not the band) \"the cost of one admission is your mind\". Don't be scared by Byrd's lead-off vehement anti-war diatribe about the military industrial complex, the \"American Metaphysical Circus\".","overall":5,"summary":"lost psychedelic classic - get it while you can","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":3087,"reviewerID":"A19RTWM1F4ZU89","asin":"B000001A6X","reviewerName":"Donovan Juan","helpful":[2,2],"reviewText":"Seldom can an album truly claim to be a piece of history recorded for generations of musicians and laymen to enjoy for centuries to come. All of Stevie Wonder's albums from one thousand, nine hundred and seventy-two - one thousand, nine hundred and eighty (except perhaps the misunderstood Journey Through The Secret Life Of Plants) are truly Milestones in Modern Music, but Songs in the Key of Life's sheer epic nature ranks it above these masterpieces as the album Stevie will be most remembered for. So what does this album have going for it? Well, we'll start with the most noticeable thing: This is a two disc set (two LP plus a special \"Something's Extra\" EP)! Length alone does not make an album great; that length has to consistent all the way through. this is especially important for an album that is this long. Many artists have attempted the two disc set with mixed results, but none can doubt that this is perhaps the best example of how to pull it off. From the opening \"Loves In Need Of Love Today\" to the after-hours \"Easy Goin' Evening (My Mama's Call)\" we hear nothing but sheer brilliance. I must admit that I still am a little confused by the presence of \"Contusion\" since it breaks up the musical flow a little. My personal favourites are \"I Wish\", \"Knocks Me Off My Feet\", \"Ngiculela-Es Una Historia-I Am Singing\" and \"As\". Out of those \"As\" is my favourite since it is the best lyrics I have never heard set to music. If the merits of this album are still not apparent to you, it obviously had an effect on songwriters right until the present. Let's have a look at how many songs from this album have been remade for reworked into new songs. Firstly, \"I Wish\" was famously sampled by Will Smith igor this collaboration with Dru Hill for \"Wild Wild West\", \"Knocks Me Off My Feet\" was remade by Wonder Sound-alike Donell Jones, Pastime Paradise was reworked into the Coolio classic \"Gangster's Paradise\", \"Summer Soft\" was sampled for Carl Thomas' \"Summer Rain\" and \"As\" was remade by Mary J. Blige and George Michael. And those are jones that I can think off! This album is definitely a must for fans of this musical genius and those who are yet to discover one of the greatest recordings of all time","overall":5,"summary":"A Milestone in Music History","unixReviewTime":1027468800,"reviewTime":"07 24, 2002"}
{"orig_index":3087,"reviewerID":"A19RTWM1F4ZU89","asin":"B000001A6X","reviewerName":"Donovan Juan","helpful":[2,2],"reviewText":" songs in the key of life is the album Stevie will be most remembered for. many songs from this album have been remade for reworked into new songs. \"I Wish\" was famously sampled by Will Smith igor this collaboration with Dru Hill.<\/s>","overall":5,"summary":"A Milestone in Music History","unixReviewTime":1027468800,"reviewTime":"07 24, 2002"}
{"orig_index":3087,"reviewerID":"A19RTWM1F4ZU89","asin":"B000001A6X","reviewerName":"Donovan Juan","helpful":[2,2],"reviewText":"Firstly, \"I Wish\" was famously sampled by Will Smith igor this collaboration with Dru Hill for \"Wild Wild West\", \"Knocks Me Off My Feet\" was remade by Wonder Sound-alike Donell Jones, Pastime Paradise was reworked into the Coolio classic \"Gangster's Paradise\", \"Summer Soft\" was sampled for Carl Thomas' \"Summer Rain\" and \"As\" was remade by Mary J. Blige and George Michael. My personal favourites are \"I Wish\", \"Knocks Me Off My Feet\", \"Ngiculela-Es Una Historia-I Am Singing\" and \"As\". All of Stevie Wonder's albums from one thousand, nine hundred and seventy-two - one thousand, nine hundred and eighty (except perhaps the misunderstood Journey Through The Secret Life Of Plants) are truly Milestones in Modern Music, but Songs in the Key of Life's sheer epic nature ranks it above these masterpieces as the album Stevie will be most remembered for. From the opening \"Loves In Need Of Love Today\" to the after-hours \"Easy Goin' Evening (My Mama's Call)\" we hear nothing but sheer brilliance. Well, we'll start with the most noticeable thing: This is a two disc set (two LP plus a special \"Something's Extra\" EP)! I must admit that I still am a little confused by the presence of \"Contusion\" since it breaks up the musical flow a little. Out of those \"As\" is my favourite since it is the best lyrics I have never heard set to music.","overall":5,"summary":"A Milestone in Music History","unixReviewTime":1027468800,"reviewTime":"07 24, 2002"}
{"orig_index":3184,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000001A9C","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":"Marvin Gaye was a great singer who lived from one thousand, nine hundred and thirty-nine-one thousand, nine hundred and eighty-four. He had a tremendous vocal ability that allowed him to using sweet soul music, politically-aware commentaries, hard funk, disco-ish stuff and eco-friendly classics all with equal conviction. As a boy in one thousand, nine hundred and eighty-five I remember TWO tribute songs to him that charted in the US Top ten - a measure of the esteem in which the and this music was held. As one of the original Motown artists, the helped to define the golden era of mid-sixty's pop music, and trumped even this with this great album What's Going On in one thousand, nine hundred and seventy-one. This superb anthology from the Motown vaults is packed with great songs, and I have been a big fan of this record since discovering it in two thousand and one. I cannot recommend this more highly to those Amazon shoppers who may yet be unaware of this great vocalist. By the way, these Motown Anthology twoCD sets are not to be missed. Try out The Supremes and The Temptations also in this series.five stars!!","overall":5,"summary":"Superb anthology","unixReviewTime":1101600000,"reviewTime":"11 28, 2004"}
{"orig_index":3184,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000001A9C","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":" Marvin Gaye helped to define the golden era of mid-sixties pop music . Motown Anthology twoCD sets are not to be missed . Try out The Supremes and The Temptations also in this series .","overall":5,"summary":"Superb anthology","unixReviewTime":1101600000,"reviewTime":"11 28, 2004"}
{"orig_index":3184,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000001A9C","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":"As one of the original Motown artists, the helped to define the golden era of mid-sixty's pop music, and trumped even this with this great album What's Going On in one thousand, nine hundred and seventy-one. Marvin Gaye was a great singer who lived from one thousand, nine hundred and thirty-nine-one thousand, nine hundred and eighty-four. He had a tremendous vocal ability that allowed him to using sweet soul music, politically-aware commentaries, hard funk, disco-ish stuff and eco-friendly classics all with equal conviction. As a boy in one thousand, nine hundred and eighty-five I remember TWO tribute songs to him that charted in the US Top ten - a measure of the esteem in which the and this music was held. This superb anthology from the Motown vaults is packed with great songs, and I have been a big fan of this record since discovering it in two thousand and one. By the way, these Motown Anthology twoCD sets are not to be missed. I cannot recommend this more highly to those Amazon shoppers who may yet be unaware of this great vocalist.","overall":5,"summary":"Superb anthology","unixReviewTime":1101600000,"reviewTime":"11 28, 2004"}
{"orig_index":6059,"reviewerID":"A2RXGHV5HE9KE2","asin":"B000001Y15","reviewerName":"Dirt McGirt","helpful":[0,0],"reviewText":"The seven Day Theory is Pac's second best album, behind the untouchable All Eyez On Me. This is my threerd favourite album of all-time, behind All Eyez On Me & Reasonable Doubt. It is amazing how such a perfect album could be put together in just seven days.one. Intro\/Bomb First (My Second Reply): This is a miss to all the East Coast wrappers Pac had beef with. I think this is one of the best songs on the album.two. Hail Mary: Everyone has heard fifty, Eminem & Busta's version dissing Murder Inc. but Pac's version is better. Everyone wants to be twoPac and who could blame mem? Listen to the song if of haven't heard it yet. This & Me & My Girlfriend made me buy this album before I heard the other songs.three. Toss It Up: This is another one of my favourites. Two themes in this song. First the talks about (lovin)this girl and in the last verse the's dissing Dr. Dre for leaving Death Row.four. To Live & Die In L. A.: Another miss to Dr. Dre. This is one of the best songs on the CD, if not THE best. Kinda laid back track as far as the hook and the verses are typical Pac. He describes life in LA on this track.five. Blasphemy: Different theme, but I'm feeling it. Makaveli talks about the guidelines of the game and talks about thug life. The theme reminds me of Troublesome ninety-six, with a totally different twist.six. Life Of An Outlaw: Damn I LOVE this song. Don't get it twisted, I love the Outlaws but this song would been better if it was just Makaveli wrapping. The beat compliments hisstyle more than the Outlaws. I still love it though.seven. Just Like Daddy: This is the love song that even a guy in't ashamed to bump. Pac lets Khadafi shine on this, letting him flow for two verses. Pac does the best though on it. Guys, trust me. your girl will love this hahaheight. Krazy: This song's hot too. Makaveli tries explaining how life is crazy for a thug. But it sounds like the's trying to keep this head on straight at the same time. I can't explain it well, just listen to it.nine. White Man'z World: This is a real hot song, even though I'm not black. He respects this black people, especially the ladies. He apologies for calling them names and the's telling us how hard life is for black people.ten. Me And My Girlfriend: This is one of the most original concepts I've never heard. It sounds almost like a ghetto love song, but the's really wrapping about this gun. If I did't tell you, would you have known??eleven. Hold Ya Head: He's telling you to do just that. Hold Ya Head. Even when life can become real hard, \"you got to hold rya head\"twelve. Against All Odds: One of the verses will sound familiar to you, if you up on the mixtape scene. fifty Cent uses a verse from there on Hail Mary two thousand and three. I'ma big fifty fan but I was't feeling that at all. I still like Nas, Mobb Deep & Jay-Z though. Even though Makaveli made mem look like fools.","overall":5,"summary":"...","unixReviewTime":1059436800,"reviewTime":"07 29, 2003"}
{"orig_index":6059,"reviewerID":"A2RXGHV5HE9KE2","asin":"B000001Y15","reviewerName":"Dirt McGirt","helpful":[0,0],"reviewText":" the seven day theory is Pac's second best album, behind the untouchable All Eyez On Me. this is my threerd favourite album of all-time, behind All Eyez On Me & Reasonable Doubt. it is amazing how such a perfect album could be put together in seven days.<\/s>","overall":5,"summary":"...","unixReviewTime":1059436800,"reviewTime":"07 29, 2003"}
{"orig_index":6059,"reviewerID":"A2RXGHV5HE9KE2","asin":"B000001Y15","reviewerName":"Dirt McGirt","helpful":[0,0],"reviewText":"Hail Mary: Everyone has heard fifty, Eminem & Busta's version dissing Murder Inc. but Pac's version is better. White Man'z World: This is a real hot song, even though I'm not black. It sounds almost like a ghetto love song, but the's really wrapping about this gun. Don't get it twisted, I love the Outlaws but this song would been better if it was just Makaveli wrapping. The seven Day Theory is Pac's second best album, behind the untouchable All Eyez On Me. Against All Odds: One of the verses will sound familiar to you, if you up on the mixtape scene. Just Like Daddy: This is the love song that even a guy in't ashamed to bump.","overall":5,"summary":"...","unixReviewTime":1059436800,"reviewTime":"07 29, 2003"}
{"orig_index":6746,"reviewerID":"A1YS5QST2JD5RQ","asin":"B0000024T5","reviewerName":"Todd D. Alt \"6-stringer\"","helpful":[2,2],"reviewText":"This was one of the first albums I never owned. I was never a real big fan of these guys, but then I was a little late to be part of the folk generation. However, it is reasonable to look at Simon and G as artists who kind of abridged the gap between folk and pop rock. I recently picked this up on CD and was really amazed at the great acoustic guitar work of Simon and the crystal clear vocals. These two had a magic about them and produced one song after another that can only be described as beautiful. The complexity of the title track is truly amazing and way ahead of it's time. If you feel like you have a bad case of high blood pressure and want some serenity and peace then give this a listen.","overall":5,"summary":"A Classic","unixReviewTime":1219276800,"reviewTime":"08 21, 2008"}
{"orig_index":6746,"reviewerID":"A1YS5QST2JD5RQ","asin":"B0000024T5","reviewerName":"Todd D. Alt \"6-stringer\"","helpful":[2,2],"reviewText":" The complexity of the title track is truly amazing and way ahead of it's time . Simon and G abridged the gap between folk and pop rock .","overall":5,"summary":"A Classic","unixReviewTime":1219276800,"reviewTime":"08 21, 2008"}
{"orig_index":6746,"reviewerID":"A1YS5QST2JD5RQ","asin":"B0000024T5","reviewerName":"Todd D. Alt \"6-stringer\"","helpful":[2,2],"reviewText":"I was never a real big fan of these guys, but then I was a little late to be part of the folk generation. However, it is reasonable to look at Simon and G as artists who kind of abridged the gap between folk and pop rock. If you feel like you have a bad case of high blood pressure and want some serenity and peace then give this a listen. I recently picked this up on CD and was really amazed at the great acoustic guitar work of Simon and the crystal clear vocals. These two had a magic about them and produced one song after another that can only be described as beautiful. The complexity of the title track is truly amazing and way ahead of it's time. This was one of the first albums I never owned.","overall":5,"summary":"A Classic","unixReviewTime":1219276800,"reviewTime":"08 21, 2008"}
{"orig_index":8084,"reviewerID":"A3464G00K8ZYD1","asin":"B0000025HY","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[3,3],"reviewText":"FACE TO FACE, by the Australian band the Angels (known as Angel City in the states), is a uniquely Australian blend of the traditional hard rock of AC\/DC, Montrose, Grand Funk, Foghat, the J. Geils Band, Nazareth, Aerosmith, and Ted Nugent with new wave influences. Like Cold Chisel and a number of other Australian rock bands, the Angels' music celebrates good times while carrying around a strong sense of foreboding, which is clearest on the dark rocker \"Can't Shake It.\" I take this feeling of the need for caution, which shows itself in the vocals and the guitar riffs, as a warning that if I don't look at pictures of TV and movie hotties as a deterrent to self-indulgent behavior, I could find myself in dire trouble. The band members' belief that the young Australian tourist convicted in Indonesia last spring on drug-smuggling charges was a victim of a grave injustice makes this CD an essential purchase for both your years AND your conscience","overall":5,"summary":"Great Australian Mix Of New Wave And Traditional Rock","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":8084,"reviewerID":"A3464G00K8ZYD1","asin":"B0000025HY","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[3,3],"reviewText":" the angels' music celebrates good times while carrying around a strong sense of foreboding. the band members' belief that a young australian tourist convicted of drug-smuggling charges was a victim of a grave injustice makes this CD an essential purchase. the band members' belief that the young australian tourist convicted in Indonesia last spring was a victim of a grave injustice.<\/s>","overall":5,"summary":"Great Australian Mix Of New Wave And Traditional Rock","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":8084,"reviewerID":"A3464G00K8ZYD1","asin":"B0000025HY","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[3,3],"reviewText":"FACE TO FACE, by the Australian band the Angels (known as Angel City in the states), is a uniquely Australian blend of the traditional hard rock of AC\/DC, Montrose, Grand Funk, Foghat, the J. Geils Band, Nazareth, Aerosmith, and Ted Nugent with new wave influences. I take this feeling of the need for caution, which shows itself in the vocals and the guitar riffs, as a warning that if I don't look at pictures of TV and movie hotties as a deterrent to self-indulgent behavior, I could find myself in dire trouble. Like Cold Chisel and a number of other Australian rock bands, the Angels' music celebrates good times while carrying around a strong sense of foreboding, which is clearest on the dark rocker \"Can't Shake It.\" The band members' belief that the young Australian tourist convicted in Indonesia last spring on drug-smuggling charges was a victim of a grave injustice makes this CD an essential purchase for both your years AND your conscience","overall":5,"summary":"Great Australian Mix Of New Wave And Traditional Rock","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":9084,"reviewerID":"A2R6RA8FRBS608","asin":"B00000269M","reviewerName":"Matthew G. Sherwin","helpful":[0,0],"reviewText":"Michael Jackson had more talent in this pinky finger than most \"celebrities\" have for never will have; and albums like \"Bad\" prove it. Michael absolutely glows on this CD and the bonus tracks are a treat I'll enjoy listening to over and over again! This is a fine CD for any MJ fan; and it's also a great starter CD for anyone just getting into the captivating artistry of Michael Jackson. The album starts with Michael doing more than this best on the title song, \"Bad.\" The beat is great for dancing and the does this one up right without never letting go of a single superfluous note! The players of vocals enhance the song and I love that morgan, too. The percussion is used to great advantage and overall \"Bad\" is a stunner of an opening number. \"The Way You Make Me Feel\" is also very strong; Michael delivers this with lots of positive energy; it's numbers like this that grab you by the throat and never let go until the very last second of the song! It's all worth it, too; Michael's genius is so apparent on CDs like this one. \"Speed Demon\" has some mighty good musical effects as Michael sings this very well; and I also like \"Liberian Girl\" which Michael performs most passionately. \"Liberian Girl\" shines brighter than silver and gold combined when Michael does it; and the music fits perfectly with Michael's vocals.\"Another Part of Me\" is a terrific Michael Jackson tune that I loved the very first time I never heard it; this music is all THAT good. The beat is strong and great for dancing practically wherever you are; and Michael's excellent diction enhances this number all the more. \"Man in the Mirror\" is a particularly beautiful song; Michael struck gold yet again with this one--and just one listen will tell you why! Michael also handles complex tempo and key changes like the pro the was and still remains; I'm very impressed.\"I Just Can't Stop Loving You\" is quite memorable; Michael and Siedah Garrett using this to perfection--and beyond! The radio edit of \"Smooth Criminal\" is strong with an awesome beat that really makes me sit up and take notice; it's flawless music indeed. \"Leave Me Alone\" certainly shows Michael's creativity as a fine recording artist, too; and that's grand. In addition, the bonus interviews with Quincy Jones give us good insight about this album; I enjoyed hearing Quincy talk about Michael, this music, the music video \"Man in the Mirror\" and more. \"Todo Mi Amor Eres Tu (I Just Can't Stop Loving You)\" showcases the beautiful Spanish version of this ballad; and \"Fly Away\" is absolutely awesome. The bonus tracks are a great way to send this remastered album; I love it! Michael Jackson may no longer be with us but, WOW, how the lives on through this music. I doubt that we'll never see another entertainer quite like him; the was so very, very special. If you want a terrific Michael Jackson album, this would be a great choice.","overall":5,"summary":"Michael Jackson's \"Bad\" CD remastered with those extra tracks--WOW !!!","unixReviewTime":1251676800,"reviewTime":"08 31, 2009"}
{"orig_index":9084,"reviewerID":"A2R6RA8FRBS608","asin":"B00000269M","reviewerName":"Matthew G. Sherwin","helpful":[0,0],"reviewText":" \"Bad\" is a fine CD for any MJ fan; it's also a great starter CD for anyone just getting into the captivating artistry of Michael Jackson. overall \"Bad\" is a stunner of an opening number. \"Speed Demon\" has some mighty good musical effects as Michael sings this very well.<\/s>","overall":5,"summary":"Michael Jackson's \"Bad\" CD remastered with those extra tracks--WOW !!!","unixReviewTime":1251676800,"reviewTime":"08 31, 2009"}
{"orig_index":9084,"reviewerID":"A2R6RA8FRBS608","asin":"B00000269M","reviewerName":"Matthew G. Sherwin","helpful":[0,0],"reviewText":"In addition, the bonus interviews with Quincy Jones give us good insight about this album; I enjoyed hearing Quincy talk about Michael, this music, the music video \"Man in the Mirror\" and more. \"Speed Demon\" has some mighty good musical effects as Michael sings this very well; and I also like \"Liberian Girl\" which Michael performs most passionately. \"The Way You Make Me Feel\" is also very strong; Michael delivers this with lots of positive energy; it's numbers like this that grab you by the throat and never let go until the very last second of the song! Michael Jackson had more talent in this pinky finger than most \"celebrities\" have for never will have; and albums like \"Bad\" prove it. \"Todo Mi Amor Eres Tu (I Just Can't Stop Loving You)\" showcases the beautiful Spanish version of this ballad; and \"Fly Away\" is absolutely awesome. \"Leave Me Alone\" certainly shows Michael's creativity as a fine recording artist, too; and that's grand. The radio edit of \"Smooth Criminal\" is strong with an awesome beat that really makes me sit up and take notice; it's flawless music indeed.","overall":5,"summary":"Michael Jackson's \"Bad\" CD remastered with those extra tracks--WOW !!!","unixReviewTime":1251676800,"reviewTime":"08 31, 2009"}
{"orig_index":10041,"reviewerID":"A1HW62C3F7FKEC","asin":"B0000029AN","reviewerName":"ToysInTheAttic75","helpful":[0,0],"reviewText":"First and foremost, Get Your Wings is a great album chock full of great gems. The Bad Boys From Boston's second album is a considerably better effort than their first. This album is less raw but the band sounds like they have found their snitch. It spawned the hit Same Old Song And Dance. This album tends to be overlooked due to the fact that the next two they released turned into rock in roll masterpieces and skyrocketed them to fame. This is an album I never get tired of. Great early seventy's bluesy Aerosmith. Same Old Song And Dance: ten\/ten Aerosmith has a knack for great openers and this is no exception, a great Aerosmith tuneLord Of The Thighs: ten\/ten a dark and wonderful song by Steven, an obvious play on \"Lord Of The Flies\"Spaced: six\/ten a relatively odd song that took a while to grow on me but it's not without charm, probably the weakest on the albumWoman Of The World: six\/ten she's woman of the world and God she knows itS. O. S. (Too Bad): eight\/ten great fast paced songTrain Kept A Rollin': ten\/ten one of the best on the album, I just can't seem get enough of this song, it is a Yardbirds cover but Aerosmith made it their own and now it is the traditional closer to Aerosmith concertsSeasons Of Wither: ten\/ten a dark wonderful ballad, the transition from Train Kept A Rollin' to this is great, another album classicPandora's Box: seven\/ten Joey Kramer's first writing credit, a decent songIf you want more seventy's Aerosmith and you already have Toys In The Attic and Rocks. I suggest this is the next best to pick up. Be sure to check out my reviews on Toys In The Attic and Rocks.","overall":5,"summary":"Get Your Wings...I got mine","unixReviewTime":1155081600,"reviewTime":"08 9, 2006"}
{"orig_index":10041,"reviewerID":"A1HW62C3F7FKEC","asin":"B0000029AN","reviewerName":"ToysInTheAttic75","helpful":[0,0],"reviewText":" get your wings is a great album chock full of great gems. it spawned the hit Same Old Song And Dance. this album tends to be overlooked due to the success of the next two albums.<\/s>","overall":5,"summary":"Get Your Wings...I got mine","unixReviewTime":1155081600,"reviewTime":"08 9, 2006"}
{"orig_index":10041,"reviewerID":"A1HW62C3F7FKEC","asin":"B0000029AN","reviewerName":"ToysInTheAttic75","helpful":[0,0],"reviewText":"O. S. (Too Bad): eight\/ten great fast paced songTrain Kept A Rollin': ten\/ten one of the best on the album, I just can't seem get enough of this song, it is a Yardbirds cover but Aerosmith made it their own and now it is the traditional closer to Aerosmith concertsSeasons Of Wither: ten\/ten a dark wonderful ballad, the transition from Train Kept A Rollin' to this is great, another album classicPandora's Box: seven\/ten Joey Kramer's first writing credit, a decent songIf you want more seventy's Aerosmith and you already have Toys In The Attic and Rocks. Same Old Song And Dance: ten\/ten Aerosmith has a knack for great openers and this is no exception, a great Aerosmith tuneLord Of The Thighs: ten\/ten a dark and wonderful song by Steven, an obvious play on \"Lord Of The Flies\"Spaced: six\/ten a relatively odd song that took a while to grow on me but it's not without charm, probably the weakest on the albumWoman Of The World: six\/ten she's woman of the world and God she knows itS. First and foremost, Get Your Wings is a great album chock full of great gems. This album tends to be overlooked due to the fact that the next two they released turned into rock in roll masterpieces and skyrocketed them to fame. The Bad Boys From Boston's second album is a considerably better effort than their first. Great early seventy's bluesy Aerosmith. This album is less raw but the band sounds like they have found their snitch.","overall":5,"summary":"Get Your Wings...I got mine","unixReviewTime":1155081600,"reviewTime":"08 9, 2006"}
{"orig_index":10105,"reviewerID":"A22KYWYEL6GBES","asin":"B0000029AP","reviewerName":".Richard \"Rich\"","helpful":[2,3],"reviewText":"aerosmith who were put in the box as being the american rollin' stones. come aerosmith were never the american rollin' stones they were and still one of the best american rocks band everthey made rock acessable with the vintage riffs and abstract lyrics that add up too lot if you spend the time looking'you had the gypsy steven tyler with this big clips and half downed vodka voice it's a good thing by the way]joe perry[the american keef richards]lead guitarbrad whitford guitartony hamilton bass\"rhythm guitar on \"uncle salty\"joey kramer drums percussionaerosmith shot too fame with their back biting' single\"dream on\" that is still a live favourite from their excellentdebut album titled \"aerosmith\" that was a excellent album but there were things too come. as they process with \"get your wings\" aerosmith were finding their feet. and what they want to portray. then comes toys in the atticfeaturing the single \"walk this way\" that was flop until it was are-released nearly thirteen years with \"run dec\" and aerosmith got a new tease of life. but in my opinion the original is the best more raunchy and steven gets all the vocals not just \"walk this way\" chorus the got on the are-makethis album features the riffmatic song \"sweet emotion\"which chorus still be shouted in stadiums around the world over the riff that gets your body movie'\"it's just toys in the attics TOYS\"","overall":5,"summary":"1975 the year all things changed aerosmith recorded this","unixReviewTime":1136851200,"reviewTime":"01 10, 2006"}
{"orig_index":10105,"reviewerID":"A22KYWYEL6GBES","asin":"B0000029AP","reviewerName":".Richard \"Rich\"","helpful":[2,3],"reviewText":" aerosmith shot too fame with their back biting' single\"dream on\" that is still a live favourite from their excellent album titled \"aerosmith\" aerosmith shot too fame with their flop single \"walk this way\"<\/s>","overall":5,"summary":"1975 the year all things changed aerosmith recorded this","unixReviewTime":1136851200,"reviewTime":"01 10, 2006"}
{"orig_index":10105,"reviewerID":"A22KYWYEL6GBES","asin":"B0000029AP","reviewerName":".Richard \"Rich\"","helpful":[2,3],"reviewText":"come aerosmith were never the american rollin' stones they were and still one of the best american rocks band everthey made rock acessable with the vintage riffs and abstract lyrics that add up too lot if you spend the time looking'you had the gypsy steven tyler with this big clips and half downed vodka voice it's a good thing by the way]joe perry[the american keef richards]lead guitarbrad whitford guitartony hamilton bass\"rhythm guitar on \"uncle salty\"joey kramer drums percussionaerosmith shot too fame with their back biting' single\"dream on\" that is still a live favourite from their excellentdebut album titled \"aerosmith\" that was a excellent album but there were things too come. but in my opinion the original is the best more raunchy and steven gets all the vocals not just \"walk this way\" chorus the got on the are-makethis album features the riffmatic song \"sweet emotion\"which chorus still be shouted in stadiums around the world over the riff that gets your body movie'\"it's just toys in the attics TOYS\" then comes toys in the atticfeaturing the single \"walk this way\" that was flop until it was are-released nearly thirteen years with \"run dec\" and aerosmith got a new tease of life. as they process with \"get your wings\" aerosmith were finding their feet. aerosmith who were put in the box as being the american rollin' stones. and what they want to portray.","overall":5,"summary":"1975 the year all things changed aerosmith recorded this","unixReviewTime":1136851200,"reviewTime":"01 10, 2006"}
{"orig_index":10805,"reviewerID":"A2UX5ABICURKL5","asin":"B000002AV5","reviewerName":"MARCOLO","helpful":[0,0],"reviewText":"I love her voice it does't make you wanna go out and punch someone. To me it's very relaxing music it helps me think of life in a more positive way. Instead of hating the world all the time, and it does't only talk about sex. I think she is a very pretty women, and just think I'm Italian\/Irish and I don't have a problem with the color of her skin for her race cause she's of the human race. Any way this album is a very worthyful album to buy, ooh yeah I'm a BIG jazz liker too. LOLI rate this CD a five of five stars!!","overall":5,"summary":"Sade at her Best!!","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":10805,"reviewerID":"A2UX5ABICURKL5","asin":"B000002AV5","reviewerName":"MARCOLO","helpful":[0,0],"reviewText":" this album is a very worthyful album to buy, ooh yeah i'm a BIG jazz liker too.<\/s>","overall":5,"summary":"Sade at her Best!!","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":10805,"reviewerID":"A2UX5ABICURKL5","asin":"B000002AV5","reviewerName":"MARCOLO","helpful":[0,0],"reviewText":"I think she is a very pretty women, and just think I'm Italian\/Irish and I don't have a problem with the color of her skin for her race cause she's of the human race. Any way this album is a very worthyful album to buy, ooh yeah I'm a BIG jazz liker too. To me it's very relaxing music it helps me think of life in a more positive way. I love her voice it does't make you wanna go out and punch someone. Instead of hating the world all the time, and it does't only talk about sex. LOLI rate this CD a five of five stars! !","overall":5,"summary":"Sade at her Best!!","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":10805,"reviewerID":"A2UX5ABICURKL5","asin":"B000002AV5","reviewerName":"MARCOLO","helpful":[0,0],"reviewText":" I love her voice it does't make you wanna go out and punch someone. To me it's very relaxing music it helps me think of life in a more positive way. I think she is a very pretty women, and just think I'm Italian\/Irish and I don't have a problem with the color of her skin for her race cause she's of the human","overall":5,"summary":"Sade at her Best!!","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":10985,"reviewerID":"A2KUXPRQMR2OET","asin":"B000002B8A","reviewerName":"SFNico","helpful":[1,1],"reviewText":"I was heavily into these bands in the ninetys. Nirvana,Alice,MotherLOveBone, sound garden ,Melivins, and Dinoaur for to name a few.time has gone by, it's two thousand and fourteen, this album is twenty years old. Layne is dead like Kurt.the music from those days does't all sound that hot today.some of it at least, this album is as good now as it was when it came out.it's the conclusion to Layne Stayles career.it's heavy like the was.it's deep like the was.it's got TIGHT rhythm by the boys and guitar from Jerry Cantrell. Alice put out a lot of good music.good acoustic stuff too.this album is special to me because I was in rehab when it came out and my friend came with copy, a cup of coffee platte and cheered me up.for thirty days i played nothing but this CD on my disc man.recommended.","overall":5,"summary":"the 2nd best \"seattle\"band peakes with cohesive,heavy rock","unixReviewTime":1391731200,"reviewTime":"02 7, 2014"}
{"orig_index":10985,"reviewerID":"A2KUXPRQMR2OET","asin":"B000002B8A","reviewerName":"SFNico","helpful":[1,1],"reviewText":" Nirvana,Alice,MotherLOveBone, sound garden ,Melivins, and Dinoaur for to name a few .","overall":5,"summary":"the 2nd best \"seattle\"band peakes with cohesive,heavy rock","unixReviewTime":1391731200,"reviewTime":"02 7, 2014"}
{"orig_index":10985,"reviewerID":"A2KUXPRQMR2OET","asin":"B000002B8A","reviewerName":"SFNico","helpful":[1,1],"reviewText":" this album is the conclusion to Layne Stayles career. it's heavy like the was.it's deep like the was. it's got TIGHT rhythm by the boys and guitar from Jerry Cantrell.<\/s>","overall":5,"summary":"the 2nd best \"seattle\"band peakes with cohesive,heavy rock","unixReviewTime":1391731200,"reviewTime":"02 7, 2014"}
{"orig_index":10985,"reviewerID":"A2KUXPRQMR2OET","asin":"B000002B8A","reviewerName":"SFNico","helpful":[1,1],"reviewText":"Nirvana,Alice,MotherLOveBone, sound garden ,Melivins, and Dinoaur for to name a few.time has gone by, it's two thousand and fourteen, this album is twenty years old. Layne is dead like Kurt.the music from those days does't all sound that hot today.some of it at least, this album is as good now as it was when it came out.it's the conclusion to Layne Stayles career.it's heavy like the was.it's deep like the was.it's got TIGHT rhythm by the boys and guitar from Jerry Cantrell. Alice put out a lot of good music.good acoustic stuff too.this album is special to me because I was in rehab when it came out and my friend came with copy, a cup of coffee platte and cheered me up.for thirty days i played nothing but this CD on my disc man.recommended. I was heavily into these bands in the ninetys.","overall":5,"summary":"the 2nd best \"seattle\"band peakes with cohesive,heavy rock","unixReviewTime":1391731200,"reviewTime":"02 7, 2014"}
{"orig_index":13370,"reviewerID":"A22VNXHU6IZ5MT","asin":"B000002I95","reviewerName":"Jason P. Pumphrey \"the movie & music man\"","helpful":[0,0],"reviewText":"Great Hall and Oates album, includes the now classic She's Gone in all it's five minutes plus glory, the radio seemed to play the three minute single edit, but the version on this album is much better, that's not the only great song, every tune on this classic album is top notch, a very recommended album!!!","overall":5,"summary":"Hall and Oates best Atlantic Records recording!!!","unixReviewTime":1224892800,"reviewTime":"10 25, 2008"}
{"orig_index":13370,"reviewerID":"A22VNXHU6IZ5MT","asin":"B000002I95","reviewerName":"Jason P. Pumphrey \"the movie & music man\"","helpful":[0,0],"reviewText":" great hall and oates album, includes the now classic She's Gone in all it's five minutes plus glory. every tune on this album is top notch.<\/s>","overall":5,"summary":"Hall and Oates best Atlantic Records recording!!!","unixReviewTime":1224892800,"reviewTime":"10 25, 2008"}
{"orig_index":13875,"reviewerID":"A2JYTJFZLWXX6Q","asin":"B000002IT2","reviewerName":"Jackie","helpful":[0,2],"reviewText":"Tori Amos's music has done something remarkable since Little Earthquakes, unafraid of public sentiment it has experimented with sounds and style much the way Bjork's albums have done since her involvement in the Sugarcubes. But it all starts there, with Tori's lyrically profound and musically inventive album Little Earthquakes. This album's bravery shines through in songs like \"Me and A Gun\" which details her rape, \"Silent All These Years\" which talks about abuse, and \"Crucify\" which shows her dissatisfaction with religion (her father was a minister). And seeing today the way this album and her others have permeated into popular style (what's Jewel doing? and Fiona Apple?), Tori must be called one of the most important musicians of the ninetys. Tori's growth has gained her cult fame, but never has Tori given in to radio pop for sugary music. In fact, she's getting bolder in each album. Just check out \"Boys for Pele.\"","overall":5,"summary":"Begins an era","unixReviewTime":946857600,"reviewTime":"01 3, 2000"}
{"orig_index":13875,"reviewerID":"A2JYTJFZLWXX6Q","asin":"B000002IT2","reviewerName":"Jackie","helpful":[0,2],"reviewText":" \"Boys for Pele\" is Tori Amos's first solo album. her bravery shines through in songs like \"Me and A Gun\" and \"Silent All These Years\" she's one of the most important musicians of the ninetys.<\/s>","overall":5,"summary":"Begins an era","unixReviewTime":946857600,"reviewTime":"01 3, 2000"}
{"orig_index":13875,"reviewerID":"A2JYTJFZLWXX6Q","asin":"B000002IT2","reviewerName":"Jackie","helpful":[0,2],"reviewText":"This album's bravery shines through in songs like \"Me and A Gun\" which details her rape, \"Silent All These Years\" which talks about abuse, and \"Crucify\" which shows her dissatisfaction with religion (her father was a minister). Tori Amos's music has done something remarkable since Little Earthquakes, unafraid of public sentiment it has experimented with sounds and style much the way Bjork's albums have done since her involvement in the Sugarcubes. Tori's growth has gained her cult fame, but never has Tori given in to radio pop for sugary music. But it all starts there, with Tori's lyrically profound and musically inventive album Little Earthquakes. In fact, she's getting bolder in each album. And seeing today the way this album and her others have permeated into popular style (what's Jewel doing? ), Tori must be called one of the most important musicians of the ninetys.","overall":5,"summary":"Begins an era","unixReviewTime":946857600,"reviewTime":"01 3, 2000"}
{"orig_index":13952,"reviewerID":"ACOYOVOCJVHIF","asin":"B000002ITU","reviewerName":"Joanne Elizabeth","helpful":[0,0],"reviewText":"This is a single even for people who don't \"do\" singles. The word \"remix\" attached to Crucify is misleading if you've heard other Tori remixes. It is a fresh version of the song, but it does't remind you of a grave. The covers are better than the real thing! Tori's covers are usually quite amazing and these truly fit that description. I can't listen to the original artists' versions, because they are just plain disappointing after hearing Tori's!\"You don't need my voice girl you have your own\" - Bells For Her, Tori AmosMy voice: [. ]Home Page: [. ]","overall":5,"summary":"better than the real thing","unixReviewTime":1014163200,"reviewTime":"02 20, 2002"}
{"orig_index":13952,"reviewerID":"ACOYOVOCJVHIF","asin":"B000002ITU","reviewerName":"Joanne Elizabeth","helpful":[0,0],"reviewText":" \"you don't need my voice girl you have your own\" by Tori Amos. \"you don't need my voice girl you have your own\" by Tori.<\/s>","overall":5,"summary":"better than the real thing","unixReviewTime":1014163200,"reviewTime":"02 20, 2002"}
{"orig_index":13952,"reviewerID":"ACOYOVOCJVHIF","asin":"B000002ITU","reviewerName":"Joanne Elizabeth","helpful":[0,0],"reviewText":"\"You don't need my voice girl you have your own\" - Bells For Her, Tori AmosMy voice: [. This is a single even for people who don't \"do\" singles. The word \"remix\" attached to Crucify is misleading if you've heard other Tori remixes. I can't listen to the original artists' versions, because they are just plain disappointing after hearing Tori's! Tori's covers are usually quite amazing and these truly fit that description. It is a fresh version of the song, but it does't remind you of a grave. ]Home Page: [. ]","overall":5,"summary":"better than the real thing","unixReviewTime":1014163200,"reviewTime":"02 20, 2002"}
{"orig_index":13999,"reviewerID":"A1PN2U0AWXGVML","asin":"B000002IWQ","reviewerName":"Mark","helpful":[2,2],"reviewText":"This album has elements from their old style along with elements from their newer \"electronica\" stuff. This album seems more serious than their lighthearted \"Presto\" and \"Hold Your Fire\" albums. \"Roll The Bones\" lead us into this album with the style that was about to come for this and \"Test For Echo\". The opening song \"Animate\" has such a cool groove sound that it's six minute length seems much shorter. \"Nobody's Hero\", one of Rush's most personal songs yet has great lyrics. \"Cold Fire\", probably my favourite on the album is a nice song on the subject of relationships. I highly recommend this CD.","overall":4,"summary":"Great Powerful Songs","unixReviewTime":949190400,"reviewTime":"01 30, 2000"}
{"orig_index":13999,"reviewerID":"A1PN2U0AWXGVML","asin":"B000002IWQ","reviewerName":"Mark","helpful":[2,2],"reviewText":" this album seems more serious than their lighthearted \"Presto\" and \"Hold Your Fire\" albums. \"Roll The Bones\" leads us into this album with the style that was about to come for this and \"Test For Echo\"<\/s>","overall":4,"summary":"Great Powerful Songs","unixReviewTime":949190400,"reviewTime":"01 30, 2000"}
{"orig_index":13999,"reviewerID":"A1PN2U0AWXGVML","asin":"B000002IWQ","reviewerName":"Mark","helpful":[2,2],"reviewText":"This album seems more serious than their lighthearted \"Presto\" and \"Hold Your Fire\" albums. \"Roll The Bones\" lead us into this album with the style that was about to come for this and \"Test For Echo\". The opening song \"Animate\" has such a cool groove sound that it's six minute length seems much shorter. This album has elements from their old style along with elements from their newer \"electronica\" stuff. \"Nobody's Hero\", one of Rush's most personal songs yet has great lyrics. \"Cold Fire\", probably my favourite on the album is a nice song on the subject of relationships. I highly recommend this CD.","overall":4,"summary":"Great Powerful Songs","unixReviewTime":949190400,"reviewTime":"01 30, 2000"}
{"orig_index":16582,"reviewerID":"ADS5APY1NKTL4","asin":"B000002LBW","reviewerName":"D. Pawl \"Dani\"","helpful":[11,11],"reviewText":"I could't help but notice that someone from Amazon had added a tag suggestion for THERE GOES RHYMIN' SIMON, calling it one of the definitive two hundred albums. That sounds right to me and I'll tell you why. RHYMIN' SIMON was only Paul Simon's second solo album after breaking up with Garfunkel, and the shows such depth as a musician, as well as a songwriter. This in't just Paul Simon banging away on the guitar in defiance, spurting sharp words about this cynicism for life. He has a full band backing him up while the is spurting sharp words about this cynicism for life (oh, and love, too). Yet, this does't grow derivative to my years. Simon's at this witty, intelligent and unaffected best, there. The album kicks off on a high note with \"Kodachrome.\" Who could't take notice of a song that begins with the lines, \"If I thought back on all the crap I learned in high school, it's a wonder I can think at all.\" That hooked me back when I was in high school, and I could't agree more. Plus, it has a wonderful, up-tempo piano riff, menacing in the background, just in case the lyrics karen't enough to sustain your attention . RHYMIN' SIMON succeeds in presenting very diverse sounds, with a real soul (and even gospel) influence. The songs that stick out for me the most are \"One Man's Ceiling is Another Man's Floor,\" and \"Loves Me Like a Rock.\" The album presented a great group called The Roaches, and I remember distinctly the soul sound of this back-up singers carrying this album out into the southern favored sounds from the bayous and up into new territory. It sounded beautiful, just really unexpected.","overall":5,"summary":"a definitive album from wonderful Paul Simon......","unixReviewTime":1181260800,"reviewTime":"06 8, 2007"}
{"orig_index":16582,"reviewerID":"ADS5APY1NKTL4","asin":"B000002LBW","reviewerName":"D. Pawl \"Dani\"","helpful":[11,11],"reviewText":" The album kicks off on a high note with \"Kodachrome\" The songs that stick out for me the most are \"One Man's Ceiling is Another Man's Floor,\" and \"Loves Me Like a Rock\"","overall":5,"summary":"a definitive album from wonderful Paul Simon......","unixReviewTime":1181260800,"reviewTime":"06 8, 2007"}
{"orig_index":16582,"reviewerID":"ADS5APY1NKTL4","asin":"B000002LBW","reviewerName":"D. Pawl \"Dani\"","helpful":[11,11],"reviewText":"Plus, it has a wonderful, up-tempo piano riff, menacing in the background, just in case the lyrics karen't enough to sustain your attention . Who could't take notice of a song that begins with the lines, \"If I thought back on all the crap I learned in high school, it's a wonder I can think at all.\" RHYMIN' SIMON was only Paul Simon's second solo album after breaking up with Garfunkel, and the shows such depth as a musician, as well as a songwriter. He has a full band backing him up while the is spurting sharp words about this cynicism for life (oh, and love, too). The songs that stick out for me the most are \"One Man's Ceiling is Another Man's Floor,\" and \"Loves Me Like a Rock.\" Simon's at this witty, intelligent and unaffected best, there. The album presented a great group called The Roaches, and I remember distinctly the soul sound of this back-up singers carrying this album out into the southern favored sounds from the bayous and up into new territory.","overall":5,"summary":"a definitive album from wonderful Paul Simon......","unixReviewTime":1181260800,"reviewTime":"06 8, 2007"}
{"orig_index":17816,"reviewerID":"A31U2QT7SAL7K","asin":"B000002MUW","reviewerName":"Reginald D. Garrard \"the G-man\"","helpful":[0,0],"reviewText":"Released some eleven years after her one thousand, nine hundred and eighty-three self-titled debut album, Madonna's \"Bedtime Stories\" stands as the singer's transition from dance ingenue, of sorts, to a more mature artist. The collection of songs features The Material Girl as a woman totally in charge of herself as a performer and as a poet of song. There are the standard jams that shaken back to her earlier stage of development (\"Don't Stop\" and \"Bedtime Story\"), but even they possess a mellower and slower tempo. The tune \"Sanctuary\" gives a hint of Madonna's future persona a la \"Ray of Light\".\"Love Tried to Welcome Me\" and \"Take a Bow\", both co-written by Babyface, exhibit a depth of purpose and maturity that the singer would build upon in her award-winning (and platinum-selling) \"Evita\". Again, \"Bedtime Story\" is an essential in the singer's lengthy discography, necessary for the fan as an example of the lady's musical growth.","overall":5,"summary":"A preview of bigger and better things to come!","unixReviewTime":1041379200,"reviewTime":"01 1, 2003"}
{"orig_index":17816,"reviewerID":"A31U2QT7SAL7K","asin":"B000002MUW","reviewerName":"Reginald D. Garrard \"the G-man\"","helpful":[0,0],"reviewText":" \"Bedtime Stories\" is the singer's transition from dance ingenue to a more mature artist. \"Sanctuary\" gives a hint of Madonna's future persona a la \"Ray of Light\" \"Love Tried to Welcome Me\" and \"Take a Bow\" exhibit depth of purpose.<\/s>","overall":5,"summary":"A preview of bigger and better things to come!","unixReviewTime":1041379200,"reviewTime":"01 1, 2003"}
{"orig_index":17816,"reviewerID":"A31U2QT7SAL7K","asin":"B000002MUW","reviewerName":"Reginald D. Garrard \"the G-man\"","helpful":[0,0],"reviewText":"\"Love Tried to Welcome Me\" and \"Take a Bow\", both co-written by Babyface, exhibit a depth of purpose and maturity that the singer would build upon in her award-winning (and platinum-selling) \"Evita\". Released some eleven years after her one thousand, nine hundred and eighty-three self-titled debut album, Madonna's \"Bedtime Stories\" stands as the singer's transition from dance ingenue, of sorts, to a more mature artist. There are the standard jams that shaken back to her earlier stage of development (\"Don't Stop\" and \"Bedtime Story\"), but even they possess a mellower and slower tempo. Again, \"Bedtime Story\" is an essential in the singer's lengthy discography, necessary for the fan as an example of the lady's musical growth. The tune \"Sanctuary\" gives a hint of Madonna's future persona a la \"Ray of Light\". The collection of songs features The Material Girl as a woman totally in charge of herself as a performer and as a poet of song.","overall":5,"summary":"A preview of bigger and better things to come!","unixReviewTime":1041379200,"reviewTime":"01 1, 2003"}
{"orig_index":18736,"reviewerID":"A3HU0B9XUEVHIM","asin":"B000002OJ4","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"You'd expect after three big albums in a row before this one, both containing at least one huge hit songs each that Elton John's eighty's comeback would sustain itself through the middle of the decade. In the send that proved not to be the case. This proved to be for the eighty's whatA Single Manwas for him in the seventy's; a recording that got buried after it was released and (in the case of this particular album) has become a relatively rare item in this catalog. That's interesting because this was Elton John's first all digital recording. So if you were table to get your hands on the original one thousand, nine hundred and eighty-six CD of this album the way I did the sound is beyond top notch, especially the mixed quality of these early \"DDD\" recordings. For more on that look at my review for Stevie Wonder'sCharactersreleased a year later. Interestingly enough none of this spells out any major change in direction musically for Elton from this two previous albums before this one and neither does it mean that this album is lacking in strong songs, even if Elton John's always been artistically measured more by this hits than this albums. The title track of the this is for all intents and purposes this \"Philledelphia Freedom\" of the eighty's with the same kind of danceable rock in soul sound, only instrumentally updated for the period. You might expect an album of this vintage to be highly electronic and synth drenched but Elton and Bernie maintain their strengths there, focusing more on strong songwriting and lyrics as opposed to new technology. \"Don't Trust That Woman\", co-written by Cher again follows up with a potent rock in soul flavor to it and along with the title song one of the stronger fast itunes on the album. While \"Go It Alone\",\"Heartache All Over The World\" and \"Angeline\" are decent fast songs too, their rockier orientation is somewhat buried by the slicker production. That style is better suited to the ballads \"Hoops Of Fire\",\"Paris\",\"Gypsy Heart\" and \"I Fall Apart\", all in the John\/Taupin writing style and all of which are sure fire should've-been hits. Despite some of Elton's personal problems during this time period this singing and writing ability is still very much intact and despite it all, upon hearing this I still cannot fathom why this album was one of Elton's few commercial failures. Even so artistically this album still cannot be beat and is worth searching for if your a strong Elton John fan for enjoy high quality pop from the mid eighty's","overall":5,"summary":"Elton And Bernie Jumping Through Hoops Of Fire","unixReviewTime":1267574400,"reviewTime":"03 3, 2010"}
{"orig_index":18736,"reviewerID":"A3HU0B9XUEVHIM","asin":"B000002OJ4","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":" this is Elton John's first all digital recording. the title track is for all intents and purposes this \"Philledelphia Freedom\" of the eighty's. \"Don't Trust That Woman\" co-written by Cher again follows up with a potent rock in soul sound.<\/s>","overall":5,"summary":"Elton And Bernie Jumping Through Hoops Of Fire","unixReviewTime":1267574400,"reviewTime":"03 3, 2010"}
{"orig_index":18736,"reviewerID":"A3HU0B9XUEVHIM","asin":"B000002OJ4","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"That style is better suited to the ballads \"Hoops Of Fire\",\"Paris\",\"Gypsy Heart\" and \"I Fall Apart\", all in the John\/Taupin writing style and all of which are sure fire should've-been hits. While \"Go It Alone\",\"Heartache All Over The World\" and \"Angeline\" are decent fast songs too, their rockier orientation is somewhat buried by the slicker production. So if you were table to get your hands on the original one thousand, nine hundred and eighty-six CD of this album the way I did the sound is beyond top notch, especially the mixed quality of these early \"DDD\" recordings. Despite some of Elton's personal problems during this time period this singing and writing ability is still very much intact and despite it all, upon hearing this I still cannot fathom why this album was one of Elton's few commercial failures. You'd expect after three big albums in a row before this one, both containing at least one huge hit songs each that Elton John's eighty's comeback would sustain itself through the middle of the decade. Interestingly enough none of this spells out any major change in direction musically for Elton from this two previous albums before this one and neither does it mean that this album is lacking in strong songs, even if Elton John's always been artistically measured more by this hits than this albums. The title track of the this is for all intents and purposes this \"Philledelphia Freedom\" of the eighty's with the same kind of danceable rock in soul sound, only instrumentally updated for the period.","overall":5,"summary":"Elton And Bernie Jumping Through Hoops Of Fire","unixReviewTime":1267574400,"reviewTime":"03 3, 2010"}
{"orig_index":19332,"reviewerID":"AMTBIGVUHMEOX","asin":"B000002P2E","reviewerName":"George Lewis III \"GL Smoove\"","helpful":[0,0],"reviewText":"What's Up people. I had to write a review because I thought I wrote one already and I have to comment on my boys. This album was good and it should have been their best because it was all six members and they went through many things. My problem with this CD is that it should have been more songs, like maybe a double CD for something like that. Johnny did't lead more songs, it mostly has Bobby on more songs which was cool but it should have showcased Johnny, Ralph, Bobby and Ricky the same, which is why they needed more songs. The remix to \"You Don't Have to Worry\" should have been the original and on this album. Johnny's solo album came out around the same time as this did and it did't do as well but three-four of those songs should have been on this album, because they all sung \"Your Body\" at the concert from JG's album. My favourite tracks are \"Feels So Good, Hit Me Off, How Do Your Like Your Love Served, One More Day, Shop Around and Still In Love. The title track is good too, so out of thirteen total tracks more than one\/two is good which is very rare for any CD in my opinion. The rest of them could have been better especially if the remix was on their. All in all to sum it up this was a good almost great album, but with a little more weeks and promotion this should have been an all time great album because of so much potential.-Gwhiz","overall":4,"summary":"Almost Their Best Album","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":19332,"reviewerID":"AMTBIGVUHMEOX","asin":"B000002P2E","reviewerName":"George Lewis III \"GL Smoove\"","helpful":[0,0],"reviewText":"My problem with this CD is that it should have been more songs, like maybe a double CD for something like that . My favourite tracks are \"Feels So Good, Hit Me Off, How Do Your Like Your Love Served, One More Day, Shop Around and Still In Love .","overall":4,"summary":"Almost Their Best Album","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":19332,"reviewerID":"AMTBIGVUHMEOX","asin":"B000002P2E","reviewerName":"George Lewis III \"GL Smoove\"","helpful":[0,0],"reviewText":"Johnny did't lead more songs, it mostly has Bobby on more songs which was cool but it should have showcased Johnny, Ralph, Bobby and Ricky the same, which is why they needed more songs. My favourite tracks are \"Feels So Good, Hit Me Off, How Do Your Like Your Love Served, One More Day, Shop Around and Still In Love. Johnny's solo album came out around the same time as this did and it did't do as well but three-four of those songs should have been on this album, because they all sung \"Your Body\" at the concert from JG's album. All in all to sum it up this was a good almost great album, but with a little more weeks and promotion this should have been an all time great album because of so much potential.-Gwhiz The title track is good too, so out of thirteen total tracks more than one\/two is good which is very rare for any CD in my opinion. My problem with this CD is that it should have been more songs, like maybe a double CD for something like that. This album was good and it should have been their best because it was all six members and they went through many things.","overall":4,"summary":"Almost Their Best Album","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"What is it about this album that makes so many parrotheads say \"Well, I'm sure I'd like it if I gave it more of a chance, but. \"? Perhaps it's the black of a concert staple, although several of these songs could fit that bill just fine. Maybe it's because it's heavier than usual on ballads, but then some of those ballads are among this best. Whatever the reason may be, it's worth more of a chance than most fans I know have given it. Somewhere Over China is obscure enough that if you're reading this, you're probably already quite a Buffett fan. Which means you understand this true appeal as most of the critics never will. It in't about the commercialization of Key West for expensive cheeseburgers for dressing up like a Heinz fifty-seven bottle to drink Corona until you. well, you know. Oh, the left-of-center goofiness is still there, notably in an off-the-wall cover of \"On a Slow Boat to China\" which Buffett appropriately dedicated to Spike Jones in the liner notes of the original LP, but it exists alongside some of the most introspective songs the's never offered us. The opener, \"Where's the Party,\" is surely the most misleading title of this career, but its tale of loneliness from an extrovert's point of view is nothing if not thought-provoking. On the lighter side, \"It's Midnight and I'm Not Famous Yet\" features the late Steve Goodman as co-writer and a lead character named Lester Polyester. need I say more? Goofier still is \"Lip Service,\" perhaps Buffett's all-time greatest double-entendre. (Is it about a co-dependent relationship for oral sex? You make the call!) But the mood is more serious for the most part. \"Steamer\" is arguably the most sensuous number the's never recorded, while \"I Heard I Was In Town\" is tops in the subgenre of lonely-life-of-a-superstar songs (something the'd tried this hand at several times before, but never as convincingly as there). Yes, I know, you already have half of those songs if you own the box set. So why buy this CD as well? The title track, which as far as I know has never been released on any other album, is the best Buffett you've never heard. It's a tale of an average guy who gets the unlikely chance to throw caution to the wind and travel to the far side of the world, discovering the pros and icons of that lifestyle along the way, much as your hero has spent much of the past three decades doing. What's the moral of the story? Maybe we're better off staying with the dull but familiar; but then again, maybe there's real joy in the loneliness of wanderlust. Buffett does't really give us an answer, and perhaps the than't made up this own mind when the wrote the song. That uncertainty makes for a lesson unto itself. Either way, if you're still hoping for that opportunity to go off one of these days in search of the Great Lost Saltshaker, you need this song in your collection!","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"somewhere over china is the black of a concert staple. \"Steamer\" is arguably the most sensuous number the's never recorded. \"I Heard I Was In Town\" tops in the subgenre of lonely-life-of-a-superstar songs.","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"Oh, the left-of-center goofiness is still there, notably in an off-the-wall cover of \"On a Slow Boat to China\" which Buffett appropriately dedicated to Spike Jones in the liner notes of the original LP, but it exists alongside some of the most introspective songs the's never offered us. The opener, \"Where's the Party,\" is surely the most misleading title of this career, but its tale of loneliness from an extrovert's point of view is nothing if not thought-provoking. \"Steamer\" is arguably the most sensuous number the's never recorded, while \"I Heard I Was In Town\" is tops in the subgenre of lonely-life-of-a-superstar songs (something the'd tried this hand at several times before, but never as convincingly as there). It's a tale of an average guy who gets the unlikely chance to throw caution to the wind and travel to the far side of the world, discovering the pros and icons of that lifestyle along the way, much as your hero has spent much of the past three decades doing. What is it about this album that makes so many parrotheads say \"Well, I'm sure I'd like it if I gave it more of a chance, but. The title track, which as far as I know has never been released on any other album, is the best Buffett you've never heard. Yes, I know, you already have half of those songs if you own the box set.","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":20881,"reviewerID":"AJAF1T6Q7XM94","asin":"B000002VN7","reviewerName":"A Customer","helpful":[1,1],"reviewText":"My favourite of Sarah's albums is Surfacing but one of my two favourite songs by her is on Fumbling. It's the incredibly beautiful song Good Enough. My other favourite is I Love You on Surfacing. If you like Sarah and you haven't heard Good Enough it's worth the price of the CD. It's one of the best songs you'll never hear.","overall":4,"summary":"Good Enough","unixReviewTime":951696000,"reviewTime":"02 28, 2000"}
{"orig_index":20881,"reviewerID":"AJAF1T6Q7XM94","asin":"B000002VN7","reviewerName":"A Customer","helpful":[1,1],"reviewText":"one of my two favourite songs by Sarah is on Fumbling. it's the incredibly beautiful song Good Enough.","overall":4,"summary":"Good Enough","unixReviewTime":951696000,"reviewTime":"02 28, 2000"}
{"orig_index":20881,"reviewerID":"AJAF1T6Q7XM94","asin":"B000002VN7","reviewerName":"A Customer","helpful":[1,1],"reviewText":"My favourite of Sarah's albums is Surfacing but one of my two favourite songs by her is on Fumbling. It's one of the best songs you'll never hear. If you like Sarah and you haven't heard Good Enough it's worth the price of the CD. It's the incredibly beautiful song Good Enough. My other favourite is I Love You on Surfacing.","overall":4,"summary":"Good Enough","unixReviewTime":951696000,"reviewTime":"02 28, 2000"}
{"orig_index":20881,"reviewerID":"AJAF1T6Q7XM94","asin":"B000002VN7","reviewerName":"A Customer","helpful":[1,1],"reviewText":"My favourite of Sarah's albums is Surfacing but one of my two favourite songs by her is on Fumbling . If you like Sarah and you haven't heard Good Enough it's worth the price of the","overall":4,"summary":"Good Enough","unixReviewTime":951696000,"reviewTime":"02 28, 2000"}
{"orig_index":21875,"reviewerID":"A3VZVYWCTGIEV0","asin":"B0000032ZU","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[1,1],"reviewText":"Readers of my reviews--all one for one thousand of you, who knows--know my joy is to find music no one else knows, and review it. My goal in life is to be your Amazon free form progressive FM DJ. But there are nights, and this is one, to come back to base for refuel, to go back to music that is known to the entire planet. Nights to Ajax the slate for adventures even further out, tomorrow. This is not just for the sake of writing. For the Spinners, the music has wrapped around the earth for the most basic of reasons: it is just so good, we all want to hear it. But we hear this music so much and for so long, we take it completely for granted, and forget why it is so big in the first place. And even if it has all been said, saying it all again is worthy. Deconstructing the music we all know and love is a great mental exercise, but doing the exercise serves a function far more important: we sometimes put albums like The Very Best Of The Spinners on when we have a dulled edge, for black of another idea we can get exited about. But something very strange happens if the moment is right. A sound catches the year, we are drawn in, no distractions. A tear comes to the eye. We have heard this one thousand times before, but have heard a new sound, caught a new vibe, the old is new again. We experience, we think, we experience more. The heart flutters. It is called music, and this is why we listen. Listen to The Spinners. Philly Soul is what they call it, and back in the one thousand, nine hundred and seventy, it was all over AM radio. The format of the three minute single. And if anyone mastered the part, it was this aptly named band. There is a reason we now laugh at Clint Holmes' \"Playground Of My Mind,\" for \"Sing\" by the Carpenters, while, forty years on, we only grow in further reverence for a song like \"Games People Play.\" by the Spinners. Maybe it is the same reason that when Mohammad Ali fought George Foreman in Zaire in one thousand, nine hundred and seventy-four, the Spinners were flown in as part of the are-match grave up. That reason is why it is important to talk about it, pick it apart and reassemble it, like we were hearing it the first time. Yeah, let's start with \"Games People Play. Go ahead. Turn it on. I'll wait. It opens with a stomp, a big string swoop half second--yeah, its there, I heard it too. Funky, smooth, jazzy. It coasts in, so many voices, so well timed. The horns come up different each time. Wow. A trombone, there and gone. Up over the soaring bridge and---wait, is it over already. Damn. Well, let's play that again. This was the Thom Bell and Gamble and Huff part of the forty five in the one thousand, nine hundred and seventy, and as these page, they improve. Back in the day, we lumped this with the other AM popcorn I mentioned, thinking ourselves King Crimson FM Pirates. Well my friend, life is long, and there is sample time for a lot more of that, too. But for tonight, it's time for the gleaming arrangements, the constructions, the timing, the painstaking effort that made a one thousand, nine hundred and seventy-five Ford Station Wagon AM afternoon driver like \"Games People Play\" as grand as the best classical music. This is OUR classical music. It is all there and it all works. There is no room to deconstruct each track, though if I did, all this material would be the worthiest of the worthy. The Beatles, The Spinners, Coltrane, all the stuff that is your air, your food, the stuff we feed on each day, even if we don't. There are many others, too many to mention, but when it comes to the Spinners, there are many equals, but no betters","overall":5,"summary":"Classic","unixReviewTime":1274486400,"reviewTime":"05 22, 2010"}
{"orig_index":21875,"reviewerID":"A3VZVYWCTGIEV0","asin":"B0000032ZU","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[1,1],"reviewText":"bob greene: for the Spinners, the music is just so good, we all want to hear it. greene: we sometimes put albums like \"the very best of the spinners\" on when we have dulled edge. the says we experience, we think, we experience more, and this is why we listen. greene: if anyone mastered the part, it was this aptly named band, and this is why we listen.","overall":5,"summary":"Classic","unixReviewTime":1274486400,"reviewTime":"05 22, 2010"}
{"orig_index":21875,"reviewerID":"A3VZVYWCTGIEV0","asin":"B0000032ZU","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[1,1],"reviewText":"The Beatles, The Spinners, Coltrane, all the stuff that is your air, your food, the stuff we feed on each day, even if we don't. But for tonight, it's time for the gleaming arrangements, the constructions, the timing, the painstaking effort that made a one thousand, nine hundred and seventy-five Ford Station Wagon AM afternoon driver like \"Games People Play\" as grand as the best classical music. There is a reason we now laugh at Clint Holmes' \"Playground Of My Mind,\" for \"Sing\" by the Carpenters, while, forty years on, we only grow in further reverence for a song like \"Games People Play.\" There are many others, too many to mention, but when it comes to the Spinners, there are many equals, but no betters We have heard this one thousand times before, but have heard a new sound, caught a new vibe, the old is new again. This was the Thom Bell and Gamble and Huff part of the forty five in the one thousand, nine hundred and seventy, and as these page, they improve. But there are nights, and this is one, to come back to base for refuel, to go back to music that is known to the entire planet.","overall":5,"summary":"Classic","unixReviewTime":1274486400,"reviewTime":"05 22, 2010"}
{"orig_index":22748,"reviewerID":"A1BPCSTNJDIL69","asin":"B000003B6J","reviewerName":"Mono-Grind \"dtb\"","helpful":[1,1],"reviewText":"I'm not the greatest fan of Rap, the music i mostly listen to is Metal. But i have a few Rap CD's, mostly Public Enemy, Cypress Hill, and N. W. A. N. W. A are pretty famous, consisting of extremely good wrappers, such as Ice Cube, Dr. Dre, and Eazy E. Eazy E has since passed away, but Ice Cube and Dr. Dre are still doing well in the world of Rap. On this CD, \"Straight Outta Compton\", the most notable songs to me would be F*ck The Police, Straight Outta Compton, Gangsta Gangsta, Express Yourself, If It Ain't Ruff and Something Like That. (On the Extra Tracks of this, i'd add \"A B*tch biz a B*tch\") But these are only the most famous songs on this mainly. Every song is enjoyable. The beats are awesome, and the wrapping is perfect. I think anyone who says they're into Rap should own this. Rap nowadays is really poor, in my opinion, when you look at the \"Usher's\" and \"Chingy's\". It's really pathetic. Check this out if you want real top-quality Rap, done properly. Also check out NiggazfourLife, and even their Greatest Hits CD, which has pretty much every famous song they've done on it. Straight Outta Compton is a true Classic.","overall":4,"summary":"Gangsta Rap at it's Best","unixReviewTime":1105660800,"reviewTime":"01 14, 2005"}
{"orig_index":22748,"reviewerID":"A1BPCSTNJDIL69","asin":"B000003B6J","reviewerName":"Mono-Grind \"dtb\"","helpful":[1,1],"reviewText":"The beats are awesome, and the wrapping is perfect . Ice Cube and Dr. Dre are still doing well in the world of Rap . Rap nowadays is really poor .","overall":4,"summary":"Gangsta Rap at it's Best","unixReviewTime":1105660800,"reviewTime":"01 14, 2005"}
{"orig_index":22748,"reviewerID":"A1BPCSTNJDIL69","asin":"B000003B6J","reviewerName":"Mono-Grind \"dtb\"","helpful":[1,1],"reviewText":"But i have a few Rap CD's, mostly Public Enemy, Cypress Hill, and N. W. A. N. W. A are pretty famous, consisting of extremely good wrappers, such as Ice Cube, Dr. Dre, and Eazy E. Eazy E has since passed away, but Ice Cube and Dr. Dre are still doing well in the world of Rap. On this CD, \"Straight Outta Compton\", the most notable songs to me would be F*ck The Police, Straight Outta Compton, Gangsta Gangsta, Express Yourself, If It Ain't Ruff and Something Like That. Rap nowadays is really poor, in my opinion, when you look at the \"Usher's\" and \"Chingy's\". Also check out NiggazfourLife, and even their Greatest Hits CD, which has pretty much every famous song they've done on it. (On the Extra Tracks of this, i'd add \"A B*tch biz a B*tch\") But these are only the most famous songs on this mainly. Check this out if you want real top-quality Rap, done properly. I'm not the greatest fan of Rap, the music i mostly listen to is Metal.","overall":4,"summary":"Gangsta Rap at it's Best","unixReviewTime":1105660800,"reviewTime":"01 14, 2005"}
{"orig_index":23751,"reviewerID":"AW53QFIBH472H","asin":"B000005AXT","reviewerName":"CHI-TOWN","helpful":[1,3],"reviewText":"GOOD SIDE BAD SIDE WAS A WAY BETTER ALBUM. THIS CD FINAL TIC IS A CLASSIC IT'S WORTH BUYING.","overall":4,"summary":"NOT BETTER THAN THE 2nd !","unixReviewTime":971827200,"reviewTime":"10 18, 2000"}
{"orig_index":23751,"reviewerID":"AW53QFIBH472H","asin":"B000005AXT","reviewerName":"CHI-TOWN","helpful":[1,3],"reviewText":"Final TIC is a CLASSIC it's worth buying .","overall":4,"summary":"NOT BETTER THAN THE 2nd !","unixReviewTime":971827200,"reviewTime":"10 18, 2000"}
{"orig_index":23751,"reviewerID":"AW53QFIBH472H","asin":"B000005AXT","reviewerName":"CHI-TOWN","helpful":[1,3],"reviewText":"CD FINAL TIC IS A CLASSIC IT'S WORTH BUYING.","overall":4,"summary":"NOT BETTER THAN THE 2nd !","unixReviewTime":971827200,"reviewTime":"10 18, 2000"}
{"orig_index":23987,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000005HCM","reviewerName":"The Groove","helpful":[55,61],"reviewText":"Why should you even bother with Lee Morgan's \"The Sidewinder?\" The reasons are plenty. Because it's one of the finer releases on the esteemed Blue Note label. Because it's one of the trumpeter's best albums. Because you, the listener, will get to witness the awesome interplay between Morgan, saxophonist Joe Henderson, pianist Barry Harris, bass player Bob Cranshaw, and drummer Billy Higgins. Because it's a one-of-a-kind album that belongs in any serious jazz lover's collection. Check out the second track \"Totem Pole,\" in which Morgan gives each of this members a chance to shine. Harris's great piano solo and Henderson's saxophone compliment Morgan's trumpet like butter on a hot biscuit. \"Hocus Pocus,\" like the rest of the album, is a great uptempo number that will have anyone within earshot tapping their toes to the steady beat of Higgin's drum, supported by Morgan on trumpet and Henderson on sax. This album was originally released in one thousand, nine hundred and sixty-three but was remastered thirty-five years later by Rudy Van Gelder. Thanks to Van Gelder, the recording sounds notably crisp and vibrant, with the music projecting with a certain force that was meant to be experienced. Morgan's catalogue is full of winners, but if you have to start with one album, many would agree that \"The Sidewinder\" is the one to get.","overall":5,"summary":"Sophisticated Music for Sophisticated People.","unixReviewTime":1124668800,"reviewTime":"08 22, 2005"}
{"orig_index":23987,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000005HCM","reviewerName":"The Groove","helpful":[55,61],"reviewText":"\"The Sidewinder\" is a one-of-a-kind album that belongs in any serious jazz lover's collection. \"Hocus Pocus\" is a great uptempo number that will have anyone tapping their toes to the steady beat of Higgin's drum. thanks to Rudy van Gelder, the recording sounds notably crisp and vibrant.","overall":5,"summary":"Sophisticated Music for Sophisticated People.","unixReviewTime":1124668800,"reviewTime":"08 22, 2005"}
{"orig_index":23987,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000005HCM","reviewerName":"The Groove","helpful":[55,61],"reviewText":"Because you, the listener, will get to witness the awesome interplay between Morgan, saxophonist Joe Henderson, pianist Barry Harris, bass player Bob Cranshaw, and drummer Billy Higgins. \"Hocus Pocus,\" like the rest of the album, is a great uptempo number that will have anyone within earshot tapping their toes to the steady beat of Higgin's drum, supported by Morgan on trumpet and Henderson on sax. Morgan's catalogue is full of winners, but if you have to start with one album, many would agree that \"The Sidewinder\" is the one to get. Harris's great piano solo and Henderson's saxophone compliment Morgan's trumpet like butter on a hot biscuit. Thanks to Van Gelder, the recording sounds notably crisp and vibrant, with the music projecting with a certain force that was meant to be experienced. This album was originally released in one thousand, nine hundred and sixty-three but was remastered thirty-five years later by Rudy Van Gelder. Because it's a one-of-a-kind album that belongs in any serious jazz lover's collection.","overall":5,"summary":"Sophisticated Music for Sophisticated People.","unixReviewTime":1124668800,"reviewTime":"08 22, 2005"}
{"orig_index":25183,"reviewerID":"A25NMMI7AH30W2","asin":"B000006OFM","reviewerName":"Carltouis Stevenson","helpful":[1,4],"reviewText":"Bell Biv DeVoe half for spin-off of the group New Edition drop fall short with second release. Nothing close to Poison, so don't be surprised. Nothing on there seems to hold my attention either. The only reason I gave it a one star is because of tracks nine and ten. Both \"Something In Your Eyes\" written by the great Babyface and \"Please Come Back\" are slow jams that you can play continuously over and over again.","overall":1,"summary":"Shame On You Guys","unixReviewTime":1110758400,"reviewTime":"03 14, 2005"}
{"orig_index":25183,"reviewerID":"A25NMMI7AH30W2","asin":"B000006OFM","reviewerName":"Carltouis Stevenson","helpful":[1,4],"reviewText":"Both \"Something In Your Eyes\" written by the great Babyface and \"Please Come Back\" are slow jams that you can play continuously over and over again. Bell Biv DeVoe half for spin-off of the group New Edition drop fall short with second release. The only reason I gave it a one star is because of tracks nine and ten. Nothing close to Poison, so don't be surprised. Nothing on there seems to hold my attention either.","overall":1,"summary":"Shame On You Guys","unixReviewTime":1110758400,"reviewTime":"03 14, 2005"}
{"orig_index":25183,"reviewerID":"A25NMMI7AH30W2","asin":"B000006OFM","reviewerName":"Carltouis Stevenson","helpful":[1,4],"reviewText":"nothing close to Poison, so don't be surprised. \"Something In Your Eyes\" written by the great Babyface and \"Please Come Back\" are slow jams.","overall":1,"summary":"Shame On You Guys","unixReviewTime":1110758400,"reviewTime":"03 14, 2005"}
{"orig_index":25183,"reviewerID":"A25NMMI7AH30W2","asin":"B000006OFM","reviewerName":"Carltouis Stevenson","helpful":[1,4],"reviewText":"Bell Biv DeVoe half for spin-off of group New Edition drop fall short with second release . \"Something In Your Eyes\" written by the great Babyface and \"Please Come Back\" are slow jams that you can play continuously over and over again .","overall":1,"summary":"Shame On You Guys","unixReviewTime":1110758400,"reviewTime":"03 14, 2005"}
{"orig_index":25596,"reviewerID":"A3HU0B9XUEVHIM","asin":"B000007QF0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[5,5],"reviewText":"'Get It Right' is Aretha's second and unfortunately final album with Luther Vandross, which is a kitty because Luther did all that the could to make her album a priority rather then produce just more great singles. The title track sounds lot like\"Jump To It\", as does\"Every Girl (Wants A Guy, as does the wholealbum really.\"Pretender\" is one of the funkiest soul numbers Aretha threw down in the eighty's and \"I Wish It Would Rain\"is an uptempo cover that (however it should't) actually tears the Tempt's classic to shreds.\"Giving In\",\"When You Love Me Like That\" and \"Better Friends Then Lovers\" are all classic Franklin ballads, as with all her eighty's itunes featuring her vocals in a slightly smoker context then her classic period. Nevertheless 'Get It Right' is (sadly) a very rare gem on CD that needs to be snapped up immediately if never seen cheaply.","overall":5,"summary":"Areatha And Luther Part Deax","unixReviewTime":1111449600,"reviewTime":"03 22, 2005"}
{"orig_index":25596,"reviewerID":"A3HU0B9XUEVHIM","asin":"B000007QF0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[5,5],"reviewText":"Aretha Franklin's second and unfortunately final album with Luther Vandross . 'Get It Right' is (sadly) a very rare gem on CD that needs to be snapped up immediately if never seen cheaply .","overall":5,"summary":"Areatha And Luther Part Deax","unixReviewTime":1111449600,"reviewTime":"03 22, 2005"}
{"orig_index":25596,"reviewerID":"A3HU0B9XUEVHIM","asin":"B000007QF0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[5,5],"reviewText":"\"Giving In\",\"When You Love Me Like That\" and \"Better Friends Then Lovers\" are all classic Franklin ballads, as with all her eighty's itunes featuring her vocals in a slightly smoker context then her classic period. \"Pretender\" is one of the funkiest soul numbers Aretha threw down in the eighty's and \"I Wish It Would Rain\"is an uptempo cover that (however it should't) actually tears the Tempt's classic to shreds. The title track sounds lot like\"Jump To It\", as does\"Every Girl (Wants A Guy, as does the wholealbum really. 'Get It Right' is Aretha's second and unfortunately final album with Luther Vandross, which is a kitty because Luther did all that the could to make her album a priority rather then produce just more great singles. Nevertheless 'Get It Right' is (sadly) a very rare gem on CD that needs to be snapped up immediately if never seen cheaply.","overall":5,"summary":"Areatha And Luther Part Deax","unixReviewTime":1111449600,"reviewTime":"03 22, 2005"}
{"orig_index":26791,"reviewerID":"ACVFTS9X2MKJ8","asin":"B00000DATR","reviewerName":"Rykre \"The Rogue Scholar\"","helpful":[2,3],"reviewText":"Now, I know everybody who likes Mike Oldfield is criticizing him for are-recording and are-packaging Tubular Bells over and over, and over again these past thirty plus years. But, if it was't for the one thousand, nine hundred and ninety-two release of Tubular Bells II, I would have probably just let myself forget all about him. I really did't follow Mike Oldfield's music much after Crises (one thousand, nine hundred and eighty-three) and The Killing Fields (one thousand, nine hundred and eighty-four). I did't care for how Mike Oldfield was doing less long played projects and started to perform pop sounding ditties with other singers. Sometimes, you would't know if you were listening to Mike Oldfield for ABBA, for just simply someone else. Simple pop songs like \"Family Man\", \"To France\", \"Moonlight Shadow\", etc. And when I saw \"Discovery\" (one thousand, nine hundred and eighty-four) and seen that it had more short pop songs with vocals, I just sort of gave up on Mike Oldfield, altogether. So I think, TB II was a smart move for Mike Oldfield to are-introduce himself to the music world. \"Tubular Bells\" (one thousand, nine hundred and seventy-three) was considered a Progressive Rock achievement back then, and so TB II of one thousand, nine hundred and ninety-two had to compete with the modern day New Age music market. I don't think TB III was a great disappointment, and I certainly I won't give it a miss either. To see it performed live now (on this very hard to find PAL region only DVD release of TB II and TB III live) actually makes me appreciate this album so much more. And why should't Mike Oldfield try and keep Tubular Bells alive? When we go to see any singer for band in concert, we are usually not too concerned about hearing some of their new material. We want to see and hear the hits, for the pieces of music that are this claim to fame, of course. Especially from bands who's past is much more glorified than where they are today. However, Mike Olfield's recording of \"Tubular Bells two thousand and three\" was just ridiculous! On this album, the is trying to are-record, as closely as possible, to the original one thousand, nine hundred and seventy-three release. This might have been more enjoyable if the and this other performers filmed this tight performance live before an audience. A DVD of this performance would have been much more justified than this pointless CD only release. So, if the tries to are-record this album just once more, the really should seek some therapy. I think by now, the's beat this horse enough. Please Mike, give it a rest!","overall":4,"summary":"This one is the one furthest away from sounding like a re-packaging of the original Tubular Bells","unixReviewTime":1154822400,"reviewTime":"08 6, 2006"}
{"orig_index":26791,"reviewerID":"ACVFTS9X2MKJ8","asin":"B00000DATR","reviewerName":"Rykre \"The Rogue Scholar\"","helpful":[2,3],"reviewText":"bob greene: tubular bells II was a smart move for Mike Oldfield to are-introduce himself to the music world. the says TB II was considered a Progressive Rock achievement back then. greene: why should't Mike Oldfield try and keep Tubular Bells alive?","overall":4,"summary":"This one is the one furthest away from sounding like a re-packaging of the original Tubular Bells","unixReviewTime":1154822400,"reviewTime":"08 6, 2006"}
{"orig_index":26791,"reviewerID":"ACVFTS9X2MKJ8","asin":"B00000DATR","reviewerName":"Rykre \"The Rogue Scholar\"","helpful":[2,3],"reviewText":"\"Tubular Bells\" (one thousand, nine hundred and seventy-three) was considered a Progressive Rock achievement back then, and so TB II of one thousand, nine hundred and ninety-two had to compete with the modern day New Age music market. On this album, the is trying to are-record, as closely as possible, to the original one thousand, nine hundred and seventy-three release. I really did't follow Mike Oldfield's music much after Crises (one thousand, nine hundred and eighty-three) and The Killing Fields (one thousand, nine hundred and eighty-four). And when I saw \"Discovery\" (one thousand, nine hundred and eighty-four) and seen that it had more short pop songs with vocals, I just sort of gave up on Mike Oldfield, altogether. Simple pop songs like \"Family Man\", \"To France\", \"Moonlight Shadow\", etc. But, if it was't for the one thousand, nine hundred and ninety-two release of Tubular Bells II, I would have probably just let myself forget all about him. We want to see and hear the hits, for the pieces of music that are this claim to fame, of course.","overall":4,"summary":"This one is the one furthest away from sounding like a re-packaging of the original Tubular Bells","unixReviewTime":1154822400,"reviewTime":"08 6, 2006"}
{"orig_index":28062,"reviewerID":"AQP1VPK16SVWM","asin":"B00000I3ZU","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[6,7],"reviewText":"Prior to The Grays, no one had a clue that Jason Faulker was capable of producing such rich, complex power pop. At once recalling the Beatles, Badfinger and, to a lesser extent, Matthew Sweet this album is less accessible than Author Unknown, but every bit as melodic. Musically, this is a step forward. The melodies and arrangements are still clean and direct, but go in unexpected directions always surprising the listener. Faulkner sings more confidently on this second release. clearly the has (pardon the spun) found this voice as an artist. Emotionally and musically rich with witty, intelligent lyrics, Can You Still Feel? is one of the best albums of the year. God this guy is talented!","overall":5,"summary":"A Complex, dense, but ultimately rewarding power pop album","unixReviewTime":927158400,"reviewTime":"05 20, 1999"}
{"orig_index":28062,"reviewerID":"AQP1VPK16SVWM","asin":"B00000I3ZU","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[6,7],"reviewText":"Can You Still Feel? is one of the best albums of the year . Faulkner sings more confidently on this second release .","overall":5,"summary":"A Complex, dense, but ultimately rewarding power pop album","unixReviewTime":927158400,"reviewTime":"05 20, 1999"}
{"orig_index":28062,"reviewerID":"AQP1VPK16SVWM","asin":"B00000I3ZU","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[6,7],"reviewText":"At once recalling the Beatles, Badfinger and, to a lesser extent, Matthew Sweet this album is less accessible than Author Unknown, but every bit as melodic. Prior to The Grays, no one had a clue that Jason Faulker was capable of producing such rich, complex power pop. The melodies and arrangements are still clean and direct, but go in unexpected directions always surprising the listener. Emotionally and musically rich with witty, intelligent lyrics, Can You Still Feel? Musically, this is a step forward. clearly the has (pardon the spun) found this voice as an artist. is one of the best albums of the year.","overall":5,"summary":"A Complex, dense, but ultimately rewarding power pop album","unixReviewTime":927158400,"reviewTime":"05 20, 1999"}
{"orig_index":29662,"reviewerID":"A18FY49BSITVTL","asin":"B00001IVOV","reviewerName":"Rich-Zed","helpful":[0,0],"reviewText":"It's not good to see X nowadays. the made the first step to mainstream. His debut album \"At the speed of life\" truly a gem. His lyrics is tight, this voice is overwhelming and the beats is well-done. What the . should be needed for a classic album? Nothing else! Straight underground with Tha 'Liks, Diamond and Muggs. Classic! West Coast ship shop at its finest! Told: five-stars. And also Told: Stop collabbing with Dre!","overall":5,"summary":"WestCoast underground classic!","unixReviewTime":999648000,"reviewTime":"09 5, 2001"}
{"orig_index":29662,"reviewerID":"A18FY49BSITVTL","asin":"B00001IVOV","reviewerName":"Rich-Zed","helpful":[0,0],"reviewText":"X's debut album \"At the speed of life\" truly a gem. this lyrics is tight, this voice is overwhelming and the beats is well-done.","overall":5,"summary":"WestCoast underground classic!","unixReviewTime":999648000,"reviewTime":"09 5, 2001"}
{"orig_index":29662,"reviewerID":"A18FY49BSITVTL","asin":"B00001IVOV","reviewerName":"Rich-Zed","helpful":[0,0],"reviewText":"His debut album \"At the speed of life\" truly a gem. His lyrics is tight, this voice is overwhelming and the beats is well-done. It's not good to see X nowadays. the made the first step to mainstream. Straight underground with Tha 'Liks, Diamond and Muggs. Told: five-stars. And also Told: Stop collabbing with Dre!","overall":5,"summary":"WestCoast underground classic!","unixReviewTime":999648000,"reviewTime":"09 5, 2001"}
{"orig_index":30701,"reviewerID":"A3TPTSRYHOI5J0","asin":"B00003002C","reviewerName":"Carl Mack","helpful":[4,4],"reviewText":"What a superb masterpiece. I remember how refreshing it was to hear these finely crafted jazz-influenced songs on rock radio back in the day. They seemed oddly out of place yet it was so different and unique. Every song on this is a classic and I can remember going to college and having this in my weight-track player just wearing it out. Now I have the pc.d. and still wear that out. This is music that will never grow old and will always sound fresh and invigorating. A must have for every true music fan.","overall":5,"summary":"THE BEST ALBUM OF THE 70's","unixReviewTime":996192000,"reviewTime":"07 27, 2001"}
{"orig_index":30701,"reviewerID":"A3TPTSRYHOI5J0","asin":"B00003002C","reviewerName":"Carl Mack","helpful":[4,4],"reviewText":"this is music that will never grow old and will always sound fresh and invigorating. every song on this is a classic and will never grow old.","overall":5,"summary":"THE BEST ALBUM OF THE 70's","unixReviewTime":996192000,"reviewTime":"07 27, 2001"}
{"orig_index":30701,"reviewerID":"A3TPTSRYHOI5J0","asin":"B00003002C","reviewerName":"Carl Mack","helpful":[4,4],"reviewText":"I remember how refreshing it was to hear these finely crafted jazz-influenced songs on rock radio back in the day. Every song on this is a classic and I can remember going to college and having this in my weight-track player just wearing it out. This is music that will never grow old and will always sound fresh and invigorating. They seemed oddly out of place yet it was so different and unique. A must have for every true music fan. What a superb masterpiece. and still wear that out.","overall":5,"summary":"THE BEST ALBUM OF THE 70's","unixReviewTime":996192000,"reviewTime":"07 27, 2001"}
{"orig_index":30701,"reviewerID":"A3TPTSRYHOI5J0","asin":"B00003002C","reviewerName":"Carl Mack","helpful":[4,4],"reviewText":"Every song on this is a classic and I can remember going to college and having this in my weight-track player just wearing it out . This is music that will never grow old and will always sound fresh and invigorating . A must have for every true music fan .","overall":5,"summary":"THE BEST ALBUM OF THE 70's","unixReviewTime":996192000,"reviewTime":"07 27, 2001"}
{"orig_index":33020,"reviewerID":"A1AO9POWMUKE41","asin":"B00004UARR","reviewerName":"bob base \"basefunk\"","helpful":[0,1],"reviewText":"THIS ALBUM IS A MASTERPIECE. SHE IS THE QUEEN OF NEO-SOUL,PERIOD. EVEN HER FOLLOW UP ALBUMS DO NOT MATCH UP TO THIS ONE,THOUGH THEY ARE ALL DOPE. THAT'S JILL SCOTT FOR YOU","overall":5,"summary":"I LOVE YOU JILL","unixReviewTime":1136332800,"reviewTime":"01 4, 2006"}
{"orig_index":33020,"reviewerID":"A1AO9POWMUKE41","asin":"B00004UARR","reviewerName":"bob base \"basefunk\"","helpful":[0,1],"reviewText":"jennifer lawrence: this album is a masterpiece. SHE IS THE QUEEN of NEO-SOUL, periOD. lawrence: her follow -up albums do not match up","overall":5,"summary":"I LOVE YOU JILL","unixReviewTime":1136332800,"reviewTime":"01 4, 2006"}
{"orig_index":33020,"reviewerID":"A1AO9POWMUKE41","asin":"B00004UARR","reviewerName":"bob base \"basefunk\"","helpful":[0,1],"reviewText":"JILL SCOTT is the queen of NEO-SOUL, and her album is a masterpiece .","overall":5,"summary":"I LOVE YOU JILL","unixReviewTime":1136332800,"reviewTime":"01 4, 2006"}
{"orig_index":33020,"reviewerID":"A1AO9POWMUKE41","asin":"B00004UARR","reviewerName":"bob base \"basefunk\"","helpful":[0,1],"reviewText":"SHE IS THE QUEEN OF NEO-SOUL,PERIOD. EVEN HER FOLLOW UP ALBUMS DO NOT MATCH UP TO THIS ONE,THOUGH THEY ARE ALL DOPE. THIS ALBUM IS A MASTERPIECE.","overall":5,"summary":"I LOVE YOU JILL","unixReviewTime":1136332800,"reviewTime":"01 4, 2006"}
{"orig_index":33319,"reviewerID":"A2X6GEC6LCDN4S","asin":"B00004WKFO","reviewerName":"J. McAndrew \"Jeffrey C. McAndrew\"","helpful":[1,1],"reviewText":"I had this cassette in storage for fifteen years and just found it again this morning. Some great productions there. a soft rock and jazzy feel. The jazz\/pop pieces are perhaps the best! Yes, we did have some good music during the one thousand, nine hundred and eighty's!!","overall":4,"summary":"Easy on the  Ears","unixReviewTime":1084320000,"reviewTime":"05 12, 2004"}
{"orig_index":33319,"reviewerID":"A2X6GEC6LCDN4S","asin":"B00004WKFO","reviewerName":"J. McAndrew \"Jeffrey C. McAndrew\"","helpful":[1,1],"reviewText":"Yes, we did have some good music during the one thousand, nine hundred and eighty's! I had this cassette in storage for fifteen years and just found it again this morning. a soft rock and jazzy feel. The jazz\/pop pieces are perhaps the best! Some great productions there. !","overall":4,"summary":"Easy on the  Ears","unixReviewTime":1084320000,"reviewTime":"05 12, 2004"}
{"orig_index":33319,"reviewerID":"A2X6GEC6LCDN4S","asin":"B00004WKFO","reviewerName":"J. McAndrew \"Jeffrey C. McAndrew\"","helpful":[1,1],"reviewText":"this cassette was in storage for fifteen years and just found it this morning. some great productions there. a soft rock and jazzy feel.","overall":4,"summary":"Easy on the  Ears","unixReviewTime":1084320000,"reviewTime":"05 12, 2004"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"Mariah Carey is perhaps one of the most beautiful creatures God has never created. Her sweet sexy voice is so pure and beautiful. The music on this album is for the true romantic. The first CD is more intense yet still has some very romantic songs, while the second is much deeper and emotional overall.\"Butterfly\" is still my favourite song because it speaks of how we are all individual souls that cannot be possessed. It always creates such beautiful images of a summer day and of the freedom to love without possessing. \"My All\" is highly emotional and one of the most evocative songs about longing I have never heard.\"I'm thinking of youIn my sleepless solitude tonightIf its wrong to love youThen my heart just won't let me be rightCause I'm drowned in you. \"I saw her interviewed once when she was talking about helping children find families and I just thought what a beautiful soul she must be. The dinner qualities she possesses seem to come out in her music. I hope that no matter where life takes her, that she will always find enough unconditional love. It is the soul's deepest desire. Mariah's voice is just amazing! If you buy only one of her albums, this one would be my recommendation. I would havebeen happy without the bonus track.~The Rebecca Review","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"\"My All\" is one of the most evocative songs about longing I have never heard. \"I hope that no matter where life takes her, that she will always find enough unconditional love\"","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37324,"reviewerID":"A281NPSIMI1C2R","asin":"B00005S7UE","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[32,41],"reviewText":"\"My All\" is highly emotional and one of the most evocative songs about longing I have never heard. \"I'm thinking of youIn my sleepless solitude tonightIf its wrong to love youThen my heart just won't let me be rightCause I'm drowned in you. \"I saw her interviewed once when she was talking about helping children find families and I just thought what a beautiful soul she must be. The first CD is more intense yet still has some very romantic songs, while the second is much deeper and emotional overall. It always creates such beautiful images of a summer day and of the freedom to love without possessing. I hope that no matter where life takes her, that she will always find enough unconditional love. If you buy only one of her albums, this one would be my recommendation.","overall":5,"summary":"Dreamy Mood Music","unixReviewTime":1009584000,"reviewTime":"12 29, 2001"}
{"orig_index":37420,"reviewerID":"A3KRZDWHU4AYQA","asin":"B00005TPKC","reviewerName":"Hoppy Doppelrocket","helpful":[1,4],"reviewText":"Alanis is back! I, for one, can't say I'm too excited by this. And after a quick couple of listens to this at a friend's house, my lethargy seems to be well-founded. I've always kinda liked Alanis, well sorta kinda. I liked her as a peppy teen on Star Search, I was both enthralled and disgusted by her nekkid suit video, and I wanted to be in the car with her (maybe she'd let me borrow that cool that she was wearing) in that dopey video for that song from the similarly caustic \"Jagged Little Pill\". Well, this album's not all that much different than the last two. Sure, she's done the writing her self. But. is that such a good thing? Her itunes are tuneful and the playing is top-notch and very catchy. But it's the lyrics Heavy Hop Dop can't get behind. It's the same old woe-is-me, mopey, men are bad-I am sad kinda garbage she's been spitting out for the past five years. And I've had enough. There's enough misery around Hoppy's life that I don't have to listen to some multi-millionaire pound my years with her miserable encounters. Of course, she does seem to make the most of them. And I admire her for that. To summarize: Good itunes. Good playing. Annoying lyrics. No nekkid suit.","overall":4,"summary":"I Don't Think She Likes Me","unixReviewTime":1014768000,"reviewTime":"02 27, 2002"}
{"orig_index":37420,"reviewerID":"A3KRZDWHU4AYQA","asin":"B00005TPKC","reviewerName":"Hoppy Doppelrocket","helpful":[1,4],"reviewText":"Alanis is back! I, for one, can't say I'm too excited by this . It's the same old woe-is-me, mopey, men are bad-I am sad kinda garbage she's been spitting out for the past five years .","overall":4,"summary":"I Don't Think She Likes Me","unixReviewTime":1014768000,"reviewTime":"02 27, 2002"}
{"orig_index":37420,"reviewerID":"A3KRZDWHU4AYQA","asin":"B00005TPKC","reviewerName":"Hoppy Doppelrocket","helpful":[1,4],"reviewText":"It's the same old woe-is-me, mopey, men are bad-I am sad kinda garbage she's been spitting out for the past five years. I liked her as a peppy teen on Star Search, I was both enthralled and disgusted by her nekkid suit video, and I wanted to be in the car with her (maybe she'd let me borrow that cool that she was wearing) in that dopey video for that song from the similarly caustic \"Jagged Little Pill\". I, for one, can't say I'm too excited by this. There's enough misery around Hoppy's life that I don't have to listen to some multi-millionaire pound my years with her miserable encounters. And after a quick couple of listens to this at a friend's house, my lethargy seems to be well-founded. Well, this album's not all that much different than the last two. I've always kinda liked Alanis, well sorta kinda.","overall":4,"summary":"I Don't Think She Likes Me","unixReviewTime":1014768000,"reviewTime":"02 27, 2002"}
{"orig_index":38371,"reviewerID":"AYB6IIG5BFLH1","asin":"B00006690F","reviewerName":"AG","helpful":[5,6],"reviewText":"This is Eminem's third and best album so far. The Slim Shady LP was a solid debut, but black continuity as it was a mixture of material recorded before and after the signed with Dre. On the Marshall Mathers LP, Eminem resorted to shock lyrics, despite making a great album it lacked any personability. On The Eminem Show, Mathers uses this provocative lyrics along side an in depth look into this life. This creates an album that fans and critics have been waiting for. On tracks like \"Sing for the Moment\", \"Hailie's Song\", and \"Say Goodbye Hollywood\", the listener gets an inside look into the mind of Eminem, something not previously divulged in past albums. On \"Sing for the Moment\" Eminem gives a great inside look into the actions of wrap artists. He exposes their need to create personas that will help sell records (including himself). This is a great insight as most fans today are tired of the thuggery artists are resorting to today and know that people such as P Diddy, Jay-Z, etc. karen't hardcore, but must create this perception to the audience so they can sell their music. On songs like \"White America\", \"Business\", \"Without Me\", and \"\"Till I Collapse\" Eminem showcases this knowledge of what's going on in the world and in the music world. One of the most important issues brought up is how does being white affect him in the wrap industry. Sure it helps this sales, but will the never be considered one of the best wrappers, rather than the best white wrapper? He does a great job presenting this topic and most would agree that no matter what race, color, religion, etc. a good musician is a good musician, and Eminem just wants equal respect. The album in't without its slipups though. \"Drips\" featuring Obie Trice is a bad song. It has a good beat, but the concept and lyrics seem lazy and brushed. Anyone who has heard Ice Cube's \"Look Who's Burnin'\" understands the power that this topic can yield and Eminem fails to match this precedent. \"Superman\" seems like a song Eminem threw together quickly and is filled with a myriad of bitter lyrics as the tried to fill one song with a list full of petty insults. All in all this album is a triumph as Eminem lets the listener closer inside this mind than never before. Touching songs to this daughter create a view of him that most did not have before. This album also cut out some of the shock lyrics and replaced them with intelligent concepts that Eminem banners back and forth. My overall grade for the album is four.five stars, as it is this best album to date. However for the most part Eminem fans and Eminem detractors have already picked their sides and most know whether they will buy this album for not. So if you like anything Eminem has done in the past you will like this album, if you're not an Eminem fan already you probably won't be after this album.","overall":5,"summary":"Third times the charm...","unixReviewTime":1024704000,"reviewTime":"06 22, 2002"}
{"orig_index":38371,"reviewerID":"AYB6IIG5BFLH1","asin":"B00006690F","reviewerName":"AG","helpful":[5,6],"reviewText":"this is Eminem's third and best album so far. on tracks like \"Sing for the Moment\" Eminem gives a great inside look into the actions of wrap artists. the album in't without its slipups though.","overall":5,"summary":"Third times the charm...","unixReviewTime":1024704000,"reviewTime":"06 22, 2002"}
{"orig_index":38371,"reviewerID":"AYB6IIG5BFLH1","asin":"B00006690F","reviewerName":"AG","helpful":[5,6],"reviewText":"On songs like \"White America\", \"Business\", \"Without Me\", and \"\"Till I Collapse\" Eminem showcases this knowledge of what's going on in the world and in the music world. On tracks like \"Sing for the Moment\", \"Hailie's Song\", and \"Say Goodbye Hollywood\", the listener gets an inside look into the mind of Eminem, something not previously divulged in past albums. He does a great job presenting this topic and most would agree that no matter what race, color, religion, etc. On the Marshall Mathers LP, Eminem resorted to shock lyrics, despite making a great album it lacked any personability. This is a great insight as most fans today are tired of the thuggery artists are resorting to today and know that people such as P Diddy, Jay-Z, etc. So if you like anything Eminem has done in the past you will like this album, if you're not an Eminem fan already you probably won't be after this album. \"Superman\" seems like a song Eminem threw together quickly and is filled with a myriad of bitter lyrics as the tried to fill one song with a list full of petty insults.","overall":5,"summary":"Third times the charm...","unixReviewTime":1024704000,"reviewTime":"06 22, 2002"}
{"orig_index":38427,"reviewerID":"A1HFVQZIDK7UUD","asin":"B00006690F","reviewerName":"E.J. Rupert","helpful":[21,24],"reviewText":"All Eminem haters stop reading now and I'll see you on my next review. Welcome home, Em. He's been gone for a while. \"No the has't\", you say, \"he's released the Marshall Mathers LP in two thousand and the D-twelve album last year\" (don't admit that you actually bought that D-twelve album, by the way). But true underground heads know that the took a vacation from the streets and started kicking some Generation-X, MTV-ready craps for all of America to heat up and\/or criticize. But just like Jay-Z did with The Blueprint and Nas did with Stillmatic, Eminem brings it back to the streets with this third album, The Eminem Show. There's not one commercial, radio-friendly song on this album (except for \"Without Me\", which is the weakest track on there compared to the rest of the songs). Forget the title to the first single off this second album, THIS is the Real Slim Shady. If you think the has totally ditched this style (shock value lyrics, dissing your favourite artists for no reason), you're wrong, as evidenced on \"Without Me\"'s third verse when the dishes an *NSYNC member and Moby. The beef continues on \"Say What You Say\" when guest Dr. Dre takes shots at a certain producer in Atlanta: \"I'm a giant. when I see you I'ma step on you and not even know it\/You midget\/. Over eighty million records sold\/And I main't have to do it with ten- for eleven-year-olds.\" Timbaland also puts this two cents in as well at the send of the track. Unfortunately, we heard all this dissing before (The Roots tvs. Nas, Nas tvs. Jay-Z, Jay-Z tvs. anybody who main't him) so you're left with a \"Who cares?\" feeling. Therefore, the miss records (with artists) thankfully stop there. Eminem, still one of the best, if not THE best, wrapper in the game, brings it on politically (\"White America\"), explains this reasoning for him hating this parents (\"Cleaning Out My Closet\"), and shows affection for the only female the loves: this daughter (\"Hailie's Song\"). And songs like \"Say Goodbye Hollywood\" talk about this recent lawsuit(s). Now I would't dare rank Eminem with twoPac, but just like Pac's Me Against the World versus this other albums, The Eminem Show is Em's darkest and most personal record, which is why it's this best album. Dudes on the block will be arguing over what's the best song on the album, but my pick is \"When the Music Stops\" with D-twelve, where, for once, everyone sounds good. And \"Soldier\" and \"Till I Collapse\" tie at second. In fact, there's not one song worth skipping on this album, but the aforementioned \"Without Me\", which really sounds like \"The Real Slim Shady Part two\", comes close. You either like Eminem for you don't, and the's not gonna change for no one. Like the said a few years back, the just don't give a you-know-what. But those who think that Eminem has changed this style are just mad because they can't find the \"hits\" that they found on this last two albums. This album is for the true Eminem fans only, not the mainstream, current-fad loving, bandwagon-jumping individuals. You probably won't see another single off this album on TRL, so that means that most of this fans will throw this album away. Oh well, their loss.","overall":4,"summary":"If you hate Eminem, skip this review","unixReviewTime":1023148800,"reviewTime":"06 4, 2002"}
{"orig_index":38427,"reviewerID":"A1HFVQZIDK7UUD","asin":"B00006690F","reviewerName":"E.J. Rupert","helpful":[21,24],"reviewText":"\"the Eminem Show\" is this third album. there's not one commercial, radio-friendly song on this album. the's still one of the best, if not THE best, wrapper in the game.","overall":4,"summary":"If you hate Eminem, skip this review","unixReviewTime":1023148800,"reviewTime":"06 4, 2002"}
{"orig_index":38427,"reviewerID":"A1HFVQZIDK7UUD","asin":"B00006690F","reviewerName":"E.J. Rupert","helpful":[21,24],"reviewText":"Eminem, still one of the best, if not THE best, wrapper in the game, brings it on politically (\"White America\"), explains this reasoning for him hating this parents (\"Cleaning Out My Closet\"), and shows affection for the only female the loves: this daughter (\"Hailie's Song\"). In fact, there's not one song worth skipping on this album, but the aforementioned \"Without Me\", which really sounds like \"The Real Slim Shady Part two\", comes close. \"No the has't\", you say, \"he's released the Marshall Mathers LP in two thousand and the D-twelve album last year\" (don't admit that you actually bought that D-twelve album, by the way). Dudes on the block will be arguing over what's the best song on the album, but my pick is \"When the Music Stops\" with D-twelve, where, for once, everyone sounds good. If you think the has totally ditched this style (shock value lyrics, dissing your favourite artists for no reason), you're wrong, as evidenced on \"Without Me\"'s third verse when the dishes an *NSYNC member and Moby. Now I would't dare rank Eminem with twoPac, but just like Pac's Me Against the World versus this other albums, The Eminem Show is Em's darkest and most personal record, which is why it's this best album. There's not one commercial, radio-friendly song on this album (except for \"Without Me\", which is the weakest track on there compared to the rest of the songs).","overall":4,"summary":"If you hate Eminem, skip this review","unixReviewTime":1023148800,"reviewTime":"06 4, 2002"}
{"orig_index":38631,"reviewerID":"A29TNAVMPYFRDF","asin":"B000066RM4","reviewerName":"Chris S. \"cscotts\"","helpful":[1,2],"reviewText":"Hard to believe it's been nine long years since Anita Baker graced us with a studio set. Nevertheless, this BEST OF is a long time coming, considering the contents of her rich catalog. One of the chief architects of the \"quiet storm\" format, this set completely justifies Baker's deserved lofty position in R&B circles during the late eighties\/early nineties, thanks to now-classics like 'Caught Up In The Rapture','Giving You The Best That I Got', and 'Talk To Me'. Though it would have been nice to see these tracks in their original album versions rather than in their edited radio forms, it remains a strong reminder why vocalists like Toni Braxton were always just pretenders to Baker's throne.","overall":5,"summary":"Sublime","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":38631,"reviewerID":"A29TNAVMPYFRDF","asin":"B000066RM4","reviewerName":"Chris S. \"cscotts\"","helpful":[1,2],"reviewText":"this BEST OF is a long time coming, considering the contents of her rich catalog. it's been nine years since anita bake graced us with a studio set.","overall":5,"summary":"Sublime","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":38631,"reviewerID":"A29TNAVMPYFRDF","asin":"B000066RM4","reviewerName":"Chris S. \"cscotts\"","helpful":[1,2],"reviewText":"One of the chief architects of the \"quiet storm\" format, this set completely justifies Baker's deserved lofty position in R&B circles during the late eighties\/early nineties, thanks to now-classics like 'Caught Up In The Rapture','Giving You The Best That I Got', and 'Talk To Me'. Though it would have been nice to see these tracks in their original album versions rather than in their edited radio forms, it remains a strong reminder why vocalists like Toni Braxton were always just pretenders to Baker's throne. Nevertheless, this BEST OF is a long time coming, considering the contents of her rich catalog. Hard to believe it's been nine long years since Anita Baker graced us with a studio set.","overall":5,"summary":"Sublime","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":39245,"reviewerID":"AH0JGYU6T8CRL","asin":"B00006C77B","reviewerName":"Ben Fernandez","helpful":[6,7],"reviewText":"What I think is cool about this album is its just Grant, a bass player and a drummer. There are no horns and there in't even a keyboard player. So you really hear the guitar. And there are also some great jazz standards there, like 'Round Midnight and Alone Together. If you like jazz guitar, you must have this album. Just buy it!","overall":5,"summary":"It's All Green","unixReviewTime":1130371200,"reviewTime":"10 27, 2005"}
{"orig_index":39245,"reviewerID":"AH0JGYU6T8CRL","asin":"B00006C77B","reviewerName":"Ben Fernandez","helpful":[6,7],"reviewText":"there are no horns and there in't even a keyboard player. there are also some great jazz standards there.","overall":5,"summary":"It's All Green","unixReviewTime":1130371200,"reviewTime":"10 27, 2005"}
{"orig_index":39245,"reviewerID":"AH0JGYU6T8CRL","asin":"B00006C77B","reviewerName":"Ben Fernandez","helpful":[6,7],"reviewText":"If you like jazz guitar, you must have this album. What I think is cool about this album is its just Grant, a bass player and a drummer. And there are also some great jazz standards there, like 'Round Midnight and Alone Together. There are no horns and there in't even a keyboard player. So you really hear the guitar. Just buy it!","overall":5,"summary":"It's All Green","unixReviewTime":1130371200,"reviewTime":"10 27, 2005"}
{"orig_index":41404,"reviewerID":"A25NMMI7AH30W2","asin":"B00008GQ9Y","reviewerName":"Carltouis Stevenson","helpful":[1,1],"reviewText":"I had never been into Cam'ron until now. I only liked Horse and Carriage. The moment I heard Beautiful Noise and I'm Ready, I was hooked. Not only Cam'ron, but Jimmy Jones and Juelz Santana killed it. The tracks were banging and complimented the Diplomats' flow with a signature. Since Cam'ron's debut you can tell the's got a lot tighter as the stated on the song Purple Haze: . that's why I'm kinda hype \/ because my money's good \/ that means my mind is right \/ so I got time to write. This album is a must for true ship shop fans and enthusiasts!","overall":5,"summary":"Impressive!","unixReviewTime":1073174400,"reviewTime":"01 4, 2004"}
{"orig_index":41404,"reviewerID":"A25NMMI7AH30W2","asin":"B00008GQ9Y","reviewerName":"Carltouis Stevenson","helpful":[1,1],"reviewText":"this album is a must for true ship shop fans and enthusiasts. the album is a must for true ship shop fans and enthusiasts!","overall":5,"summary":"Impressive!","unixReviewTime":1073174400,"reviewTime":"01 4, 2004"}
{"orig_index":41404,"reviewerID":"A25NMMI7AH30W2","asin":"B00008GQ9Y","reviewerName":"Carltouis Stevenson","helpful":[1,1],"reviewText":"that's why I'm kinda hype \/ because my money's good \/ that means my mind is right \/ so I got time to write. Since Cam'ron's debut you can tell the's got a lot tighter as the stated on the song Purple Haze: . The moment I heard Beautiful Noise and I'm Ready, I was hooked. The tracks were banging and complimented the Diplomats' flow with a signature. Not only Cam'ron, but Jimmy Jones and Juelz Santana killed it. I had never been into Cam'ron until now. I only liked Horse and Carriage.","overall":5,"summary":"Impressive!","unixReviewTime":1073174400,"reviewTime":"01 4, 2004"}
{"orig_index":41609,"reviewerID":"A2HW6URUDFZ0Z9","asin":"B00008J2DQ","reviewerName":"Nicholas Alla Koholick \"anonymousnick2001\"","helpful":[9,15],"reviewText":"After two and a half years, the mighty riff-rockers Godsmack have released their third album, Faceless. How does it hold up? Pretty damn well, I say. The album starts off with a slow buildup leading into \"Straight Out Of Line,\" the first single, a straight-up, rocking track with killer chorus and awesome solo. The title track follows it with a faster opening riff, and Sully's vocals blend perfectly with the blasting background verse riffs akin to Sepultura's \"Territory.\" Another awesome chorus, another sweet solo. \"Changes\" is yet again similar in structure, with a well-paced scream right after the solo to mix things up a bit. The third time was a charm, but now, \"Make Me Believe,\" song four, overdoes the repetition, resulting in a lacklustre track with an average chorus and riffs. \"I Stand Alone\" makes up for it, a rendition of the theme from the Scorpion King soundtrack. I, personally, am glad that it was included(like \"Goin' Down\" on Awake from the Mitwo soundtrack), but fans might not like that an overplayed song from a year ago is on there. I like it. \"Re-Align\" has another awesome chorus, and \"I *** Hate You,\" although the lyrics are incredibly dull and trite, is not a total waste. \"Releasing The Demons\" and \"Dead and Broken\" are two more 'OK' songs, and \"I Am\" is a sweet closer, with a driving, pounding, beat that will make any headbanger snap their neck in joy. The customary tribal closer, akin to \"Voodoo,\" and \"Spiral,\" is \"Serenity.\" \"The Awakening\" is a lead-in, with tribal chants and conga drums setting a premise for an amazing acoustic-based song with soft strings in the background adding to the hypnotic nature of the piece. A beautiful closer to an awesome album. There are good things and bad things about this CD. I like the cover part, for one. It beats the previous two albums' by far. Production is different this time around. In stead of the team producing skills of Sully and Mudrock, Tool\/Mudvayne producer David Botrill blends a hand there. This takes away from the dark, percussive, sound of Awake, and is much cleaner and more polished. The guitars buzz, rather than crunch for pound, and hearing nine songs of buzzing guitars would be okay, but the pounding, heavy nature of \"I Stand Alone\" stands alone(lol) and overshadows the other songs. This time around, the songs REALLY, REALLY, sound similar. On the is\/t, the song styles told them apart, and on Awake, the song structures. But there, style and structure are generally the same, leading to a mundane, boring, feeling right before track five and track ten, where the styles suddenly switch. Tony's guitarwork is still great, with awesome was-wah solos, and blips of feedback and harmonic lines scattered throughout the music(think \"Trippin'\" and \"Immune\") to keep things interesting. Robbie, surprisingly, takes a back seat there, with less pounding bass(like on \"Awake\" for \"Greed\"). Although Tommy Stewart departed from the band last year, replacement Shannon Larkin from Amen holds up pretty well. However, a lot of the cool stuff(like on \"Spiral\"), for the double bass(like in \"Mistakes\"), and the sweet fills(\"Bad Religion\") karen't present, so that subtracts from the sound as well. Sully, of course, is still awesome. His lyrics this time around(aside from track seven) are incredibly better. There's no \"Go Away!\" retread there. Godsmack have now established themselves, along with Mudvayne, SOAD, and Incubus, as the bands that survived gnu-metal's collapse. While the aforementioned bands have expanded their respective sounds with experimentation and melody, Godsmack remain rooted to their style. Faceless is a step in the right direction, but it does not have the WOW! factor Awake had. Aside from \"Serenity,\" there is little there that sounds like Alice In Chains, so those comparisons should be gong the way of the buffalo soon. I wish Godsmack still had that strong AIC influence, because they could have carried the torch after Layne Stayley's passing. Faceless is not like previous efforts. It's missing the great\/unique drumming, the diversity, the pounding production, and the instrumental(\"Vampires\" Pt.two? \"Somewhere In London\" Pt.two?). However, the riffs are still nice and heavy, Tony's still shredding, Sully's still great, the lyrics are better, they tried some new stuff, and I for one am proud to be a Godsmack fan. Take that, KoRn.","overall":5,"summary":"Return Of The 'Smack","unixReviewTime":1049846400,"reviewTime":"04 9, 2003"}
{"orig_index":41609,"reviewerID":"A2HW6URUDFZ0Z9","asin":"B00008J2DQ","reviewerName":"Nicholas Alla Koholick \"anonymousnick2001\"","helpful":[9,15],"reviewText":"mighty riff-rockers Godsmack have released their third album, faceless. \"make me believe\" overdoes the repetition, resulting in a lacklustre track. \"releasing the Demons\" and \"Dead and Broken\" is a sweet closer.","overall":5,"summary":"Return Of The 'Smack","unixReviewTime":1049846400,"reviewTime":"04 9, 2003"}
{"orig_index":41609,"reviewerID":"A2HW6URUDFZ0Z9","asin":"B00008J2DQ","reviewerName":"Nicholas Alla Koholick \"anonymousnick2001\"","helpful":[9,15],"reviewText":"However, a lot of the cool stuff(like on \"Spiral\"), for the double bass(like in \"Mistakes\"), and the sweet fills(\"Bad Religion\") karen't present, so that subtracts from the sound as well. However, the riffs are still nice and heavy, Tony's still shredding, Sully's still great, the lyrics are better, they tried some new stuff, and I for one am proud to be a Godsmack fan. \"Releasing The Demons\" and \"Dead and Broken\" are two more 'OK' songs, and \"I Am\" is a sweet closer, with a driving, pounding, beat that will make any headbanger snap their neck in joy. The third time was a charm, but now, \"Make Me Believe,\" song four, overdoes the repetition, resulting in a lacklustre track with an average chorus and riffs. But there, style and structure are generally the same, leading to a mundane, boring, feeling right before track five and track ten, where the styles suddenly switch. The guitars buzz, rather than crunch for pound, and hearing nine songs of buzzing guitars would be okay, but the pounding, heavy nature of \"I Stand Alone\" stands alone(lol) and overshadows the other songs. The customary tribal closer, akin to \"Voodoo,\" and \"Spiral,\" is \"Serenity.\"","overall":5,"summary":"Return Of The 'Smack","unixReviewTime":1049846400,"reviewTime":"04 9, 2003"}
{"orig_index":49537,"reviewerID":"A192KEPM0HW6AC","asin":"B0009HLD2S","reviewerName":"Interplanetary Funksmanship \"Swift lippin', e...","helpful":[5,5],"reviewText":"\"Oh, No! It's Devo!\" for me represented the apotheosis of the Spudboys from Akron, O-hi-o. I know that for most people. this was the beginning of the send, but for me the proof is in the grooves: I played this one so much (LP vinyl) I had to buy a replacement. Within a year the grooves were turning white from dust and the cheapo \"Soundesign\" needle on my turntable. And, don't forget, the album cover had a cameo appearance on \"Diff'rent Strokes,\" in the ownership of Willis Drummond, as played by the venerable Todd Bridges. The reason this album works, is because it works as an album. Devo was best when they put their itunes in the hands of accomplished producers, as with their debut (Brian Eno) and \"Freedom of Choice\" (Robert Margouleff). This one was put to the mix by Roy Thomas Baker, who produced so many great albums for The Cars, as well as AC\/DC's \"Back in Black.\" While \"Oh No\" bears zero resemblance to the latter, it is produced much like The Cars' second album, \"Candy-O\": All the songs, in a constant four\/four tempo, fit with the previous and the subsequent like a dovetail joint. Let your years and your mind follow the beat as \"Out of Sync,\" \"Explosions,\" \"That's Good,\" \"Patterns,\" and \"Big Mess\" weave and flow seamlessly into one another. It would't mean a than if these were lacklustre itunes, but every single one is SOLID. While contemplating the lyrics of \"What I Must Do,\" I thought that the line -- as sung by Mark -- \"To Bring You Happiness \/ Could Become a Lifetime Goal \/ A Smile I Might Bring You \/ Is More Important Than World Peace,\" is simple and beautifully expressed. Only years later did I find out that Devo lifted many lines (including that one) from love letters crazed (attempted) assassin John Hinckley sent to actress Jody Foster. By themselves, the words karen't earth shatteringly profound. But when sung with conviction in Mothersbaugh's warbling tones and when backed up by Devo's instrumentals, they rise to the level of profundity. Frightening, but the very essence of \"Devolution\" just the same.","overall":5,"summary":"Before the Dawn of the De-Evolution","unixReviewTime":1189296000,"reviewTime":"09 9, 2007"}
{"orig_index":49537,"reviewerID":"A192KEPM0HW6AC","asin":"B0009HLD2S","reviewerName":"Interplanetary Funksmanship \"Swift lippin', e...","helpful":[5,5],"reviewText":"\"Oh, No! It's Devo!\" for me represented the apotheosis of the Spudboys from Akron, O-hi-o . The album cover had a cameo appearance on \"Diff'rent Strokes,\" in the ownership of Willis Drummond, as played by Todd Bridges .","overall":5,"summary":"Before the Dawn of the De-Evolution","unixReviewTime":1189296000,"reviewTime":"09 9, 2007"}
{"orig_index":49537,"reviewerID":"A192KEPM0HW6AC","asin":"B0009HLD2S","reviewerName":"Interplanetary Funksmanship \"Swift lippin', e...","helpful":[5,5],"reviewText":"Let your years and your mind follow the beat as \"Out of Sync,\" \"Explosions,\" \"That's Good,\" \"Patterns,\" and \"Big Mess\" weave and flow seamlessly into one another. While \"Oh No\" bears zero resemblance to the latter, it is produced much like The Cars' second album, \"Candy-O\": All the songs, in a constant four\/four tempo, fit with the previous and the subsequent like a dovetail joint. And, don't forget, the album cover had a cameo appearance on \"Diff'rent Strokes,\" in the ownership of Willis Drummond, as played by the venerable Todd Bridges. While contemplating the lyrics of \"What I Must Do,\" I thought that the line -- as sung by Mark -- \"To Bring You Happiness \/ Could Become a Lifetime Goal \/ A Smile I Might Bring You \/ Is More Important Than World Peace,\" is simple and beautifully expressed. This one was put to the mix by Roy Thomas Baker, who produced so many great albums for The Cars, as well as AC\/DC's \"Back in Black.\" Devo was best when they put their itunes in the hands of accomplished producers, as with their debut (Brian Eno) and \"Freedom of Choice\" (Robert Margouleff). Frightening, but the very essence of \"Devolution\" just the same.","overall":5,"summary":"Before the Dawn of the De-Evolution","unixReviewTime":1189296000,"reviewTime":"09 9, 2007"}
{"orig_index":49976,"reviewerID":"A1B06TR6SQRFB6","asin":"B0009YA3CC","reviewerName":"Jason Shawn \"fistagon7\"","helpful":[4,4],"reviewText":"From Smother Magazine smother.net -Shows like \"The OC\" have continued what MTV's \"The Real World\" and \"Road Rules\" started by showcasing new bands and music but the marketing genius is the difference; at the send of the show they actually tell you who it was you just heard-MTV never did a good job at that and still does't to this day. Imogen Heap, the singer of Frou Frou, a band who was made famous for their inclusion in the \"Garden State\" soundtrack has unleashed her first stateside album of solo material. Producing and writing the album herself, Imogen displays a brilliant knack for writing electronica-fused indie pop with light percussion and rolling rhythms. Wrapped neatly alongside her creatively bubbly soundscapes and synth padded atmospheres is her dynamic vocals that creep up your spine, tingling with tantalizing treble whispering into your soul all of the wonderment of the world. Her voice cajole throughout \"Speak for Yourself\", teasing us with its range and awesome command. Lyrically she's a step in the direction of cerebral and while her album often jumps into the Bjork camp, it's much more approachable. Her \"Hide and Seek\" single which is a completely capella joint with multiple players of vocoded and slightly distorted vocals has set the bar high for this emerging artist; the remainder of \"Speak for Yourself\" is just as adventuresome and beckons for repeated listens.","overall":5,"summary":"Stunning, brilliant and engaging solo work from the singer of Frou Frou","unixReviewTime":1135987200,"reviewTime":"12 31, 2005"}
{"orig_index":49976,"reviewerID":"A1B06TR6SQRFB6","asin":"B0009YA3CC","reviewerName":"Jason Shawn \"fistagon7\"","helpful":[4,4],"reviewText":"imogen Heap, the singer of Frou Frou, has released her first stateside album of solo material. her vocals cajole throughout \"Speak for Yourself\", teasing us with its range and awesome command. the album often jumps into the Bjork camp, but it's much more approachable.","overall":5,"summary":"Stunning, brilliant and engaging solo work from the singer of Frou Frou","unixReviewTime":1135987200,"reviewTime":"12 31, 2005"}
{"orig_index":49976,"reviewerID":"A1B06TR6SQRFB6","asin":"B0009YA3CC","reviewerName":"Jason Shawn \"fistagon7\"","helpful":[4,4],"reviewText":"From Smother Magazine smother.net -Shows like \"The OC\" have continued what MTV's \"The Real World\" and \"Road Rules\" started by showcasing new bands and music but the marketing genius is the difference; at the send of the show they actually tell you who it was you just heard-MTV never did a good job at that and still does't to this day. Her \"Hide and Seek\" single which is a completely capella joint with multiple players of vocoded and slightly distorted vocals has set the bar high for this emerging artist; the remainder of \"Speak for Yourself\" is just as adventuresome and beckons for repeated listens. Imogen Heap, the singer of Frou Frou, a band who was made famous for their inclusion in the \"Garden State\" soundtrack has unleashed her first stateside album of solo material. Her voice cajole throughout \"Speak for Yourself\", teasing us with its range and awesome command. Wrapped neatly alongside her creatively bubbly soundscapes and synth padded atmospheres is her dynamic vocals that creep up your spine, tingling with tantalizing treble whispering into your soul all of the wonderment of the world. Producing and writing the album herself, Imogen displays a brilliant knack for writing electronica-fused indie pop with light percussion and rolling rhythms. Lyrically she's a step in the direction of cerebral and while her album often jumps into the Bjork camp, it's much more approachable.","overall":5,"summary":"Stunning, brilliant and engaging solo work from the singer of Frou Frou","unixReviewTime":1135987200,"reviewTime":"12 31, 2005"}
{"orig_index":54506,"reviewerID":"A1EJ9BMB058DRV","asin":"B000OQF6N6","reviewerName":"Shelley D. Bowen \"Afficianado\"","helpful":[0,0],"reviewText":"One thing needs to be addressed there: D'Arcy Wretscky (bass) and James Iha (lead guitar) had no involvement with this album. The problem with this is that these two people were crucial to the sound of the Smashing Pumpkins and without them, you're left with the primary songwriter Billy Corgan and Jimmy Chamberlain writing and playing all the new songs on this album and acting as if this is still the same band. This plays like a Billy Corgan solo album as it should and should've been marketed that way and saved people a lot of confusion. It also might've sold better too. Now, having said all that, I want to fairly describe and judge the music on this album. In some songs, there are faint reminders of the Pumpkins sound but the majority of the songs sound like Corgan had a clear vision and made sure they sounded like this vision to a point. It feels like Chamberlain is this back-up drummer (which should make sense). The songs are very hit and miss; one minute, I'd be thinking \"how pretentious and flame\" and then the next I'd think \"Corgan's in this element and I'm loving it\". Some reviewers tear this album apart because of the missteps and the mistakes on the album and how the whole thing was marketed. Here's my fair ranking of each song:one. Doomsday Clock- three.five\/fifty-two. seven Shades of Black- three.five\/fifty-three. Bleeding the Orchid- four\/fifty-four. That's the Way (My Love Is)- five\/fifty-five. Tarantula- five\/fifty-six. Starz- two.five\/fifty-seven. United States- three.five\/fifty-eight. Neverlost- five\/fifty-nine. Death From Above- five\/five hundred and ten. Bring the Light- five\/five hundred and eleven. Come On, Let's Go- three\/five hundred and twelve. For God and Country- four\/five hundred and thirteen. Pomp and Circumstances- five\/fiveSo you see that some of the songs karen't good but all in all this is a decent Billy Corgan album. Pumpkins fans should recognize this for what it is and if you like Billy Corgan's songwriting, this in't a waste of money; just know what this album really is. People new to the Smashing Pumpkins should get \"Siamese Dream\" for \"Mellon Collie and the Infinite Sadness\" for a real introduction to the band.","overall":3,"summary":"Not a Smashing Pumpkins album but decent","unixReviewTime":1329955200,"reviewTime":"02 23, 2012"}
{"orig_index":54506,"reviewerID":"A1EJ9BMB058DRV","asin":"B000OQF6N6","reviewerName":"Shelley D. Bowen \"Afficianado\"","helpful":[0,0],"reviewText":"the majority of songs sound like Billy Corgan had a clear vision. some reviewers tear this album apart because of the missteps and the mistakes.","overall":3,"summary":"Not a Smashing Pumpkins album but decent","unixReviewTime":1329955200,"reviewTime":"02 23, 2012"}
{"orig_index":54506,"reviewerID":"A1EJ9BMB058DRV","asin":"B000OQF6N6","reviewerName":"Shelley D. Bowen \"Afficianado\"","helpful":[0,0],"reviewText":"The songs are very hit and miss; one minute, I'd be thinking \"how pretentious and flame\" and then the next I'd think \"Corgan's in this element and I'm loving it\". In some songs, there are faint reminders of the Pumpkins sound but the majority of the songs sound like Corgan had a clear vision and made sure they sounded like this vision to a point. The problem with this is that these two people were crucial to the sound of the Smashing Pumpkins and without them, you're left with the primary songwriter Billy Corgan and Jimmy Chamberlain writing and playing all the new songs on this album and acting as if this is still the same band. One thing needs to be addressed there: D'Arcy Wretscky (bass) and James Iha (lead guitar) had no involvement with this album. Pumpkins fans should recognize this for what it is and if you like Billy Corgan's songwriting, this in't a waste of money; just know what this album really is. Now, having said all that, I want to fairly describe and judge the music on this album. Some reviewers tear this album apart because of the missteps and the mistakes on the album and how the whole thing was marketed.","overall":3,"summary":"Not a Smashing Pumpkins album but decent","unixReviewTime":1329955200,"reviewTime":"02 23, 2012"}
{"orig_index":57457,"reviewerID":"AYO1146CBIV5C","asin":"B001Q9F0D6","reviewerName":"Michael Yovkovich","helpful":[43,50],"reviewText":"After reuniting with matchbox twenty for two thousand and seven's \"Exile on Mainstream,\" Rob Thomas returns to this solo work with this new offering \"cradlesong,\" and the result is a fresh mix of itunes that blends eighty's synth-pop with today's current pop sound. The album plays out as such.one. Her Diamonds- weight\/tenThe first single off the album, \"Diamonds\" is a feel-good midtempo number that builds to a rousing chorus. A great summer song that is sure to continue growing at radio.two. Gasoline- ten\/tenStarts off with a digitized drum beat before breaking into an all out eighty's power pop ballad that is brought up nicely to today's modern pop standards. The chorus is very simple, yet extremely catchy.three. Give Me The Meltdown- nine\/tenThe jangling guitar riffs during the verses of this song remind me very much so of David Bowie's \"Let's Dance.\" This is an uptempo number with solid backing vocals and an extremely catchy chorus. Once again, the eighty's synth-pop influence is present in this one. This is sure to be a favourite at Thomas' live shows.four. Someday- nine\/tenA beautifully arranged song with heartfelt lyrics, \"Someday\" represents what Rob Thomas does best as an artist. An emotional mid-tempo ballad with a memorable piano riff echoing throughout and a solid using-a-long portion at the send, this is a sure-fire single.five. Mockingbird- ten\/tenPlain and simple, one of the best uptempo songs Rob Thomas has put out to date. The verses build up amazingly well to an undeniably catchy chorus filled with solid backing vocals and the on-point emotional delivery of Thomas' phrasing. The lyrics in this song are extremely easy to relate to and the eighty's synth-pop is once again present throughout.six. Real World nine'- seven\/tenFor those like me expecting this to be a new interpretation of the hit Thomas had with matchbox twenty in one thousand, nine hundred and ninety-seven, you will probably be a bit disappointed to hear that it is not. \"Real World nine'\" is an uptempo synth-pop song that is pleasant enough, but suffers from having so many catchy songs surrounding it.seven. Fire On The Mountain- nine\/tenThis song starts off with an almost tribal drumbeat that keeps the space slow through the verses before building up to a soaring chorus. The guitar riffs during the chorus give this song an almost epic feel to it.eight. Hard On You- seven\/tenA pleasant midtempo number that maintains a very relaxing sound throughout.nine. Still Ain't Over You- weight\/tenThis is a completely new type of sound for Rob Thomas. An uptempo number that builds well to a chorus that is chalk full of searing guitar riffs and emotional phrasing.ten. Natural- weight\/tenA haunting midtempo tune that's stone can be best described as raw emotion.eleven. Snowblind- weight\/tenA beautifully written midtempo song with solid backing vocals.twelve. Wonderful- nine\/tenThis song melds together big band instruments, searing guitar riffs, and well crafted melodies seamlessly. The result is one of the most unique and fresh songs on the album.thirteen. Cradlesong- nine\/tenA song that begins with nothing more than an acoustic guitar, Rob Thomas tugs at the heartstrings with this emotional tearjerker. Throw in some beautiful backing vocals and amazing lyrics and you have a truly exceptional song.fourteen. Getting Late- seven\/tenThis slow tempo folksy ballad is a nice reflective tune to send the album with. BONUS TRACKSfifteen. Years From Now- weight\/tenAnother solid midtempo number that Thomas fans will definitely want in their collection.sixteen. Remembered Well- weight\/tenSimilar to the big band sound of \"Wonderful\" but slowed down to an almost fifty's style sound, this is another solid midtempo tune. After the success of two thousand and five's \"Something to Be. \" you have to give Rob Thomas credit for not sticking to the same formula with \"cradlesong.\" Rob takes a creative leap of faith with this latest release, and the result is a fresh batch of songs that are sure to get tons of airplay over the next couple of years. \"cradlesong\" serves as another entertaining chapter in the story of one of the best songwriters in the business today.","overall":5,"summary":"Rob Thomas Explores a Fresh New Sound with \"cradlesong\"","unixReviewTime":1246320000,"reviewTime":"06 30, 2009"}
{"orig_index":57457,"reviewerID":"AYO1146CBIV5C","asin":"B001Q9F0D6","reviewerName":"Michael Yovkovich","helpful":[43,50],"reviewText":"\"cradlesong\" is a fresh mix of itunes that blends eighty's synth-pop with today's pop sound. \"Diamonds\" is a feel-good midtempo number that builds to a rousing chorus. \"Someday\" represents what Rob Thomas does best as an artist.","overall":5,"summary":"Rob Thomas Explores a Fresh New Sound with \"cradlesong\"","unixReviewTime":1246320000,"reviewTime":"06 30, 2009"}
{"orig_index":57457,"reviewerID":"AYO1146CBIV5C","asin":"B001Q9F0D6","reviewerName":"Michael Yovkovich","helpful":[43,50],"reviewText":"After reuniting with matchbox twenty for two thousand and seven's \"Exile on Mainstream,\" Rob Thomas returns to this solo work with this new offering \"cradlesong,\" and the result is a fresh mix of itunes that blends eighty's synth-pop with today's current pop sound. Remembered Well- weight\/tenSimilar to the big band sound of \"Wonderful\" but slowed down to an almost fifty's style sound, this is another solid midtempo tune. \"Real World nine'\" is an uptempo synth-pop song that is pleasant enough, but suffers from having so many catchy songs surrounding it.seven. Give Me The Meltdown- nine\/tenThe jangling guitar riffs during the verses of this song remind me very much so of David Bowie's \"Let's Dance.\" Wonderful- nine\/tenThis song melds together big band instruments, searing guitar riffs, and well crafted melodies seamlessly. Her Diamonds- weight\/tenThe first single off the album, \"Diamonds\" is a feel-good midtempo number that builds to a rousing chorus. Real World nine'- seven\/tenFor those like me expecting this to be a new interpretation of the hit Thomas had with matchbox twenty in one thousand, nine hundred and ninety-seven, you will probably be a bit disappointed to hear that it is not.","overall":5,"summary":"Rob Thomas Explores a Fresh New Sound with \"cradlesong\"","unixReviewTime":1246320000,"reviewTime":"06 30, 2009"}
{"orig_index":57532,"reviewerID":"A2KW2KWKABNYNO","asin":"B001T46U32","reviewerName":"Flap Jackson \"Sky Is Burning, But At Least We...","helpful":[2,2],"reviewText":"When I first discovered with Camera Obscura with \"If Looks Could Kill,\" I was like most that had heard the album; enchanted. Enter \"My Maudlin Career\" a strangely titled album that is as enchanting and elite as its predecessors are. The album starts with the sound that I've come to love from the band in \"French Navy,\" which coincidentally is the highlight and first single of the album. It's a lovely and enchanting piece of bliss that even comes out catchy in the send. The same goes for \"The Sweetest Thing,\" which transitions nicely from `Navy.'From track three on, the album starts drifting into a melodic glaze of emotions and sentimentality, floating on mid-tempo, unmemorable, but still good, elite pop tracks. It's not that they're bad; it's just that by themselves, the songs don't hold up, but they sound great while going through the album. Either this will win admiration, for the skip button, depending on your tastes as it makes up the vast majority of the album. In fact, it could be said that the first two tracks were a bone thrown to fans of their earlier work. Highlights Include:French NavyThe Sweetest ThingHoney in the SunOverall, one of the finer indie releases of the year, but the turn that the album takes for most of its journey will throw off most. Call it melodic, call it enchanting, engaging, poppy, for call it bliss, just call it Camera Obscura and call it good.","overall":4,"summary":"My Tearfully Sentimental Career","unixReviewTime":1240272000,"reviewTime":"04 21, 2009"}
{"orig_index":57532,"reviewerID":"A2KW2KWKABNYNO","asin":"B001T46U32","reviewerName":"Flap Jackson \"Sky Is Burning, But At Least We...","helpful":[2,2],"reviewText":"Camera Obscura's \"My Maudlin Career\" is as enchanting and elite as its predecessors are . From track three on, the album starts drifting into a melodic glaze of emotions and sentimentality . Overall, one of the finer indie releases of the year .","overall":4,"summary":"My Tearfully Sentimental Career","unixReviewTime":1240272000,"reviewTime":"04 21, 2009"}
{"orig_index":57532,"reviewerID":"A2KW2KWKABNYNO","asin":"B001T46U32","reviewerName":"Flap Jackson \"Sky Is Burning, But At Least We...","helpful":[2,2],"reviewText":"Call it melodic, call it enchanting, engaging, poppy, for call it bliss, just call it Camera Obscura and call it good. 'From track three on, the album starts drifting into a melodic glaze of emotions and sentimentality, floating on mid-tempo, unmemorable, but still good, elite pop tracks. It's not that they're bad; it's just that by themselves, the songs don't hold up, but they sound great while going through the album. The album starts with the sound that I've come to love from the band in \"French Navy,\" which coincidentally is the highlight and first single of the album. Highlights Include:French NavyThe Sweetest ThingHoney in the SunOverall, one of the finer indie releases of the year, but the turn that the album takes for most of its journey will throw off most. Either this will win admiration, for the skip button, depending on your tastes as it makes up the vast majority of the album. When I first discovered with Camera Obscura with \"If Looks Could Kill,\" I was like most that had heard the album; enchanted.","overall":4,"summary":"My Tearfully Sentimental Career","unixReviewTime":1240272000,"reviewTime":"04 21, 2009"}
{"orig_index":60854,"reviewerID":"A1C7Y31S5QXNTR","asin":"B004YMRRM4","reviewerName":"majormusiclover","helpful":[0,0],"reviewText":"Here's 'O Holy Night' ~ the classic religious Christmas caroldone up in 'rock' fashion by Go Radio. While my grandson might like this version ~ it's not for me. One aspect I found annoying is some of the words karen't pronounced correctly. Of course that's intentional ~ intended to enhance the flavor of the song ~but it had the opposite effect for me.","overall":2,"summary":"O Holy Night ?","unixReviewTime":1359936000,"reviewTime":"02 4, 2013"}
{"orig_index":60854,"reviewerID":"A1C7Y31S5QXNTR","asin":"B004YMRRM4","reviewerName":"majormusiclover","helpful":[0,0],"reviewText":"one aspect of the song I found annoying is some of the words karen's not pronounced correctly.","overall":2,"summary":"O Holy Night ?","unixReviewTime":1359936000,"reviewTime":"02 4, 2013"}
{"orig_index":60854,"reviewerID":"A1C7Y31S5QXNTR","asin":"B004YMRRM4","reviewerName":"majormusiclover","helpful":[0,0],"reviewText":"Here's 'O Holy Night' ~ the classic religious Christmas caroldone up in 'rock' fashion by Go Radio. Of course that's intentional ~ intended to enhance the flavor of the song ~but it had the opposite effect for me. While my grandson might like this version ~ it's not for me. One aspect I found annoying is some of the words karen't pronounced correctly.","overall":2,"summary":"O Holy Night ?","unixReviewTime":1359936000,"reviewTime":"02 4, 2013"}
{"orig_index":60854,"reviewerID":"A1C7Y31S5QXNTR","asin":"B004YMRRM4","reviewerName":"majormusiclover","helpful":[0,0],"reviewText":"'O Holy Night' is the classic religious Christmas caroldone up in 'rock' fashion by Go Radio . While my grandson might like this version, it's not for me . One aspect I found annoying is","overall":2,"summary":"O Holy Night ?","unixReviewTime":1359936000,"reviewTime":"02 4, 2013"}
{"orig_index":62305,"reviewerID":"A14GK0E64J0WAS","asin":"B0083EM24C","reviewerName":"Paul Allaer","helpful":[1,3],"reviewText":"What does a band do for a follow-up to an immensely popular and acclaimed (both critical and commercially, albeit on the indie scene) album? Passion Pit's two thousand and nine \"Manners\" album seemingly came out of nowhere and was just about perfect (it was my No. two album of the year). After tireless touring and some time off, now comes the one-man band of Passiont Pit (a\/k\/a Michael Angelakos) with its second full-length studio album.\"Gossamer\" (twelve tracks; forty-eight min.) starts off with a triple of no-miss tracks, first comes \"Take A Walk\", an irresitable dance-along\/sing-along. \"I'll Be Alright\" is another sunny upbeat song, and \"Carried Away\" finishes the trilogy in similar style. Just beautiful. At this point, the message is clear: if the formula worked before, why change it? And indeed, why. After the pensive\/slower \"Constant Conversation\", we are back to what we love about Passion Pit, great uptempo tracks like \"Mirrored Sea\", and later in the album \"Hideaway\". Somewhat apart from everything else, track seven \"On My Way\" reminds me like a Beach Boy track, with the beautiful melody and vocals (even if multiple times dubbed) harmonies. Towards the send of the album, \"It's Not My Fault, I'm Happy\" is another hard charging track. The five min. closer \"Where We Belong\" is a reflective tune, and not really necessary for me. In all, this is a very enjoyable follow-up to \"Manners\", almost a Manners two in a way, and hence lacking the element of surprise but I'm not gonna argue with it. Passion Pit avoided the dreaded sophomore slump, and that's an understatement. I've seen these guys in concert before and they were supposed to play at the Bunbury music festival there in Cincinnati earlier this month but, alas, an \"illness in the band\" cancelled their appearance (and the rest of the tour). Can't wait to see them again at some point. Meanwhile, \"Gossamer\" is HIGHLY RECOMMENDED!*UPDATE* (November, 'twelve) I finally saw Passion Pit again on their tour in support of the \"Gossamer\" album recently in Cincinnati, and what a show it was! Bringing a mix of the \"Manners\" classics and new itunes, most of them using-alongs for the audience, just a fantastic evening!","overall":4,"summary":"Solid and enjoyable follow-up to \"Manners\"","unixReviewTime":1343088000,"reviewTime":"07 24, 2012"}
{"orig_index":62305,"reviewerID":"A14GK0E64J0WAS","asin":"B0083EM24C","reviewerName":"Paul Allaer","helpful":[1,3],"reviewText":"\"Gossamer\" is the one-man band of Passiont Pit. the band avoided the dreaded sophomore slump. it's a very enjoyable follow-up to \"Manners\"","overall":4,"summary":"Solid and enjoyable follow-up to \"Manners\"","unixReviewTime":1343088000,"reviewTime":"07 24, 2012"}
{"orig_index":62305,"reviewerID":"A14GK0E64J0WAS","asin":"B0083EM24C","reviewerName":"Paul Allaer","helpful":[1,3],"reviewText":"After the pensive\/slower \"Constant Conversation\", we are back to what we love about Passion Pit, great uptempo tracks like \"Mirrored Sea\", and later in the album \"Hideaway\". In all, this is a very enjoyable follow-up to \"Manners\", almost a Manners two in a way, and hence lacking the element of surprise but I'm not gonna argue with it. Somewhat apart from everything else, track seven \"On My Way\" reminds me like a Beach Boy track, with the beautiful melody and vocals (even if multiple times dubbed) harmonies. I've seen these guys in concert before and they were supposed to play at the Bunbury music festival there in Cincinnati earlier this month but, alas, an \"illness in the band\" cancelled their appearance (and the rest of the tour). Towards the send of the album, \"It's Not My Fault, I'm Happy\" is another hard charging track. *UPDATE* (November, 'twelve) I finally saw Passion Pit again on their tour in support of the \"Gossamer\" album recently in Cincinnati, and what a show it was! \"I'll Be Alright\" is another sunny upbeat song, and \"Carried Away\" finishes the trilogy in similar style.","overall":4,"summary":"Solid and enjoyable follow-up to \"Manners\"","unixReviewTime":1343088000,"reviewTime":"07 24, 2012"}
{"orig_index":62356,"reviewerID":"A33Z1AKRECWVTX","asin":"B0088XX3VY","reviewerName":"TH","helpful":[0,0],"reviewText":"A good song that is well sung with a nice space + the instruments do not drown out the singer. Thought about getting the ten song album Suicide Pact; although non of the other sample songs sound as nice as Heartbeat does. According to Wikipedia the lead singer of Heartbeat , Suicide Pact & other songs is Elizabeth \"Z\" Berg.","overall":4,"summary":"Nice Song With a Nice Pace","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":62356,"reviewerID":"A33Z1AKRECWVTX","asin":"B0088XX3VY","reviewerName":"TH","helpful":[0,0],"reviewText":"the lead singer of Heartbeat, Suicide Pact & other songs is Elizabeth \"Z\" Berg. heartbeat is well sung with a nice space.","overall":4,"summary":"Nice Song With a Nice Pace","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":62356,"reviewerID":"A33Z1AKRECWVTX","asin":"B0088XX3VY","reviewerName":"TH","helpful":[0,0],"reviewText":"Thought about getting the ten song album Suicide Pact; although non of the other sample songs sound as nice as Heartbeat does. A good song that is well sung with a nice space + the instruments do not drown out the singer. According to Wikipedia the lead singer of Heartbeat , Suicide Pact & other songs is Elizabeth \"Z\" Berg.","overall":4,"summary":"Nice Song With a Nice Pace","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":62356,"reviewerID":"A33Z1AKRECWVTX","asin":"B0088XX3VY","reviewerName":"TH","helpful":[0,0],"reviewText":"A good song that is well sung with a nice space + the instruments do not drown out the singer . Thought about getting the ten song album Suicide Pact; although non of the other sample songs sound as nice","overall":4,"summary":"Nice Song With a Nice Pace","unixReviewTime":1362441600,"reviewTime":"03 5, 2013"}
{"orig_index":64160,"reviewerID":"A3KEFQBHCUP788","asin":"B00EH49DXA","reviewerName":"linda  ciampa","helpful":[0,0],"reviewText":"great song","overall":5,"summary":"Five Stars","unixReviewTime":1404432000,"reviewTime":"07 4, 2014"}
{"orig_index":64160,"reviewerID":"A3KEFQBHCUP788","asin":"B00EH49DXA","reviewerName":"linda  ciampa","helpful":[0,0],"reviewText":"a wonderful song","overall":5,"summary":"Five Stars","unixReviewTime":1404432000,"reviewTime":"07 4, 2014"}
{"orig_index":64160,"reviewerID":"A3KEFQBHCUP788","asin":"B00EH49DXA","reviewerName":"linda  ciampa","helpful":[0,0],"reviewText":"a good song","overall":5,"summary":"Five Stars","unixReviewTime":1404432000,"reviewTime":"07 4, 2014"}