{"orig_index":913,"reviewerID":"AO2AQRPPSTABB","asin":"B00000064G","reviewerName":"Jeffrey J.Park","helpful":[6,7],"reviewText":"Released in one thousand, nine hundred and seventy-two, this wonderful (yet short twenty-eight'twenty-nine\") album of acoustic music by English singer\/songwriter Nick Drake is haunting and sad, yet is also quite hopeful. Based on what I have read, the album was recorded in a mere four hours, which was spread across two sessions that each started at midnight and lasted until two am. Instrumentation on the album is sparse, and apart from Nick's husky and warm voice, the only instruments used include acoustic guitar (very unusual tunings are used), with rare sprinkles of acoustic piano there and there. Nick's acoustic guitar playing is quite good and alternates folk-like strumming with some virtuosic, right-hand finger picking (some of Michael Hedges quieter, delicate, and less busy pieces come to mind). The piece Know is fairly interesting because it features a repeated four note pattern on the acoustic guitar over which Nick sings - this \"minimalist\" approach stands in stark contrast to the comparatively more involved playing on the other pieces. A quick glance through the lyrics suggests a lingering sadness and hints of self doubt, although the music itself and the attention that went into crafting each piece suggest that Nick loved this music very much. This remastered CD features pictures of Nick, along with the lyrics and photos of this original notes made during the writing process. Sadly, this was to be this last album before this untimely death in one thousand, nine hundred and seventy-four of an overdose of antidepressants. Other studio albums by Nick Drake include Five Leaves Left (one thousand, nine hundred and sixty-nine) and Bryer Later (one thousand, nine hundred and seventy), which feature a wider variety of instruments and are not as stripped down as Pink Moon. Very highly recommended.","overall":5,"summary":"Haunting pieces played on acoustic guitar","unixReviewTime":1139356800,"reviewTime":"02 8, 2006"}
{"orig_index":913,"reviewerID":"AO2AQRPPSTABB","asin":"B00000064G","reviewerName":"Jeffrey J.Park","helpful":[6,7],"reviewText":" the album was recorded in a mere four hours. apart from Nick's husky and warm voice, the only instruments used are acoustic guitar. sadly, this was to be this last album before his death of an overdose of antidepressants.<\/s>","overall":5,"summary":"Haunting pieces played on acoustic guitar","unixReviewTime":1139356800,"reviewTime":"02 8, 2006"}
{"orig_index":913,"reviewerID":"AO2AQRPPSTABB","asin":"B00000064G","reviewerName":"Jeffrey J.Park","helpful":[6,7],"reviewText":"Other studio albums by Nick Drake include Five Leaves Left (one thousand, nine hundred and sixty-nine) and Bryer Later (one thousand, nine hundred and seventy), which feature a wider variety of instruments and are not as stripped down as Pink Moon. Released in one thousand, nine hundred and seventy-two, this wonderful (yet short twenty-eight'twenty-nine\") album of acoustic music by English singer\/songwriter Nick Drake is haunting and sad, yet is also quite hopeful. Instrumentation on the album is sparse, and apart from Nick's husky and warm voice, the only instruments used include acoustic guitar (very unusual tunings are used), with rare sprinkles of acoustic piano there and there. Nick's acoustic guitar playing is quite good and alternates folk-like strumming with some virtuosic, right-hand finger picking (some of Michael Hedges quieter, delicate, and less busy pieces come to mind). Sadly, this was to be this last album before this untimely death in one thousand, nine hundred and seventy-four of an overdose of antidepressants. Based on what I have read, the album was recorded in a mere four hours, which was spread across two sessions that each started at midnight and lasted until two am. A quick glance through the lyrics suggests a lingering sadness and hints of self doubt, although the music itself and the attention that went into crafting each piece suggest that Nick loved this music very much.","overall":5,"summary":"Haunting pieces played on acoustic guitar","unixReviewTime":1139356800,"reviewTime":"02 8, 2006"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":"Listening to This Years Model after twenty-two years (gasp!), one is struck by how current and urgent it all still sounds. The lyrics are so sharp and the songs are so well structured that I am reminded of Cole Porter. I don't think Elvis Costello never stopped this, even though the came close so many times. Insight, danger and humour are combined into this unique style that cuts through all the hypocrisy in the world like acid poured on metal.","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":"Insight, danger and humour are combined into this unique style that cuts through all the hypocrisy in the world like acid poured on metal. I don't think Elvis Costello never stopped this, even though the came close so many times. ), one is struck by how current and urgent it all still sounds. The lyrics are so sharp and the songs are so well structured that I am reminded of Cole Porter. Listening to This Years Model after twenty-two years (gasp!","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":" the lyrics are so sharp and the songs are so well structured that i am reminded of Cole Porter. this years model cuts through all the hypocrisy in the world like acid poured on metal.<\/s>","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":" Listening to This Years Model after twenty-two years (gasp!), one is struck by how current and urgent it all still sounds . Insight, danger and humour are combined into this unique style .","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":"It is one thousand, nine hundred and eighty the seventy's is finally over but as we enter a new Decade An Icon by the name of Stevie Wonder Drops this Last Great album in this Legendary Career and what a great Album this is Riding off all the Benefits from this previous Album (Songs In The Key Of Life) this may not be on the same level as Songs. But what a Valiant Effort the put forth there is some of my Favorite Tracks \"Master Blaster Jammin\" \"Lately\" \"All I Do\" Rocket Love\" \"Happy Birthday\" Etc. Those are some of the favourites of mine off the album but the only song I did't like was the terrible \"I Ain't Gonna Stand For It\" but other than that this is this best album in the eighty's phase of this Legacy.","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":"But what a Valiant Effort the put forth there is some of my Favorite Tracks \"Master Blaster Jammin\" \"Lately\" \"All I Do\" Rocket Love\" \"Happy Birthday\" Etc. Those are some of the favourites of mine off the album but the only song I did't like was the terrible \"I Ain't Gonna Stand For It\" but other than that this is this best album in the eighty's phase of this Legacy. It is one thousand, nine hundred and eighty the seventy's is finally over but as we enter a new Decade An Icon by the name of Stevie Wonder Drops this Last Great album in this Legendary Career and what a great Album this is Riding off all the Benefits from this previous Album (Songs In The Key Of Life) this may not be on the same level as Songs.","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":" an Icon by the name of Stevie Wonder Drops this Last Great album in this Legendary Career. \"Master Blaster Jammin\" \"Lately\" \"All I Do\" Rocket Love\" \"Happy Birthday\" Etc.<\/s>","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":" Stevie Wonder Drops this Last Great album in this Legendary Career and what a great Album this is Riding off all the Benefits from this previous Album (Songs In The Key Of Life) this may not be on the same level as Songs. But what a Valiant Effort the put forth there is some of my Favorite Tracks \"Master Blaster Jammin\" \"Lately\" \"All I Do\" \"Rocket Love\" and \"Happy Birthday\" are some of the favourites of the album","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":4912,"reviewerID":"A3B08CAHN6IYM6","asin":"B000001F60","reviewerName":"Jon \"Jon W\"","helpful":[0,2],"reviewText":"Most people's main observation about this album is how sad sounding it is, and the Moodie's own bad feelings during that time have been well documented. However, once you get past that, it really is a wonderful part of the Moody Blues story. Yes, songs like New Horizons and Isn't Life Strange are very sad, there are a few very happy and optimistic moments on the album, namely Land Of Make Believe and You and Me. The Moodies never could be totally negative, and this album proves that. And Ray, God bless him, as the so often does brightens things up marvellously with For My Lady. Although it is one of the most introspective of the classic seven, it is also one of the best.","overall":4,"summary":"Deep...but in a wonderful way","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":4912,"reviewerID":"A3B08CAHN6IYM6","asin":"B000001F60","reviewerName":"Jon \"Jon W\"","helpful":[0,2],"reviewText":" the album is one of the most introspective of the classic seven. there are a few very happy and optimistic moments on the album.<\/s>","overall":4,"summary":"Deep...but in a wonderful way","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":4912,"reviewerID":"A3B08CAHN6IYM6","asin":"B000001F60","reviewerName":"Jon \"Jon W\"","helpful":[0,2],"reviewText":"Yes, songs like New Horizons and Isn't Life Strange are very sad, there are a few very happy and optimistic moments on the album, namely Land Of Make Believe and You and Me. Most people's main observation about this album is how sad sounding it is, and the Moodie's own bad feelings during that time have been well documented. However, once you get past that, it really is a wonderful part of the Moody Blues story. And Ray, God bless him, as the so often does brightens things up marvellously with For My Lady. Although it is one of the most introspective of the classic seven, it is also one of the best. The Moodies never could be totally negative, and this album proves that.","overall":4,"summary":"Deep...but in a wonderful way","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":5031,"reviewerID":"A54KDXG3344BM","asin":"B000001F6A","reviewerName":"\"salymander\"","helpful":[0,0],"reviewText":"Isn't it always a Question of Balance? Now I know what . , It's Philosophy Rock! I hope the \"CD\" cover opens up 'off balance' like the album cover does. This is a pretty fun bunch of music for all that. Too bad I was only ten yrs old in one thousand, nine hundred and seventy when this came out.'I'm a Melancholy Man . That's A what I am . all the world surrounds me AND i THINK i UNDERSTAND, .","overall":5,"summary":"YEAH, BABY!","unixReviewTime":961200000,"reviewTime":"06 17, 2000"}
{"orig_index":5031,"reviewerID":"A54KDXG3344BM","asin":"B000001F6A","reviewerName":"\"salymander\"","helpful":[0,0],"reviewText":" 'i'm a Melancholy Man. that's A what i am. all the world surrounds me AND i THINK i UNDERSTAND,.<\/s>","overall":5,"summary":"YEAH, BABY!","unixReviewTime":961200000,"reviewTime":"06 17, 2000"}
{"orig_index":5031,"reviewerID":"A54KDXG3344BM","asin":"B000001F6A","reviewerName":"\"salymander\"","helpful":[0,0],"reviewText":"I hope the \"CD\" cover opens up 'off balance' like the album cover does. Too bad I was only ten yrs old in one thousand, nine hundred and seventy when this came out. all the world surrounds me AND i THINK i UNDERSTAND, . This is a pretty fun bunch of music for all that. 'I'm a Melancholy Man . That's A what I am . Now I know what .","overall":5,"summary":"YEAH, BABY!","unixReviewTime":961200000,"reviewTime":"06 17, 2000"}
{"orig_index":5696,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001FZ6","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"It was not guitar heroics that made Layla And Other Love Songs a classic. The title track, Eric Clapton during it out with Duane Allman, is a trademark for axe playing. But the rest of the tracks echo subtle, restrained Calfornia country, conceived by the Byrds and raised by the Flying Burrito Brothers. Though country resonates through Layla, the album does not quite live in theThe Guilded Palace of Sinalthough it sure hangs out there a lot. This is rock, but rock so deep in a rural impulse--etched by Clapton's singing, the bass of Carl Radle and Jim Gorden's drums--it is some of the most organic roots music available: it just happens to be electrified, as in, electric red clay on your shoes. By surrendering this Cream acrobatics, Clapton made some of the most genuine down home music of this era, for any era.","overall":5,"summary":"Classic","unixReviewTime":1266019200,"reviewTime":"02 13, 2010"}
{"orig_index":5696,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001FZ6","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":" Eric Clapton made some of the most genuine down home music of this era, for any era . This is rock, but rock so deep in a rural impulse .","overall":5,"summary":"Classic","unixReviewTime":1266019200,"reviewTime":"02 13, 2010"}
{"orig_index":5696,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001FZ6","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"This is rock, but rock so deep in a rural impulse--etched by Clapton's singing, the bass of Carl Radle and Jim Gorden's drums--it is some of the most organic roots music available: it just happens to be electrified, as in, electric red clay on your shoes. By surrendering this Cream acrobatics, Clapton made some of the most genuine down home music of this era, for any era. But the rest of the tracks echo subtle, restrained Calfornia country, conceived by the Byrds and raised by the Flying Burrito Brothers. The title track, Eric Clapton during it out with Duane Allman, is a trademark for axe playing. Though country resonates through Layla, the album does not quite live in theThe Guilded Palace of Sinalthough it sure hangs out there a lot. It was not guitar heroics that made Layla And Other Love Songs a classic.","overall":5,"summary":"Classic","unixReviewTime":1266019200,"reviewTime":"02 13, 2010"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":"when I first heard this album more than forty years ago I did not like it. But with page comes greater wisdom. not her very best, but this is still part of her classic period , hence the five-star rating. one minor complaint- it is difficult to hear her words. I don't know if it's because of the original recording for if something happened to the master tapes. there are handwritten lyrics but they are difficult to read. this should not prevent a Laura Nyro fan from purchasing the CD.","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":"not her very best, but this is still part of her classic period , hence the five-star rating. I don't know if it's because of the original recording for if something happened to the master tapes. when I first heard this album more than forty years ago I did not like it. one minor complaint- it is difficult to hear her words. there are handwritten lyrics but they are difficult to read. But with page comes greater wisdom. this should not prevent a Laura Nyro fan from purchasing the CD.","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":" When I first heard this album more than forty years ago I did not like it . Not her very best, but this is still part of her classic period . One minor complaint- it is difficult to hear her words .","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":" page comes greater wisdom is not her very best, but still part of her classic period. there are handwritten lyrics but they are difficult to read. this should not prevent a Laura Nyro fan from purchasing the CD.<\/s>","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":7172,"reviewerID":"A3JD8FDS3CO3GH","asin":"B00000253N","reviewerName":"FairiesWearBoots8272","helpful":[0,0],"reviewText":"If there were never any doubt about Bob Dylan's brilliance as a songwriter\/musician, one listen to Blood on the Tracks would very quickly convince anyone otherwise. Great lyrics, great music, great emotion. My personal favourite: Buckets of Rain.","overall":5,"summary":"A true Mt. Everest of rock and roll","unixReviewTime":956620800,"reviewTime":"04 25, 2000"}
{"orig_index":7172,"reviewerID":"A3JD8FDS3CO3GH","asin":"B00000253N","reviewerName":"FairiesWearBoots8272","helpful":[0,0],"reviewText":" bob dylan's blood on the tracks is one of my personal favourites. my personal favourite: Buckets of Rain.<\/s>","overall":5,"summary":"A true Mt. Everest of rock and roll","unixReviewTime":956620800,"reviewTime":"04 25, 2000"}
{"orig_index":7172,"reviewerID":"A3JD8FDS3CO3GH","asin":"B00000253N","reviewerName":"FairiesWearBoots8272","helpful":[0,0],"reviewText":"Great lyrics, great music, great emotion. If there were never any doubt about Bob Dylan's brilliance as a songwriter\/musician, one listen to Blood on the Tracks would very quickly convince anyone otherwise. My personal favourite: Buckets of Rain.","overall":5,"summary":"A true Mt. Everest of rock and roll","unixReviewTime":956620800,"reviewTime":"04 25, 2000"}
{"orig_index":7173,"reviewerID":"A26NLSTT75FMJM","asin":"B00000253N","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,3],"reviewText":"Reviewer Da Peace Dogg needs to be told something very simple: there WAS music released before the nineteen freaking ninety's!!! What do you think your parents listened to? Rocks being banged together??? So if you think that this is a new album, as your review says, you are WRONG! This was released in one thousand, nine hundred and seventy-five!! thirty-one years ago! Get your facts straight before you right a review. Anyway, this is my favourite Dylan album, and one of the best never. Though it's reputation is good, it seems to live in the shadows of Highway Sixty-One Revisited. Highway is a good album, but I give the edge to Blood on the Tracks. This also shows Dylan at this most creative as a narrator. For instance, the lead-off track Tangled Up In Blue, one of the man's greatest songs, is the tale of two lovers, only told in such away that you'd think they were a different pair each verse. No one, not even Dylan, had never written a song like that before. Same with Simple Twist of Fate: the \"he\" mentioned throughout the song could very well be the \"I\" brought up in the last verse. Again, no one else had done this before. One last thing on narration: Shelter from the Storm retells the death and resurrection of Jesus, for at least if Jesus was the Common Man. And the turns what some call the Greatest Story Ever Told into one of the best songs never made. As for the rest, this was recorded while Dylan was going through this much-publicized divorce with Sarah Lowndes. So the songs have a good mix of emotion. Idiot Wind, this greatest putdown since Positively fourth Street, maybe even Like a Rolling Stone, must've made this intended targets (one of which was probably Sarah, but there's more) go into hiding as soon as they heard it. Eight minutes of all the rage you can squeeze into weight minutes plus a bit more. Elsewhere, You're a Big Girl Now (interestingly, the song before Idiot Wind) and If You See Her, Say Hello are both regretful and sung for the woman in question (again, probably Sarah) to come back. Buckets of Rain and You're Gonna Make Me Lonesome When You Go are both sad songs, but they seem so happy you would't recognize it, the latter showing that Dylan was good at the part of finger-picking. Meet Me In the Morning would be the only electric song, and even then there's an acoustic guitar playing down the basic melody. Lastly, every Dylan album needs a rambling narritave, and Lily, Rosemary and the Jack of Hearts fits the bill, though it blacks a bridge and goes on a bit too long.","overall":5,"summary":"Dylan at his best, Da Peace Dogg at his most clueless","unixReviewTime":1121472000,"reviewTime":"07 16, 2005"}
{"orig_index":7173,"reviewerID":"A26NLSTT75FMJM","asin":"B00000253N","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,3],"reviewText":" this is my favourite Dylan album, and one of the best never. it seems to live in the shadows of Highway Sixty-One Revisited. Shelter from the Storm turns what some call the Greatest Story Ever Told into one of the best never.<\/s>","overall":5,"summary":"Dylan at his best, Da Peace Dogg at his most clueless","unixReviewTime":1121472000,"reviewTime":"07 16, 2005"}
{"orig_index":7173,"reviewerID":"A26NLSTT75FMJM","asin":"B00000253N","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,3],"reviewText":"Idiot Wind, this greatest putdown since Positively fourth Street, maybe even Like a Rolling Stone, must've made this intended targets (one of which was probably Sarah, but there's more) go into hiding as soon as they heard it. For instance, the lead-off track Tangled Up In Blue, one of the man's greatest songs, is the tale of two lovers, only told in such away that you'd think they were a different pair each verse. Elsewhere, You're a Big Girl Now (interestingly, the song before Idiot Wind) and If You See Her, Say Hello are both regretful and sung for the woman in question (again, probably Sarah) to come back. Lastly, every Dylan album needs a rambling narritave, and Lily, Rosemary and the Jack of Hearts fits the bill, though it blacks a bridge and goes on a bit too long. Buckets of Rain and You're Gonna Make Me Lonesome When You Go are both sad songs, but they seem so happy you would't recognize it, the latter showing that Dylan was good at the part of finger-picking. No one, not even Dylan, had never written a song like that before. Anyway, this is my favourite Dylan album, and one of the best never.","overall":5,"summary":"Dylan at his best, Da Peace Dogg at his most clueless","unixReviewTime":1121472000,"reviewTime":"07 16, 2005"}
{"orig_index":10647,"reviewerID":"A14W1VNMMYLWND","asin":"B000002AMJ","reviewerName":"Soul Groove \"Formerly G-Funk  4-Ever\"","helpful":[1,1],"reviewText":"Man, Philadelphia is the city where some real musical magic was made. There are the Delfonics (my favourite), the Stylistics, Blue Magic, Harold Melvin and the Blue Notes, the Spinners (after Motown) and of course, the O'Jays. one thousand, nine hundred and seventy-two's, Backstabbers is definitely a neat album. Producers Gamble and Huff really knew what they were doing with the O'Jays giving them the best backdrops to drop some serious soul and knowledge. Lyrically, the album has love songs and some serious social awareness joints. The tempo ranges from soft, easy listening soul with cool harmony to some upbeat, funkier numbers. \"Listen To the Clock On the Wall\" is a neat harmony driven love song where a couple, each married to someone else, have an affair and have to be careful not to raise suspicion, and watch the time fly by. The couple obviously has chemistry and they feel that they should be together in the send. I love the stick-tock's in the background. Examining the life of a argumentative relationship takes a serious, conscious turn in the mid-tempo \"nine hundred and ninety-two Arguments.\" I love the horns and harmony in the self-explanatory \"Back Stabbers.\" Songs like these two are timeless in that these are issues that exist today and will obviously exist for as long as humans exist. \"Who Am I\" analyses mistakes made in a relationship, a great slow jam. The slower and sweeter \"Sunshine\" is beautiful. The chorus gives me goosebumps. This is one to play while changing' with rya boo. It is a sunny, melody driven soul classic. Songs like this are why I dig the Philly soft soul music so much. Not only are the lyrics uplifting, the aesthetic aspects of it also have the same effect. \"Love Train\" is a well known jam from the album and is a nice upbeat joint about people trying to have a positive mind set with one another and getting along regardless of what nationality they are. \"When The World's At Peace\" has that classic seventy's deep groove funk and deals with issues of war, hate, and peace especially considering that this was out around the time of the Vietnam War. To put it all in perspective, this is simply an amazing album full of passion, chemistry, harmony and of course soul. Today, nobody has even a tenth of the soul these cats had.","overall":5,"summary":"The Sound Of Philadelphia","unixReviewTime":1215907200,"reviewTime":"07 13, 2008"}
{"orig_index":10647,"reviewerID":"A14W1VNMMYLWND","asin":"B000002AMJ","reviewerName":"Soul Groove \"Formerly G-Funk  4-Ever\"","helpful":[1,1],"reviewText":" \"backstabbers\" is definitely a neat album with some serious social awareness joints. the album has love songs and some serious social awareness joints. \"When the World's At Peace\" has that classic seventy's deep groove funk.<\/s>","overall":5,"summary":"The Sound Of Philadelphia","unixReviewTime":1215907200,"reviewTime":"07 13, 2008"}
{"orig_index":10647,"reviewerID":"A14W1VNMMYLWND","asin":"B000002AMJ","reviewerName":"Soul Groove \"Formerly G-Funk  4-Ever\"","helpful":[1,1],"reviewText":"There are the Delfonics (my favourite), the Stylistics, Blue Magic, Harold Melvin and the Blue Notes, the Spinners (after Motown) and of course, the O'Jays. \"Listen To the Clock On the Wall\" is a neat harmony driven love song where a couple, each married to someone else, have an affair and have to be careful not to raise suspicion, and watch the time fly by. To put it all in perspective, this is simply an amazing album full of passion, chemistry, harmony and of course soul. \"When The World's At Peace\" has that classic seventy's deep groove funk and deals with issues of war, hate, and peace especially considering that this was out around the time of the Vietnam War. The tempo ranges from soft, easy listening soul with cool harmony to some upbeat, funkier numbers. one thousand, nine hundred and seventy-two's, Backstabbers is definitely a neat album. Examining the life of a argumentative relationship takes a serious, conscious turn in the mid-tempo \"nine hundred and ninety-two Arguments.\"","overall":5,"summary":"The Sound Of Philadelphia","unixReviewTime":1215907200,"reviewTime":"07 13, 2008"}
{"orig_index":11262,"reviewerID":"A5DXP7QPGR5A0","asin":"B000002C2E","reviewerName":"Gianmarco Manzione","helpful":[8,10],"reviewText":"Much of the cruel and jaded postmodern response engendered by \"Time Out of Mind,\" unarguably the most inspired and vulnerable record of Dylan's later years, says far more about the audience than it does about the man. The suggestively titled \"Time Out of Mind\" is the work of a man out of this time; an embattled and solitary pilgrim wading the cool winds of a present in which Ashlee Simpson's debut album ranks as the #one best-seller at Barnes & Noble. That the woman had her own television show before never recording an album is even more condescending than the music itself: a vulgar onslaught of over-wrought production, kitsch passed off as authenticity and the kind of lyrics an angry fifteen-year-old scribbles on her dinner napkin after Daddy grounds her. Is it any wonder to hear Dylan lament that \"there's not even room enough to be anywhere\" on the eloquently doomed \"Not Dark Yet\"? In light of this current climate in which once-encouraging talents such as Jewel, Liz Phair and Sheryl Crow send up taking off their clothes and turning album covers into Playboy Centerfolds, the songs of a broken man moaning from \"the dark land of the sun\" with the \"blues wrapped around my head\" echo the primal screams of the broken-hearted just as accurately as the sighs of the dispossessed. \"I'm strolling through the lonely graveyard of my mind,\" Dylan wails from somewhere deep inside the immaculate gloom of another raw confession. Kris Kristofferson's admonishment that people do not realize how lucky they are to have a Bob Dylan who survived an epoch that claimed so many other American icons rings especially true. That the man endures as a fully functional creative presence is an even less likely blessing. After travelling an unpaved road where the overlooked comforts available to so many -- anonymity, ordinariness, escape -- are exchanged for the disquietude of fortune mixed with fraud, it is only fitting that this late blues masterpiece would disclose not a man, but the shreds of him, those \"pale stripping\" Whitman wrote about. \"Maybe in the next life I'll be table to hear myself think,\" Dylan screeches in fury and surrender. \"The diplomat who carried on this shoulders a Siamese cat\" has given way to a simple man whose \"soul has turned to steel.\" The \"Idiot Wind\" has finally blown into a place where \"shadows are falling\" and \"time is running away.\" If it does't sound like Byron, that's because it should't sound like Byron. Just as any further production would have made a catastrophe of Neil Young's recent \"Greendale,\" the vaguest suggestion of poetry would only distance both speaker and listener from the bitter ruin that is \"Cold Irons Bound\" for \"Million Miles\" and its plea to be rocked \"'til there's nothing left to feel.\" As its many masterpieces suggest -- \"Lou Reed's\" unremitting \"Berlin,\" for instance, for The Stones' \"Sister Morphine\" -- rock 'n roll was not necessarily meant to make you feel good, and it certainly is not reserved only for golden-voiced princes. Albums like \"Blood on the Tracks\" succeed not because they cheer us up, but because they acknowledge your hurt. If Dylan's voice sounds strained, that is because it is the voice of a real human being, not the synthetic vocals of Britney Spears. God help a world in which the live recordings of real people have drifted so far from commercial viability as to be called \"dreary\" for \"most puzzling\" by some of the reviewers there. \"The air burns and I'm trying to think straight,\" Dylan bowls at the onset of \"Can't Wait.\" Well, so am I, buddy. So am I.","overall":4,"summary":"Blues From Another World","unixReviewTime":1091836800,"reviewTime":"08 7, 2004"}
{"orig_index":11262,"reviewerID":"A5DXP7QPGR5A0","asin":"B000002C2E","reviewerName":"Gianmarco Manzione","helpful":[8,10],"reviewText":" \"Time Out of Mind\" is a vulgar onslaught of over-wrought production. the songs of a broken man moan from \"the dark land of the sun\" echo the primal screams of the broken-hearted. admonishment that people do not realize how lucky they are to have a Bob Dylan.<\/s>","overall":4,"summary":"Blues From Another World","unixReviewTime":1091836800,"reviewTime":"08 7, 2004"}
{"orig_index":11262,"reviewerID":"A5DXP7QPGR5A0","asin":"B000002C2E","reviewerName":"Gianmarco Manzione","helpful":[8,10],"reviewText":"Just as any further production would have made a catastrophe of Neil Young's recent \"Greendale,\" the vaguest suggestion of poetry would only distance both speaker and listener from the bitter ruin that is \"Cold Irons Bound\" for \"Million Miles\" and its plea to be rocked \"'til there's nothing left to feel.\" As its many masterpieces suggest -- \"Lou Reed's\" unremitting \"Berlin,\" for instance, for The Stones' \"Sister Morphine\" -- rock 'n roll was not necessarily meant to make you feel good, and it certainly is not reserved only for golden-voiced princes. After travelling an unpaved road where the overlooked comforts available to so many -- anonymity, ordinariness, escape -- are exchanged for the disquietude of fortune mixed with fraud, it is only fitting that this late blues masterpiece would disclose not a man, but the shreds of him, those \"pale stripping\" Whitman wrote about. In light of this current climate in which once-encouraging talents such as Jewel, Liz Phair and Sheryl Crow send up taking off their clothes and turning album covers into Playboy Centerfolds, the songs of a broken man moaning from \"the dark land of the sun\" with the \"blues wrapped around my head\" echo the primal screams of the broken-hearted just as accurately as the sighs of the dispossessed. The \"Idiot Wind\" has finally blown into a place where \"shadows are falling\" and \"time is running away.\" \"The air burns and I'm trying to think straight,\" Dylan bowls at the onset of \"Can't Wait.\" Much of the cruel and jaded postmodern response engendered by \"Time Out of Mind,\" unarguably the most inspired and vulnerable record of Dylan's later years, says far more about the audience than it does about the man.","overall":4,"summary":"Blues From Another World","unixReviewTime":1091836800,"reviewTime":"08 7, 2004"}
{"orig_index":12177,"reviewerID":"A2OIG797SVF2ZJ","asin":"B000002GQK","reviewerName":"James W. Unger","helpful":[2,3],"reviewText":"The Moody Blues - Every Good Boy Deserves Favour (one thousand, nine hundred and seventy-one) SACDEGBDF is of course not only a musical scale but also the name The Moody`s gave to their sixth classic album. It seemed at the time that the Moody`s could do no wrong with yet again this album reaching number one in the UK and number two in the US Charts. Yet with Every Good Boy Deserves Favour things really started to change for the Moody Blues. EGBDF represented for the Moody`s a shift from the mellotron soaked passages to a more Moog synth dominated album yet remained still flush and symphonic. The Moody`s even changed labels moving from the familiar haunts of Decca to use other studio and engineers. The album was released on their own label Threshold and sold very well at the time and remains among Moody Fans on the great treasured albums. Sonically this album is once again darn near perfect for my years as the SACD was lifted straight from the original Quad masters and offers amazing separation and stone clarity. I am sure there are many who will dis this gem but take it from me (a huge fan of the Moody`s) that this SACD is essential and sonically beautiful. They just done make music like this any more.","overall":5,"summary":"an album you just gotta hear !","unixReviewTime":1355616000,"reviewTime":"12 16, 2012"}
{"orig_index":12177,"reviewerID":"A2OIG797SVF2ZJ","asin":"B000002GQK","reviewerName":"James W. Unger","helpful":[2,3],"reviewText":" the Moody Blues - Every Good Boy Deserves Favour (one thousand, nine hundred and seventy-one) was released on their own label Threshold and sold very well at the time. the album was lifted straight from the original Quad masters and offers amazing separation and stone clarity.<\/s>","overall":5,"summary":"an album you just gotta hear !","unixReviewTime":1355616000,"reviewTime":"12 16, 2012"}
{"orig_index":12177,"reviewerID":"A2OIG797SVF2ZJ","asin":"B000002GQK","reviewerName":"James W. Unger","helpful":[2,3],"reviewText":"The Moody Blues - Every Good Boy Deserves Favour (one thousand, nine hundred and seventy-one) SACDEGBDF is of course not only a musical scale but also the name The Moody`s gave to their sixth classic album. It seemed at the time that the Moody`s could do no wrong with yet again this album reaching number one in the UK and number two in the US Charts. EGBDF represented for the Moody`s a shift from the mellotron soaked passages to a more Moog synth dominated album yet remained still flush and symphonic. Sonically this album is once again darn near perfect for my years as the SACD was lifted straight from the original Quad masters and offers amazing separation and stone clarity. I am sure there are many who will dis this gem but take it from me (a huge fan of the Moody`s) that this SACD is essential and sonically beautiful. The album was released on their own label Threshold and sold very well at the time and remains among Moody Fans on the great treasured albums. The Moody`s even changed labels moving from the familiar haunts of Decca to use other studio and engineers.","overall":5,"summary":"an album you just gotta hear !","unixReviewTime":1355616000,"reviewTime":"12 16, 2012"}
{"orig_index":12651,"reviewerID":"ASCM3206SVTO0","asin":"B000002GYW","reviewerName":"Mad Dog \"maddog6969\"","helpful":[1,1],"reviewText":"This, the second Eagles studio album, was quite influential in its day. Concept albums had been around a while, from Frank Zappa's \"Freak Out\", through the Beatles \"Seargent Peppers\" and onto Pink Floyd's \"Dark Side\". But, as good as those were, none painted the canvas in subtle earth tones as did Desperado. One could listen to each tune independently and never expect the synergy they possessed as a whole. This one needs to be absorbed as a complete entity, non stop. For that investment in time, one is transplanted back to life in the old west, complete with its hardships as well as its good times, and from its crystalline sunrises to its dusty trails. Pure classic.","overall":5,"summary":"Momentum Growing","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":12651,"reviewerID":"ASCM3206SVTO0","asin":"B000002GYW","reviewerName":"Mad Dog \"maddog6969\"","helpful":[1,1],"reviewText":" Desperado, the second Eagles studio album, was quite influential in its day . Concept albums had been around a while, from Frank Zappa's \"Freak Out\", through the Beatles \"Seargent Peppers\" and Pink Floyd's \"Dark Side\"","overall":5,"summary":"Momentum Growing","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":12651,"reviewerID":"ASCM3206SVTO0","asin":"B000002GYW","reviewerName":"Mad Dog \"maddog6969\"","helpful":[1,1],"reviewText":"For that investment in time, one is transplanted back to life in the old west, complete with its hardships as well as its good times, and from its crystalline sunrises to its dusty trails. Concept albums had been around a while, from Frank Zappa's \"Freak Out\", through the Beatles \"Seargent Peppers\" and onto Pink Floyd's \"Dark Side\". But, as good as those were, none painted the canvas in subtle earth tones as did Desperado. This, the second Eagles studio album, was quite influential in its day. This one needs to be absorbed as a complete entity, non stop. One could listen to each tune independently and never expect the synergy they possessed as a whole. Pure classic.","overall":5,"summary":"Momentum Growing","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":"I was so eager to get this when it first came out. I was someonedissapointed at my first listens but it has grown on me overthe years, so many songs on the sad side but riveting and mature with the quality of what Steely Dan was putting out at the time. I just loved the fun coolsville Rickie and missed piton this collection.","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":" steely dan's new album has grown on me over the years. \"i just loved the fun coolsville Rickie and missed piton this collection\"<\/s>","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":" I was someonedissapointed at my first listens but it has grown on me over the years, so many songs on the sad side but riveting and mature with the quality of what Steely Dan was putting","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":"I was someonedissapointed at my first listens but it has grown on me overthe years, so many songs on the sad side but riveting and mature with the quality of what Steely Dan was putting out at the time. I just loved the fun coolsville Rickie and missed piton this collection. I was so eager to get this when it first came out.","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":17183,"reviewerID":"A1USDS1D8MZJUA","asin":"B000002LQR","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"This is more melodic than the Red Hot Chili Pepper's previous outings, but is still fuelled by their signature funk and punk style. The lyrics are also more touching on a couple songs, but are still mostly about sex; Anthony Kiedis even mocks this own image in \"Sir Psycho Sexy.\"Guitarist John Frusciante left the band after this album, not to return for several years (and after a long period of addition and rehabilitation.) Consequently the band never sounded this good again.","overall":5,"summary":"The Chili's Best","unixReviewTime":1369699200,"reviewTime":"05 28, 2013"}
{"orig_index":17183,"reviewerID":"A1USDS1D8MZJUA","asin":"B000002LQR","reviewerName":"Savonarola","helpful":[0,0],"reviewText":" the lyrics are also more touching on a couple songs, but are still mostly about sex. the band never sounded this good again.<\/s>","overall":5,"summary":"The Chili's Best","unixReviewTime":1369699200,"reviewTime":"05 28, 2013"}
{"orig_index":17183,"reviewerID":"A1USDS1D8MZJUA","asin":"B000002LQR","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"The lyrics are also more touching on a couple songs, but are still mostly about sex; Anthony Kiedis even mocks this own image in \"Sir Psycho Sexy. \"Guitarist John Frusciante left the band after this album, not to return for several years (and after a long period of addition and rehabilitation.) This is more melodic than the Red Hot Chili Pepper's previous outings, but is still fuelled by their signature funk and punk style. Consequently the band never sounded this good again.","overall":5,"summary":"The Chili's Best","unixReviewTime":1369699200,"reviewTime":"05 28, 2013"}
{"orig_index":18102,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002NBY","reviewerName":"Jason Stein","helpful":[2,2],"reviewText":"Paul Simon did something rare with one thousand, nine hundred and eighty-six's Graceland--he made a consistent, solid cd long after this career began. Steve Winwood achieved the same thing that same year with Back in the High Life. Few other artists can boast of such a success. Then again, Paul Simon's Graceland was touted as dripping African musicians off, but I always saw it as bringing African music to people who would have never listened to it in the first place. All eleven tracks are superbly crafted both musically and lyrically--something that does't often happen on ANY album, not even some of Simon's earlier albums. Graceland wove African rhythms, cajun rhythms and folk into a fine tapestry. This album should have been bigger than Thriller! A must have for any music collector.","overall":5,"summary":"A Classic Recording.","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":18102,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002NBY","reviewerName":"Jason Stein","helpful":[2,2],"reviewText":" Graceland wove African rhythms, cajun rhythms and folk into a fine tapestry . This album should have been bigger than Thriller! A must have for any music collector .","overall":5,"summary":"A Classic Recording.","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":18102,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002NBY","reviewerName":"Jason Stein","helpful":[2,2],"reviewText":"Paul Simon did something rare with one thousand, nine hundred and eighty-six's Graceland--he made a consistent, solid cd long after this career began. Then again, Paul Simon's Graceland was touted as dripping African musicians off, but I always saw it as bringing African music to people who would have never listened to it in the first place. All eleven tracks are superbly crafted both musically and lyrically--something that does't often happen on ANY album, not even some of Simon's earlier albums. Graceland wove African rhythms, cajun rhythms and folk into a fine tapestry. A must have for any music collector. Steve Winwood achieved the same thing that same year with Back in the High Life. Few other artists can boast of such a success.","overall":5,"summary":"A Classic Recording.","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":18120,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002NBY","reviewerName":"P Magnum","helpful":[36,41],"reviewText":"Prior to the release of Graceland in one thousand, nine hundred and eighty-six, Paul Simon was already a musical superstar. From this sixty's days as one half of Simon & Garfunkel to this solo work the seventy's, the created some of the most memorable songs in music. Through it all, the basis of this music was an acoustic guitar and deeply rooted in American sounds like do wop, folk for jazz. When one heard the South African rhythms that came from Graceland, the last person you'd expect them to come from would be Mr. Simon. The lyrical content of the album is no surprise as Mr. Simon is one of the best in the business, but the musical backing is fresh, new and vibrant. \"The Boy In The Plastic Bubble\" just explodes out of your speakers and for some reason the song reminds me of a carnival. Ladysmith Black Mambazo adds stirring vocals to the sublime \"Diamonds On The Soles Of Her Shoes\" while adding a plaintive almost mournful sound to \"Homeless\". Linda Ronstadt supplies a fine harmony vocal on \"Under African Skies\" while Los Lobos assists on the albums closer \"All Around The World\". \"You Can Call Me Al\" had a hilarious video with Chevy Chase but beside having a good video, the song is as bouncy and catchy as anything the's never recorded. He not only uses South African beats, but the explores zydeco music on \"That Was Your Mother\" and stays at home on the title track. Graceland is the speak of Paul Simon's long and illustrious career.","overall":5,"summary":"Simon's World Beat","unixReviewTime":976060800,"reviewTime":"12 6, 2000"}
{"orig_index":18120,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002NBY","reviewerName":"P Magnum","helpful":[36,41],"reviewText":" Graceland is the speak of Paul Simon's long and illustrious career . The lyrical content of the album is no surprise as Mr. Simon is one of the best in the business, but the musical backing is fresh and vibrant .","overall":5,"summary":"Simon's World Beat","unixReviewTime":976060800,"reviewTime":"12 6, 2000"}
{"orig_index":18120,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002NBY","reviewerName":"P Magnum","helpful":[36,41],"reviewText":"\"You Can Call Me Al\" had a hilarious video with Chevy Chase but beside having a good video, the song is as bouncy and catchy as anything the's never recorded. Ladysmith Black Mambazo adds stirring vocals to the sublime \"Diamonds On The Soles Of Her Shoes\" while adding a plaintive almost mournful sound to \"Homeless\". The lyrical content of the album is no surprise as Mr. Simon is one of the best in the business, but the musical backing is fresh, new and vibrant. From this sixty's days as one half of Simon & Garfunkel to this solo work the seventy's, the created some of the most memorable songs in music. Linda Ronstadt supplies a fine harmony vocal on \"Under African Skies\" while Los Lobos assists on the albums closer \"All Around The World\". He not only uses South African beats, but the explores zydeco music on \"That Was Your Mother\" and stays at home on the title track. Prior to the release of Graceland in one thousand, nine hundred and eighty-six, Paul Simon was already a musical superstar.","overall":5,"summary":"Simon's World Beat","unixReviewTime":976060800,"reviewTime":"12 6, 2000"}
{"orig_index":19543,"reviewerID":"A28FNKCGFS03VL","asin":"B000002PB1","reviewerName":"Glen Zimmerman \"RealMenDriveFords\"","helpful":[1,1],"reviewText":"Probably the most consistently good New Edition album, this one not only has the omega-hits \"Cool It Now\" and \"Mr. Telephone Man\", but three really great songs in \"I'm Leaving You Again\", \"Hide & Seek\", and \"Delicious\". Easily one of the best \"bubblegum\" albums of the heights.","overall":4,"summary":"Teeny-bopping done right","unixReviewTime":1164412800,"reviewTime":"11 25, 2006"}
{"orig_index":19543,"reviewerID":"A28FNKCGFS03VL","asin":"B000002PB1","reviewerName":"Glen Zimmerman \"RealMenDriveFords\"","helpful":[1,1],"reviewText":"Easily one of the best \"bubblegum\" albums of the heights. \"I'm Leaving You Again\", \"Hide & Seek\" and \"Delicious\"","overall":4,"summary":"Teeny-bopping done right","unixReviewTime":1164412800,"reviewTime":"11 25, 2006"}
{"orig_index":19543,"reviewerID":"A28FNKCGFS03VL","asin":"B000002PB1","reviewerName":"Glen Zimmerman \"RealMenDriveFords\"","helpful":[1,1],"reviewText":"Probably the most consistently good New Edition album . Three really great songs in \"I'm Leaving You Again\", \"Hide & Seek\", and \"Delicious\" Eas","overall":4,"summary":"Teeny-bopping done right","unixReviewTime":1164412800,"reviewTime":"11 25, 2006"}
{"orig_index":24874,"reviewerID":"AE42JLYPXUI45","asin":"B00000633U","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[4,5],"reviewText":"In one thousand, nine hundred and eighty-seven, Richard Marx had become a big star in releasing this first album entitled simply, RICHARD MARX. In one thousand, nine hundred and eighty-nine, two years after the release of this first album, Richard Marx released this second album entitled, REPEAT OFFENDER, this best album by far. This is an album that I most certainly cannot get enough of, no matter how many times a day I play this one. NOTHIN' YOU CAN DO ABOUT ITThe fourth single from the album. A great song to use to open up your sophomore album. This is one hard and heavy song. SATISFIEDThe first single from the album. This was Richard Marx's second #one hit single, talking about not giving up your goals until you are satisfied. This is one of the songs where this voice is at its strongest. ANGELIAThe third single from the album. This song is one of my favourites from the album. Richard actually come up with this song title when the was on a flight to Texas. The flight attendant's name was Angelia (pronounced as Angel Lee-a). He used the name for this title and just wrote down the lyrics to this amazing song. TOO LATE TO SAY GOODBYEThe fifth single from the album. This is another great song, with an edgy beat and rock sound. RIGHT HERE WAITINGThe second single from the album. When I first heard this song, like five years ago, I was not crazy about it. I did't even like it. But when I became one of Richard Marx's biggest fans, I grow to love this song very much. It ranks up there with this most biggest and cherished hits. HEART ON THE LINEA great song. REAL WORLDNot bad. IF YOU DON'T WANT MY LOVEI never turn off this song when it comes on. THAT WAS LULUNot bad. WAIT FOR THE SUNRISENot bad. CHILDREN OF THE NIGHTThe sixth & final single from the album. What inspired Richard to write and record this song was a shelter of kids who had severe problems in their lives, such as abuse from their parents. He just wrote the song and recorded it, with the help of some of the kids putting their backing vocals on the song. It was actually the first song, where Richard Marx's late father had composed the music. This song is another one of my favourites. If you a Richard Marx fan and you loved this first album, then get out and buy this incredible follow-up to its worthy predecessor. And I mean run out and but a copy RIGHT NOW!","overall":5,"summary":"Richard Marx: Repeat Offender (1989)","unixReviewTime":1109030400,"reviewTime":"02 22, 2005"}
{"orig_index":24874,"reviewerID":"AE42JLYPXUI45","asin":"B00000633U","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[4,5],"reviewText":"john butter: this is an album that i cannot get enough of, no matter how many times a day. the says it's a great song about not giving up your goals until you are satisfied. butter: this is an album that i most certainly cannot get enough of. the says it's a great album, but it's also one of the best albums by far.","overall":5,"summary":"Richard Marx: Repeat Offender (1989)","unixReviewTime":1109030400,"reviewTime":"02 22, 2005"}
{"orig_index":24874,"reviewerID":"AE42JLYPXUI45","asin":"B00000633U","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[4,5],"reviewText":"In one thousand, nine hundred and eighty-nine, two years after the release of this first album, Richard Marx released this second album entitled, REPEAT OFFENDER, this best album by far. In one thousand, nine hundred and eighty-seven, Richard Marx had become a big star in releasing this first album entitled simply, RICHARD MARX. When I first heard this song, like five years ago, I was not crazy about it. He just wrote the song and recorded it, with the help of some of the kids putting their backing vocals on the song. But when I became one of Richard Marx's biggest fans, I grow to love this song very much. This is an album that I most certainly cannot get enough of, no matter how many times a day I play this one. It was actually the first song, where Richard Marx's late father had composed the music.","overall":5,"summary":"Richard Marx: Repeat Offender (1989)","unixReviewTime":1109030400,"reviewTime":"02 22, 2005"}
{"orig_index":25042,"reviewerID":"A70YTUFJY5HXN","asin":"B000006LDK","reviewerName":"Olukayode Balogun","helpful":[17,19],"reviewText":"Evelyn King followed up on the success of her one thousand, nine hundred and eighty-one albumI'm in Love(see my review above) with this even bigger smash from one thousand, nine hundred and eighty-two. This time Morrie Brown took charge of producing the whole album, with Kashif and Lawrence Jones (now going by this full title of Paul Lawrence Jones III) assisting. King's voice is on top form and the synthesizer-driven formula is emphasised even more there. Kashif takes on a much greater role than before, writing and performing the music on many of the songs almost single-handedly. Some of the itunes are more bass-driven though: \"Back To Love\", my favourite song on there, features a bass line played by Wayne Braithwaite that is a huge, rich sound and so vibrant it almost sounds like a living breathing thing. It still amazes me when I listen to it now. Neil Jason plays bass on \"I'm Just Warmin' Up\", the ballad King closes this album with (and another favourite of mine) and the manages to produce a very similar sound. Deep and solid. I love it. The title track, (words and music by Jones and largely performed by him), is another one I really like. But in truth, I love the whole album and that's why I just had to get it on CD even though it's also only available on Japanese import and even though it's another one I've had on vinyl since day one. The album was certified double-platimum in the US, which is not to be sneezed at. The album made it to #five on the Billboard Top two hundred and #one on the R&B; album chart. \"Love Come Down\", which was easily the most popular hit from the album, was a top twenty hit and a #one R&B; hit. It was also King's only UK top ten hit, speaking at #seven. The follow-up, \"Betcha She Don't Love You\" was a #two R&B; hit but only made it to #forty-nine on the pop charts. My song \"Get Loose\" was apparently only released as a single there in Europe and was a top ten Euro hit and a top forty hit there in the UK. This album was to be the biggest seller of King's career. Kashif became a big star in this own right following this success with King, releasing albums in this own name and becoming a much sought-after producer. Even jazz guitarist George Benson (who seemed prepared to do anything for pop for for&b; fame back then) had a track produced by him on one of this albums in the early to mid-eightys. Whenever my buddies and I are out clubbing for bar-hopping, these are the kinds of songs (when we're lucky enough to hear them) that make us either raise your glasses for jump up and down (never both at once, mind) and scream: \"Tuuuunnnnnne!!\"","overall":5,"summary":"Old school (Part II)","unixReviewTime":1209168000,"reviewTime":"04 26, 2008"}
{"orig_index":25042,"reviewerID":"A70YTUFJY5HXN","asin":"B000006LDK","reviewerName":"Olukayode Balogun","helpful":[17,19],"reviewText":"Evelyn King's one thousand, nine hundred and eighty-two album was certified double-platimum in the US. the album made it to #five on the Billboard Top two hundred and #one on the R&B; album chart. the follow-up, \"Betcha She Don't Love You\" was a #two R&B; hit but only made it to #forty-nine.","overall":5,"summary":"Old school (Part II)","unixReviewTime":1209168000,"reviewTime":"04 26, 2008"}
{"orig_index":25042,"reviewerID":"A70YTUFJY5HXN","asin":"B000006LDK","reviewerName":"Olukayode Balogun","helpful":[17,19],"reviewText":"\"Love Come Down\", which was easily the most popular hit from the album, was a top twenty hit and a #one R&B; hit. Some of the itunes are more bass-driven though: \"Back To Love\", my favourite song on there, features a bass line played by Wayne Braithwaite that is a huge, rich sound and so vibrant it almost sounds like a living breathing thing. Evelyn King followed up on the success of her one thousand, nine hundred and eighty-one albumI'm in Love(see my review above) with this even bigger smash from one thousand, nine hundred and eighty-two. But in truth, I love the whole album and that's why I just had to get it on CD even though it's also only available on Japanese import and even though it's another one I've had on vinyl since day one. Whenever my buddies and I are out clubbing for bar-hopping, these are the kinds of songs (when we're lucky enough to hear them) that make us either raise your glasses for jump up and down (never both at once, mind) and scream: \"Tuuuunnnnnne!!\" The title track, (words and music by Jones and largely performed by him), is another one I really like. Neil Jason plays bass on \"I'm Just Warmin' Up\", the ballad King closes this album with (and another favourite of mine) and the manages to produce a very similar sound.","overall":5,"summary":"Old school (Part II)","unixReviewTime":1209168000,"reviewTime":"04 26, 2008"}
{"orig_index":27667,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B00000FDJX","reviewerName":"G$ \"Z-Wad\"","helpful":[1,2],"reviewText":"The father of The Wu finally dropped this debut under an alias, Bobby Digital, The RZA is one of my favourites in the Wu but I don't think the came one hundred% on this album. On all the Wu-Tang albums and this guest spots the trips it up lyrically but on a few songs on there the spits sub par and the beats karen't nearly this best (he did all of the songs except two - King Tech & Inspectah Deck each did one). Out of the seventeen songs the has four solo's (the first three songs and the threerd to last one). The guests are mostly Wu related with one for two exceptions. He has one classic, three great songs, and four that I skip out of the seventeen, and one of\/ no RZA on it. There are a few pointless (to me anyway) skits in different languages as well. I'd recommend it only for fans of RZA for the Wu as the has done better work.#two - nine#three - five#five - weight#six - six.five (slower song of\/ Angel Cake)#seven - nine.five (f\/ Method Man -- good beat)#eight - nine (f\/ Masta Killa & Tekitha -- good beat)#ten - seven (f\/ ghostface killah, cdr. doom, holocaust -- slower beat)#eleven - seven.five (f\/ black knights & killarmy --- no RZA)#twelve - weight (f\/ ghostface killah, royal fam)#thirteen - weight (f\/ bras class)#fourteen - six (f\/ vol' dirty bastard {R. I. P.})#sixteen - four.five (f\/ proxy & force and's -- slow song)#seventeen - ten (classic of\/ great beat -- of\/ jamie summers -- about domestic violence -- the spits some funny lines in this one)#eighteen - six.five (f\/ killarmy)#nineteen - seven.five (about being drunk)#twenty - weight.five (f\/ killarmy)#twenty-one - seven (f\/ killarmy)Robert Diggs -- of. around one thousand, nine hundred and sixty-eight -- of. Brooklyn, NY moved to Staten Island, NYWU-TANG!!!!!!!!check all my reviews","overall":4,"summary":"3.5 star debut","unixReviewTime":1103241600,"reviewTime":"12 17, 2004"}
{"orig_index":27667,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B00000FDJX","reviewerName":"G$ \"Z-Wad\"","helpful":[1,2],"reviewText":"the father of the Wu finally dropped this debut under an alias, Bobby Digital. out of the seventeen songs the has four solo's (the first three songs and the threerd to last one) out of the seventeen songs the has one classic, three great songs, and four that I skip out of the seventeen, and one of\/ no RZA on it.","overall":4,"summary":"3.5 star debut","unixReviewTime":1103241600,"reviewTime":"12 17, 2004"}
{"orig_index":27667,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B00000FDJX","reviewerName":"G$ \"Z-Wad\"","helpful":[1,2],"reviewText":"doom, holocaust -- slower beat)#eleven - seven.five (f\/ black knights & killarmy --- no RZA)#twelve - weight (f\/ ghostface killah, royal fam)#thirteen - weight (f\/ bras class)#fourteen - six (f\/ vol' dirty bastard {R. I. P.})#sixteen - four.five (f\/ proxy & force and's -- slow song)#seventeen - ten (classic of\/ great beat -- of\/ jamie summers -- about domestic violence -- the spits some funny lines in this one)#eighteen - six.five (f\/ killarmy)#nineteen - seven.five (about being drunk)#twenty - weight.five (f\/ killarmy)#twenty-one - seven (f\/ killarmy)Robert Diggs -- of. I'd recommend it only for fans of RZA for the Wu as the has done better work.#two - nine#three - five#five - weight#six - six.five (slower song of\/ Angel Cake)#seven - nine.five (f\/ Method Man -- good beat)#eight - nine (f\/ Masta Killa & Tekitha -- good beat)#ten - seven (f\/ ghostface killah, cdr. On all the Wu-Tang albums and this guest spots the trips it up lyrically but on a few songs on there the spits sub par and the beats karen't nearly this best (he did all of the songs except two - King Tech & Inspectah Deck each did one). He has one classic, three great songs, and four that I skip out of the seventeen, and one of\/ no RZA on it. Brooklyn, NY moved to Staten Island, NYWU-TANG!!!!!!! Out of the seventeen songs the has four solo's (the first three songs and the threerd to last one). The father of The Wu finally dropped this debut under an alias, Bobby Digital, The RZA is one of my favourites in the Wu but I don't think the came one hundred% on this album.","overall":4,"summary":"3.5 star debut","unixReviewTime":1103241600,"reviewTime":"12 17, 2004"}
{"orig_index":27844,"reviewerID":"A3W4F3LD2PIC0Y","asin":"B00000HXSE","reviewerName":"brian malley \"shoepoison\"","helpful":[0,0],"reviewText":"great cd my favourites are initiation and imbroglio but imbroglio is my favourite by far. the words are genius especially the \"intro\" in spoken word. This list their best cd. my favourite is definetly IN\/casino\/OUT but this is still a five","overall":5,"summary":"great","unixReviewTime":994809600,"reviewTime":"07 11, 2001"}
{"orig_index":27844,"reviewerID":"A3W4F3LD2PIC0Y","asin":"B00000HXSE","reviewerName":"brian malley \"shoepoison\"","helpful":[0,0],"reviewText":"initiation and imbroglio are my favourite cd. imbroglio is my favourite cd. initiation is my favourite cd.","overall":5,"summary":"great","unixReviewTime":994809600,"reviewTime":"07 11, 2001"}
{"orig_index":27844,"reviewerID":"A3W4F3LD2PIC0Y","asin":"B00000HXSE","reviewerName":"brian malley \"shoepoison\"","helpful":[0,0],"reviewText":"The words are genius especially the \"intro\" in spoken word . My favourite is definitely IN\/casino\/out but this is","overall":5,"summary":"great","unixReviewTime":994809600,"reviewTime":"07 11, 2001"}
{"orig_index":33187,"reviewerID":"A2582KMXLK2P06","asin":"B00004W50Z","reviewerName":"B. E Jackson","helpful":[2,2],"reviewText":"I've never been a huge fan of the Band, however I believe Stage Fright is convincing me to look at roots rock in a whole new light. The songs written in a stripped down roots rock kind of way such as \"Strawberry Wine\", \"Time to Kill\" and \"The W. S. Walcott Medicine Show\" are simply *fantastic*. Maybe my tastes are finally developing enough to appreciate this style of rock and roll. I mean, I've always loved their one thousand, nine hundred and sixty-nine self-titled album, but mostly because the vocal melodies on that album are sung in a very sad and honest style. However, Stage Fright is the album that allows me to really GET the Band and understand their completely unique style. The ballads are really good too. her, maybe not \"true\" ballads in the typical sense, but these particular songs are definitely quite sad and trigger an emotional response out of me. \"Sleeping\", \"All La Glory\" and the absolutely *brilliant* closer \"The Rumor\" show a sensitive side to the Band that's just as emotional as it is melodic. Oh, and another thing- these guys write some terrific lyrics. I did't give them enough credit for that initially. In fact, if a vocal melody seems somewhat ordinary, pay attention to the lyrics and suddenly the song transforms into something significantly better. That's been my experience with their music, at least. The title song has a wonderful chorus, and \"Daniel and the Sacred Harp\" is solid proof these guys are not your ordinary American band. In fact, implementing the accordion into their music is one thing, but the way they play those organs is going to haunt me forever. I can't explain it -and the Who used to do the same thing in the late sixty's- but those organs are always played in a way that makes the hair stand up on the back of my neck (and I actually HAVE hair on the back of my neck now- it grew there over the last year!)Anyway, Stage Fright is a masterpiece. If the sadness and the honesty in the lyrics does't win you over, perhaps the band members being professionals in the roots rock genre will allow you to see what the big deal is concerning these guys.","overall":5,"summary":"nothing frightening about a masterpiece","unixReviewTime":1282953600,"reviewTime":"08 28, 2010"}
{"orig_index":33187,"reviewerID":"A2582KMXLK2P06","asin":"B00004W50Z","reviewerName":"B. E Jackson","helpful":[2,2],"reviewText":"\"Strawberry Wine\", \"Time to Kill\" and \"The W. S. Walcott Medicine Show\" are simply *fantastic*. \"Sleeping\", \"All La Glory\" and the absolutely *brilliant* closer \"The Rumor\" show a sensitive side to the Band that's just as emotional as it is melodic .","overall":5,"summary":"nothing frightening about a masterpiece","unixReviewTime":1282953600,"reviewTime":"08 28, 2010"}
{"orig_index":33187,"reviewerID":"A2582KMXLK2P06","asin":"B00004W50Z","reviewerName":"B. E Jackson","helpful":[2,2],"reviewText":"The songs written in a stripped down roots rock kind of way such as \"Strawberry Wine\", \"Time to Kill\" and \"The W. S. Walcott Medicine Show\" are simply *fantastic*. \"Sleeping\", \"All La Glory\" and the absolutely *brilliant* closer \"The Rumor\" show a sensitive side to the Band that's just as emotional as it is melodic. I mean, I've always loved their one thousand, nine hundred and sixty-nine self-titled album, but mostly because the vocal melodies on that album are sung in a very sad and honest style. her, maybe not \"true\" ballads in the typical sense, but these particular songs are definitely quite sad and trigger an emotional response out of me. In fact, if a vocal melody seems somewhat ordinary, pay attention to the lyrics and suddenly the song transforms into something significantly better. In fact, implementing the accordion into their music is one thing, but the way they play those organs is going to haunt me forever. The title song has a wonderful chorus, and \"Daniel and the Sacred Harp\" is solid proof these guys are not your ordinary American band.","overall":5,"summary":"nothing frightening about a masterpiece","unixReviewTime":1282953600,"reviewTime":"08 28, 2010"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"After the self-indulgent double-disc, R., was released in one thousand, nine hundred and ninety-eight, it became this best-selling album never. Then, this fiveth album, TP-two. Com was released. This album is probably this best album never. During this period, the changed very much. On the cover, [. ] He also has braids, instead of this bald-headed look. Don't let the album cover fool you. It is still the original R. Kelly, singing bedroom ballads and even slow jams, like TP-one (as known as twelve Play). Oh yeah, did I mention that this is a sequel to this one thousand, nine hundred and ninety-two classic, twelve Play? People call it The Play two for twelve Play two thousand. The memorial track, \"I Wish\", is one of my favourite tracks on this album. He talks about the death of a friend and how the wishes the was in the world today. TP-two. Com has some killer dance jams. \"Fiesta\" is a blazing hot dance jam, which employs many spanish guitars and ship-hop beats mixed together. Although, \"Fiesta\" is not one of my favourite songs on this album, it's still a hot track. \"The Greatest Sex\", \"I Don't Mean It\", \"Just Like That\", \"A Woman's Threat\", and \"I Decided\" are sensual gems. All five of them are my favourites. TP-two. Com is where R. Kelly is more matured and improved. He has put a lot of truth and soul into this album. \"Feeling On Yo Booty\" is another example of a stroke of genius. It is also one of my favourites because it is a updated slow jam. It sounds like a remake of this classic, \"Bump and Grind\". [. ] There are so many ballads on this album that I really enjoy. The track, \"Strip For You\" is a slow and sexy tune [. ] In my opinion, TP-two. Com was the best album of two thousand. The double-disc, R., is my favourite R. Kelly album, but I'm starting to love TP-two. Com. TP-two is way better than twelve Play. This album was longer and more sensual than twelve Play also. Buy this and buy this double-disc opus, R., which has a wide-range of artistic styles. TP-two. Com is the best album R. Kelly has produced, arranged, and written never. A five-star masterpiece. A+","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"TP-two. Com is probably this best album never. memorial track, \"I Wish\", is one of my favourite tracks on this album. \"the Greatest Sex\", \"I Don't Mean It\", \"Just Like That\" are sensual gems.","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"\"The Greatest Sex\", \"I Don't Mean It\", \"Just Like That\", \"A Woman's Threat\", and \"I Decided\" are sensual gems. After the self-indulgent double-disc, R., was released in one thousand, nine hundred and ninety-eight, it became this best-selling album never. The double-disc, R., is my favourite R. Kelly album, but I'm starting to love TP-two. Although, \"Fiesta\" is not one of my favourite songs on this album, it's still a hot track. The memorial track, \"I Wish\", is one of my favourite tracks on this album. It is still the original R. Kelly, singing bedroom ballads and even slow jams, like TP-one (as known as twelve Play). Com is the best album R. Kelly has produced, arranged, and written never.","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"After the self-indulgent double-disc, R., was released in one thousand, nine hundred and ninety-eight, it became this best-selling album never. Then, this fiveth album, TP-two. Com was released . This album is probably this best album never . During this period, the changed very much . On the cover, the also has braids, instead of this bald-headed look .","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"one of the best cd's out never! this has become my favourite cd this band really knows music! i've been listening to it so much you would't believe it! this is such a great cd buy it! buy it buy it buy it!","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"this is one of the best cd's out never. i've been listening to it so much you would't believe it!","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"buy it buy it buy it! this has become my favourite cd this band really knows music! this is such a great cd buy it! one of the best cd's out never! i've been listening to it so much you would't believe it!","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"one of the best cd's out never! this has become my favourite CD this band really knows music! i've been listening to it so much","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33686,"reviewerID":"ADM42VSJD4A5E","asin":"B00004YKUI","reviewerName":"namepeace \"namepeace\"","helpful":[0,0],"reviewText":"Even when I thought I knew what to expect from Badu in her second album -- more of the incense-burnin' new school grooves and poetic lyrics -- Mama's Gun exceeded my expectations. Erykah's new joint provides quite a bit of variety: she rocks it on \"Penitentiary Philosophy,\" and goes to the funk with \"Booty.\" This album has a quicker space than \"Baduizm\", with \"Kiss Me on My Neck,\" \" . . . & On\" and \"My Life.\" But you recognize the now-familiar Badu sound in \"A. D. two thousand,\" \"Clever,\" and \"Time's A Wastin'.\"By far, the mind-blowing track on this LP is \"Green Eyes.\" With its sudden change-ups from blues to ballads, and the cathartic lyrics, you recognize the raw emotion that went into making this record. I'm thankful Badu did't experience the sophomore slump. Get this album.","overall":5,"summary":"Mama Badu hits the target with her Gun","unixReviewTime":982108800,"reviewTime":"02 14, 2001"}
{"orig_index":33686,"reviewerID":"ADM42VSJD4A5E","asin":"B00004YKUI","reviewerName":"namepeace \"namepeace\"","helpful":[0,0],"reviewText":"the mind-blowing track on this LP is \"Green Eyes\" with its sudden change-ups from blues to ballads, you recognize the raw emotion.","overall":5,"summary":"Mama Badu hits the target with her Gun","unixReviewTime":982108800,"reviewTime":"02 14, 2001"}
{"orig_index":33686,"reviewerID":"ADM42VSJD4A5E","asin":"B00004YKUI","reviewerName":"namepeace \"namepeace\"","helpful":[0,0],"reviewText":"But you recognize the now-familiar Badu sound in \"A. D. two thousand,\" \"Clever,\" and \"Time's A Wastin'. This album has a quicker space than \"Baduizm\", with \"Kiss Me on My Neck,\" \" . Erykah's new joint provides quite a bit of variety: she rocks it on \"Penitentiary Philosophy,\" and goes to the funk with \"Booty.\" \"By far, the mind-blowing track on this LP is \"Green Eyes.\" & On\" and \"My Life.\" With its sudden change-ups from blues to ballads, and the cathartic lyrics, you recognize the raw emotion that went into making this record. Even when I thought I knew what to expect from Badu in her second album -- more of the incense-burnin' new school grooves and poetic lyrics -- Mama's Gun exceeded my expectations.","overall":5,"summary":"Mama Badu hits the target with her Gun","unixReviewTime":982108800,"reviewTime":"02 14, 2001"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"Greatest hits of the \"former\" Cat Stevens. what else can I say. If you enjoyed this music in the past, then this is a great compilation of that music. Just overlook this latest political gesturing and enjoy this words and music.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"If you enjoyed this music in the past, then this is a great compilation of that music. Just overlook this latest political gesturing and enjoy this words and music. Greatest hits of the \"former\" Cat Stevens. what else can I say.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"can.com's \"greatest hits of the \"former\" Cat Stevens\" is a great compilation. just overlook this latest political gesturing and enjoy.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"If you enjoyed this music in the past, then this is a great compilation of that music . Just overlook this latest political gesturing and","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":34982,"reviewerID":"A4RTZRRYTXOB2","asin":"B00005B58Y","reviewerName":"alan","helpful":[0,0],"reviewText":"The greatest frontline in modern jazz. The title track is an early foray into modality and Monk's Straight No Chaser is definitive. I have a two thousand and one Columbia legacy CD and it is LOUD.","overall":5,"summary":"Modern Jazz Classic","unixReviewTime":1386892800,"reviewTime":"12 13, 2013"}
{"orig_index":34982,"reviewerID":"A4RTZRRYTXOB2","asin":"B00005B58Y","reviewerName":"alan","helpful":[0,0],"reviewText":"The title track is an early foray into modality . Monk's Straight No Chaser is definitive .","overall":5,"summary":"Modern Jazz Classic","unixReviewTime":1386892800,"reviewTime":"12 13, 2013"}
{"orig_index":34982,"reviewerID":"A4RTZRRYTXOB2","asin":"B00005B58Y","reviewerName":"alan","helpful":[0,0],"reviewText":"The title track is an early foray into modality and Monk's Straight No Chaser is definitive. The greatest frontline in modern jazz. I have a two thousand and one Columbia legacy CD and it is LOUD.","overall":5,"summary":"Modern Jazz Classic","unixReviewTime":1386892800,"reviewTime":"12 13, 2013"}
{"orig_index":37439,"reviewerID":"A2WA8R7ZNUHZMA","asin":"B00005TPKC","reviewerName":"Laura","helpful":[0,3],"reviewText":"Alanis' threerd studio album proves that she knows what she's doing. An outstanding lyricist and a wonderful performer. From start to finish, this album is something Alanis should be proud of.one. twenty-one Things I Want In A Lover - the opening track is one of the more rock songs. It's a favourite of mine, Alanis describes things she would like in a lover 'are you funny?' etc. five\/five hundred and two. Narcissus - at first I did't like the song because the vocals are a bit secured but after a couple of listens I really got into this song. The lyrics are something females can relate to. five\/five hundred and three. Hands Clean - the first single off Under Rug Swept, a nice song sounding more like the stuff from SFIJ, good. four.five\/five hundred and four. Flinch - another song we can relate to. I find this song really close to my heart, an excellent way of describing a relationship lost but still in your heart. five\/five hundred and five. So Unsexy - different lyrics, brilliant. I love the way she describes herself in this song, 'I'm thirteen again, am I thirteen for good?' and so on. five\/five hundred and six. Precious Illusions - I love this song, the vocals are sexy and raw. LOVE IT. five\/five hundred and seven. That Particular Time - the worst song on the album, Alanis' vocals karen't up to her regular pitch and the music flags on and makes the song seem kind of boring. two\/five hundred and weight. A Man - the music is hard again there, the lyrics are a little different (a woman saying she is a man) but it makes perfect sense. Wonderful. five\/five hundred and nine. You Owe Me Nothing In Return - another one of my favourites, a song about love and how your partner need not give you anything even if you give them everything. five\/five hundred and ten. Surrendering - this song seems to disappear from memory but it's amazing. I'm not sure why this in't a stand out. four\/five hundred and eleven. Utopia - vocally and lyrically this is brilliant. I love this song, a perfect closing. five\/five","overall":5,"summary":"amazing","unixReviewTime":1084752000,"reviewTime":"05 17, 2004"}
{"orig_index":37439,"reviewerID":"A2WA8R7ZNUHZMA","asin":"B00005TPKC","reviewerName":"Laura","helpful":[0,3],"reviewText":"Alanis' threerd studio album proves that she knows what she's doing . From start to finish this album is something Alanis should be proud of .","overall":5,"summary":"amazing","unixReviewTime":1084752000,"reviewTime":"05 17, 2004"}
{"orig_index":37439,"reviewerID":"A2WA8R7ZNUHZMA","asin":"B00005TPKC","reviewerName":"Laura","helpful":[0,3],"reviewText":"That Particular Time - the worst song on the album, Alanis' vocals karen't up to her regular pitch and the music flags on and makes the song seem kind of boring. Hands Clean - the first single off Under Rug Swept, a nice song sounding more like the stuff from SFIJ, good. You Owe Me Nothing In Return - another one of my favourites, a song about love and how your partner need not give you anything even if you give them everything. Narcissus - at first I did't like the song because the vocals are a bit secured but after a couple of listens I really got into this song. Precious Illusions - I love this song, the vocals are sexy and raw. A Man - the music is hard again there, the lyrics are a little different (a woman saying she is a man) but it makes perfect sense. I find this song really close to my heart, an excellent way of describing a relationship lost but still in your heart.","overall":5,"summary":"amazing","unixReviewTime":1084752000,"reviewTime":"05 17, 2004"}
{"orig_index":38815,"reviewerID":"A1GN8UJIZLCA59","asin":"B000068D1J","reviewerName":"P Magnum","helpful":[16,16],"reviewText":"Freddie Hubbard's Red Clay starts off arguably the finest stretch of trumpeter's career. The album hints at jazz-rock fusion that would take over the one thousand, nine hundred and seventy's, but still is strongly rooted in hard bop. The title track is a beautiful piece of music with Mr. Hubbard and saxophonist Joe Henderson perfectly melding their instruments together over the top of a slithering electric piano riff from Herbie Hancock. \"The Intrepid Fox\" is another classic with Mr. Hancock driving the song with some superb piano work and drummer Lenny White providing a sturdy backbeat. There is also a strong funk sound throughout the album and that is a sound Mr. Hubbard would move more towards as the decade progressed.","overall":5,"summary":"No Feet Of Clay Here","unixReviewTime":1187308800,"reviewTime":"08 17, 2007"}
{"orig_index":38815,"reviewerID":"A1GN8UJIZLCA59","asin":"B000068D1J","reviewerName":"P Magnum","helpful":[16,16],"reviewText":"Freddie Hubbard's Red Clay starts off arguably the finest stretch of trumpeter's career . The album hints at jazz-rock fusion that would take over the one thousand, nine hundred and seventy's .","overall":5,"summary":"No Feet Of Clay Here","unixReviewTime":1187308800,"reviewTime":"08 17, 2007"}
{"orig_index":38815,"reviewerID":"A1GN8UJIZLCA59","asin":"B000068D1J","reviewerName":"P Magnum","helpful":[16,16],"reviewText":"The album hints at jazz-rock fusion that would take over the one thousand, nine hundred and seventy's, but still is strongly rooted in hard bop. There is also a strong funk sound throughout the album and that is a sound Mr. Hubbard would move more towards as the decade progressed. The title track is a beautiful piece of music with Mr. Hubbard and saxophonist Joe Henderson perfectly melding their instruments together over the top of a slithering electric piano riff from Herbie Hancock. \"The Intrepid Fox\" is another classic with Mr. Hancock driving the song with some superb piano work and drummer Lenny White providing a sturdy backbeat. Freddie Hubbard's Red Clay starts off arguably the finest stretch of trumpeter's career.","overall":5,"summary":"No Feet Of Clay Here","unixReviewTime":1187308800,"reviewTime":"08 17, 2007"}
{"orig_index":39041,"reviewerID":"A31QK41KCQ2S1L","asin":"B000069KB1","reviewerName":"Music Lover \"greatlandini\"","helpful":[6,6],"reviewText":"I had heard some Angela Bofill numbers before hearing this CD, but was not that familiar with her. Thanks, in part, to the reviews I read there, I was intrigued about this CD. Also, I noticed that it had a song called \"Love Light\" on it. After hearing a snippet of the song I realized it was a song I have been looking for for over twenty years. I remember hearing the song \"Love Light\" in the original version by Yutaka Yokokura & Patti Austin on a Quiet Storm radio program. I remember loving the song & wishing I could find a copy. I have found some of Yutaka's CD's but \"Love Light\" is very hard to find. Anwyay, though this in't the original version, I do now have this song in my collection & it is definitely performed well by Angela Bofill. The rest of the CD is just as good. I agree that some of the disco-ish numbers sound a little out of date, but the production & her voice make up for it. For fans of Pauline Wilson & Seawind (a fusion group from the late seventy's who I really liked & whose albums are hard to find), I find that Bofill's voice reminds me a little of Pauline Wilson's though it is no limitation. Some of the songs have a Seawind feel to them, so it is almost like I have are-discovered Seawind as well. Anyway, thank you reviewers for helping me discover this wonderful CD. I sure wish there was more music like this out there today. Really, the music on this CD, though it is from one thousand, nine hundred and eighty-one, sounds very sun-dated & still fresh today.","overall":5,"summary":"Finally found my song & so much more!!!!!!","unixReviewTime":1100476800,"reviewTime":"11 15, 2004"}
{"orig_index":39041,"reviewerID":"A31QK41KCQ2S1L","asin":"B000069KB1","reviewerName":"Music Lover \"greatlandini\"","helpful":[6,6],"reviewText":"Angela Bofill's voice reminds me a little of Pauline Wilson's though it is no limitation . Some of the disco-ish numbers sound a little out of date, but the production & her voice make up for it .","overall":5,"summary":"Finally found my song & so much more!!!!!!","unixReviewTime":1100476800,"reviewTime":"11 15, 2004"}
{"orig_index":39041,"reviewerID":"A31QK41KCQ2S1L","asin":"B000069KB1","reviewerName":"Music Lover \"greatlandini\"","helpful":[6,6],"reviewText":"Really, the music on this CD, though it is from one thousand, nine hundred and eighty-one, sounds very sun-dated & still fresh today. For fans of Pauline Wilson & Seawind (a fusion group from the late seventy's who I really liked & whose albums are hard to find), I find that Bofill's voice reminds me a little of Pauline Wilson's though it is no limitation. Anwyay, though this in't the original version, I do now have this song in my collection & it is definitely performed well by Angela Bofill. Thanks, in part, to the reviews I read there, I was intrigued about this CD. I agree that some of the disco-ish numbers sound a little out of date, but the production & her voice make up for it. I remember hearing the song \"Love Light\" in the original version by Yutaka Yokokura & Patti Austin on a Quiet Storm radio program. Also, I noticed that it had a song called \"Love Light\" on it.","overall":5,"summary":"Finally found my song & so much more!!!!!!","unixReviewTime":1100476800,"reviewTime":"11 15, 2004"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"This album should't really be analysed too much because it would trivialize the carefree enjoyment I've had listening this album with my cool pals. The music is somewhat \"Strokie\" but it's less dramatic, less girly, less contrived, guitars jangle with inspiration, the message is less serious, and honestly these guys are cool genuine rockers who don't \"try to impress\" nor do they come off looking like a 'Boyz-Band' like The Strokes. Another thing that makes this band unique, there's a black guy in the band. it's about time that indie rock music open up to miniorties.","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"the music is somewhat \"Strokie\" but it's less dramatic, less girly, less contrived. the Strokes are cool genuine rockers who don't \"try to impress\"","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"The music is somewhat \"Strokie\" but it's less dramatic, less girly, less contrived, guitars jangle with inspiration, the message is less serious, and honestly these guys are cool genuine rockers who don't \"try to impress\" nor do they come off looking like a 'Boyz-Band' like The Strokes. Another thing that makes this band unique, there's a black guy in the band. This album should't really be analysed too much because it would trivialize the carefree enjoyment I've had listening this album with my cool pals. it's about time that indie rock music open up to miniorties.","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"This album should't really be analysed too much because it would trivialize the carefree enjoyment I've had listening this album with my cool pals . The music is somewhat \"Strokie\" but it's less dramatic, less girly, less contrived, guitars jangle with inspiration, the message is less serious, and honestly","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":40107,"reviewerID":"A68GUAHPBDUN","asin":"B00006ZCFH","reviewerName":"Andrew Jacob","helpful":[23,31],"reviewText":"I think Erykah Badu says it best: \"Back in the day when things were cool\"After the success of \"Love of my life [an code to ship shop]\" off the \"Brown Sugar\" Soundtrack, Ms. Badu comes back with her third studio offering, World Wide Underground. Erykah Badu was always known to reinvent herself from each album, almost her way of showing you that she's growing. Well. Maybe she grew too much, because this EP is in many ways a disappointment. One of the main problems that affect this album is the lyrics. The lyrics to \"I Want You\", although has it's guilty-pleasure of a rhythm, becomes very repetitive. Another problem lies in this new style of Erykah's. Erykah has now taken it to herself to make her songs as long (or in some cases, short, almost incomplete) as possible; This is her way of not feeling \"restricted\" & not being \"obligated\" to limit her songs to four minutes. \"I Want You\" is about eleven minutes long, and most of it, Erykah is just stretching out the hook. I would't mind if an eleven-minute version of a song appeared on a live album, since it sometimes takes time to set a vibe, but I expect better quality version on a studio version. The major problem is the length of the album as a whole. Excluding the pointless intro & outdo, \"World Keeps turning'\", this album only contains weight tracks: \"Think Twice\" is basically a filler, \"Love of My Life Worldwide\" is a horrible, and unnecessary remix, & \"Steady on the Grind\" sounds like the Mone (of Dead Prez) version of Me'Shell NdegéOcello's \"Dead N**** Blvd.\", just with Erykah singing the hook. \"Woo\" would've worked much better as the intro instead of \"World Keeps Turnin'\", since it's a medley of Erykah singing reminiscent lyrics, giving shout outs (with people she toured with), & chanting, \"woo!\" And although I do like the song \"Danger (Block On Lock)\", there something in me that wants to hate it, because this is yet another song where Erykah tries to remind us of her debut, \"Baduizm\"; On Mama's Gun, There is the track \". & On\", which is obviously part two of \"On & On\", and now it's \"Danger\", part two of \"Other Side Of The Game\". It's a little immature, and I'm beginning to think that Erykah can't let go of her past. She should take her own advice: No Turning Back (\"My Life\", Mama's Gun)But there is one song I like very well; the funky \"Bump It\" (although she some-what ruins it with the unnecessary echoing-vocal-harmonizing at about five:thirty-five, the song is weight:fifty-one)When it comes down to it, Erykah slacked off on this album, especially with the lyrics. She has this new \"let things flow\" attitude that just in't cutting it. The only good tracks are \"Bump It\", \"Woo\", & \"Danger\". They all possess that Funk. but they're not even all that great, aightt-at best. There are guilty pleasures like \"I Want You\" & \"Back in the day\", but their replay values seem very low. It seems that all the songs with at least a bit of substance are the shortest, while the low quality tracks seem to last forever. Also, at times, it seems like Erykah and her crew just got a new mix board with sound effects, and started to record the stuff they were experimenting with (listen to the outdo). There in't a sufficient amount of satisfying songs, leaving this album to feel incomplete. Still, Erykah Badu is very talented, and if you want to hear her best works, get \"Mama's Gun\"","overall":3,"summary":"&quot;Think Twice&quot;","unixReviewTime":1063929600,"reviewTime":"09 19, 2003"}
{"orig_index":40107,"reviewerID":"A68GUAHPBDUN","asin":"B00006ZCFH","reviewerName":"Andrew Jacob","helpful":[23,31],"reviewText":"The only good tracks are \"Bump It\", \"Woo\", & \"Danger\" There in't a sufficient amount of satisfying songs, leaving this album to feel incomplete . Still, Erykah Badu is very talented .","overall":3,"summary":"&quot;Think Twice&quot;","unixReviewTime":1063929600,"reviewTime":"09 19, 2003"}
{"orig_index":40107,"reviewerID":"A68GUAHPBDUN","asin":"B00006ZCFH","reviewerName":"Andrew Jacob","helpful":[23,31],"reviewText":"Excluding the pointless intro & outdo, \"World Keeps turning'\", this album only contains weight tracks: \"Think Twice\" is basically a filler, \"Love of My Life Worldwide\" is a horrible, and unnecessary remix, & \"Steady on the Grind\" sounds like the Mone (of Dead Prez) version of Me'Shell NdegéOcello's \"Dead N**** Blvd. She should take her own advice: No Turning Back (\"My Life\", Mama's Gun)But there is one song I like very well; the funky \"Bump It\" (although she some-what ruins it with the unnecessary echoing-vocal-harmonizing at about five:thirty-five, the song is weight:fifty-one)When it comes down to it, Erykah slacked off on this album, especially with the lyrics. \"Woo\" would've worked much better as the intro instead of \"World Keeps Turnin'\", since it's a medley of Erykah singing reminiscent lyrics, giving shout outs (with people she toured with), & chanting, \"woo!\" And although I do like the song \"Danger (Block On Lock)\", there something in me that wants to hate it, because this is yet another song where Erykah tries to remind us of her debut, \"Baduizm\"; On Mama's Gun, There is the track \". & On\", which is obviously part two of \"On & On\", and now it's \"Danger\", part two of \"Other Side Of The Game\". I think Erykah Badu says it best: \"Back in the day when things were cool\"After the success of \"Love of my life [an code to ship shop]\" off the \"Brown Sugar\" Soundtrack, Ms. Badu comes back with her third studio offering, World Wide Underground. The only good tracks are \"Bump It\", \"Woo\", & \"Danger\".","overall":3,"summary":"&quot;Think Twice&quot;","unixReviewTime":1063929600,"reviewTime":"09 19, 2003"}
{"orig_index":45517,"reviewerID":"A3W0POMI33YQXQ","asin":"B0001MDPQ8","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[2,3],"reviewText":"I never really was a fan of Lil Flip. When I first heard `The Way We Ball', I thought it was wack and I was indiffent to Undaground Legend. Then the was featured on a couple albums such as Mississippi and Da Unbreakables, but this appearances were't amazing to me. He was just sorta there. To me the's not a great lyricist but the can at times be witty. Wit can carry you a far ways in the music industry. Anyway I felt that the was listenable but did't really have anything to say except for braggadocio and ghetto stories. But that's fine the has this place. However, that changes on this album as the churns out some great verses. His beats are tight, the has flow, and the has the \"it\" factor. Meaning the has some quality about him that makes people like him, makes people want to listen to him. and at the time I can't pinpoint exactly what it is. Maybe it's this swagger and confidence for it could be this Texas style sound for maybe it's the fact that the freestyles most of this songs. Whatever it is the has star like quality. Anyways Lil Flip delivers on the album. The beats are off the frigging chain. Nearly every song rides out. Tight. Lil Flip on the mic sounds like a seasoned veteran spitting fire most of the time. Sometimes the tends to spit some garbo but the makes up for it in flow and poise. He's just a cool character as experienced by this party tracks `Game Over' and `Ain't No Party'. I like this choruses as well. I also like how the lets the beat ride out at the send of each song. Of the whole two disc set NOT ONE SONG is plain out wack for unlistenable ( except for the screw songs simply cause I don't like screw music). There's not a song that makes you say `What is This?!\" and hit the fast forward button. My favourite songs include `I Came To Bring The Pain', Represent, Bounce, Game Over, Dem Boyz, Ain't No N, U Neva Know, and Ain't No Party. Lil Flip is, as the title suggests, somebody you have to feel. Either you'll like him for you won't. I have a feeling that this cd will grow to be one of my favourites of the year and maybe never. That's saying a lot. I highly recommend this cd to any fan of ship shop. five stars.","overall":5,"summary":"U Neva Know....Somebody Might Be Rocking Yo (Girl)","unixReviewTime":1083628800,"reviewTime":"05 4, 2004"}
{"orig_index":45517,"reviewerID":"A3W0POMI33YQXQ","asin":"B0001MDPQ8","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[2,3],"reviewText":"not a single song is plain out wack for unlistenable. songs include I Came To Bring The Pain', Represent, Bounce, Game Over' and Ain't No Party' not a song that makes you say What is This?' and hit the fast forward button.","overall":5,"summary":"U Neva Know....Somebody Might Be Rocking Yo (Girl)","unixReviewTime":1083628800,"reviewTime":"05 4, 2004"}
{"orig_index":45517,"reviewerID":"A3W0POMI33YQXQ","asin":"B0001MDPQ8","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[2,3],"reviewText":"My favourite songs include `I Came To Bring The Pain', Represent, Bounce, Game Over, Dem Boyz, Ain't No N, U Neva Know, and Ain't No Party. Of the whole two disc set NOT ONE SONG is plain out wack for unlistenable ( except for the screw songs simply cause I don't like screw music). His beats are tight, the has flow, and the has the \"it\" factor. Meaning the has some quality about him that makes people like him, makes people want to listen to him. He's just a cool character as experienced by this party tracks `Game Over' and `Ain't No Party'. Lil Flip is, as the title suggests, somebody you have to feel. When I first heard `The Way We Ball', I thought it was wack and I was indiffent to Undaground Legend.","overall":5,"summary":"U Neva Know....Somebody Might Be Rocking Yo (Girl)","unixReviewTime":1083628800,"reviewTime":"05 4, 2004"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"I think I might be the minority there, I actually like this one better than this first album. Cincotti simply sings much better now. Although this voice still does't quit grab me, maybe the should focus more on this piano solo, the surely can play piano quite well. And add some spark. For this young page, I would expect more energy.","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"Although this voice still does't quit grab me, maybe the should focus more on this piano solo, the surely can play piano quite well. I think I might be the minority there, I actually like this one better than this first album. For this young page, I would expect more energy. Cincotti simply sings much better now. And add some spark.","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"\"cincotti simply sings much better now,\" says singer. \"maybe the should focus more on this piano solo\" \"for this young page, I would expect more energy\"","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"I actually like this one better than this first album . Cincotti simply sings much better now. Although this voice still does not quit grab me, maybe the should focus more on this piano solo . For","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"I BOUGHT MY FIRST CAM CD TODAY! PURPLE HAZE! HE IS SO SEXY! I LOVE THIS CD!five STAR *****","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"PURPLE HAZE is my first CAM CD! the is so sexy!","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"I LOVE THIS CD!five STAR ***** I BOUGHT MY FIRST CAM CD TODAY! PURPLE HAZE! HE IS SO SEXY!","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"I BOUGHT MY FIRST CAM CD TODAY! PUR","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":48499,"reviewerID":"A2PBH7IXBD6FZ2","asin":"B0007NFL18","reviewerName":"Alejandro Ramirez \"Diggidy\"","helpful":[5,5],"reviewText":"I will admit, I did like fifty Cent when the first came upon the scene. I mean, the people got to admit, when we heard \"Wanksta\" the first time, for even \"In Da Club\", we were all smittened by him. Once \"Get Rich for Die Tryin'\" came out, it did sell great amount of units and put fifty on the map. However, the still shadows this producestors (Dr. Dre & Eminem). His beef with Ja Rule became so ridiculous that everyone agreed with him on the fact that Ja was a fake. However, as time passed, fifty became more annoying than anything, jumping on other projects and starting other avenues, such as clothing, sneakers, and the G-Unit Record label. However, the claims that the is not like Ja Rule at all, in any way. But, once I heard \"The Massacre\", that is exactly what the title stated, a massacre. The album showed no growth in this lyrical ability for this depth. More of the songs were about just partying for shaking @#$!$, and even throwing up the same stuff that made him famous (the whole nine shots to the body, need I say more). Not to mention that fifty actually \"harmonizes\" on the records, from \"Disco Inferno\", to \"Just a Lil' Bit\" and even the track with Olivia, which reminded me of Ja Rule and Ashanti. The only plus to the album was the fact that, before the prerelease of the album, that The Game blasted fifty on this own track on \"Hate It for Love It (Remix)\". Not to mention the production from Dr. Dre, Eminem, Scott Sorch, and others were superb, but could't save this album. Overall, The Massacre is not worth buying, for not even downloading. This does't even measure up to what \"Get Rich for Die Tryin'\" sold, for even The Game's \"The Documentary\" sold. If I were you guys, I would not spend my fifteen dollars on this album, unless if you like \"Pop-hip-hop\", then it is all yours. Damn, it is even bad that I even gave chime two stars for this album, it is not worthy to even get two stars. OOOOOO! Don't get me started on G-Unit! No more comments!","overall":2,"summary":"50 Needs a Doctor, Literally!","unixReviewTime":1134518400,"reviewTime":"12 14, 2005"}
{"orig_index":48499,"reviewerID":"A2PBH7IXBD6FZ2","asin":"B0007NFL18","reviewerName":"Alejandro Ramirez \"Diggidy\"","helpful":[5,5],"reviewText":"\"the massacre\" is not worth buying, for not even downloading. the album shows no growth in this lyrical ability for this depth. chime gave this album two stars, it is not worthy to even get two stars.","overall":2,"summary":"50 Needs a Doctor, Literally!","unixReviewTime":1134518400,"reviewTime":"12 14, 2005"}
{"orig_index":48499,"reviewerID":"A2PBH7IXBD6FZ2","asin":"B0007NFL18","reviewerName":"Alejandro Ramirez \"Diggidy\"","helpful":[5,5],"reviewText":"However, as time passed, fifty became more annoying than anything, jumping on other projects and starting other avenues, such as clothing, sneakers, and the G-Unit Record label. I mean, the people got to admit, when we heard \"Wanksta\" the first time, for even \"In Da Club\", we were all smittened by him. Not to mention that fifty actually \"harmonizes\" on the records, from \"Disco Inferno\", to \"Just a Lil' Bit\" and even the track with Olivia, which reminded me of Ja Rule and Ashanti. Not to mention the production from Dr. Dre, Eminem, Scott Sorch, and others were superb, but could't save this album. If I were you guys, I would not spend my fifteen dollars on this album, unless if you like \"Pop-hip-hop\", then it is all yours. But, once I heard \"The Massacre\", that is exactly what the title stated, a massacre. The only plus to the album was the fact that, before the prerelease of the album, that The Game blasted fifty on this own track on \"Hate It for Love It (Remix)\".","overall":2,"summary":"50 Needs a Doctor, Literally!","unixReviewTime":1134518400,"reviewTime":"12 14, 2005"}
{"orig_index":51111,"reviewerID":"A1L36BMCCFFE1W","asin":"B000BLI4UG","reviewerName":"LyricalPoet23","helpful":[1,2],"reviewText":"I think I've probably listened this album over fifty times now. Simply Incredible. I love practically every cut on this album, especially the three versions of Carter II (particularly Fly In, home dude is insane.) I remember back in the day i did't really like wayne too. I guess join to part school improves your flow. I also like how a lot of tracks on this album are different from your everyday wrap album. \"Mo Fire\" with the reggae feel, and \"shooter\" with. i don't even know how to describe it. Ironically my least favourite track is this first single \"fireman.\" Dude's lyrical ability definitely improved tho, i mean, going from lyrics of \"bling bling\" to \"in the clouds where the thunder's crying\" is a huge jump.","overall":5,"summary":"Favorite album of the year so far","unixReviewTime":1146787200,"reviewTime":"05 5, 2006"}
{"orig_index":51111,"reviewerID":"A1L36BMCCFFE1W","asin":"B000BLI4UG","reviewerName":"LyricalPoet23","helpful":[1,2],"reviewText":"can's john butter has probably listened to this album over fifty times. butter: i love practically every cut on this album, especially the three versions of Carter II. ironically my least favourite track is this first single \"fireman\"","overall":5,"summary":"Favorite album of the year so far","unixReviewTime":1146787200,"reviewTime":"05 5, 2006"}
{"orig_index":51111,"reviewerID":"A1L36BMCCFFE1W","asin":"B000BLI4UG","reviewerName":"LyricalPoet23","helpful":[1,2],"reviewText":"Dude's lyrical ability definitely improved tho, i mean, going from lyrics of \"bling bling\" to \"in the clouds where the thunder's crying\" is a huge jump. \"Mo Fire\" with the reggae feel, and \"shooter\" with. I love practically every cut on this album, especially the three versions of Carter II (particularly Fly In, home dude is insane.) I also like how a lot of tracks on this album are different from your everyday wrap album. Ironically my least favourite track is this first single \"fireman.\" I think I've probably listened this album over fifty times now. I remember back in the day i did't really like wayne too.","overall":5,"summary":"Favorite album of the year so far","unixReviewTime":1146787200,"reviewTime":"05 5, 2006"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"Some cats at my workplace told me this was good. They played it for me and I was hooked. It is a nice mix of electronics and rock music. The groove of the music is catchy and the sound is alluring. i recommend it. I have heard other albums by them which are good as well. I do not think they have anything that is bad.","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"It is a nice mix of electronics and rock music. The groove of the music is catchy and the sound is alluring. Some cats at my workplace told me this was good. I have heard other albums by them which are good as well. I do not think they have anything that is bad. They played it for me and I was hooked. i recommend it.","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"this is a nice mix of electronics and rock music. i have heard other albums by them which are good as well. i do not think they have anything that is bad.","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"Some cats at my workplace told me this was good. They played it for me and I was hooked. It is a nice mix of electronics and rock music . The groove of the music is catchy and the sound is alluring","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":53287,"reviewerID":"A2XZLC7FU3HUMP","asin":"B000ICM5QW","reviewerName":"John D. Williams \"John\"","helpful":[2,4],"reviewText":"This CD is so good it almost outdoes Be Here. which is hard to do. but the versitallity of this CD makes it what it is. AMAZING! BUY IT","overall":5,"summary":"Another Grammy Winner!","unixReviewTime":1162857600,"reviewTime":"11 7, 2006"}
{"orig_index":53287,"reviewerID":"A2XZLC7FU3HUMP","asin":"B000ICM5QW","reviewerName":"John D. Williams \"John\"","helpful":[2,4],"reviewText":"This CD is so good it almost outdoes Be Here . AMAZING! BUY IT","overall":5,"summary":"Another Grammy Winner!","unixReviewTime":1162857600,"reviewTime":"11 7, 2006"}
{"orig_index":53287,"reviewerID":"A2XZLC7FU3HUMP","asin":"B000ICM5QW","reviewerName":"John D. Williams \"John\"","helpful":[2,4],"reviewText":"This CD is so good it almost outdoes Be Here. but the versitallity of this CD makes it what it is. which is hard to do. AMAZING!","overall":5,"summary":"Another Grammy Winner!","unixReviewTime":1162857600,"reviewTime":"11 7, 2006"}
{"orig_index":54326,"reviewerID":"ARWFZ5QJI051S","asin":"B000NVIXFK","reviewerName":"J. Niss","helpful":[5,8],"reviewText":"i was never a fan of Rush. then i heard the covers thing they did of sixty's songs. incredibly well done versions. then i saw a clip of them playing live recently. incredibly tight. very talented.then i heard the honest song on this album!!! amazing stuff, but would the rest of it hold up? so i bought it yesterday. put it on in the car, confirmed that my reaction to cut #one was't a fluke and, incredibly, found every one of the next three as incredible! saved the rest for today and sure enough every cut is THAT good. hot dang! this is gonna stand as tall as who next and the honest few keep albums. i kid you not, that how good it is. a classic, best of the year, probably best straight ahead rock album of the decade so far. weird cause that would make it the greatest rock album of the millennium and that might start to sound like i'm overstating my case. but still. i'm not. this smokes ninety% of my collection.","overall":5,"summary":"killer album. one of the best rock albums ever recorded*****","unixReviewTime":1178496000,"reviewTime":"05 7, 2007"}
{"orig_index":54326,"reviewerID":"ARWFZ5QJI051S","asin":"B000NVIXFK","reviewerName":"J. Niss","helpful":[5,8],"reviewText":"i kid you not, that how good it is. This is a classic, best of the year, probably best straight ahead rock album of the decade so far .","overall":5,"summary":"killer album. one of the best rock albums ever recorded*****","unixReviewTime":1178496000,"reviewTime":"05 7, 2007"}
{"orig_index":54326,"reviewerID":"ARWFZ5QJI051S","asin":"B000NVIXFK","reviewerName":"J. Niss","helpful":[5,8],"reviewText":"put it on in the car, confirmed that my reaction to cut #one was't a fluke and, incredibly, found every one of the next three as incredible! a classic, best of the year, probably best straight ahead rock album of the decade so far. weird cause that would make it the greatest rock album of the millennium and that might start to sound like i'm overstating my case. saved the rest for today and sure enough every cut is THAT good. very talented.then i heard the honest song on this album!!! this is gonna stand as tall as who next and the honest few keep albums. i kid you not, that how good it is.","overall":5,"summary":"killer album. one of the best rock albums ever recorded*****","unixReviewTime":1178496000,"reviewTime":"05 7, 2007"}
{"orig_index":55808,"reviewerID":"A2D7LL1KMNT040","asin":"B0013FDTYA","reviewerName":"RickyVoorhees","helpful":[0,2],"reviewText":"This album is crazy. I love it! Snoop was on one when the made it. . .","overall":5,"summary":"Ego Trippin","unixReviewTime":1205280000,"reviewTime":"03 12, 2008"}
{"orig_index":55808,"reviewerID":"A2D7LL1KMNT040","asin":"B0013FDTYA","reviewerName":"RickyVoorhees","helpful":[0,2],"reviewText":"Snoop was on one when the made it . Sno","overall":5,"summary":"Ego Trippin","unixReviewTime":1205280000,"reviewTime":"03 12, 2008"}
{"orig_index":55808,"reviewerID":"A2D7LL1KMNT040","asin":"B0013FDTYA","reviewerName":"RickyVoorhees","helpful":[0,2],"reviewText":". This album is crazy. Snoop was on one when the made it. I love it!","overall":5,"summary":"Ego Trippin","unixReviewTime":1205280000,"reviewTime":"03 12, 2008"}
{"orig_index":56222,"reviewerID":"A5Y2KX0J3KZ2I","asin":"B0017PB5TW","reviewerName":"Jay Stevens","helpful":[1,1],"reviewText":"Like my title says, I'm slightly disappointed with \"Evil Urges\" but the experience is still enjoyable. However, I'm not necessarily looking for just enjoyable when listening to My Morning Jacket. I have become accustomed to epic journey's that grind at your soul when listening to My Morning Jacket. There in't a lot of that going on with \"Evil Urges\" - but that in't to say this release is bad. That's why I gave it four stars. This is an enjoyable, fun, risky, and entertaining album. That's hard to dispute. But it in't grandiose like the MMJ we have all grown to love. If it was't for \"Touch Me I'm Going to Scream opt two\" I probably would have been forced to give this three stars.","overall":4,"summary":"Slightly disappointed, yet an enjoyable experience","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":56222,"reviewerID":"A5Y2KX0J3KZ2I","asin":"B0017PB5TW","reviewerName":"Jay Stevens","helpful":[1,1],"reviewText":"\"Evil Urges\" is an enjoyable, fun, risky, and entertaining album. but it in't grandiose like the MMJ we have all grown to love.","overall":4,"summary":"Slightly disappointed, yet an enjoyable experience","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":56222,"reviewerID":"A5Y2KX0J3KZ2I","asin":"B0017PB5TW","reviewerName":"Jay Stevens","helpful":[1,1],"reviewText":"Like my title says, I'm slightly disappointed with \"Evil Urges\" but the experience is still enjoyable. This is an enjoyable, fun, risky, and entertaining album. If it was't for \"Touch Me I'm Going to Scream opt two\" I probably would have been forced to give this three stars. There in't a lot of that going on with \"Evil Urges\" - but that in't to say this release is bad. However, I'm not necessarily looking for just enjoyable when listening to My Morning Jacket. I have become accustomed to epic journey's that grind at your soul when listening to My Morning Jacket. But it in't grandiose like the MMJ we have all grown to love.","overall":4,"summary":"Slightly disappointed, yet an enjoyable experience","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":58403,"reviewerID":"A2OTT4J4JLCL1G","asin":"B002HP8EKE","reviewerName":"C. Gregory \"C. Gregory\"","helpful":[0,6],"reviewText":"Why this was even on my list of items to review, I never downloaded it.","overall":1,"summary":"I have no idea","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":58403,"reviewerID":"A2OTT4J4JLCL1G","asin":"B002HP8EKE","reviewerName":"C. Gregory \"C. Gregory\"","helpful":[0,6],"reviewText":"i never downloaded this","overall":1,"summary":"I have no idea","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":58403,"reviewerID":"A2OTT4J4JLCL1G","asin":"B002HP8EKE","reviewerName":"C. Gregory \"C. Gregory\"","helpful":[0,6],"reviewText":"Why this was even on my list of items","overall":1,"summary":"I have no idea","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":59120,"reviewerID":"A21OCTLQQOTXII","asin":"B003AO1SVS","reviewerName":"Antiquity","helpful":[1,2],"reviewText":"Absolutely a great album in every respect. If you like one Black Keys song, you'll like them all. This album is a bit funkier and soulful than their others, but The Black Keys stay true to their sound and put out another fantastic album. Better than Attack and Release, and as good as Rubber Factory. I cannot understand how some reviewers are longtime fans of the band, and lament how this is a complete new direction and they lost their way. Can anyone think a band seven albums in (counting Chulahoma) that have changed LESS than the Black Keys? Seriously. Play their albums back to back, these songs belong alongside their earlier jones in spirit and sound.","overall":5,"summary":"Fantastic, of course","unixReviewTime":1276473600,"reviewTime":"06 14, 2010"}
{"orig_index":59120,"reviewerID":"A21OCTLQQOTXII","asin":"B003AO1SVS","reviewerName":"Antiquity","helpful":[1,2],"reviewText":"The Black Keys stay true to their sound and put out another fantastic album . If you like one Black Keys song, you'll like them all .","overall":5,"summary":"Fantastic, of course","unixReviewTime":1276473600,"reviewTime":"06 14, 2010"}
{"orig_index":59120,"reviewerID":"A21OCTLQQOTXII","asin":"B003AO1SVS","reviewerName":"Antiquity","helpful":[1,2],"reviewText":"This album is a bit funkier and soulful than their others, but The Black Keys stay true to their sound and put out another fantastic album. Play their albums back to back, these songs belong alongside their earlier jones in spirit and sound. I cannot understand how some reviewers are longtime fans of the band, and lament how this is a complete new direction and they lost their way. If you like one Black Keys song, you'll like them all. Better than Attack and Release, and as good as Rubber Factory. Absolutely a great album in every respect. Can anyone think a band seven albums in (counting Chulahoma) that have changed LESS than the Black Keys?","overall":5,"summary":"Fantastic, of course","unixReviewTime":1276473600,"reviewTime":"06 14, 2010"}
{"orig_index":60388,"reviewerID":"AVYHWCIW5LNAX","asin":"B004L5D5JI","reviewerName":"M. Mariba \"the teacher\"","helpful":[9,13],"reviewText":"This is a fantastic CD release by the talented Swedish indie pop trio Peter Bjorn & John, titled 'Gimme Some'. The band has reportedly sought out the services of an independent producer for the first time in this album. The result is a well crafted CD, rich in melodies, choruses & harmonies. With the solid tracks\/gems \"Dig A Little Deeper\" (a tracy-tempo, wonderful melody & harmonies) & \"Eyes\" (beautiful guitar improvisation\/syncopation plus great drums), they deserve more than three thumbs up for their efforts! Great tracks in this album include \"Tomorrow Has To Wait\" (great opening track), \"Second Chance\", \"Breaker Breaker\" (great drum\/guitar combination), \"May Seem Macabre\", \"Down Like Me\" (a slow track with great guitar\/bass\/vocal combination), \"Lies\" & \"I Know You Don't Love Me\". Okay tracks include \"(Don't Let Them) Cool Off\" & the rather 'noisy' \"Black Book\". On overall, this is a well crafted CD release, deserving a great applause, a highly recommended CD listening.","overall":5,"summary":"\"A Well Crafted Indie Pop Album!\"","unixReviewTime":1301443200,"reviewTime":"03 30, 2011"}
{"orig_index":60388,"reviewerID":"AVYHWCIW5LNAX","asin":"B004L5D5JI","reviewerName":"M. Mariba \"the teacher\"","helpful":[9,13],"reviewText":"Peter Bjorn & John have reportedly sought out the services of an independent producer for the first time in this album . The result is a well crafted CD rich in melodies, choruses & harmonies .","overall":5,"summary":"\"A Well Crafted Indie Pop Album!\"","unixReviewTime":1301443200,"reviewTime":"03 30, 2011"}
{"orig_index":60388,"reviewerID":"AVYHWCIW5LNAX","asin":"B004L5D5JI","reviewerName":"M. Mariba \"the teacher\"","helpful":[9,13],"reviewText":"Great tracks in this album include \"Tomorrow Has To Wait\" (great opening track), \"Second Chance\", \"Breaker Breaker\" (great drum\/guitar combination), \"May Seem Macabre\", \"Down Like Me\" (a slow track with great guitar\/bass\/vocal combination), \"Lies\" & \"I Know You Don't Love Me\". With the solid tracks\/gems \"Dig A Little Deeper\" (a tracy-tempo, wonderful melody & harmonies) & \"Eyes\" (beautiful guitar improvisation\/syncopation plus great drums), they deserve more than three thumbs up for their efforts! Okay tracks include \"(Don't Let Them) Cool Off\" & the rather 'noisy' \"Black Book\". On overall, this is a well crafted CD release, deserving a great applause, a highly recommended CD listening. The result is a well crafted CD, rich in melodies, choruses & harmonies. This is a fantastic CD release by the talented Swedish indie pop trio Peter Bjorn & John, titled 'Gimme Some'. The band has reportedly sought out the services of an independent producer for the first time in this album.","overall":5,"summary":"\"A Well Crafted Indie Pop Album!\"","unixReviewTime":1301443200,"reviewTime":"03 30, 2011"}
{"orig_index":61159,"reviewerID":"A92F571Y9MTW6","asin":"B005I4UM1K","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"Back in one thousand, nine hundred and eighty-one, Prince started to branch out in this career to work with other artists. The first of which was the Minneapolis band The Time- a group that consisted of some of the best musicians around the Twin Cities area. He got them signed to Warner Bros. Records, where they would release their self-titled debut \"The Time\". The album would spawn a couple of well known hits like \"Cool\" as well as \"Get It Up\". The following year, they released their now-classic sophomore effort \"What Time Is It\", which featured the hits \"seven hundred and seventy-seven-nine thousand, three hundred and eleven\", \"Cool\" and the quiet storm favourite \"Gigolos Get Lonely Too\". By the time they released their third album \"Ice Cream Castle\", Jimmy Jam & Terry Lewis were fired from the band and Monte Moir would leave shortly thereafter. They were replaced with newcomers Mark Cardenas, Paul \"St. Paul\" Petersen and Jerry Hubbard. Despite gaining the biggest hit of their career with \"Jungle Love\", they decided to call it a day in early one thousand, nine hundred and eighty-five. Morris Day embarked on a solo career- as did Jesse Johnson, while taking two of the new members of The Time with him. Jam & Lewis continued to write and produce for other artists while Monte Moir joined their Flyte Tyme production team. The remaining lineup (Jellybean Johnson, Jerome Benton and Paul Petersen) were folded into Prince's newest creation The Family. In one thousand, nine hundred and ninety, they reunited for their next album \"Pandemonium\"- a project that was devoid of Prince's influence save for being released on this Paisley Park record label. After twenty years, the original lineup reformed. but there was one small problem. Due to Prince owning the legal rights to their name, they decided to change it to The Original sevenven and released the first album under their new name \"Condensate\". On the new recording Jimmy Jam & Terry Lewis handle most of the production with additional help on a few songs from Jesse Johnson. They start the album off with the song \"Strawberry Lake\", which sounds like a strange fusion of Prince's \"one thousand, nine hundred and ninety-nine\" as well as Sly & The Family Stone's \"Everyday People\". On the title track \"Condensate\", Morris responds to critics who wonder if they still have it. On the first single \"#Trendin'\", they using about their importance in the page of social media. Morris tries to woo a potential girlfriend on \"If I Was Yo Man\" and get sensual on \"Role Play\". They bring in a few rock inspired songs on there, such as female form admiring \"Sick\" and Morris confronting a woman who's hiding her past on \"AYDKMN\". They pay tribute to backstage groupies on \"Toast To The Party Girl\", a song that sounds noticeably similar to Coldplay's \"Viva La Vida\". They bring in the double entendres in full force on \"Cadillac\", and speak of a woman who's infatuated with material things on \"Lifestyle\". The Original sevenven's \"Condensate\" is a listenable album when they are doing what they know best. However, on a few songs, they sound out of place trying to keep up with the times. Still in all, despite the name change nothing has really changed for the band. They still sound sleazy and play funky- something that's been their trademark for thirty years.","overall":4,"summary":"The Time return as The Original 7ven for their new album \"Condensate\"","unixReviewTime":1341705600,"reviewTime":"07 8, 2012"}
{"orig_index":61159,"reviewerID":"A92F571Y9MTW6","asin":"B005I4UM1K","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"The Original sevenven's \"Condensate\" is a listenable album when they are doing what they know best . They still sound sleazy and play funky- something that's been their trademark for thirty years . After twenty years, the original lineup reformed .","overall":4,"summary":"The Time return as The Original 7ven for their new album \"Condensate\"","unixReviewTime":1341705600,"reviewTime":"07 8, 2012"}
{"orig_index":61159,"reviewerID":"A92F571Y9MTW6","asin":"B005I4UM1K","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"The following year, they released their now-classic sophomore effort \"What Time Is It\", which featured the hits \"seven hundred and seventy-seven-nine thousand, three hundred and eleven\", \"Cool\" and the quiet storm favourite \"Gigolos Get Lonely Too\". They start the album off with the song \"Strawberry Lake\", which sounds like a strange fusion of Prince's \"one thousand, nine hundred and ninety-nine\" as well as Sly & The Family Stone's \"Everyday People\". In one thousand, nine hundred and ninety, they reunited for their next album \"Pandemonium\"- a project that was devoid of Prince's influence save for being released on this Paisley Park record label. They bring in a few rock inspired songs on there, such as female form admiring \"Sick\" and Morris confronting a woman who's hiding her past on \"AYDKMN\". They bring in the double entendres in full force on \"Cadillac\", and speak of a woman who's infatuated with material things on \"Lifestyle\". They pay tribute to backstage groupies on \"Toast To The Party Girl\", a song that sounds noticeably similar to Coldplay's \"Viva La Vida\". Despite gaining the biggest hit of their career with \"Jungle Love\", they decided to call it a day in early one thousand, nine hundred and eighty-five.","overall":4,"summary":"The Time return as The Original 7ven for their new album \"Condensate\"","unixReviewTime":1341705600,"reviewTime":"07 8, 2012"}
{"orig_index":61952,"reviewerID":"A234IZP4U2Y0OQ","asin":"B007CKNX28","reviewerName":"Luke \"luke\"","helpful":[3,6],"reviewText":"This cd did not hit me like this others. First thing I noticed off this listen is jack's not doing what the did on other cd's but diving deeper into this music catalogue. The catchy choruses of \"Many shades of black\" for infectious bass of seven nation was not there. What is there are the lyrics and storytelling for your ass and a musician weaving in old I mean old country time blues then current rock in' roll and folk songs done perfectly. Most of the songs on this cd somehow put me in the same mindframe of that song about the Milk man and the boy killing on Carolina Drama. Songs like Poor boy are catchy but some of the songs I actually love best are the jones without the catchy choruses (hypocritical kiss, i'm shaking). Basically this is how the cd hit me. oneMissing pieces caught my year as an uptempo rock in'roll song with a beat that seems a little bit off from catching itself but completely works the beat is very catchy but the's telling a great story that does't blend you to be table to using with the chorus, but listen greatfully. Great song, liked it first listen and it had me thinking the whole album would move in this direction. twoSixteen saltines is that hard fast garage rock (tone similar to fell in love with a girl). This song gives the album that punch and fast space. threeFreedom at twenty-one is him singing in a wrap-like stone that works because of the style of singing voice the uses. It helps to add diversity to the album since the uses a choppy singing voice for most of the cd. fourI'm sure everyone's heard love interruption. Great song. fiveBlunderbuss is somewhat reminiscent of a Led Zepellin song that never was. Jack sings on this song and sings in a talking voice over a grand piano and violin. The melody is hypnotic and folksy. \"doing what two people need is never on my menu,\" that line is award but describes this attitude to me. sixHypocritical kiss starts off like it's gonna be symphonic the way the piano introduces itself with a flushing of the keys it leads up to the epicness of a guy having an argument with this girl about why the's right and she's wrong. This is a song that is needed during a time when so many men want to using apology songs about how men are wrong and stupid. Love this song, it reminds me i'm a man and have the right to be right (haha). sevenWeep themselves starts off with guitars, piano and drums that somehow make me feel like I'm in a western showdown. Jack speaks of beating this girl up in the first line and talks bad about the guys who are suckers for love. He's not really singing in this song, but like announcing in a singing stone things that are about men's feelings of the world and relationships. It's a song that takes a stand about the choice of how men decide to be a specific type of man and what they can expect for consequences. weightI'm shaking makes me feel like I'm trapped in drag time song in the twenty's and seventy's somehow as the describes how a woman makes him feel great and the's shaking from bad nerves. He likens this nervous wreck to leaves on a tree shaking but the's jumping from insecurity and likes it. This is an old time style of song and works for where the rest of the album goes. ninetrash tongue is like a Little Richard song. God only knows when I heard someone sound like little richard (maybe Awol Nation) on that one song. He's telling a song about some monkeys, the breaks into old time piano playing and tambourines. I think i even hear a banjo. This is like some old time Chuck Berry Rock in'roll stuff with Jack growling out blues singing on an rock song. I wanted to hear him scream on this one for have some more fun with it, but it seemed like the was trying to focus on making the song authentic. ten this song starts off like i'm on a carousel but then leads it's way into being a ballad and then reveals itself to be a definite folk song with a banjo for very old guitar a simple piano playing and a catchy as hell chorus. Jack sings and tells the story of a poor boy. This song is an easy going, uptempo, fun song to me. Some of the greatest love songs are the jones that don't praise love for speak of the good side. eleven this song is like an old gospel one thousand, nine hundred and ten song with folk song lyrics. I hate to put it that far back but I listen to a lot of music and this is definitely Jack showing the can take a song from one thousand, nine hundred and ten and somehow bring Queen remnants out then the original jack white somehow turning this into a lullaby. This song works on so many levels. I wish I was smoking, but that past is gone for me. I would like to know what the was smoking to go there with it though. twelveon and on \"sun and the moon never change, they just rearrange,\" parables, philosophies sung in a tenor, a duet partially in harmony, a soft song crooning then changes to somewhat a mix of a jazz, psychedelic rock song. This song just starts to cement the continuity of listenability of the cd that lets you know that no song is going to make it so you don't feel the album. thirteen is probably my favourite because of the very weird harmony the uses. It's jazzy and psychedelic, sorry to say that again but it uses jazz keys and I don't even listen to jazz. it just is. The only thing rock and roll about the song is Jack's singing in the send. This song is a using-a-long song and makes you want to be on the road looking at cornfields and blue skies. The send of the song breaks into a zepellin type rocking out to send the song of with probably one of the most pleasant unique falsetto and harmonies i've heard in a while. Perfect way to send of the cd. To summarize it all I wanted to hear Jack really showcase this vocal range and using steady long notes and harmonies (like many shades of black) instead the used a choppy singing voice most of the time. I wanted to hear choruses from White Stripes Elephants that make you incapable of getting the song out your head. Instead the introduced me to what seems to be a very natural place for him musically, but new to my year. It took a lot of listening until I could hear and love what the was doing. He somehow updated the oldest blues, before Muddy Waters, and brought in himself Jack and one thousand, nine hundred and sixty's seventy's psycadelic era. He left out the eighty's vibe completely that some of this other cd's gave to. Eclectic cd that shows Jack is a musician that has influences but is so educated in music that the is creating, recreating and making style of completely this own. So many of this songs do this that I just have to give him the credit for being one of the greatest musicians out there today. Great masterpiece classic.","overall":5,"summary":"11times i didn' like it 12th time i loved it","unixReviewTime":1335571200,"reviewTime":"04 28, 2012"}
{"orig_index":61952,"reviewerID":"A234IZP4U2Y0OQ","asin":"B007CKNX28","reviewerName":"Luke \"luke\"","helpful":[3,6],"reviewText":"the catchy choruses of \"Many shades of black\" for infectious bass of seven nation were not there. jack sings in a talking voice over a grand piano and violin. \"doing what two people need is never on my menu,\" that line is award but describes this attitude.","overall":5,"summary":"11times i didn' like it 12th time i loved it","unixReviewTime":1335571200,"reviewTime":"04 28, 2012"}
{"orig_index":61952,"reviewerID":"A234IZP4U2Y0OQ","asin":"B007CKNX28","reviewerName":"Luke \"luke\"","helpful":[3,6],"reviewText":"twelveon and on \"sun and the moon never change, they just rearrange,\" parables, philosophies sung in a tenor, a duet partially in harmony, a soft song crooning then changes to somewhat a mix of a jazz, psychedelic rock song. eleven this song is like an old gospel one thousand, nine hundred and ten song with folk song lyrics. weightI'm shaking makes me feel like I'm trapped in drag time song in the twenty's and seventy's somehow as the describes how a woman makes him feel great and the's shaking from bad nerves. ten this song starts off like i'm on a carousel but then leads it's way into being a ballad and then reveals itself to be a definite folk song with a banjo for very old guitar a simple piano playing and a catchy as hell chorus. He somehow updated the oldest blues, before Muddy Waters, and brought in himself Jack and one thousand, nine hundred and sixty's seventy's psycadelic era. He's not really singing in this song, but like announcing in a singing stone things that are about men's feelings of the world and relationships. oneMissing pieces caught my year as an uptempo rock in'roll song with a beat that seems a little bit off from catching itself but completely works the beat is very catchy but the's telling a great story that does't blend you to be table to using with the chorus, but listen greatfully.","overall":5,"summary":"11times i didn' like it 12th time i loved it","unixReviewTime":1335571200,"reviewTime":"04 28, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"Make way, this is the truest most talented. Reagan babies look out. Kendrick is not messing around. He is ready and primed. No homos, I love this man. He's jus killing' it. This is an instant classic, no doubt about it. I loved Section eighty, but this is far beyond any of my expectations. Lamar is a KING","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"roland martin: this is an instant classic, no doubt about it. martin: lamar is a KING. the's a KING. the's a KING. martin: the's a KING. the's a KING.","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"I loved Section eighty, but this is far beyond any of my expectations. Make way, this is the truest most talented. No homos, I love this man. This is an instant classic, no doubt about it. He's jus killing' it. Reagan babies look out. Kendrick is not messing around.","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"Kendrick is not messing around. He is ready and primed. No homos, I love this man. He's jus killing' it. This is an instant classic, no doubt about it","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"The name of the song says it all. Bruno is a wonderful artist and uses this talent well. I believe the young man is going to be in the spotlight for a long time.","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"I believe the young man is going to be in the spotlight for a long time. Bruno is a wonderful artist and uses this talent well. The name of the song says it all.","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"Bruno Bruno Ferdinand is a wonderful artist and uses this talent well, says singer . Bruno is going to be in","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"Bruno is a wonderful artist and uses this talent well. the is going to be in the spotlight for a long time.","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}