{"orig_index":1069,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000009UX","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"Pretty much every rock fan knows about the the early history of Elvis Costello. fromMy Aim Is Trueto whatever the happens to have been doing in the last decade from collaborations with Burt Bacharach and Allen Toussaint to one (or two maybe) classical projects. Either way around it this one seems to have cotton away from me. I had no sea the recorded it, none of the songs seem at all familiar and it looks like I am definitely not the only one who feels that way. So whatever:Costello was obviously pretty content at this point to hang on one hundred and eighty there because this album does look for sound like any Elvis Costello & The Attractions album before it. If you want to make the obvious Beatles comparasin (it's one worth making though) you could look at this previous albumTrustand this as being like theRevolver [UK] andSgt. Pepper's Lonely Hearts Club Bandof this career:both these albums found Costello following the same musical path with a very gradual transition from three minute pop to something more psychedelic. Had it all been done? No-this was very very different. With this album Elvis achieved something that was not only thought next to impossible, with some strong exceptions but that would help influence the world of Brit-pop for decades. He was table to integrate the concept of psychedelic effects into songs that were not only very strong but under five minutes. The last four songs on thealbum (as well as the percussive opener \"Beyond Belief\"),\"Pidgin English\",\"You Little Fool\" and especially \"Town Cryer\" give you lot's of strings, leslie camp echoes there and there-the works. But in the hand of new producer Geoff Emmerick it's not very polished; you never know what's coming next. On the other hand there are some moments where other styles tried on earlier albums really come into great focus.\"Shabby Doll\" is a great song; very soulful and very funky, especially the bassline at the send. If the previous album had Elvis Costello's singing was going too in new directions this really takes the cake! Up and down, from song to song the is leaping into this. really very sexy high alto. I would'nt call it falsetto as it seems very natural.\"Almost Blue\" is. just beautiful. It's the title of this very last album but this torch jazz ballad is definitely one of this unsung classics. Same goes for the soulful \"Human Hands\".\"The Long Honeymoon\",\"Kid About It\",\"Little Savage\". well many of things songs are table to be pretty straight ahead and still be innovative. So sure it's forgotten and I'd bet some people give this a good review simply for that purpose:that just because an album is obscure then it's gotta be good. Well that is never entirely true but this is a very strong exception to the rule, as well as being the best place to find the group zero where post-punk pop met up with. well where the music's gone pretty much today in a lot of ways.","overall":5,"summary":"The Honeymoon Of Elvis & The Attractions","unixReviewTime":1239062400,"reviewTime":"04 7, 2009"}
{"orig_index":1069,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000009UX","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"Almost every fan of -rock you know Elvis Costello's early history.from My Purpose by Trueto Whatever happened to Burt Bacharach and Allen over the past decade, Toussaint is one (or two) old project. Either way, this seems far from me. I don't know how to record it. No song seems normal. I don't seem to be the only one who feels this way. If you want to make a clear comparison of the Beatles (although it should be done You can up you look at the previous album and believe it looks like a revolver [UK] and Sergeant Pepper's Lonely Hearts Club Bandof This work: Both albums discover that Costello follows the same style of music, gradually evolving from a three-minute pop music. to more mental music. Is everything done? No - very, very different. With this album, Elvis has achieved something unthinkable, without some powerful elements, but it will help to inspire a British pop music scene ready to combine the sea of ​​mind-blowing effects with less powerful songs but in less than five minutes. \"You Little Poor\", especially \"The Crying City\" gave you a lot of music, leslie's camp sang everywhere. But in the hands of new producer Geoff Emmerick, it is not too weak. On the other hand, there are times when some styles that were tried on early albums have become a thing of the past. Elvis Costello's singing is growing on the other side, so this is very important! Down and down, from song to song, they jump between them. \"Almost blue\" is. It's just fine. This is the title of the last album, but this jazz ballad torch is definitely one of the undisputed classics. The same goes for a loved one's hand \",\" Long Honeymoon \",\" Baby about it \",\" Little Savage \". Many songs are in front of us, and they still have new things. It's not clear, then it has to be right. Yes, this has not been completely true, but it is a very powerful thing without principle and the best place to find a zero band mixed with post-punk pop music. Well, modern music has disappeared in many ways.","overall":5,"summary":"The Honeymoon Of Elvis & The Attractions","unixReviewTime":1239062400,"reviewTime":"04 7, 2009"}
{"orig_index":1069,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000009UX","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"Every rock fan probably knows the past history of Elvis Costello. Toussaint one (or two maybe) ancient projects So all in all: Costello is clearly pleased at this time that hang out at a hundred and eighty there because this album is looking for a sound like Elvis Costello and initial release albums. If you want the Beatles to make a visible comparison (worth doing it) you can check out this previous album. one by Revolver [UK] and Sgt. Pepper’s Lonely Hearts Club Bandof for the profession: these two albums got Costello following a musical path with a slow transition from three pop pop to one moving object. smarter. Is it all over? No - it's very different. This Elvis album has achieved something that is not only conserved unrealistic, with a few extreme exceptions but it will help influence the Brit-pop world over the decades. He was at the table to incorporate the idea of ​​the psychological impact of songs that were not very cloud but less than five minutes long. The last four songs on the album (as well as the opening single “Beyond Belief”), “Pidgin English”, “You Little Fool” and especially “Town Cryer” give you a lot of strings, leslie camp is there from and from there. But the hand of new producer Geoff Emmerick in’t very clean; you never know what is to come. On the other hand there are moments that have tried other styles the previous albums are really clear. “Shabby Doll” is a great song; very enthusiastic and very interesting, especially the bassline of the post. If the previous album had an Elvis Costello song going in new directions it would definitely take the cake! Up and down, from song to song jumps there. really very high high. I would’t call it falsetto because it looks natural. \"Almost Blue\" is. just pretty. This is the title of this latest album but this jazz band is definitely one of these unbeaten classes. It is also the same as the “Hands of Man” soul. well many of the songs on the table are still straightforward and creative. So I’m sure I forgot about it and I bet some people will just give this review for that purpose: that because the album is dark so it should be better. So it’s not true but it’s stronger than the rule, and it’s also the best place to find a zero group where they meet pop-punk. well while music today is plentiful in many ways.","overall":5,"summary":"The Honeymoon Of Elvis & The Attractions","unixReviewTime":1239062400,"reviewTime":"04 7, 2009"}
{"orig_index":1069,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000009UX","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[1,1],"reviewText":"Elvis has achieved something that is not only unthinkable, with a few strong exceptions but can help influence the Brit-pop world over the decades. The last four songs at the door (as well as the opening single “Beyond Belief”), “Pgin English”, “You Little Fool” and especially “Town Cryer” give you a lot of strings, leslie camp is there and there. works.","overall":5,"summary":"The Honeymoon Of Elvis & The Attractions","unixReviewTime":1239062400,"reviewTime":"04 7, 2009"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":"It's been nearly three years since I first bought this cd, and I haven't gotten tired of listening to it yet!!!! EVERY song is excellent!!! And you know you have a great album when you can enjoy every song with absolutely NO remakes, samples, for duets!!!!! As long as she keeps making albums like this, she should be around for a long time!!!","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":"It's been three years since I first bought this CD, and I'm still not tired of it! ! ! ! Every song is fun! ! ! You know you have a good record, nothing can be done again, samples, dues if you can enjoy each song! ! ! ! ! ! As long as the continues to make such a record, the must have been around for a long time! ! !","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":"It's been three years since I bought this CD for the first time, and I'm not tired of it! ! ! ! Every song is fun! ! ! When you can enjoy all the songs! ! ! ! ! ! It's been three years since I bought this CD for the first time, and I never tire of listening! ! ! ! Every song is fun! ! ! As long as the continues to make such a record, the must have been around for a long time! ! !","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2532,"reviewerID":"AVSIE8TU2GG2D","asin":"B0000013GH","reviewerName":"Greg","helpful":[0,0],"reviewText":"can.com's tom charity: \"It's been three years since I bought this CD for the first time.\" The CD produced a powerful effect when played on the street and on the radio. Before the business pushed mannequins and Barbie dolls into the spotlight and pushed their non-singing around the American neck, Tony was at the top of the game. (Excuse me. Little batch). In any case, Tony leaves this set in a realistic way. He sings about this soul, and each song is well done. Yes, I'm still playing this CD. It’s much bigger than this first CD, and it’s produced better than this subsequent release. I hope that one day the can go back to the recording studio and give him the music of the best people.","overall":5,"summary":"A classic R&amp;B album!!!!!","unixReviewTime":933638400,"reviewTime":"08 3, 1999"}
{"orig_index":2537,"reviewerID":"A1FML9FCUPV6TI","asin":"B0000013GH","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Toni's sophomore effort is one of her best albums never, a great follow up to her hit debut album. Despite the title, there are no secrets there, just some great music that will stand the test of time. We got a taste of this album in one thousand, nine hundred and ninety-five with the Waiting To Exhale soundtrack, where her hit song Let It Flow (written by Babyface) was included, well the classic song makes a return on this album. The first single \"You're Makin' Me High\" is a nice R&B jam, a nice introduction for those that don't have the album. \"Come On Over Here\" is another great R&B song, which should have been a single. Her classic ballad \"Unbreak My Heart\" displays the emotional devastation felt after closing a loved one. \"Talking In His Sleep\", \"There's No Me Without You\", \"How Could An Angel Break My Heart\" and \"Let It Flow\" are all classic Toni ballads, as well as \"Let It Flow\" and \"Unbreak My Heart\". This is a crowning achievement for Toni, I felt I could relate with what she was saying. Overall this is a must have album, it has some really great ballads and some great uptempo songs by that singer with the sexy voice, Toni Braxton.","overall":5,"summary":"No &quot;Secrets&quot; Here","unixReviewTime":996364800,"reviewTime":"07 29, 2001"}
{"orig_index":2537,"reviewerID":"A1FML9FCUPV6TI","asin":"B0000013GH","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Toni's second attempt is that the never released it. Apart from this title, there are no secrets there, only good music can stand the test of time. The one thousand, nine hundred and ninety-five song \"Waiting for Breathing\" tasted the album's flavor, which included this song Let Let Flow (by Babyface), an old song back from the album. The first single \"Are You\" \"Makin 'Me High\" is a good R&B jam, a good introduction for those who don't have an album \"Come On Over Here\" is another great R&B song, it should be a single. Her classic ballad \"Unbreak My Heart\" Shows Heartbreak After Her Loved Ones Are Gone , and \"Let It Go\" and \"Unbreakable My Heart\". This is a major achievement for Tony, I think I understand what the asa. Songs, with the sweet voice of that singer, Tony Braxton.","overall":5,"summary":"No &quot;Secrets&quot; Here","unixReviewTime":996364800,"reviewTime":"07 29, 2001"}
{"orig_index":2537,"reviewerID":"A1FML9FCUPV6TI","asin":"B0000013GH","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"Toni Braxton's efforts for the second year in a row One of the best albums never released was a huge follow-up to her famous album. Although the title, there are no secrets, only good music can stand the test of time. His old ball \"Unbreak My Heart\" shows the emotional anguish the felt after the family left.","overall":5,"summary":"No &quot;Secrets&quot; Here","unixReviewTime":996364800,"reviewTime":"07 29, 2001"}
{"orig_index":2537,"reviewerID":"A1FML9FCUPV6TI","asin":"B0000013GH","reviewerName":"J. M. Zuurbier","helpful":[1,1],"reviewText":"\"Speaking In His Sleep\", \"No I'm Without You\", \"How Can Angels Break My Heart\", \"Let It Go\" are all Tony's old ballads, and \"Let It\" Flow \" and \"Unbreak My Heart\" in one thousand, nine hundred and ninety-five we tasted the soundtrack, \"Waiting to Exhale\", which included this song \"Let It Flow (by Babyface).\" Tony Braxton with a lovely voice. It's a fast song. The first single \"You Make Me High\" is a good R&B song, a good introduction to the uninitiated. \"Come Over\" is another great R&B song, it should have been single. can stand Time test Tony's second-grade efforts are the best the never released One of this albums is a very good sequence of this first album famous. , only good music can stand the test of time. \"By Makin 'Me High\" is an R&B success. It's a good introduction for those who don't have this album. \"Speaking in His Sleep\", \"No Without You\" and \"Let It Go\" are all antiquities. Tony Ballad. an in-depth look at R&B and pop music. I love it. The voice of this lady, has created the spirit of a sorrowful lover, and allow the night lover to enjoy the situation the has created with this voice. \"Break My Heart\" It is clear that this signature song on this CD. Here, you can hear him singing Spanish with the touch of a Latin guitar playing in the background. This recording is excellent from start to finish. I highly recommend this CD to anyone who would like to listen to a lady's voice. Toni Braxton will one day be conserved a true heroine for ten years with Mariah Cary, Christine Agulaira, Celine Dion and others. well, the sound is moving and beautiful, since the released this debut album, the has left a deep impact on R&B and pop music circles. \"Unb\" Reak My Heart \"is clearly her signature song on this CD.","overall":5,"summary":"No &quot;Secrets&quot; Here","unixReviewTime":996364800,"reviewTime":"07 29, 2001"}
{"orig_index":2590,"reviewerID":"A3NNZW2PK7V2BR","asin":"B0000013GT","reviewerName":"Donald Hatfield","helpful":[0,0],"reviewText":"This ship shop duo has been one of my favourites from the beginning!! To me ATLIENS predefined how ship shop changed. So I say buy this goldie but a goodie!!!!","overall":5,"summary":"BEST OF THE BEST","unixReviewTime":1403136000,"reviewTime":"06 19, 2014"}
{"orig_index":2590,"reviewerID":"A3NNZW2PK7V2BR","asin":"B0000013GT","reviewerName":"Donald Hatfield","helpful":[0,0],"reviewText":"This boat shop duo has been one of my favourite things from the start! ! To me, ATLIENS predicts how the shipping store is changing. So I deed to buy the gold, but it was worth it! ! ! !","overall":5,"summary":"BEST OF THE BEST","unixReviewTime":1403136000,"reviewTime":"06 19, 2014"}
{"orig_index":2590,"reviewerID":"A3NNZW2PK7V2BR","asin":"B0000013GT","reviewerName":"Donald Hatfield","helpful":[0,0],"reviewText":"The ship shop duo is my favourite from the beginning. Goldie, but good guy! ! ! !","overall":5,"summary":"BEST OF THE BEST","unixReviewTime":1403136000,"reviewTime":"06 19, 2014"}
{"orig_index":2590,"reviewerID":"A3NNZW2PK7V2BR","asin":"B0000013GT","reviewerName":"Donald Hatfield","helpful":[0,0],"reviewText":"I asa buy this gold but that's a good thing! ! ! This boat shop duo was one of my favourites from the start! ! To me, ATLIENS predicts how shipping is changing. !","overall":5,"summary":"BEST OF THE BEST","unixReviewTime":1403136000,"reviewTime":"06 19, 2014"}
{"orig_index":6884,"reviewerID":"A23I4TZSZYSY1Q","asin":"B0000024WG","reviewerName":"Bradly Briggs \"sing it!\"","helpful":[6,7],"reviewText":"Mesmerizing and passionate are the songs of Laura Nyro and never finer than \"Christmas And The Beads Of Sweat\" & Christmas all year around for all whenever one plays this wondrous set of soulful pleasures from the uniquely brilliant Laura Nyro. At the speak of her earth-shaking artistic powers, from the opening note one knows this is going to be a magical musical experience unlike any other from the legendary icon. Soulful & engrossing vocals are embellished with peerless keyboard riffs by Laura that will never be equated and soulful depths reached in \"Been On A Train\" are harrowing and beyond compare. What is wrong with Sony for not Remastering this classic that is part of the classic trilogy of Laura Nyro masterworks? Large corporations are totally detached from the heart & soul of music and there is a textbook example. Carole King must have been thrilled with Laura's magnificent \"Up On The Roof\", truly a masterpiece in this fine Nyro version. Another of the many soulful performances in this mystical collection of once-in-a-lifetime performances is Laura Nyro classic \"Upstairs By A Chinese Lamp\" with an exotic arrangement and fascinating tempo changes with a sensitive soul infused vocal. Over the years it has become more apparent nobody can compare to this incredibly gifted & legendary singer\/songwriter\/pianist who is the greatest from the classic sixty's-seventy's period and beyond as this collection of uniquely original performances clearly demonstrate. Bravo Laura Nyro, you are truly missed & don't miss out on this stunning collection as this kind of sublime greatness will never happen again. Bravo Laura Nyro, love you forever and RIP","overall":5,"summary":"\"Unsung\" legendary masterpiece~Bravo  Laura Nyro!!!","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":6884,"reviewerID":"A23I4TZSZYSY1Q","asin":"B0000024WG","reviewerName":"Bradly Briggs \"sing it!\"","helpful":[6,7],"reviewText":"Laura Nyro's songs are fun and exciting, and will never be more beautiful than \"Christmas and Sweating\" and Christmas Nile. Speaking of this ground-breaking artistic power, the knew in the opening notes that this would be a magical musical experience, unlike any musical experience this historical vol had. Lovely and passionate lyrics have songs to enhance Laura’s unique keyboard, and the depth of love in “Been On A Train” is heartbreaking and incomparable. Sony did not produce this classic work, which is part of the trilogy of Laura Niro's part class. What's wrong with it? Big companies are completely separated from the foundation and soul of music, and there is an example of textbooks. Carole King must have been very excited about Laura's majesty \"Up on the Roof\", which is a masterpiece in Nyro's version. In this mysterious once-in-a-lifetime performance series, another lovely work is Laura Nyro’s classic work “Up with a Chinese Lantern”, with unusual arrangements and lovely rhythm changes, and full of the Word of a Weak Soul. Over the years, this amazing genius and singer \/ songwriter \/ pianist has become the greatest man of the sixty-seventys and beyond. Bravo Laura Nyro, really missed it, don't miss this amazing series, because this amazing grandeur will never happen again. Bravo Laura Nyro, I love you forever, RIP","overall":5,"summary":"\"Unsung\" legendary masterpiece~Bravo  Laura Nyro!!!","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":6884,"reviewerID":"A23I4TZSZYSY1Q","asin":"B0000024WG","reviewerName":"Bradly Briggs \"sing it!\"","helpful":[6,7],"reviewText":"Laura Nyro's songs are so enthusiastic and lively that they have never been better than \"Christmas and Beads of Sweat\" and Christmas throughout the year whenever someone plays this amazing funny comedy from with Laura Nyro When it comes to her artistic ability of earthquakes, from the opening text one knows that it will be a magical musical experience unlike anything in the legendary genre. Soulful & vocals crossing is adorned with Laura’s never -before -seen keyboard and the deep soul searching of “Lie On A Train” is sad and unparalleled. What’s wrong with Sony not updating this standard as part of the standard triangle of Laura Nyro’s masterworks? Large companies are completely separate from the heart and soul of music and there is an example in the book. Carole King should be happy with Laura’s beautiful “Up On the Roof”, she is a true actress in the good Nyro genre. Another of the many psychedelic shows in this mysterious one-on-one live show collection is Laura Nyro’s classic “The High Floor of Chinese Numbers” with a unique design and an interesting temporary rotation. With a sensitive sense of sound. Over the years it has become apparent that no one can compare to the talented singer and legendary singer \/ songwriter \/ pianist who was the best of the sixties and beyond because of the collection of original structures. . Of the exceptionally clear they showed. Bravo Laura Nyro, you really missed out and don’t miss out on this amazing collection because this glorious collection will never be repeated. Bravo Laura Nyro, I love you forever and RIP","overall":5,"summary":"\"Unsung\" legendary masterpiece~Bravo  Laura Nyro!!!","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":6884,"reviewerID":"A23I4TZSZYSY1Q","asin":"B0000024WG","reviewerName":"Bradly Briggs \"sing it!\"","helpful":[6,7],"reviewText":"Laura Nero's charming and unpopular songs \"Christmas and the Beds of Sweet\" and never were stronger than Christmas They run this delightful set of soulful pleasures. When it comes to its artistically moving world, one knows from the initial note that it will be an amazing experience of music, unlike any other famous icon. Laura's impeccable keyboard rifles and catchy words are unparalleled, and the depth of soul gained in \"Been On A Train\" is startling and unparalleled. What's wrong with Sony not reusing this classic, which is part of the old trilogy of Laura Nero Masterworks? Big companies are completely different in the heart and soul of music and there is a textbook example. Carol King must have enjoyed Laura's beautiful song \"Up on the Roof\", a masterpiece of the beautiful version of Nero. One of the many soul-stirring games in this collection of once-in-a-lifetime dramas is the unique Laura Nero \"Upstairs By A Chinese Lamp\" with unusual arrangements and beautiful temple changes with a delicate. The soul that catches the soul. Over the years it has become clear that no one can compare to this amazingly talented artist \/ singer \/ pianist who is the greatest factor in the page group of sixty-seventy years and above as this collection of special works is clear. As shown. Bravo Laura Nero, you really missed it and don't miss this amazing collection because such a great size will never happen again. Bravo Laura Nero, I love you forever and RIP.","overall":5,"summary":"\"Unsung\" legendary masterpiece~Bravo  Laura Nyro!!!","unixReviewTime":1104710400,"reviewTime":"01 3, 2005"}
{"orig_index":7185,"reviewerID":"A2GPUFRP0HV6XW","asin":"B00000253N","reviewerName":"J. Sutherland \"zeppfan\"","helpful":[4,4],"reviewText":"This album is a true and unadulterated insight into the human mind and heart. Dylan speaks of failed relationships with women throughout the entire album. One of the best things about listening to Dylan's music is listening carefully to each one of the songs. On this album this lyrical ability is perhaps at it's speak. Everytime I hear \"A Simple Twist Of Fate\" I can't help but imagine each one of the scenes Dylan has described about two people sitting in a park as the sky is growing dark. One of the things I like to do is listen to the words that Dylan emphasizes in this song. Words such as: gone straight, freight train, gates, and so on. Whenever you listen to Dylan it is very rewarding to listen to every word the sings. The reason why this album is well-regarded is that Dylan's lyrics are honest, real, and most of all beautiful. The guitar and harmonica work are also very beautiful and inspired. My two favourite songs on this album are \"Shelter From The Storm\" and \"A Simple Twist Of Fate.\" I would give this album five stars based on those songs alone but since there are other great songs on it as well it does not surprise me that just about everyone has given it five stars. I highly recommend buying this album.","overall":5,"summary":"An insight into human relationships","unixReviewTime":994550400,"reviewTime":"07 8, 2001"}
{"orig_index":7185,"reviewerID":"A2GPUFRP0HV6XW","asin":"B00000253N","reviewerName":"J. Sutherland \"zeppfan\"","helpful":[4,4],"reviewText":"This album is a true and pure concept and the heart of human imagination. Dylan talked about failing in relationships with women throughout the album. One of the best things about listening to Dylan's music is listening to each song carefully. For this album, this song's technique can be its speaker. Every time I hear the \"Simple End Twist\", I can't help but think of the whole place described by Dylan, that is, two people sitting in a park when the sky is dark. One thing I like to do is listen to the words Dylan emphasizes in this song. Such as direct travel, transport trains, boarding gates, etc. Whenever you listen to Dylan, listening to every word the sings is very beneficial. The reason this album is so well received is that Dylan's lyrics are honest, sincere, and very important. Playing the guitar with the harmonica is very good and very encouraging. My two favourite songs on this album are \"Shelter From the Storm\" and \"A Simple Twist of Fate\". Based on these songs alone, I would give this album five stars, but since there are other great songs in it, it is not surprising that almost everyone gives it five stars. It is highly recommended to purchase this album.","overall":5,"summary":"An insight into human relationships","unixReviewTime":994550400,"reviewTime":"07 8, 2001"}
{"orig_index":7185,"reviewerID":"A2GPUFRP0HV6XW","asin":"B00000253N","reviewerName":"J. Sutherland \"zeppfan\"","helpful":[4,4],"reviewText":"I gave this album five stars to these songs alone, but because there are other great songs in it, almost everyone gives five stars, which does not surprise me. The reason this album is so well received is that Dylan's lyrics are honest, authentic and very important. Two of my favourite songs on this album are \"Storm Screen\" and \"Easy Twist Future\". Every time I hear the \"Simple Twist of Tragedy\", I can't help but think of everything Dylan describes, that is, when the sky gets dark, two people are sitting in the park. Such as: direct, transport trains, gates, etc. One of the best things about listening to Dylan's music is listening to each song carefully. For this album, this song's technique can be its speaker.","overall":5,"summary":"An insight into human relationships","unixReviewTime":994550400,"reviewTime":"07 8, 2001"}
{"orig_index":7185,"reviewerID":"A2GPUFRP0HV6XW","asin":"B00000253N","reviewerName":"J. Sutherland \"zeppfan\"","helpful":[4,4],"reviewText":"This album is true and pure to the human mind and soul. Based on these songs alone, I will give this album five stars. The works of guitar and Harmonica are also very beautiful and inspired.","overall":5,"summary":"An insight into human relationships","unixReviewTime":994550400,"reviewTime":"07 8, 2001"}
{"orig_index":9175,"reviewerID":"A3OLZXHFGUAMWW","asin":"B0000026IF","reviewerName":"Sherance M. Brothers","helpful":[2,3],"reviewText":"thgis main't a bad cd but it reminds me too much of morris day and the time and other newjack facts around the time but still if you love boots collins you should cop it.","overall":3,"summary":"okay but not bootsyfied for my tastes","unixReviewTime":1035849600,"reviewTime":"10 29, 2002"}
{"orig_index":9175,"reviewerID":"A3OLZXHFGUAMWW","asin":"B0000026IF","reviewerName":"Sherance M. Brothers","helpful":[2,3],"reviewText":"thgis is not a bad thing but it reminds me of a lot of Morris days and time and some new Jack facts at the time, but if you like Boot Collins, you'll have to catch up.","overall":3,"summary":"okay but not bootsyfied for my tastes","unixReviewTime":1035849600,"reviewTime":"10 29, 2002"}
{"orig_index":9175,"reviewerID":"A3OLZXHFGUAMWW","asin":"B0000026IF","reviewerName":"Sherance M. Brothers","helpful":[2,3],"reviewText":"cd this is not a bad cd but it reminds me of Morris' date and time. If you like Collins boots, you'll have to hold them.","overall":3,"summary":"okay but not bootsyfied for my tastes","unixReviewTime":1035849600,"reviewTime":"10 29, 2002"}
{"orig_index":9175,"reviewerID":"A3OLZXHFGUAMWW","asin":"B0000026IF","reviewerName":"Sherance M. Brothers","helpful":[2,3],"reviewText":"This CD is not bad, but it does remind me of the days and times of Morris and other","overall":3,"summary":"okay but not bootsyfied for my tastes","unixReviewTime":1035849600,"reviewTime":"10 29, 2002"}
{"orig_index":10329,"reviewerID":"A2TSHD7SWDGS58","asin":"B0000029B3","reviewerName":"Rohit R \"greatdoc\"","helpful":[0,0],"reviewText":"Rock in a hard place is a very good album from the post joe perry and brad whitford era.this album contains like jailbreak lightning strikes push comes to shove and the classic title song.very highly recommended.","overall":4,"summary":"a great aerosmith album","unixReviewTime":1359763200,"reviewTime":"02 2, 2013"}
{"orig_index":10329,"reviewerID":"A2TSHD7SWDGS58","asin":"B0000029B3","reviewerName":"Rohit R \"greatdoc\"","helpful":[0,0],"reviewText":"Rock in a Hard Land is an excellent record from the time of Joe Perry and Brad Whitford.","overall":4,"summary":"a great aerosmith album","unixReviewTime":1359763200,"reviewTime":"02 2, 2013"}
{"orig_index":10329,"reviewerID":"A2TSHD7SWDGS58","asin":"B0000029B3","reviewerName":"Rohit R \"greatdoc\"","helpful":[0,0],"reviewText":"Rock in a Hard Land is an excellent record from the time of Joe Perry and Brad Whitford. The album contains electricity pushing those who like to escape from prison. When Aerosmith broke up with Joe Perry and Brad Whitford, Steve Tyler, Joey Kramer, and Tom Hamilton hired Jimmy Crespo and Rick Duffay to fill their vacancies. They try to be popular again, but it does't work for me. But Steve Taylor began to write great works again. \"Jailbait\", \"Cry Me A River\" and \"Rock In a Hard Place\" and other songs are samples of reunion.","overall":4,"summary":"a great aerosmith album","unixReviewTime":1359763200,"reviewTime":"02 2, 2013"}
{"orig_index":10329,"reviewerID":"A2TSHD7SWDGS58","asin":"B0000029B3","reviewerName":"Rohit R \"greatdoc\"","helpful":[0,0],"reviewText":"Hard Rock is a very good album from the joe perry and brad whitford era. This album consists of how to attack jailbreak lightning push that includes the usual title song. highly recommended.","overall":4,"summary":"a great aerosmith album","unixReviewTime":1359763200,"reviewTime":"02 2, 2013"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":"Will make the dog wet, your mommy cry, and your neighbour claw at this wallpaper. More metal on this record than any of its stepchildren. Possibly the worst album recorded in terms of felity, but the cd remaster brings some of the bite back. Fully realized classic rock and roll on \"Shake Appeal\", and of course, you are hopelessly unzip if you haven't heard \"Search and Destroy\".","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":"\"Search and\" Crash \"is a cd remaster of a classic rock and roll album.it looks honest, but the The CD reworked returns some of the bite ada Usually fully recognizable and combined \"Appeal Shake\"","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":"Ordinary fully recognizable and combined \"Appeal Shake\", and of course, you will close hope if you don’t hear it. “Search and Destruction.” The dog will get wet, your mother will cry, and your neighbour’s wall will chew. Possibly the ugliest album never recorded in terms of authenticity, but the cams remaster is back with a few bites. More iron on this record than either to this cousins.","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":10710,"reviewerID":"A5KJVGJ43ZDC9","asin":"B000002AP1","reviewerName":"Ronald Battista","helpful":[0,0],"reviewText":"\"Search and Destroy\" is a cd remaster of a classic rock and roll album. \"Shake Appeal\" is arguably the worst album recorded in terms of felity. of course, you are hopelessly unzip if you have not heard \"Search and Destroy\"","overall":5,"summary":"Will whoop the tar out of you","unixReviewTime":1012608000,"reviewTime":"02 2, 2002"}
{"orig_index":11306,"reviewerID":"AORCXT2CLTQFR","asin":"B000002G1R","reviewerName":"Justo Roteta","helpful":[1,1],"reviewText":"By the time this CD was released in one thousand, nine hundred and ninety-four, many felt that Barry White was well past this prime as this three previous A&M releases had not scored any major hits despite being well-received by both music critics and fans of romantic Soul. \"Practice What You Preach\", \"It's Over\", \"Baby's Home\" and the simply glorious \"Come On\" all played key roles in Mr. White's career revival and (in many ways) this CD modernized and updated this music without making it close its soulful and romantic vibe. A classic.","overall":4,"summary":"An unexpected but  well-deserved comeback for a true Soul icon.","unixReviewTime":1263340800,"reviewTime":"01 13, 2010"}
{"orig_index":11306,"reviewerID":"AORCXT2CLTQFR","asin":"B000002G1R","reviewerName":"Justo Roteta","helpful":[1,1],"reviewText":"When this CD was released in one thousand, nine hundred and ninety-four, many people thought that Barry White had won this golden season because the release of the previous A&M was criticized by music. \"Practice what you preach\", \"It's over\", \"Children's Home\" and the adage \"Come\" all played a key role in Mr. but without closing its state of love and affection. Classic work.","overall":4,"summary":"An unexpected but  well-deserved comeback for a true Soul icon.","unixReviewTime":1263340800,"reviewTime":"01 13, 2010"}
{"orig_index":11306,"reviewerID":"AORCXT2CLTQFR","asin":"B000002G1R","reviewerName":"Justo Roteta","helpful":[1,1],"reviewText":"By the time this CD one thousand nine hundred and ninety -four was released, many people felt that Barry White had surpassed this prime as well as A&M’s three previous releases that it cd nothing. they were well received by music critics and romantic Soul fans. \"Repeat what you call\", \"It's over\", \"Home of the child\" and simply \"Come\" all played a key role in reviving Mr. White and (in many ways) this CD modernized and updated this music without doing so. close this auction for soul and love. A classic.","overall":4,"summary":"An unexpected but  well-deserved comeback for a true Soul icon.","unixReviewTime":1263340800,"reviewTime":"01 13, 2010"}
{"orig_index":11306,"reviewerID":"AORCXT2CLTQFR","asin":"B000002G1R","reviewerName":"Justo Roteta","helpful":[1,1],"reviewText":"By the time the CD was first released in one thousand, nine hundred and ninety-six, many people felt that Barry White was far ahead in the title because despite all three A&M releases, it was hot. Songs do not live up to the acclaim of music critics and fans. \"Practice Preaching\", \"Done\", \"Children's Home\" and the wonderful \"Come On\" all played a key role in reviving Mr. Close this spiritual and loving Bible. A classic.","overall":4,"summary":"An unexpected but  well-deserved comeback for a true Soul icon.","unixReviewTime":1263340800,"reviewTime":"01 13, 2010"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":"A lot of times Nirvana and Pearl Jam get the credit for putting Seattle on the map, (Heart, Hendrix and Queensryche were before any of them) but I believe that this one thousand, nine hundred and eighty-nine release was the pinnacle of anything that came out from this genre in the last sixteen years. I also don't believe that anything that Creed, Three Doors Down for Nickleback will never come close to. Starting off the record are two of the best hard rock songs never written. Rusty Cage and Outshinned are just six star songs if there never was any. The album goes downhill from there, although there is not a bad track on there.right now we can all use a new Soundgarden CD.","overall":4,"summary":"Sol rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":"Many times Nirvana and Pearl Jam put Seattle on the map (Heart, Hendrix, and Queensryche are all in front of them), but I believe these one thousand, nine hundred and eighty - nine have been released in the last sixteen genres. years Peak work. I don't believe in any religion, Nick Baker's three doors will never close. Starting at the record are two of the strongest songs never written. If not, Rusty Cage and Outshinned are just six-star songs. The disc came down from there, though there were no bad tracks there. Now we can all use Soundgarden's new CD.","overall":4,"summary":"Sol rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":"Many times Nirvana and Pearl Jam put Seattle on the map (Heart, Hendrix, and Queensryche are in front of them), but I believe these one thousands and nine hundred and eighty-nine have been released in this way over the past sixteen years. Peak activity. I don’t believe any “Creed, Doors Three Down for Nickleback” will never appear If not, Rusty Cage and Outshinned are just six-star songs. There are no bad tracks.","overall":4,"summary":"Sol rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":11950,"reviewerID":"A1H0PFSQQMBP3D","asin":"B000002GK1","reviewerName":"W. Jarkousky","helpful":[0,2],"reviewText":"Many times Nirvana and Pearl Jam put Seattle on the map (Heart, Hendrix, and Queensryche are in front of them), but I believe these one thousands and nine hundred and eighty-nine have been released in this way over the past sixteen years. Peak activity. I don't believe in any religion, Nick Baker's three doors will never close. The disc came down from there, though there were no bad tracks there. Now we can all use Soundgarden's new CD. Starting at the record are two of the strongest songs never written. If that than’t happened, Rusty Cage and Oushinned are just six star songs.","overall":4,"summary":"Sol rock from Seattle","unixReviewTime":1128902400,"reviewTime":"10 10, 2005"}
{"orig_index":12709,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B000002H1C","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"Here is an interesting situation. The Eagles released their first greatest hits album after releasing four albums. They then release two more albums and then release a second greatest hits collection. Let me give you the send of this review. I like this collection. However, the two albums from which weight of the songs derive, \"Hotel California\" and \"The Long Run,\" are better. Of the other two songs, \"After the Thrill Is Gone\" is from the one thousand, nine hundred and seventy-five release \"One of These Nights.\" The other song is the wonderful \"Seven Brges Road,\" which only appears on one thousand, nine hundred and eighty's \"Eagles Live.\" I think the only reason I bought this CD was because of \"Seven Bridges Road,\" otherwise owning the aforementioned albums covers the rest. These songs show a change in musical styles, from the country rock of the first four albums to rock and pop\/rock, likely a result of Joe Walsh's influence on Don Henley and Glen Frey. In the process the Eagles created one of the best story songs never, \"Hotel California,\" a surreal vision combining elements of the desert, the loss of innocence of all of us in the transition from the sixty to the seventy, and a longing for those things that never seem quite achievable. The other songs on this collection range from very good to great. The Eagles hit a speak on \"The Long Run\" and \"Hotel California\" that was reflected in the sales of both albums and the extensive list of singles released from both. While the early Eagles albums were influential in country-rock, the last two albums are what cemented their place in rock music. As great as the music is, as I stated at the beginning, I find it difficult to recommend this CD as a must have. \"The Long Run\" and \"Hotel California\" albums are worth buying. Once you have those songs, there are only two songs missing from this CD. You have to decide whether owning \"Seven Bridges Road\" is worth the expense of buying this CD. There is also a two-disc set called \"The Very Best of the Eagles\" that contains every hit from this CD, from their first greatest hits CD and a few more in addition. So many options, so few dollars! I should also point out that this particular CD is a Japanese remaster of the original. Given the cost of this CD and the availability of alternatives, I suggest you review all the options available to you and decide which CD has the content, quality and price that meet your needs.","overall":5,"summary":"Great Stuff - But there are other options","unixReviewTime":1137888000,"reviewTime":"01 22, 2006"}
{"orig_index":12709,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B000002H1C","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"This is an interesting situation. The Eagles released their debut album after releasing four albums. They then released two more albums, after which they released a second popular album. Let me send you this study. I love this series. However, two albums \"California hotel\" and \"long distance running\" where the difficulty of the song comes in is better. Among the other two songs, \"After the Thrill Is Gone\" appears in the one thousand, nine hundred and seventy-five song \"One of These Days\". One of the most amazing songs is \"Seven Brges Road\", which only appeared on \"Eagle Live\" by one, nine hundred and eighty people. I think the main reason I bought this CD is because of \"Seven Road Bridge\", otherwise the above album would cover some. These songs reflect a shift in musical styles, from country rock to the first four albums to rock and pop \/ rock, which may be the result of Joe Walsh's influence on Don Henry and Glenfrey. In the process, the Eagle performed one of the best never-before-seen songs, the \"California hotel\", a surrealist view combining desert objects. , and seemingly impossible things forever. Some of the songs in the list range from the best to the best. The Eagles gave talks at \"Long Run\" and \"Hotel California\", which featured commercials for two albums and a large list of released songs. Although the Eagles' debut albums have had an impact on the country's rock, the last two albums cemented their place in rock music. As I said earlier, although the music is great, I find it difficult to recommend this CD as necessary. The albums \"The Long Run\" and \"Hotel California\" are worth a purchase. As long as you have these songs, only two songs are missing from this CD. You will have to decide if it is worth paying for this CD to have \"Seven Bridges\". There are also two albums called \"The Best of the Eagles\", which contain all the top songs on this CD, starting with their first hot CD, and other songs. More choices, less money! I have to prove that this CD is an original Japanese copy. Given the cost of this CD and the availability of alternatives, I recommend that you review all available options and decide which CD has the content, quality, and price to meet your needs.","overall":5,"summary":"Great Stuff - But there are other options","unixReviewTime":1137888000,"reviewTime":"01 22, 2006"}
{"orig_index":12709,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B000002H1C","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"In the process, the Eagles made one of the most unprecedented storytelling songs, \"the California hotel\", a surrealist view combining desert objects. in the transition from the one thousand, nine hundred and sixtys to the seventys, a longing for things that seemed impossible to achieve. However, the difficulty of the song comes from the two albums of \"Hotel California\" and \"long distance running\". Among the other two songs, \"After the Thrill Is Gone\" appears in the one thousand, nine hundred and seventy-five song \"One of These Days\". One of the most amazing songs is \"Seven Brges Road\", which only appeared on \"Eagle Live\" by one, nine hundred and eighty people. These songs reflect a shift in musical styles, from rock rock to the first four albums to rock and pop \/ rock, which may have been the result of Joe Walsh's influence on Don Henry and Glenn Frey. The Eagles have given talks at \"The Long Run\" and \"Hotel California\", which featured two album sales and a large list of released singles. There are also two albums called \"The Best of the Eagles\", which contain all the top songs on this CD, starting with their first hot CD, and other songs.","overall":5,"summary":"Great Stuff - But there are other options","unixReviewTime":1137888000,"reviewTime":"01 22, 2006"}
{"orig_index":12709,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B000002H1C","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"The Eagles have released their first hot album after releasing four albums. Then they released some albums, after which they released the second most popular collection. The weight of the song comes from two albums, \"Hotel California\" and \"Long Run\" albums worth buying.","overall":5,"summary":"Great Stuff - But there are other options","unixReviewTime":1137888000,"reviewTime":"01 22, 2006"}
{"orig_index":16993,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LJF","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"Even though today Ice-T has pretty much left the music biz, and is doing TV and Movies, lets not forget what the contributed to the Hip-Hip community back in the day. Ice-T might have been one of the first gangster artist (his first release Ryhme Pays was released a year before NWA's Straight Outta Compton. Out of all this releases this might be this best effort. Sure there are some filler tracks there, yet the other songs are so good and powerful, that they make up for the bad songs on this. You played yourself and The Peel their caps back are my personal favourites on this, and anyone looking for great Ganasta wrap, should ditch other fifty Cent CD's and pick this one up. Even though Ice-T has made it into the mainstream, I done believe the sold out. He started out back in the day as a nobody, and as the got older the made some career moves that would get him into Movies and TV. You can't be making Ganster Material forever, as it just would't sound right for forty+ tyr old man to be wrapping about guns and pimping (would it) He does, however still do some musical work, and this love for hardcore and Metal Music still show as the cd a guest appearance on Six Feet Unders \"True Carnage\" in two thousand and one. Enjoy this piece of ship-hop History.","overall":5,"summary":"Classic Gansta Hip-Hop","unixReviewTime":1138924800,"reviewTime":"02 3, 2006"}
{"orig_index":16993,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LJF","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"Although Ice-T almost left the music industry today and made TV and movies, don't forget its contribution to the Hip-Hip community at the time. Ice-T is one of the first gang artists (his first album, Ryhme Pays, was released a year before that of the NWA Straight Outta Compton. my favor, anyone who wants a big threat from Ganasta should give up another fifty CD CD and choose it Although Ice-T has become a staple, I believe it is for sale. You can't do Ganster Material forever, because with an old forty-year-old man, it does't sound right to wrap a gun and pimples (he'll do it) the's done, but the's still doing music work, And this love Hardcore and metal music still shows, because the guest appeared in two thousand and one \"Real Holocaust\" six feet below the dance. Yonw share this history of shipwreck. (His first version of Ryhme Pays was released the year before NWA Straight Outta Compton). Of all the variations, this one may be the best. Of course, there are some ways to fill it, but some songs are good and powerful, making up this bad song. I may, however, have done music work, and this love of hardcore and metal music is still on display in the cameo in two thousand and one less than six feet in \"True Carnage\". You play it yourself, Peel and their hats are my favourite things. who wants a big package from Ganasta should give up another fifty CDs and choose this one. Although Ice-T has almost left the music industry today, Make TV and movies, but don't forget the contribution to the Hip-Hip community at that time. , but some songs are good and powerful, and they represent this bad song. He started out as a stranger, As the grew up, the cd some permissive activities. to join a movie and television show. Although Ice-T is the norm, I believe it is for sale. Ice-T may be one of the first gang members (Ryhme Pays' first album is better than the NWA The Outta Compton was released a year ago.","overall":5,"summary":"Classic Gansta Hip-Hop","unixReviewTime":1138924800,"reviewTime":"02 3, 2006"}
{"orig_index":16993,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LJF","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"Today Ice-T almost left the music business and cd TV and movies. Ryhme Pays' first edition was a year earlier than NWA's Straight Outta Compton. The revival has established young but loyal fans of old music of nature, love and beauty. \"One Thousand Story and One Night\" is the first of a great collection of two episodes. and One Nights \"was compiled for one, nine hundred and seventy speeches, composed by guitarist Michael Dunford, and the poet Betty Thatcher wrote the words. But Renaissance gained the power of Aslam's voice over Annie H. It's very interesting in traditional songs, very clear and sweet on rock and roll, Haslam's voice is high, intensifying the band's songs (\"I Remember You\", should be a carpet of the \"classic\" songs and atmospheric story songs (\"Black Flame\", \"The Mother of Russia\" and \"Marine Gypsy\", Haslam reads it as a poem and the sound of the sound). Rachmaninoff of the group, Bacharach \/ Baroque hybrid music. sixteen thousand, nine hundred and ninety-four> \"Seventy More Words\" is one of the best collections in these two categories. since found strength in Anne Haslam's unusual voice. The “One Night and One Night Story” is a sample promoted by subgroups.","overall":5,"summary":"Classic Gansta Hip-Hop","unixReviewTime":1138924800,"reviewTime":"02 3, 2006"}
{"orig_index":16993,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LJF","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"Ice-T may have been one of the band's first artists (his first release Ryhme Pays was released a year ago on NWA's Straight Outta Compton) All of this release is it may be the best effort. Sure there are some traces of filling there, but the other songs are so good and powerful, to make the bad songs of this one.","overall":5,"summary":"Classic Gansta Hip-Hop","unixReviewTime":1138924800,"reviewTime":"02 3, 2006"}
{"orig_index":17338,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002LSV","reviewerName":"Jason Stein","helpful":[78,82],"reviewText":"It's tough being an aging rock band in the pop world. At a certain point both fans and record company turn away from your music and focus on what's hot now. ZZ Top, I think, has suffered this fate. While they still continue to make good music, no one seems to be listening anymore. Fine. I still like them. I still buy their cd. This compilation is the only best of ZZ Top that's worth buying for now. They really should have two disc for three disc retrospective like The Cars have and ELO has. However, this one disc compiles some of their greatest seventy's and eighty's hits in one place with a couple of new songs for one thousand, nine hundred and ninety-two, \"Viva Las Vegas\" and \"Gun Love.\" At eighteen tracks this is a nice buy. No extensive liner notes though. After one thousand, nine hundred and ninety-two, ZZ Top released Antenna in one thousand, nine hundred and ninety-four, which dropped the synthesizers and went back to hard rocking blues. Then they released one thousand, nine hundred and ninety-six's Rhythmeen, which seemed like they were going for a more mud-swamp, pm-tempo hard rock blues. In one thousand, nine hundred and ninety-nine they released XXX which finds them still rocking the blues but with a bit more fun like they had before one thousand, nine hundred and ninety's Recycler. This Greatest Hits, however, is perfect for those wanting a sample. This is a must have for any rock collector.","overall":5,"summary":"I'm Bad, I'm Nationwide.","unixReviewTime":953683200,"reviewTime":"03 22, 2000"}
{"orig_index":17338,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002LSV","reviewerName":"Jason Stein","helpful":[78,82],"reviewText":"It's hard to be the oldest rock band in the pop world. For some time, fans and record companies will stay away from your music and focus on the current popular music. The top ZZ, I think, got this kind of difficulty. Although they continue to make beautiful music, no one seems to listen to it anymore. beautiful. I still love them. I still buy their CD. This design is now the only ZZ top that should be purchased. They really need to prove two sets of three back-up sets like Cars and ELO. However, this record combines some of their biggest songs of the seventys and eightys in one place, and includes a few thousand and nine hundred and ninety-two songs \"Viva Las Vegas\" and \"Gun Love\" . A new song. This is a great choice for song eighteen. Although there are no wide liner notes. After one thousand, nine hundred and twenty-nine, ZZ Top released the Antenna in one thousand, nine hundred and ninety-four, which abandoned the synthesizer and reverted to hard rock blues. Then they released a thousand Rhythm, nine hundred and ninety-six, apparently looking for a muddy, medium-sized blue. They released XXX in one thousand, nine hundred and ninety-nine and found that they were still moving the blues, but it was even more interesting than the Recycler's one thousand, nine hundred and ninetys Works. However, this Excellent Hits is ideal for those looking for samples. This is a must have for any stone collector.","overall":5,"summary":"I'm Bad, I'm Nationwide.","unixReviewTime":953683200,"reviewTime":"03 22, 2000"}
{"orig_index":17338,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002LSV","reviewerName":"Jason Stein","helpful":[78,82],"reviewText":"This CD brings together some of the biggest hits from the seventys and eightys in one place. This is a great choice for song eighteen. Although there are no we liner notes.","overall":5,"summary":"I'm Bad, I'm Nationwide.","unixReviewTime":953683200,"reviewTime":"03 22, 2000"}
{"orig_index":17338,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002LSV","reviewerName":"Jason Stein","helpful":[78,82],"reviewText":"This record combines their great songs of the seventys and eightys in one place, including the new one, nine hundred and ninety-two song, \"Long Live Las Vegas\" and \"Gun Love\" is a great choice for the eighteenth song. .","overall":5,"summary":"I'm Bad, I'm Nationwe.","unixReviewTime":953683200,"reviewTime":"03 22, 2000"}
{"orig_index":19008,"reviewerID":"A1P0T3QLZGZDDN","asin":"B000002OPL","reviewerName":"MTV and the radio BURN IN HELL","helpful":[0,0],"reviewText":"As much as people want to believe that Eddy Van Halen and Jimmy Page were the greatest guitar players of all time they cant because although Eddy and Jimmy are both some of the greatest musicians who never lived they did't live up to the guitar godliness of good vol' Jimi Hendrix. This album, with its opening riff to its first song 'Purple Haze' was a reminder that The Rolling Stones and The Who were't the only hard rock bands out there. Most of the songs on the album are classics, each one shows just how talented Sir Hendrix is (I call him Sir because of this talent). Jimi was one of the people who started hard rock along with Robert Plant\\Jimmy Page, Ozzy Osbourne\\Tony Iommi, Mick Jagger\\Kieth Richards and Pete Townsend\\Kieth Moon (Moon the Loon) and that alone makes him a god. He WAS the greatest guitar player of all time and no one can deny that, the freaking' played the star spangled banner behind this back with please! If you are a guitarist then buy this album and see if you can play all the songs just like Sir Hendrix did, there a very low chance you'll be table to but just give it a shot. Even if you done play guitar then buy this anyway as you will find many masterpieces there.","overall":5,"summary":"The album that unleashed guitar rock","unixReviewTime":1095465600,"reviewTime":"09 18, 2004"}
{"orig_index":19008,"reviewerID":"A1P0T3QLZGZDDN","asin":"B000002OPL","reviewerName":"MTV and the radio BURN IN HELL","helpful":[0,0],"reviewText":"Although people want to believe that Eddy Van Halen and Jimmy Page are the biggest guitarists of all time, they can't believe it, because even though Eddy and Jimmy are great musicians, they never lived up to \"Live\" by respecting Jimi Hendrix's guitar. . The album is using the opening version of its debut single \"Purple Haze\" to remind people that the Rolling Stones and The Who are not the only heavy rock bands. The songs are old-fashioned songs, and each bull showcases the talent of Sir Hendrix (I call him jazz because of this talent). Moon the Loon) This alone made him a god. He is the best guitarist of all time. No one can deny this Damn 'please play Stars and Stripes behind this! If you have a guitar, buy this album and see if you can play all the songs like Hendrix Jazz, your chances of being at the table are very slim, but please try. One of the songs on the albums is classic, and each headquarters showcases Hendrix Jazz talent. Jimi Hendrix is ​​one of the first to rock hard with Robert Plant \\ Jimmy Page, Ozzy Osbourne \\ Tony Iommi, Mick Jagger \\ Kieth Richards and Pete Townsend. but they can't believe it, because Eddy and Jimmy are both great musicians, but they did't live up to Jim Hendrix's guitar. Jim was one of the founders of the heavy rock with Robert Plant \\ Jimmy Page, Ozzy Osbourne \\ Tony Iommi, Mick Jagger \\ Kieth Richards and Pete Townsend \\ Kieth Moon (Moon Moon), and this alone made him a god. He's the biggest guitar of all time, and no one can deny it, this damn'cela please play the Stars and Stripes after this! If you are a guitarist, buy this album and see if you can play all the songs like Hendrix Jazz. The album reminds people that the Rolling Stones and Who karen’t the only tough bands with the opening of the first song “Purple Haze”. Most of the songs on the album are classic songs, and each bull showcases the talent of Jazz Hendrix (I call him jazz because of this talent). Even if you've played the guitar, buy this one, because you'll find a lot of part there.","overall":5,"summary":"The album that unleashed guitar rock","unixReviewTime":1095465600,"reviewTime":"09 18, 2004"}
{"orig_index":19008,"reviewerID":"A1P0T3QLZGZDDN","asin":"B000002OPL","reviewerName":"MTV and the radio BURN IN HELL","helpful":[0,0],"reviewText":"the freaking 'is one of the founders of hard rock with Robert PlantJimmy PageTony IommiMick JaggerKieth Richards and Pete TownsendKieth Moon.","overall":5,"summary":"The album that unleashed guitar rock","unixReviewTime":1095465600,"reviewTime":"09 18, 2004"}
{"orig_index":19008,"reviewerID":"A1P0T3QLZGZDDN","asin":"B000002OPL","reviewerName":"MTV and the radio BURN IN HELL","helpful":[0,0],"reviewText":"As much as people want to believe that Eddy Van Halen and Jimmy Page are the greatest guitarists of all time they can't because even Eddy and Jimmy are the same artists. singer The greatest non -living thing never done is ‘live the god of guitar good vol’ Jimi Hendrix. This door, which the opened with this debut song ‘Purple Haze’ is a reminder that The Rolling Stones and The Who karen’t the only solid rock there. Most of the songs on the album were great, and each one showed how talented Sir Hendrix was (I called him Sir because of this talent). Jimi is one of the pioneers of hard rock along with Robert Plant \\ Jimmy Page, Ozzy Osbourne \\ Tony Iommi, Mick Jagger \\ Kieth Richards and Pete Townsend \\ Kieth Moon (Moon the Loon) and that alone makes him a god . He’s the greatest guitar player of all time and no one can deny that, the fans hit the banner behind him! If you are a guitarist then buy this album and see if you can play all the songs like Sir Hendrix did, very low chance that you will land on the table but just give the shot. Even if you made the guitar then you still buy it, you will find a lot of part there.","overall":5,"summary":"The album that unleashed guitar rock","unixReviewTime":1095465600,"reviewTime":"09 18, 2004"}
{"orig_index":19264,"reviewerID":"AEPJ075RIOTRU","asin":"B000002OZS","reviewerName":"Jeffrey A. Gangwer","helpful":[4,5],"reviewText":"Everybody loves this album; why else would you have clicked on the icon in order to view the product? Everybody knows that the album has been are-sequenced in order to comply with Bradly Nowell's original sequence. I have listened to this album for so long, that it will take a while to RE-ADJUST to the new sequence of the songs! Also, everybody knows that this album comes with a supplemental disc with extra goodies! The second disc contains several priceless songs- especially the acoustic material which has been included. In my OPINION, the acoustic tracks make the second disc the gem of the whole collection. This release is a no-brainer for the fans.","overall":5,"summary":"Brad and Sublime: resurrected at last...!","unixReviewTime":1157932800,"reviewTime":"09 11, 2006"}
{"orig_index":19264,"reviewerID":"AEPJ075RIOTRU","asin":"B000002OZS","reviewerName":"Jeffrey A. Gangwer","helpful":[4,5],"reviewText":"Everyone loves this album; why do you want to click the icon to view the product? Everyone knows that this album is set to match Bradly Nowell's original sequence. I've been listening to this album for a long time, and it will take me a while to rearrange the new song in a row! Plus, everyone knows this disc comes with a bonus disc! The second report contains valuable songs - especially musical jones. In my opinion, the original soundtrack makes the second record a treasure trove for the entire series. This style is obvious to fans.","overall":5,"summary":"Brad and Sublime: resurrected at last...!","unixReviewTime":1157932800,"reviewTime":"09 11, 2006"}
{"orig_index":19264,"reviewerID":"AEPJ075RIOTRU","asin":"B000002OZS","reviewerName":"Jeffrey A. Gangwer","helpful":[4,5],"reviewText":"Everyone loves this album; why do you want to click the icon to view the product? The second report contains valuable songs - especially musical jones.","overall":5,"summary":"Brad and Sublime: resurrected at last...!","unixReviewTime":1157932800,"reviewTime":"09 11, 2006"}
{"orig_index":19264,"reviewerID":"AEPJ075RIOTRU","asin":"B000002OZS","reviewerName":"Jeffrey A. Gangwer","helpful":[4,5],"reviewText":"Everyone knows that this album is set to match Bradly Nowell's original sequence. Plus, everyone knows this disc comes with a bonus disc! In my opinion, the original soundtrack makes the second record a treasure trove for the entire series. The second record contains a number of valuable songs — especially those that are spoken from the heart. Everyone loves this album; why do you want to click the icon to view the product? I have been listening to this album for a long time, and it will take some time to get used to the sequence of the new song! This version is visible to fans.","overall":5,"summary":"Brad and Sublime: resurrected at last...!","unixReviewTime":1157932800,"reviewTime":"09 11, 2006"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"What is it about this album that makes so many parrotheads say \"Well, I'm sure I'd like it if I gave it more of a chance, but. \"? Perhaps it's the black of a concert staple, although several of these songs could fit that bill just fine. Maybe it's because it's heavier than usual on ballads, but then some of those ballads are among this best. Whatever the reason may be, it's worth more of a chance than most fans I know have given it. Somewhere Over China is obscure enough that if you're reading this, you're probably already quite a Buffett fan. Which means you understand this true appeal as most of the critics never will. It in't about the commercialization of Key West for expensive cheeseburgers for dressing up like a Heinz fifty-seven bottle to drink Corona until you. well, you know. Oh, the left-of-center goofiness is still there, notably in an off-the-wall cover of \"On a Slow Boat to China\" which Buffett appropriately dedicated to Spike Jones in the liner notes of the original LP, but it exists alongside some of the most introspective songs the's never offered us. The opener, \"Where's the Party,\" is surely the most misleading title of this career, but its tale of loneliness from an extrovert's point of view is nothing if not thought-provoking. On the lighter side, \"It's Midnight and I'm Not Famous Yet\" features the late Steve Goodman as co-writer and a lead character named Lester Polyester. need I say more? Goofier still is \"Lip Service,\" perhaps Buffett's all-time greatest double-entendre. (Is it about a co-dependent relationship for oral sex? You make the call!) But the mood is more serious for the most part. \"Steamer\" is arguably the most sensuous number the's never recorded, while \"I Heard I Was In Town\" is tops in the subgenre of lonely-life-of-a-superstar songs (something the'd tried this hand at several times before, but never as convincingly as there). Yes, I know, you already have half of those songs if you own the box set. So why buy this CD as well? The title track, which as far as I know has never been released on any other album, is the best Buffett you've never heard. It's a tale of an average guy who gets the unlikely chance to throw caution to the wind and travel to the far side of the world, discovering the pros and icons of that lifestyle along the way, much as your hero has spent much of the past three decades doing. What's the moral of the story? Maybe we're better off staying with the dull but familiar; but then again, maybe there's real joy in the loneliness of wanderlust. Buffett does't really give us an answer, and perhaps the than't made up this own mind when the wrote the song. That uncertainty makes for a lesson unto itself. Either way, if you're still hoping for that opportunity to go off one of these days in search of the Great Lost Saltshaker, you need this song in your collection!","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"Which album makes most parrots say “Yes, if I give it more chances, I'm sure I'll love it, but.”? Maybe this is the black color of the concert, though a few songs can meet this requirement well. Probably because it is more difficult than usual in traditional songs, but some of them are the best. Whatever the reason, there should be an opportunity given by many fans I know. \"Somewhere in China\" is not clear enough, if you read this article, you may already be a big Buffett fan. This means that you understand this true appeal, because most critics will never. It’s not a Key West commercial, because expensive cheeseburgers dress like bottles of Heinz fifty-seven until you drink Corona. Yeah, you know. Oh, the folly in the middle left is still there, especially in the cover outside the wall \"On a slow boat to China\". Buffett appropriately dedicated Spike Jones to the original LP article, but it is there and With many other original songs that have not been provided to us. The opening talk, \"Where's the Party\", is undoubtedly the most misleading topic of this work, but from an extrovert's point of view, its boring story is nothing to think about. On the bright side, \"it's midnight, I'm not famous yet\" with the late Steve Goodman as a writer and main character named Lester Polyester. Do I want to talk more? Goofier is still a \"oral service\", probably the most important thing for Buffett. (Does it depend on oral sex support? Your phone call!) But in most cases emotions are very important. \"Steamer\" can be said to be the most emotional never recorded, and \"I heard I was in Cape Town\" by the superstar lonely song subgenre (I've tried this kind of song many times before), but never be sure as there). Yeah, I know that if you own a set, you already own half of the songs. So why are you buying this CD? The title track, as far as I know, has never been released on any other album. This is the story of a normal person who would not expect to have the opportunity to have fun and travel to the other side of the world to again the benefits and features of this kind of life along the way, as your hero spent most of the past three years. What is the character in this story? Maybe we should stay in a boring but familiar place, but again, maybe there is real happiness in the loneliness of wandering. Buffett gave us no answer, and the probably never made the decision when the wrote the song. This uncertainty is a study in itself. Either way, if you still want the chance to find the missing salt shaker these days, you need this song in your collection!","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"Somewhere in China is a dark black concert avenue. \"Steamer\" can be said to be the most sensible number never recorded. \"I heard I'm in town\" the excelled in the list of superstar's lowest songs.","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":19722,"reviewerID":"A2VKJOBZEZJ2A0","asin":"B000002PCV","reviewerName":"David A. Bede","helpful":[13,14],"reviewText":"\"Where's the team\" is undoubtedly the most misleading term in the profession, but from a celebrity's point of view, the story of this loneliness is nothing short of impressive. \"Steamer\" can be said to be the most sensible number never recorded. \"I Heard I'm in town\" is the best in the lowest genre of solo star songs.","overall":4,"summary":"Just for you, Trina","unixReviewTime":1052006400,"reviewTime":"05 4, 2003"}
{"orig_index":22631,"reviewerID":"AEF8X4ECM4Q3S","asin":"B000003AGB","reviewerName":"\"thecynicalcritic\"","helpful":[6,6],"reviewText":"In case you did't know, TRU consists of three wrappers. MASTER P and this brothers C-MURDER, and SILKK THE SHOCKER. Together and with the help of other wrappers from the label as MIA-X, BIG ED, MO B DICK, KANE & ABEL. just to name a few, they put this album out well. The track \"NO LIMIT SOLDIERS\" (which is followed by a sequel song) is one of the best on the album. Other songs include a remake sampling of ROCKWELL's \"Somebody's Watching Me,\" an interview (which turns into a song) with C-MURDER, and an update of a MASTER P song, \"I GOT CANDY\". Fans of ICP and CYPRUSS HILL will love track four on the second disc, \"FREAK HOES\". One of the best double discern from the label.","overall":3,"summary":"A two discer worth the money","unixReviewTime":944956800,"reviewTime":"12 12, 1999"}
{"orig_index":22631,"reviewerID":"AEF8X4ECM4Q3S","asin":"B000003AGB","reviewerName":"\"thecynicalcritic\"","helpful":[6,6],"reviewText":"If you do not know, TRU contains three threats. Brothers MASTER P and C-MURDER and SILKK THE SHOCKER. With the help of other wrapping papers, such as MIA-X, BIG ED, MO B DICK, KANE and ABEL. To name a few, they released a very good album. The song \"NO LIMIT SOLDIERS\" (followed by sequel) is one of the best songs on the album. Other songs include ROCKWELL's replica sample \"Somebody's Watching Me\", an interview with C-MURDER (turned into a song), and a revised version of MASTER P's song \"IGOT CANDY\". Fans of ICP and CYPRUSS HILL love the fourth song on the second album \"FREAK HOES\". One of the double identification tags.","overall":3,"summary":"A two discer worth the money","unixReviewTime":944956800,"reviewTime":"12 12, 1999"}
{"orig_index":22631,"reviewerID":"AEF8X4ECM4Q3S","asin":"B000003AGB","reviewerName":"\"thecynicalcritic\"","helpful":[6,6],"reviewText":"\"SOLDIERS HAVE NO LIMIT\" is one of the best songs on the album. Other songs include Rockwell's copy of \"Somebody's Watching Me\"","overall":3,"summary":"A two discer worth the money","unixReviewTime":944956800,"reviewTime":"12 12, 1999"}
{"orig_index":22631,"reviewerID":"AEF8X4ECM4Q3S","asin":"B000003AGB","reviewerName":"\"thecynicalcritic\"","helpful":[6,6],"reviewText":"Other songs include Rockwell's copy of \"Somebody's Watching Me\", an interview with C-MURDER (turned into a song), and Update of the song \"I FOUND A CANDY\" by MASTER P. With the help of other wrapping papers, such as MIA-X, BIG ED, MO B DICK, KANE and ABEL. The song \"NO LIMIT SOLDIERS\" (followed by sequel) is one of the best songs on the album. Fans of ICP and CYPRUSS HILL will love the fourth song on their second album \"FREAK HOES\". If you don't know, TRU has three threats. To name a few, they have successfully released this album. Brothers MASTER P and C-MURDER and SILKK THE SHOCKER.","overall":3,"summary":"A two discer worth the money","unixReviewTime":944956800,"reviewTime":"12 12, 1999"}
{"orig_index":24433,"reviewerID":"AJMO5NI0FNMDQ","asin":"B000005Z0E","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"This is two me the threerd best Pac Album bet it still gets five stars because He was the Rebel of the Underground and nobody could stop him I love this album","overall":5,"summary":"Classic album, must buy!!!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":24433,"reviewerID":"AJMO5NI0FNMDQ","asin":"B000005Z0E","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"the bet is still getting five stars because it is","overall":5,"summary":"Classic album, must buy!!!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":24433,"reviewerID":"AJMO5NI0FNMDQ","asin":"B000005Z0E","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"This is two me the threerd best Pac Album bet it still gets five stars because He was the","overall":5,"summary":"Classic album, must buy!!!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":24433,"reviewerID":"AJMO5NI0FNMDQ","asin":"B000005Z0E","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"this is two me the threerd best Pac Album bet it still gets five stars. the was the Rebel of the Underground and nobody could stop him.","overall":5,"summary":"Classic album, must buy!!!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":24859,"reviewerID":"AXPYGNIC5ZIXS","asin":"B0000062VH","reviewerName":"John Jones \"Musician\"","helpful":[11,11],"reviewText":"Subtle vocals, understated instrumentation, warmth and intimacy. Michael Franks is the quintessential adult contemporary artist: clever enough to win jazz listeners and slick enough to lure pop fans. This wonderfully comprehensive compilation includes popular early work like \"Popsicle Toes\" and \"The Lady Wants to Know\" as well as later, radio-friendly fodder like \"Your Secret's Safe With Me\" and \"When I Give My Love to You.\" Some itunes (notably \"The Art of Love\" and \"Soul Mate\") are missed opportunities for commercial success when viewed in hindsight, and the drop-dead gorgeous ballads \"Tiger in the Rain\" and \"Hourglass\" are attestments to the strengths of Franks' arrangements, and production, and songwriting prowess. Oddball itunes like \"Baseball\" and \"When Sly Calls\" are forgiven in the face of such beauty.","overall":4,"summary":"A wonderful collection of gorgeous jazz\/pop","unixReviewTime":913248000,"reviewTime":"12 10, 1998"}
{"orig_index":24859,"reviewerID":"AXPYGNIC5ZIXS","asin":"B0000062VH","reviewerName":"John Jones \"Musician\"","helpful":[11,11],"reviewText":"Hidden songs, low notes, warmth and close relationships. Michael Franks is a typical old-time musician: smart enough to win the hearts of jazz listeners and attract pop fans. This wide range of fun designs includes popular original works such as \"Psicle Toe\" and \"Lady Lady Want to Know\", as well as later friendly content such as \"Your Secret Is Safe for Me\" and \"When I Give You My Love\". Looking back, some iTunes (especially \"Art of Love\" and \"Soul Mate\") have missed out on commercial success, and the amazing balls \"Tiger in the Rain\" and \"Hourglass\" showcased Franks' preparation, Production and songwriting skills. . . When you are faced with such a beauty, exotic music such as \"baseball\" and \"call tricks\" can be forgiven.","overall":4,"summary":"A wonderful collection of gorgeous jazz\/pop","unixReviewTime":913248000,"reviewTime":"12 10, 1998"}
{"orig_index":24859,"reviewerID":"AXPYGNIC5ZIXS","asin":"B0000062VH","reviewerName":"John Jones \"Musician\"","helpful":[11,11],"reviewText":"Michael Franks is a typical contemporary artist. Previous works include previous works such as \"Psicle Toe\" and \"Lady Wants to Know\"","overall":4,"summary":"A wonderful collection of gorgeous jazz\/pop","unixReviewTime":913248000,"reviewTime":"12 10, 1998"}
{"orig_index":24859,"reviewerID":"AXPYGNIC5ZIXS","asin":"B0000062VH","reviewerName":"John Jones \"Musician\"","helpful":[11,11],"reviewText":"Some iTunes (especially \"Art of Love\" and \"Soul Mate\") missed commercial success when watching the Opportunity By Looking Back. , the traditional folk songs \"Tiger Rain\" and \"Hourglass\" showcased Franks' power in the organization, production and creation of the song. This comprehensive design includes the first popular works such as \"Psicle Toe\" and \"Lady Wants to Know\", as well as later content such as \"Your Secret Is Safe for Me\" and \"When I Give You My Love\". In the face of such beauty, strange music such as \"baseball\" and \"smart wire\" can be forgiven. Hidden songs, low notes, warmth and close relationships. Michael Franks is a typical old-time musician: smart enough to win the hearts of jazz listeners and attract pop fans.","overall":4,"summary":"A wonderful collection of gorgeous jazz\/pop","unixReviewTime":913248000,"reviewTime":"12 10, 1998"}
{"orig_index":26134,"reviewerID":"A2IK9YLARCZ9YG","asin":"B000009GS6","reviewerName":"Bud Sturguess","helpful":[14,14],"reviewText":"By The Band's standards, \"Islands\" is less remarkable than earlier efforts; but given the fact that it was merely a contract-filler to Capitol Records, it's not as disappointing as most albums that are as business-oriented. The overall musical sound that The Band produces on \"Islands\" sounds distinctly like seventy easy listening radio (refer to 'Right As Rain' and 'Let the Night Fall'), a definite drawback for a group that had previously created a sound that was as unique at it had; gone was the inimitable bring of a nineteenth-century creole that was still easy to place with any given era in time, only vaguely present on 'Knockin' Lost John.' But the effort of the five members is still there nonetheless. The late Rick Danko's vocals on 'Street Walker' and the alluring gem 'The Saga Of Pepote Rouge' are highlights, as is that of the late Richard Manuel on a cover of 'Georgia On My Mind,' which became Jimmy Carter's theme during this run for the Presidency. Garth Hudson's keyboards are well-served, even if this saxophone--though perfected--is somehow out of place on the album, but Levon Helm's drumming and vocals are unmistakable. Robbie Robertson's bizarre guitar work that the had perfected in the past seems to be absent. His lyrics however are recognizably brilliant most of the time, echoing a feeling of sadness, weariness, and melancholy, evident on another gem, 'Livin' In a Dream' and 'Knockin' Lost John.'But those emotional lyrics are for some reason matched with disappointingly upbeat and bland music, and weak moments like 'Let the Night Fall' and a cover of the standard 'Ain't That A Lot of Love' drag the album down a bit. The title track, an instrumental, does't sound like a Band song at all, but rather an empty seventy-style take. For the most part, \"Islands\" is worth the taking and much more enjoyable than most of The Band's ninety output. It's hard to ignore the fact that most of the genuine feeling is absent, and a lot of aspects suffer as a result.","overall":4,"summary":"Weariness Set Against a Sunny Sky","unixReviewTime":1069545600,"reviewTime":"11 23, 2003"}
{"orig_index":26134,"reviewerID":"A2IK9YLARCZ9YG","asin":"B000009GS6","reviewerName":"Bud Sturguess","helpful":[14,14],"reviewText":"By belt standards, \"islands\" are not as compliant as their previous functions; but considering it as the filler of the Capitol Records agreement, it is not as attractive as the commercial album. embarrassment. The entire music produced by the Band in the \"Islands\" sounds like seventy easy-to-listen radios (see \"Good Like Rain\" and \"Let the Night Come\"), which is as different as never; Gram The only attraction of the Riole language has disappeared. However, the efforts of five people are still there. Singing the late Rick Danke on \"Street Walker\" and the charming \"Red Officer\" are the most important, and the late Richard Manuel is also on the album \"Georgia In My Heart\". Garth Hudson's keyboard works well, and although this saxophone - though good - is nowhere near the album, Levon Helm's drums and definite lyrics. The perfect work of Robbie Robertson's guitar of the past seems to be non-existent. However, this words echo through many times, expressing feelings of sadness, exhaustion and depression, evident in some of the rare gems “Livin’ In a Dream ”and“ Knockin ”Lost John. But for some reason these emotional words go hand in hand with offensive and lonely music, and weak moments like “Let the Night Come” and the standard “It’s Not So Much Love”, make the album a little more subdued. barrier. The title track is a musical instrument, which does not sound like a band song at all, but an empty seventys style song. In many cases, \"Islands\" is worth a look and a lot more fun than most Band's ninety's works. It's hard to overlook the fact that most of the real feelings are lost, and as a result many issues are affected.","overall":4,"summary":"Weariness Set Against a Sunny Sky","unixReviewTime":1069545600,"reviewTime":"11 23, 2003"}
{"orig_index":26134,"reviewerID":"A2IK9YLARCZ9YG","asin":"B000009GS6","reviewerName":"Bud Sturguess","helpful":[14,14],"reviewText":"By belt standards, \"Islands\" is not as compelling as its previous functions; but when you look at it as a contract file for Capitol Records, it is not as attractive as commercially available discs. embarrassment. The singing of the late Rick Danko on \"Street Walker\" and the comedy \"The Saga Of Pepote Rouge\" are the best.","overall":4,"summary":"Weariness Set Against a Sunny Sky","unixReviewTime":1069545600,"reviewTime":"11 23, 2003"}
{"orig_index":26134,"reviewerID":"A2IK9YLARCZ9YG","asin":"B000009GS6","reviewerName":"Bud Sturguess","helpful":[14,14],"reviewText":"The general music produced by The Band in the \"Islands\" sounds like seventy easy to listen to radio. The late Rick Danko's singing on \"Street Walker\" and the charming \"Pepote Rouge Saga\" are some of the highlights.","overall":4,"summary":"Weariness Set Against a Sunny Sky","unixReviewTime":1069545600,"reviewTime":"11 23, 2003"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"Phil Collins has had SO many hit singles, that a greatest-hits package was inevitable. \"Hits\" collects a big seventy-four minutes-worth of Phil's best-known itunes, such as \"In The Air Tonight,\" \"You Can't Hurry Love,\" \"One More Night,\" \"Sussudio,\" \"Take Me Home,\" and \"Another Day In Paradise,\" to name but a few. The album also collects for the first time Phil's hits from movie soundtracks, such as the smash \"Against All Odds,\" this hit duet with Marilyn Martin, \"Separate Lives\" (where is Marilyn Martin these days, by the way?), \"Groovy Kind Of Love,\" and \"Two Hearts.\" There's also this hit duet with Philip Bailey, \"Easy Lover,\" AND one brand-new track, a cover of Cyndi Lauper's hit song, \"True Colors\" (which I happen to like better than Cyndi's original version!). And yet, \"Hits\" is an incomplete Phil retrospective, as there are a handful of surprising commissions---\"I Missed Again\" (which was Phil's very first hit single), \"I Don't Care Anymore,\" \"Don't Lose My Number,\" \"Do You Remember,\" and \"Everyday.\" Obviously, these were left off the album due to black of space, but still, it's a disappointment. Hopefully, Phil will one day get a proper *two-disc* set of this biggest itunes, which would solve the problem right there. I can see it now---\"The Essential Phil Collins\"! They could also toss in a few extra goodies, like \"Thru These Walls,\" \"Oughta Know By Now,\" \"You'll Be In My Heart,\" \"Can't Stop Loving You,\" and \"Testify.\" I'm sure it'll happen eventually. For now, though, \"Hits,\" while incomplete, is still a very cool Phil Collins collection.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"Phil Collins has released so many singles that the biggest hit package is inevitable. \"Hits\" collects Phil's seventy-four-minute special songs, such as \"Tonight in the Sky\", \"You Can't Hurry to Love\", \"One Night\", \"Susudio\", \"Take Me Home\" and \"Another Day in Heaven \"Just to name a few. \"and two hearts.\" Phil's incomplete retrospective because there is a shocking commission- \"I missed it again\" (this is the first time Phil hits another) \"I don't care anymore\", \"Don't close my number\", \"Do you remember? \"And\" Everyday \". Obviously, these were not included in the album because of the dark space, but it was still disappointing. They can add other good things, such as \"crossing these walls\", \"you should know now\", \"you'll be in my heart\", \"you will never stop loving me\" and \"prove it\". I believe it will happen in the send. but it is still Phil Collins' best collection.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"\"Hits\" collects Phil's famous seventy-four minutes from iTunes. This album has collected Phil's songs from the first soundtrack for the first time. \"Beat\" because there are amazing commissions.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"\"Hits\" compiles Phil's most famous iTunes moments, such as \"In the Air Tonight\", \"You Can't Hurry and \",\" One Night Night, \"\" Sussudio \",\" Take Home \"and\" Another Day in Heaven \", to name a few. However, \"Hits\" is Phil's unfinished business because there are amazing commissions - \"I missed it again\" (this is Phil's first single single beating), \"I don't care\", \"Don't close my number\", \"Remember?\" And \"Everyday\". They can add other great things, such as \"crossing these walls\", \"I need to know now\", \"You'll be in my heart\", \"You Can't Stop Loving You\", and \"Witness.\" covering Cyndi Lauper's song \"Real Colors\" (I happen to be better than Cyndi The original version likes it better!) \"(By the way, where's Marilyn Martin recently? Singles, the hottest package is inevitable.\" Hits \"collects Phil's seventy-four-minute important songs, such as\" In The Air Tonight \",\" You Can't Hurry Love \",\" One Night Night \" , \"Sussudio\" and \"Another Day Day album in Paradise also includes Phil's sound for the first time. The following year, called SERIOUS HITS LIVE. There is now a\" serious \"studio in of popular songs. The song list is certainly slightly different, as Phil has been very popular never since. In one thousand, nine hundred and eighty-six, Cyndi Lauper recorded the only new song TRUTH TO MAKE THE FIRST COLORS, This is very popular with him. From Phil Collins' album After their release in one thousand and nine hundred and eighty-nine, they formed Serious Band and recorded a live album released the following year, called SERIOUS HITS LIVE. In one thousand, nine hundred and eighty-six, Cyndi Lauper (Cyndi Lauper) wrote the only new song for TRUE COLERS for the first time, which was very popular with him. This album will feature Phil’s hit singles such as MISSING AGAIN, EVERY DAY and DON’T LOSE MYBER. The song list is a bit different, because Phil has been very popular never since. This tablet contains Phil's non-Genesis material. Now there is a combination of \"deep\" studio songs.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":27077,"reviewerID":"A2VXQL36IFQGKZ","asin":"B00000DGUG","reviewerName":"RALPH PETERS","helpful":[4,5],"reviewText":"Alanis Morissette's second major release is a stunning success on every level. Each song is a like a separate epic poem, yet never comes over as preachy for whining, as many of her contemporaries often do. What some reviewers choose to call 'journal-entry' songs are in truth the closest thing we have to one thousand, nine hundred and sixty-seventys confessional songwriting that spawned legends like Joni Mitchell, James Taylor, Cat Stevens, Carly Simon, Laura Nyro, and Carole King. Does anyone dare accuse these artists of 'annoying' lyric-writing? Maybe it's just that the glut of non-challenging, innocuous, elevator-music with lyrics that flood the airwaves simply numbs the masses so that when someone like Ms. Morissette continues to follow her own musical path and emotional journeys, it confuses people. So be it. The songs on this album, from the anthemic \"Front Row\", the poignancy and self-deprecation of \"That I Would Be Good\", the sentimental heartbreak of \"Unsent\" to the stunning wordplay of \"Joining You\" are astounding in their range and honesty. Ms Morissette's vocals have matured since 'Jagged Little Pill' also; it will be a joy to watch the evolution of this major artist and share her musical sojourns in the coming years. For those wanting some challenge to their pop music, there is no one on the scene now like Alanis. Highest recommendation.","overall":5,"summary":"Stunning sequel to star-making disc.","unixReviewTime":958003200,"reviewTime":"05 11, 2000"}
{"orig_index":27077,"reviewerID":"A2VXQL36IFQGKZ","asin":"B00000DGUG","reviewerName":"RALPH PETERS","helpful":[4,5],"reviewText":"Alanis Morissette's second major version has been incredibly successful on all levels. Each song sounds like a different epic, but it will never be a sermon of complaint as most people of this time always did. The songs that some critics choose to call \"journal entries\" are actually the closest we have to the creation of one, zero for nine hundred and seventy songs. These song creatures have produced songs such as Joni Mitchell, James Taylor, and Kati. , Laura Nyro, and Carol King. Who dares to accuse these artists of writing “offensive”? Perhaps it is because the radio is full of uncomplicated and harmless elevator music, and the sound of radio waves will destroy the public, so that when people like Ms. Morissette continue to take their musical journey and emotions. , People will be confused. They were. The songs on this album, from the main theme of \"Front Row\", the remorseful submission of \"That I Be Be Good\", the sad tribute of \"Unsent\", to the wonderful song \"Join You\", are shocking and sincere. \", Ms. Morissette's singing has grown; watching the growth of this great artist and sharing the musical journey in the coming years will be a joy. For those who are looking for a challenge to their popular music, there is no one like Alanis right now. Highly recommended.","overall":5,"summary":"Stunning sequel to star-making disc.","unixReviewTime":958003200,"reviewTime":"05 11, 2000"}
{"orig_index":27077,"reviewerID":"A2VXQL36IFQGKZ","asin":"B00000DGUG","reviewerName":"RALPH PETERS","helpful":[4,5],"reviewText":"Alanis Morissette's second-largest version has been remarkably successful on all levels. Each song is like an independent epic, but it will never be a protest sermon. For those who are looking for a challenge to their popular music, there is no one like Alanis right now.","overall":5,"summary":"Stunning sequel to star-making disc.","unixReviewTime":958003200,"reviewTime":"05 11, 2000"}
{"orig_index":27077,"reviewerID":"A2VXQL36IFQGKZ","asin":"B00000DGUG","reviewerName":"RALPH PETERS","helpful":[4,5],"reviewText":"The second largest version of the katais morissette was remarkably successful at all levels. Each song is like a separate song, but it will never be a preaching protest. For those who want to challenge their pop music, there is no one like Alanis right now.","overall":5,"summary":"Stunning sequel to star-making disc.","unixReviewTime":958003200,"reviewTime":"05 11, 2000"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"I got to give it up to Eazy. Album has one of the best battle on wax song out there to date. This album is slamming, but the should have made more songs for it. It's hot and a must have if you like Compton gangsta wrap music. RIP Eric Wright.","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"I have to give it to Eazy. The album is one of the best wax war songs to date. The album was emotional, but a lot of the songs have to be done for it. If you like Compton gangsta music around the music, it is very hot and important. RIP Eric Wright.","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"The album is one of the best wax war battles to date. The album was emotional, but a lot of the songs have to be done for it. Hot,","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":27157,"reviewerID":"A8KW38D8PQ2AV","asin":"B00000DHSH","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[1,1],"reviewText":"This album is one of the best wax music fights to date. If you like Compton gangsta music around the music, it's very hot and compelling.","overall":5,"summary":"HOT!","unixReviewTime":1097625600,"reviewTime":"10 13, 2004"}
{"orig_index":28665,"reviewerID":"A1GN8UJIZLCA59","asin":"B00000IPAC","reviewerName":"P Magnum","helpful":[4,7],"reviewText":"Pretzel Logic is the perfect name for the album, because it contains the most twisted and bizarre lyrics in their career. Songs like the title cut, \"Monkey In Your Soul\", \"With A Gun\", \"Rikki Don't Lose That Number\", and \"Through With The Boy\" are songs that have obscure, twisting, crazy plots that make you sit down really listen. The songs follow the jazz vein as they do a cover of the Duke Ellington instrumental \"East St. Louis Toodle-Oo\" and a tribute to Charlie \"The Bird\" Parker \"Parker's Band\". \"Any Major Dude Will Tell You\" is a rare number for them as it is done in an acoustic style. \"Rikki Don't Lose That Number\" is one of the strangest songs to hit the top ten (it is the highest charting single of their career, speaking at #four), but it has an infectious melody. \"With A Gun\" is a buzzing cut. Pretzel Logic was the first album the band made after they basically became a duo. On their first two albums they were a functioning band that toured, but from Pretzel Logic on to their send of the first stage of their career, they basically existed in the studio with Donald Fagen & Walter Becker leading a parade of studio musicians.","overall":4,"summary":"Quite Logical","unixReviewTime":980380800,"reviewTime":"01 25, 2001"}
{"orig_index":28665,"reviewerID":"A1GN8UJIZLCA59","asin":"B00000IPAC","reviewerName":"P Magnum","helpful":[4,7],"reviewText":"Pretzel Logic is the perfect name for this album because it has some of the best and most unique songs of their work. Songs such as the \"Monkey in Your Soul\", \"With a Gun\", \"Rikki Don't Lost That Number\" and \"About The Boy\" songs are subtle, twisted and crazy songs that keep you from staying. be quiet and listen. The songs follow a jazz theme, which covers the theme \"East St. Louis Toodle-Oo\" by the Duke of Ellington, and features Charlie \"Bird\" Parker \"Parker Group\". \"Any Great Owner will tell you\" is a rare number for them because it is done in an acoustic way. \"Rikki Don't Lose That Number\" is one of the rarest songs in the top ten (this is the main chart in their careers, they say # four), but its song is contagious. \"With a gun\" is a shooting sound. Pretzel Logic is the first album produced by the group after being a duo. For their first two albums, it was a tourist group, but from Pretzel Logic to the first stage of their career, they were in the studio, Donald Fagan and Walter Becker Leading a group of studio musicians.","overall":4,"summary":"Quite Logical","unixReviewTime":980380800,"reviewTime":"01 25, 2001"}
{"orig_index":28665,"reviewerID":"A1GN8UJIZLCA59","asin":"B00000IPAC","reviewerName":"P Magnum","helpful":[4,7],"reviewText":"Pretzel Logic is the perfect name for this album because it has some of the best and most unique songs of their work. These songs follow the theme of jazz, covering the instrument \"East St.\" Monkey in Your Soul \",\" Gun \",\" Rikki Don't Lose That Number \"and\" With The Boy \"are all those mysterious, cruel, and crazy things that make you sit down and listen really songs. These songs Following the theme of jazz music, I sang the instrumental song \"East St. Louis Toodle-Oo \"by Duke of Ellington and I paid tribute to Charlie\" The Bird \"Parker\" Parker's Band \". - # four), but it has contagious music. On their first albums, they were a regular tour group, but from Pretzel Logic to the first stage of their career, they were in the studio, with Donald Fagan and Walter Becker leading the studio of the studio musicians. \"Any Big Man Will Tell You\" for them because it is made in an acoustic way. will tell you \"it is made in acoustic style.\" Rikki don't close that number \"is one of the most amazing songs in their career.","overall":4,"summary":"Quite Logical","unixReviewTime":980380800,"reviewTime":"01 25, 2001"}
{"orig_index":28665,"reviewerID":"A1GN8UJIZLCA59","asin":"B00000IPAC","reviewerName":"P Magnum","helpful":[4,7],"reviewText":"Pretzel Logic is the best name for the album, as it contains the most twist and amazing songs of their career. Songs like the title cut, “Monkey in Yourself”, “Gun”, “Rikki Don’t Lose That Number”, and “With the Boy” are songs with dark, twisted, insane plots that sit in and. really listen. The songs follow jazz roots by producing Duke Ellington’s instrumental cover of “East St. Louis Toodle-Yes” and Charlie’s “Parker’s Band” “The Bird” Parker. “Every good person will tell you” is a rare number for them because it is made in the form of a sound. “Rikki Don’t Lose That Numbers” is one of those stunning songs to hit the top ten (it’s the top chart in their career, speaking #afar), but it has an infectious melody. The “gun” is a noisy cut. Pretzel Logic was the band’s first album after they became two. Their first two albums were a working group visit, but from Pretzel Logic to the first stages of their careers, they were originally in the studio with Donald Fagen & Walter Becker directing the studio part show.","overall":4,"summary":"Quite Logical","unixReviewTime":980380800,"reviewTime":"01 25, 2001"}
{"orig_index":30690,"reviewerID":"A2X0GI1H23MFUW","asin":"B00003002C","reviewerName":"Aparato SuperSonico","helpful":[0,1],"reviewText":"Every person I've never known that towns a CD players towns a copy of Bob Marley \"Legend\". Similarly, anyone who towns a decent to top quality stereo (particularly a turntable) should own this album.","overall":5,"summary":"The classic album to measure HiFi by","unixReviewTime":1399939200,"reviewTime":"05 13, 2014"}
{"orig_index":30690,"reviewerID":"A2X0GI1H23MFUW","asin":"B00003002C","reviewerName":"Aparato SuperSonico","helpful":[0,1],"reviewText":"Everyone did't know that the CD player had donated a copy of Bob Marley's \"Legend\". Likewise, anyone with high profile (especially turntables) should own this album.","overall":5,"summary":"The classic album to measure HiFi by","unixReviewTime":1399939200,"reviewTime":"05 13, 2014"}
{"orig_index":30690,"reviewerID":"A2X0GI1H23MFUW","asin":"B00003002C","reviewerName":"Aparato SuperSonico","helpful":[0,1],"reviewText":"Anyone with a high quality stereo (especially a turntable) should own a disc. Anyone","overall":5,"summary":"The classic album to measure HiFi by","unixReviewTime":1399939200,"reviewTime":"05 13, 2014"}
{"orig_index":30690,"reviewerID":"A2X0GI1H23MFUW","asin":"B00003002C","reviewerName":"Aparato SuperSonico","helpful":[0,1],"reviewText":"bob greene: Anyone should have this album. The \"Legend\" is a good example of a good record. greene: \"Legend\" is a great example","overall":5,"summary":"The classic album to measure HiFi by","unixReviewTime":1399939200,"reviewTime":"05 13, 2014"}
{"orig_index":32413,"reviewerID":"A3BRON54JBBNDK","asin":"B00004T8ZB","reviewerName":"\"empty68\"","helpful":[0,1],"reviewText":"\"Fold Your Hands Child, You Walk Like a Peasant\" (nice title, kids) is a fairly typical B&S record: it's another collection of wispy, enigmatic, slightly silly, and absolutely masterful pop ditties presented by way of the usual offhanded, retro-sounding approach. Don't get me wrong, this is great stuff -- but can you imagine what they could do if they actually started TRYING? Just a thought.","overall":4,"summary":"yet more brilliance (yawn)","unixReviewTime":960249600,"reviewTime":"06 6, 2000"}
{"orig_index":32413,"reviewerID":"A3BRON54JBBNDK","asin":"B00004T8ZB","reviewerName":"\"empty68\"","helpful":[0,1],"reviewText":"\"Hold Your Hands Baby, You Walk As a Guardian\" (good title, children) is a good standard B & S record: one that is slim, unpredictable, and stupid and completely. The best pop songs are done in a casual and retro way. Don't get me wrong, these are good things - but what do you think they can do to get you started? Just an idea.","overall":4,"summary":"yet more brilliance (yawn)","unixReviewTime":960249600,"reviewTime":"06 6, 2000"}
{"orig_index":32413,"reviewerID":"A3BRON54JBBNDK","asin":"B00004T8ZB","reviewerName":"\"empty68\"","helpful":[0,1],"reviewText":"\"Fold Your Hands Baby, You're Going On The Side\"","overall":4,"summary":"yet more brilliance (yawn)","unixReviewTime":960249600,"reviewTime":"06 6, 2000"}
{"orig_index":32413,"reviewerID":"A3BRON54JBBNDK","asin":"B00004T8ZB","reviewerName":"\"empty68\"","helpful":[0,1],"reviewText":"\"Hold Your Hands Baby, Go As A Guardian\" is a common B & S record. This is another collection of thin, unintelligible, flamboyant and praiseworthy pop songs","overall":4,"summary":"yet more brilliance (yawn)","unixReviewTime":960249600,"reviewTime":"06 6, 2000"}
{"orig_index":32602,"reviewerID":"AK3DY70GYZB2G","asin":"B00004T9UF","reviewerName":"Rex Marksmanson \"HEYO!\"","helpful":[0,0],"reviewText":"On Eminem's previous release \"The Slim Shady LP\" we were introduced to the immature white MC who wrapped about what the wanted, when the wanted and did't give a damn what you for anyone else thought. But when the \"Marshall Mathers LP\" came out the world was forced to meet a new slim shady, a much darker & more stressed out MC who was more fed up with the world than never. The only way for him to release this constant stress? On this latest album, for ninety% of the songs. This album contains some of the more serious and angry sounds of \"Kill you\", \"Stan\", \"The Way I Am\", \"Remember Me?\", \"Marshall Mathers\", \"Amityville\", and the always controversial \"Kim\". Also are songs reminiscent of Slim's older days on tracks \"The Real Slim Shady\" (Great song, but played out), \"I'm back\", \"Drug Ballad\" & \"Under the influence\". Great album, for as my friend Zepplintwenty-one put it \"A dark, nor classic\".","overall":5,"summary":"A more grown up and mature slim shady emerges","unixReviewTime":1000339200,"reviewTime":"09 13, 2001"}
{"orig_index":32602,"reviewerID":"AK3DY70GYZB2G","asin":"B00004T9UF","reviewerName":"Rex Marksmanson \"HEYO!\"","helpful":[0,0],"reviewText":"In an earlier release of Eminem's \"Slim Shady LP\", we were introduced to the immature white MC who wanted what and when, and did't care what you think of other people. But when \"Marshall Mathers LP\" came out, the world was forced to face a new black side, a black MC and more pressure who was more tired of the world than never before. Is the the only way to release this ongoing stress? In this latest album, ninety% of the songs. This album contains \"Kill you\", \"Stan\", \"The Way I Am\", \"Do You Remember Me?\", \"Marshall Mathers\", \"Amityville\" and the debate \"Kim\" \"Real Slim Shady\" (great song, but played), \"I'm Back\", \"Drug Ballad\" and \"Under the Impact\". A beautiful record, as my friend Zepplintwenty-one said \"black, not classic\".","overall":5,"summary":"A more grown up and mature slim shady emerges","unixReviewTime":1000339200,"reviewTime":"09 13, 2001"}
{"orig_index":32602,"reviewerID":"AK3DY70GYZB2G","asin":"B00004T9UF","reviewerName":"Rex Marksmanson \"HEYO!\"","helpful":[0,0],"reviewText":"\"Marshall Mathers LP\" contains ninety% of the songs. This album contains serious and annoying lyrics such as \"Kill\", \"Stan\", \"The Way I Am\", and \"Remember?\"","overall":5,"summary":"A more grown up and mature slim shady emerges","unixReviewTime":1000339200,"reviewTime":"09 13, 2001"}
{"orig_index":32602,"reviewerID":"AK3DY70GYZB2G","asin":"B00004T9UF","reviewerName":"Rex Marksmanson \"HEYO!\"","helpful":[0,0],"reviewText":"Eminem's earlier release \"Slim Shady LP\" was introduced to the immature white MC who wanted to be what the wanted to be, and did't care what the thought of others. This album has some sharp and catchy lyrics for \"Kill you\", \"Stan\", \"The Way I Am\", \"Remember Me?\", \"Marshall Mathers\", \"Amityville\" and \"Kim\"","overall":5,"summary":"A more grown up and mature slim shady emerges","unixReviewTime":1000339200,"reviewTime":"09 13, 2001"}
{"orig_index":32753,"reviewerID":"AJYSM99XWVT4O","asin":"B00004THL9","reviewerName":"Tyler Smith","helpful":[3,3],"reviewText":"\"Survival\" is one of three great albums Philadelphia's O'Jays presented during the first of the one thousand, nine hundred and seventy, the other two being \"Backstabbers\" and \"Ship Ahoy.\" For my money, \"Survival\" is the best of the bunch, a compelling blend of straight-ahead soul and for&b spiced with a strong dash of social commentary. The title tune provides a great example of the latter. A driving funk approach provides the perfect platform for the group to deliver its gritty vocals, which effectively convey the sense of desperation inside a man \"busted, walking' around broke.\"\"Rich Get Richer\" also provides sentiments the man in the street could relate to -- and still can. One of the best things the O'Jays do throughout the album is tell real, down-to-earth stories, and this tune rises above a diatribe with these great lines: \"There's an old friend of mine\/He's down' good, real good, as a matter of fact\/He don't know me now\/But I can take him way, way, way back.\" Great stuff. Like all the great Philly groups, the O'Jays had a way with a ballad and could put tons of genuine emotion into the simplest lyrics. They were't afraid of romance, but they did't lapse into happiness either: check out the straightforward \"Let Me Love to You,\" for the plaintive \"What Am I Waiting For,\" both of which combine well-crafted production with completely convincing and compelling vocals. One finds a dated element for two in listening to this now twenty-eight-year-old album, but these are easily outweighed by the group's pinpoint vocals, flawless arrangements and commitment to a musical concept. Recommended for those who were there and would like to relive it as well as for those coming to it for the first time. The old becomes new again.","overall":5,"summary":"Classic '70s soul","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":32753,"reviewerID":"AJYSM99XWVT4O","asin":"B00004THL9","reviewerName":"Tyler Smith","helpful":[3,3],"reviewText":"\"Survival\" is an eye-catching combination of the right soul and & of, and the strongest ideas in the community. \"Get Rich and Get Rich\" also provides for the emotions that can be associated with street men- and still can. Like all of Philadelphia's major bands, the O'Jays have a traditional way of singing traditional songs that can express many true feelings.","overall":5,"summary":"Classic '70s soul","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":32753,"reviewerID":"AJYSM99XWVT4O","asin":"B00004THL9","reviewerName":"Tyler Smith","helpful":[3,3],"reviewText":"One of O'Jays' greatest achievements during the entire stage was to tell a true, underground story. This song uses these great lines to go beyond the abuse: \"There's an old man My friend is very \/ very good, good, really \/ does't know me now \/ but I can get him back.\" for fun: take a look at \"Let Me Love You\", look at the sad \"What I'm Waiting For\", these two combine a carefully crafted product with a pleasantly and completely interesting sound. For me, \"survival\" is the best thing in this group, a wonderful combination of a direct soul and a & of, and a strong sense of community. perfect alignment and commitment in the concept of music. \"Rich Get Richer\" also provides the emotions that street men can have — and still do.","overall":5,"summary":"Classic '70s soul","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":32753,"reviewerID":"AJYSM99XWVT4O","asin":"B00004THL9","reviewerName":"Tyler Smith","helpful":[3,3],"reviewText":"\"Survival\" is an eye-catching combination of the right soul and & of, and a strong sense of community. The title song provides a good example of the latter. One of the best things O'Jays did with the whole album was tell true, underground stories.","overall":5,"summary":"Classic '70s soul","unixReviewTime":1050019200,"reviewTime":"04 11, 2003"}
{"orig_index":34972,"reviewerID":"A28UK350MERWUW","asin":"B00005B4GB","reviewerName":"L. Lawhead \"LSquared\"","helpful":[26,29],"reviewText":"Rock of Ages is a great live recording, capturing The Band during a New Year's Eve performance welcoming one thousand, nine hundred and seventy-two. This has been a favourite live albums of mine since I discovered it in the mid seventy's. This CD takes the original two album set and puts on a single CD. The are-mastered sound is great, and the performance is as vibrant now as it was then. One of the great parts of this set is the addition of a horn section on some of the songs. Both on upbeat songs such as \"Don't Do It\" and on quieter songs like \"The Night They Drove Old Dixie Down\". I've always liked \"Rock Of Ages\" more than the farewell set \"The Last Walz\", probably because this is all The Band, as opposed to the guest appearances that define The Last Walz. As if the are-mastered original recording was't enough, this deluxe edition adds a whole additional CD of live material. This is a collection of songs the Band often played during this time frame, and includes some gems that were't on the original recording (\"Up On Cripple Creek\" and \"I Shall Be Released\"). Plus four songs featuring Bob Dylan. The extra set is icing on the cake, and makes a great album even more essential. Highest recommendation!","overall":5,"summary":"A GREAT Live Album","unixReviewTime":1089331200,"reviewTime":"07 9, 2004"}
{"orig_index":34972,"reviewerID":"A28UK350MERWUW","asin":"B00005B4GB","reviewerName":"L. Lawhead \"LSquared\"","helpful":[26,29],"reviewText":"The Rock of Ages is a live recording party that holds the band during the New Year's performance, hosting one, nine hundred and seventy-two people. Because I found it in the mid-seventys, this is my favourite album. This CD uses a collection of two discs and is mounted on a single CD. The sound to the master is beautiful, and the performance is now as powerful as it was then. One of the most important features of this group is the addition of a palace component to other songs. Hopefully songs like \"Don't Do It\" and quiet songs like \"The Night They Drove Old Dixie Down\". I used to choose \"Rock of Ages\" in the farewell film \"The Last Walz\", which may be because that's what the band is all about, instead of describing the appearance of the Last Walz guests. As if the original recording is not enough, this deluxe version adds an additional CD of all living things. This is a collection of songs that the music group regularly played during this time, including some that were not on the original record (\"Up in Cripple Creek\" and \"I'll Be Free\"). Add four songs by Bob Dylan. An additional set is the icing on the cake and makes the great album even more important. Highly recommended!","overall":5,"summary":"A GREAT Live Album","unixReviewTime":1089331200,"reviewTime":"07 9, 2004"}
{"orig_index":34972,"reviewerID":"A28UK350MERWUW","asin":"B00005B4GB","reviewerName":"L. Lawhead \"LSquared\"","helpful":[26,29],"reviewText":"I used to choose \"Rock of Ages\" in the farewell film \"The Last Walz\", probably because that's what the band is all about, instead of describing the last came of Walz. This is a collection of songs that a group often played during this time, including gems that were not on the original record (\"Up On Cripple Creek\" and \"I'll Be Released\"). Hopefully songs like \"Don't Do It\" and quiet songs like \"Night Runs Old Dixie Down\". Rock of Times is a live record holding band during the New Year's performance, welcoming one, nine hundred and seventy-two people. As if the original recording is not enough, this deluxe version adds an additional CD of all living things. An additional set is the icing on the cake and makes the great album even more important. The sound to the master is beautiful, and the performance now is as powerful as it was then.","overall":5,"summary":"A GREAT Live Album","unixReviewTime":1089331200,"reviewTime":"07 9, 2004"}
{"orig_index":34972,"reviewerID":"A28UK350MERWUW","asin":"B00005B4GB","reviewerName":"L. Lawhead \"LSquared\"","helpful":[26,29],"reviewText":"Paper Stone is a large live record, recording the band during the New Year's performance, accommodating one, nine hundred and seventy-two people. The sound of the master is good, and the operation is now as powerful as it was at that time.","overall":5,"summary":"A GREAT Live Album","unixReviewTime":1089331200,"reviewTime":"07 9, 2004"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"I started listening to Travis because a friend of mine recommended them to me. I heard Driftwood, off \"The Man Who\", and was immediately hooked. This is one of the most interesting bands around. \"The Man Who\" is one of my favourite albums of all time, and still gets quite a bit of play from a man with one, zero + cd. I loved it so much, I checked out their first album, \"Good Feeling\", and was confused. \"Good Feeling\" was a decent album, but lacked the instrumentation and emotionally deep songwriting of \"The Man Who\". I was concerned over what kind of an album I would be hearing next from the boys across the pond. Well, much to my relief, they did't change much from \"The Man Who\". They use their talents to the max. The production, and the use of instruments is incredible - far surpassing that of their last album. Amazingly, so is the songwriting. This is one of those albums that you can not get enough of. The album gives music fans everywhere reason to be hopeful. Travis is one of those bands that may never catch on in the mainstream, due to the overplay of annoying cookie-cutter punk rock, wrap rock, and teen pop stars. Travis does't fit into the modern radio mold of airplay. They are better than that. The album is blessed with many, many great songs. Sing has one of the catchiest hooks on the album, that you can't help but get into. The songwriting is best displayed on songs like Side, The Humpty Dumpty Love Song, and Pipe Dreams (\"I'd spray to God if there were heaven, but heaven sees so very far from there\"). The album also is helped out by the comforting power of Safe - which is a song I turned to frequently in the aftermath of Sept eleventh. Flowers in the Window is a fun, uplifting, song that always brings a smile to my face. Other greats are Last Train, and The Cage, both of which show off everything I love about the album - songwriting and instrumentation. My only negative comment about the album is the second song, Dear Diary. It in't that it is a bad song. It is most certainly a good song, and does belong on the album. I just feel as though after the great momentum that Sing brings with the first track, the space of the album hits a wall just two tracks in. The song should have been moved to later in the album. A small complaint, but a complaint nonetheless. This is a disc that everyone should own, if not for the great songwriting for the amazing musicianship and production.","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"I started listening to Travis because my friend recommended me. I heard Driftwood on \"The Man Who\" and was immediately drawn. This is one of the most interesting bands. \"Man Go\" is one of my favourite albums of all time, and it can get a lot of play for someone with zero + cd. I really liked it, I watched their first album \"Good Feelings\" and was confused. \"Feeling good\" is a good album, but it does't have the musical instruments and the emotional composition of the song \"Who's a Man\". I'm worried about what album I'm going to hear from the boy across the lake. Well, to my relief, they haven't changed much in \"Who's Who\". They develop their talents. The production and use of musical instruments is amazing — far beyond their final album. Surprisingly, it is true to write a song. This is one of those plates you can’t get enough of. This album gives music fans everywhere a reason to be optimistic. Due to the annoyance of cookie-cutter punk rock, the surrounding rock, and the overuse of young stars, Travis is one of those bands that may never be popular in the general public. Travis does not deserve to be broadcast in today's broadcast. They are better than that. Lots, lots of great songs on this album. Sing has one of the most charming spells on this album, and you can't help but absorb it. Songwriting is best seen in songs like Side, Humpty Dumpty Love Song and Pipe Dreams (\"If there is a brain, I will sprinkle water on God, but the sky is far away\"). Safe's comforting power has also helped the album - this is a song I always turn to after eleven September. The flower outside the window is a funny and interesting song, always making my face smile. Other great works are Final Train and Cage, both of which show everything I love about songwriting and album material. My only negative reaction to this album is the second song, my favourite diary. This is not a bad song at all. This is definitely a good song, and it's really on record. I just think that after the great speed brought by the first song of Sing, the space of the album hit the wall with only two songs. This song should be delivered in the last part of the album. A small complaint, but still a complaint. This is a CD that everyone should have, if not for the sake of outstanding musical talent and the creation of a great song.","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"\"Who's the Man\" is one of my favourite albums of all time, and can still be played most of the time with someone who has it, zero + CD. The production and use of musical instruments is amazing — far beyond their final album. The song creation is best seen in songs like Side, Humpty Dumpty Love Song and Pipe Dreams.","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"\"Man\" is one of my favourite albums of all time, and it still plays a bit. \"Feel Good\" is a good album, but it does't have the equipment and the composition of the \"person\" song. This album has a lot of great songs.","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35377,"reviewerID":"A9DXT4NZP2Y11","asin":"B00005K9KP","reviewerName":"\"jimmy_jim_jim\"","helpful":[6,7],"reviewText":"This album was my introduction to The White Stripes. After seeing four of their videos on MTVtwo, I decided to get the album. I am very pleased. While it's not as great as De Stijl, at least it's more varied than the honest album. This is where Jack and Meg begin to shine artistically. Dead Leaves is a very basic song with a very basic riff. Sort of like Green Day's Brain Stew, but with a touch of The Kinks. Hotel Yorba sounds like it came directly from The Kinks. It has a hooky chorus, and clever lyrics. I'm Finding It Harder To Be A Gentlemen is irritable because of that damn piano line. It's so good! Fell In Love With A Girl, the big single, is jangly sixty's punk. Kind of hard to describe, but you'll understand when you hear it. Straight out of one thousand, nine hundred and sixty-nine. Expecting can be described in one word. swampy. I'm not kidding, it reminds me of a big swamp. It's cool. Little Room is filler. Plain and simple. The Union Forever is annoying. It has too much screaming, the same chords, and a trip-off of Citizen Kane. Didn't like it. Same Boy You've Always Known is a great tribute to The Beatles. That's what I thought when I heard Jack singing. Same thing with We're Gonna Be Friends. Offend In Every Way is a very sarcastic song, with a sneaky guitar riff. I Think I Smell A Rat is annoying and repetitive. Too much of the one chord thing. Aluminum has the best guitar riff never made. WHY was't this riff thought of sooner? I Can't Wait is too unoriginal, but it's still fun. Now Mary is a great folk song with some beautiful singing. I Can Learn is dull. It's nice, but I think this formula's over now. This Protector reminds me of Radiohead. It's a nice ending to a commercial success. White Blood Cells is nowhere near as good as critics say, but it's a solid threerd album, none the less. It's deserving of a four.","overall":4,"summary":"A commercial and artistic breakthrough.","unixReviewTime":1051401600,"reviewTime":"04 27, 2003"}
{"orig_index":35377,"reviewerID":"A9DXT4NZP2Y11","asin":"B00005K9KP","reviewerName":"\"jimmy_jim_jim\"","helpful":[6,7],"reviewText":"This album is my introduction to white strings. After watching four of their videos on MTVtwo, I decided to get this album. Very happy. Although not as good as De Stijl, it is at least a little different than a trusted album. That’s where Jack and Meg began to shine in the arts. Dead Leaves is a very basic song with a fundamental improvement. It’s similar to Green Day’s Brain Stew, but it tastes Kinks. The Yorba hotel sounds like it comes directly from Kinks. It has a charming choir and intelligent vocals. I find it hard to be honest, because that piece of piano is so annoying. Very cute! He fell in love with one big girl, a sixtys punk style. It's a little hard to explain, but you'll understand when you hear it. One thousand nine hundred and sixty-nine. Expectations can be defined in one word. swamp. I’m not kidding, it reminds me of a swamp. This is awesome. The small room is full. It is clean and tidy. Forever alliance is annoying. It has many complaints, the same words, and the stumbling block of Citizen Kane. Don't like it. \"The Same Boy You Always Know\" is a tribute to the Beatles. I thought so when I heard Jack using. The same thing we want to be friends with. Offend In Every Way is a very embarrassing song that can improve the guitar. I think my smell of rats is annoying and repetitive. There are too many things for one thing. Aluminum has the most advanced guitar never made. Why not think of this improvement before? I Can't Wait is very original, but still interesting. Now Mary is the song of an adult with a beautiful voice. I can read a lot. This is good, but I think this formula is now over. This protector reminds me of Radiohead. This is a happy ending to business success. White blood cells are far from ideal, as critics claim, but they are still the third most reliable compound. It costs four points.","overall":4,"summary":"A commercial and artistic breakthrough.","unixReviewTime":1051401600,"reviewTime":"04 27, 2003"}
{"orig_index":35377,"reviewerID":"A9DXT4NZP2Y11","asin":"B00005K9KP","reviewerName":"\"jimmy_jim_jim\"","helpful":[6,7],"reviewText":"This disc introduces the white lines very well. Not as good as De Stijl, but at least very different from a trusted album. Dating a girl is a punk in the sixtys.","overall":4,"summary":"A commercial and artistic breakthrough.","unixReviewTime":1051401600,"reviewTime":"04 27, 2003"}
{"orig_index":35377,"reviewerID":"A9DXT4NZP2Y11","asin":"B00005K9KP","reviewerName":"\"jimmy_jim_jim\"","helpful":[6,7],"reviewText":"White Blood Cells are far from perfect as critics claim, but it is still a solid third component. Although not as good as De Stijl, it is very different from a trusted album. Love Girl is one great game, punk style of the sixtys. This is good, but I think this formula is now over. It has too many complaints, the same methods, and the stumbling block of Citizen Kane. I Can't Wait is very original, but still interesting. It’s similar to Green Day’s Brain Stew, but it tastes Kinks.","overall":4,"summary":"A commercial and artistic breakthrough.","unixReviewTime":1051401600,"reviewTime":"04 27, 2003"}
{"orig_index":35633,"reviewerID":"A2PV6GK1HV54Y9","asin":"B00005M987","reviewerName":"ADRIENNE MILLER","helpful":[1,2],"reviewText":"Michelle Branch's debut album, The Spirit Room is a refreshing collection from an artist I never would have thought twice about listening to. But I am glad I put my reservations aside and gave this album a chance. To my surprise, all eleven tracks are strong and great. Her voice can be a tad whiny and flat at times, but she plays guitar and writes some amazing music so that makes up for it. Drop in the Ocean, All you Wanted, and If Only she Knew are my favourite tracks. She shows great promise on Sweet Misery and Goodbye to You. Her sophomore effort, Hotel Paper is not as good as The Spirit Room so I recommend getting this particular album instead, it's more catchier than Hotel Paper.","overall":5,"summary":"\"Love led me to you...\"","unixReviewTime":1146700800,"reviewTime":"05 4, 2006"}
{"orig_index":35633,"reviewerID":"A2PV6GK1HV54Y9","asin":"B00005M987","reviewerName":"ADRIENNE MILLER","helpful":[1,2],"reviewText":"Michelle Branch’s first door, The Spirit Room is a renaissance collection of artists I never thought to listen to twice. But I’m glad I put aside my accomplishments and gave the album a chance. To my amazement, all eleven roads were rigid and overwhelming. His voice may be cloud and smooth at times, but the plays guitar and writes beautiful music to capture it. Fall Into The Ocean, All You Want, And If You Only Knew This Is My Favorite Trail. It shows you a great promise of sweet sorrow and peace for you. For this second effort, Hotel Letter is not as good as Spirit Room so I recommend picking up this special album, it is more attractive than Hotel Letter.","overall":5,"summary":"\"Love led me to you...\"","unixReviewTime":1146700800,"reviewTime":"05 4, 2006"}
{"orig_index":35633,"reviewerID":"A2PV6GK1HV54Y9","asin":"B00005M987","reviewerName":"ADRIENNE MILLER","helpful":[1,2],"reviewText":"Michelle Branch's first door, the Spirit Room, is a renaissance collection by artists. fall into the sea, all you want, and if the only knew this was my favourite trail. for this second effort, Hotel Paper was not as good as the Spirit Room.","overall":5,"summary":"\"Love led me to you...\"","unixReviewTime":1146700800,"reviewTime":"05 4, 2006"}
{"orig_index":35633,"reviewerID":"A2PV6GK1HV54Y9","asin":"B00005M987","reviewerName":"ADRIENNE MILLER","helpful":[1,2],"reviewText":"Michelle Branch's debut album, Spirit Room The most beautiful collection to listen to I never thought about that. But I'm glad I put my booking aside and gave this album a chance. What amazes me is that all eleven tracks are powerful and beautiful. His voice can be sweet and low at times, but the plays the guitar and writes wonderful music for this success. Drop in the Ocean, All You Wanted, and if only you knew my favourite songs. He shows you the great promise in sweet trouble and goodbye. Her second attempt, Hotel Paper is not as good as The Spirit Room so I suggest her take this special album instead, it has more than hotel paper.","overall":5,"summary":"\"Love led me to you...\"","unixReviewTime":1146700800,"reviewTime":"05 4, 2006"}
{"orig_index":38668,"reviewerID":"A3LWC833HQIG7J","asin":"B000066TPM","reviewerName":"austin_Larry","helpful":[3,4],"reviewText":"I saw Nickel Creek live for the first time last September. Hadn't heard the new album, had worn out the first album. First off they are great live. Chris could solve a good part of the energy needs for a small town if they could plug him in. Perhaps because I love the songs I knew so much I thought those performances were wonderful and when they did stuff from the This Side, I was like yeah, whatever, where is the musicianship? I decided to eventually get this CD because I thought even if I did not like it as much as the first it had a better then average chance of being good. It is actually very good and a very enjoyable listen. In some ways I like it more then the first one. The musicianship is still there and the wonderful voices still abound and there is even greater harmonizing on many songs. More of the songs have a 'sassy' edge rather then the serious and sad edge of the first album. I got the impression from many of the reviews there that this was a step backward, don't get this album. Thankfully I don't always listen to Amazon reviews. What I think is this. If you like bluegrass for any type of folk (or pop there) get this album. If you like Nickel Creek for sure get this album. Perhaps you will have to listen to it a few times. But eventually everything you liked about the first album you will find there. I enjoy many of the lyrics as well especially on the title track.","overall":5,"summary":"Skpetical at first but wonderful CD","unixReviewTime":1043539200,"reviewTime":"01 26, 2003"}
{"orig_index":38668,"reviewerID":"A3LWC833HQIG7J","asin":"B000066TPM","reviewerName":"austin_Larry","helpful":[3,4],"reviewText":"I have never heard of a new album, and the first album was used. I decided to get this CD because I also think I don't like it as much as the first one, it has a better chance than the average. The idea that I have come across in many studies is that this is a step backwards, not getting this album. Compared to the depth and sadness of the first album, many songs have a \"barbaric\" edge. If you like any kind of people (or pop) bluegrass music, please get this album. Maybe it's because I like the songs I know the most. I think these games are fun. When they did \"This Case\", I was like that. Anyway, where's the musical talent? There are still musicians, beautiful sounds, and a lot of harmony.","overall":5,"summary":"Skpetical at first but wonderful CD","unixReviewTime":1043539200,"reviewTime":"01 26, 2003"}
{"orig_index":38668,"reviewerID":"A3LWC833HQIG7J","asin":"B000066TPM","reviewerName":"austin_Larry","helpful":[3,4],"reviewText":"I saw the Nickel Creek broadcast for the first time last September. I haven't heard a new album, it's old.","overall":5,"summary":"Skpetical at first but wonderful CD","unixReviewTime":1043539200,"reviewTime":"01 26, 2003"}
{"orig_index":38668,"reviewerID":"A3LWC833HQIG7J","asin":"B000066TPM","reviewerName":"austin_Larry","helpful":[3,4],"reviewText":"Music talent is still there, beautiful sounds are still everywhere, and many songs are more in tune. Compared to the depth and sadness of the first album, many songs have a \"barbaric\" edge.","overall":5,"summary":"Skpetical at first but wonderful CD","unixReviewTime":1043539200,"reviewTime":"01 26, 2003"}
{"orig_index":41650,"reviewerID":"A3R2V9HJJ63GBT","asin":"B00008J4P5","reviewerName":"B. Harris","helpful":[18,49],"reviewText":"I really had to think hard about reviewing this cd. Not because I don't like it; *that* feeling has never stopped me from writing a review before. Rather, it is the seeming inability of fans of the White Stripes to come to any other conclusion about the group other than that they are \"musical geniuses\" and the apparent savior of rock. In other words, what is the point in being a dissenting voice if you're simply going to be drowned out by people who did't want to hear your opinion in the first place? But then I thought again--I thought about how wretchedly awful this cd truly is. How the record-buying masses have been duped into thinking that the Siblings White truly *are* musical geniuses who write clever, engaging songs. About how Jack White has found not only fans of this tired brand of garage-blues, but has actually become a household name and celebrity off of it. And it made me nauseous. So, off to write the one-star review I go. I'll get right to the point: this is a terrible album. Pure and simple. The songwriting is below average at best--frequently dull, monotonous and recycled. The idea of garage-rock blues is nothing new, and Jack and Meg add absolutely nothing to a genre already filled to the brim with over-hyped and under-talented groups. Jack's guitar playing is mediocre, and by no means whatsoever worthy of the \"guitar god\" status that has inexplicably been placed on him. To place him on any kind of \"Greatest Guitarists\" list is an insult to everyone capable of playing more than three chords on their six string. Meg's drumming is equally yawn-inducing and very rudimentary. Some people hear rawness and energy in the White Stripes--I, on the other hand, hear a black of rhythm, talent and overall musical ability. Those are two completely different things people. So what is it, then? Why do so many people so *fervently* believe that this is legitimate boundary-pushing, genre-defining immortal music? I honestly have no idea. But the reviewer a few spots below me who noted that the White Stripes fan base is comprised primarily of Urban Outfitters shoppers looking for it-shirts with witty slogans was dead on. The White Stripes are defined as being \"cool\", so you must like them. Someone sitting high up in one of the record company towers had a brainstorm one afternoon, and decided that the pop world was in need of a band with a shred of indie cred to appeal to the Britney-Christina page group. And flo, the White Stripes fit the bill. So there we are. None of this would matter one iota, really, if it were't for the fact that a multitude of truly outstanding, talented bands are existing below the radar while these clowns are playing on TRL. But that's how it always has been in music, I suppose, and it's naive to think that anything would change now. I imagine, in the send, my criticisms will fall on deaf years, much like others on there. And fans of the Stripes will go on as before, blissfully ignorant to the fact that their rock savior are little more than corporate cash cows, promoted with a programmed image designed to brake in the $$$. But, they, if that's what it takes to stay with the \"in\" crowd, then I guess it does't matter.","overall":1,"summary":"Wouldn't be bad if they could play, write music and\/or sing","unixReviewTime":1098835200,"reviewTime":"10 27, 2004"}
{"orig_index":41650,"reviewerID":"A3R2V9HJJ63GBT","asin":"B00008J4P5","reviewerName":"B. Harris","helpful":[18,49],"reviewText":"I need to think seriously about reviewing this CD. It’s not that I don’t like it; if emotion did not stop me from writing the study. On the contrary, apart from being “music geniuses” and explicit stone savers, White Stripes fans seem to be unable to get any conclusions about the band. In other words, if you are overwhelmed by people who do not want to listen to you in the first place, what is the point of making different sounds? But then I thought about it again - I thought about how sad this CD is. How can people who buy records be deceived into thinking that the white brothers and sisters are really talented, and they will write clever and interesting songs. About how Jack White did’t get fans of this tired garage brand, but the’s actually become a household name and celebrity. It makes me sick. So, write a review of the one star I went to. I'm going to get to the point: This is a bad album. Pure and simple. Songwriting is below average for the best — often tiring, fun and repetitive. The idea of ​​garage rock blues is nothing new, and Jack and Meg have nothing to add to this genre that is already full of overcrowding and talented bands. Jack's guitar is in the middle and should't be this mysterious \"guitar god\" status. Putting him on any kind of \"big guitar list\" is an insult to someone who can play more than three chords on the sixth string. Meg's drum beats are also yawn and very crude. Some people feel old and strong in the white lines — on the other hand, I feel the darkness of rhythm, talent and musical talent in general. These are two very different people. So what? Why do so many people believe * with interest * that this is a legitimate, immortal music that breaks boundaries and defines certain genres? Honestly, I don’t know. But my commenter in the following areas explain that White Stripes fans mostly consist of Urban Outfitters buyers, who want a shirt with funny slogans. White stripes are described as “cool”, so you should love them. One afternoon, people sitting in a high-rise recording studio building had a vision and decided that the pop world needed a band with an independent celebrity track to attract Britney Christina fans. And the flo, white lines meet the requirements. I am there. It does’t matter at all, in fact, if it were’t for when these jokes were playing on TRL, most of the outstanding and talented teams were under the radar. But I think this is a normal part of music, and it does't make sense to think that everything will change now. I think in posting, my criticism will fall on deaf and dumb years, like others there. Lovers of Stripes will continue as before, happy not knowing that their stone savior is nothing more than a cow of the company's money to prevent the making of images of the dollar system. But, for them, if that’s what it takes to be with the “for” crowd, then I don’t think it matters.","overall":1,"summary":"Wouldn't be bad if they could play, write music and\/or sing","unixReviewTime":1098835200,"reviewTime":"10 27, 2004"}
{"orig_index":41650,"reviewerID":"A3R2V9HJJ63GBT","asin":"B00008J4P5","reviewerName":"B. Harris","helpful":[18,49],"reviewText":"This is not important at all, really, if not because when these rescuers play on TRL, there are a lot of great and talented bands under the radar. Some people feel the roughness and toughness of the White Stripes — on the other hand, what I feel is the rhythm, the talent and all the knowledge of black music. But, for them, if this is what they need to live with \"inside\" people, I don't think it matters. I think in posting, my criticism will fall on the years of the deaf and dumb, like others there. Lovers of Stripes will continue as before, happy not knowing that their stone savior is nothing more than a corporate cash cow, preventing the creation of a $$$ system. But I think this is normal in music, and it is foolish to think that everything will change now. Jack's guitar is in the middle and should't be this mysterious \"guitar god\" status.","overall":1,"summary":"Wouldn't be bad if they could play, write music and\/or sing","unixReviewTime":1098835200,"reviewTime":"10 27, 2004"}
{"orig_index":41650,"reviewerID":"A3R2V9HJJ63GBT","asin":"B00008J4P5","reviewerName":"B. Harris","helpful":[18,49],"reviewText":"Songwriting is below average which is usually dull, fun, and recycled. Jack's guitar is illegal, unsuitable for this status as an indescribable \"guitar god\".","overall":1,"summary":"Wouldn't be bad if they could play, write music and\/or sing","unixReviewTime":1098835200,"reviewTime":"10 27, 2004"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"Interestingly enough, this new Michael Jackson disc list all number jones. I compiled a track listing with their original charting years and speak position on the billboard hot one hundred:one. Don't Stop 'Til You Get Enough- one for one week (one thousand, nine hundred and seventy-nine)two. Rock With You - one for four weeks (one thousand, nine hundred and eighty)three. Billie Jean- one for seven weeks (one thousand, nine hundred and eighty-three)four. Beat It - one for three weeks (one thousand, nine hundred and eighty-three)five. Thriller - number four (one thousand, nine hundred and eighty-four)six. I Just Can't Stop Loving You- one for one week (eighty-seven)seven. Bad - one for one week (eighty-seven)eight. Smooth Criminal- number seven (eighty-eight)nine. The Way You Make Me Feel- one for one week (eighty-seven)ten. Man in the Mirror - one for one week (eighty-eight)eleven. Dirty Diana - one for one week (eighty-eight)twelve. Black for White- one for seven weeks (ninety-one)thirteen. You Are Not Alone- one for one week (ninety-five)fourteen. Earth Song - did not chart in the US, however #one in UKfifteen. You Rock My World - #one thousand and sixteen. Break of Dawn- did not chartseventeen. One More Chance- new songeighteen. Ben - one for one week (seventy-two)","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"Get up until you are full on Monday (seven hundred and ninety-nine) and two. The rock and roll with you lasted four (one thousand, nine hundred and eighty) weeks. Beat it five to three weeks (one thousand nine hundred and eighty-three). Billie Jean - seven weeks (one thousand nine hundred and eighty-three) four. Eight-eight per week (eighty-seven). Someone in the mirror - one (eighty-eight) eleven times a week. Brown Diana-Twelve per week (eighty-eight).","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"Interestingly, this new Michael Jackson disc lists all the jones numbers. I have prepared a list of songs with their years on the original chart and I speak in place of a hundred hot dust: one. Don’t stop until you experience enough - a week (one thousand, nine hundred and seventy -nine) two. Rock With You - a four week (one thousand, nine hundred and eighty) three. Billie Jean- one for seven weeks (one thousand, nine hundred and eighty-three) four. Beat It - one three weeks (one thousand, nine hundred and eighty -three) five. Thriller - number four (one thousand, nine hundred and eighty -four) six. I Can't Stop Loving You - One Week (Eighty -Seven) Seven. Bad - a week (eighty -seven) weight. Equally guilty- number seven (eighty-eight) nine. How You Feel for Me - one week (eighty -seven) ten. Man in the Mirror - one week (eighty -eight) eleven. Dirty Diana - one week (eighty -eight) twelve. Black for White- eleven weeks (ninety-one) thirteen. You are not alone-a week a week (ninety-five) fourteen. Song of the Land - not listed in the US, however #mid in the UK fifteen. You shook my world - # thousand sixteen. Breaking Dawn - the did’t chartseventeen. One More Opportunity - a new song and eighteen. Ben- a week (seventy-two)","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":44436,"reviewerID":"A97B72F4UI8FA","asin":"B0000DJE9R","reviewerName":"Nick","helpful":[29,38],"reviewText":"Don't Stop 'Till You Get- a week (one thousand, nine hundred and seventy-nine) two. Stone with - a four weeks (one thousand, nine hundred and eighty) three. Beat - one to three weeks (one thousand, nine hundred and eighty -three) five. Billie Jean- a seven week (one thousand, nine hundred and eighty-three) four. Bad - a week a week (eighty -seven) weight. Man in the Mirror - eleven weeks. Dirty Diana - one week one week (eighty -eight) and twelve.","overall":4,"summary":"Billboard Facts","unixReviewTime":1069200000,"reviewTime":"11 19, 2003"}
{"orig_index":45810,"reviewerID":"A139ZF7CJVVTJU","asin":"B00020H9ZW","reviewerName":"Mark Eremite \"This Is A Display Model Only\"","helpful":[0,1],"reviewText":"As a follow-up to this seamlessly silky \"Airdrawndagger,\" Sasha put out \"Involver,\" a collection of songs individually remixed to bear the trademark Sasha appeal: light-as-a-feather frequencies co-mingling with a sly-n-slushy subversiveness. It's mastered as, yet again, an uninterrupted thread of music, but this time each song really does stand alone. The name is a tad ironic, since Sasha's style is more conducive to detachment, to transcendence. In that vein, the builds this album's style on a foundation of dark, rolling thunderhead. Billowing, broiling, harsh as a whisper, there is still the promise of crumbling power, a fashionable tremble of something electric going on. There is trance music's usual sense of elevation, but Sasha adds a hint of danger and foreboding that remains everpresent, giving an album that could've been fluffy and dismissable a delicious edge of ozone. The heady intro to this CD is \"Talk Amongst Yourselves,\" a moody number by Grand National that Sasha stirs up with an antsy beat that seems eager to jump up and run. Sasha never lets go of the reins, though, guiding the mood through the sashaying salsa sparks of Shpongle's \"Dorset Perception,\" the soft sighs of U. N. K. L. E.'s \"What You Mean to Me,\" and even through the mechanical energy of Felix Da Housecat's \"Watching Cars Go By.\" He caps the record off with a gorgeous refiguring of Ulrich Schnauss's already gorgeous \"On My Own.\"It's a fitting finale on a record that walks the fuzzy border between sleeping and awake, between day dreams and nightmares, between a sprint, a stroll, and a soar. It's a summer storm of sound, sometimes crashing and dark, but always warm, always fun, and always always refreshing.","overall":5,"summary":"Involver Envelops","unixReviewTime":1173830400,"reviewTime":"03 14, 2007"}
{"orig_index":45810,"reviewerID":"A139ZF7CJVVTJU","asin":"B00020H9ZW","reviewerName":"Mark Eremite \"This Is A Display Model Only\"","helpful":[0,1],"reviewText":"As a follow-up to this seamless and silk \"Airdrawndagger\", Sasha launched \"Involver\", with a set of different mixed songs. Sasha's trademark: feather - a light bulb mixed with mud tricks. It is also known as an uninterrupted musical instrument, but this time each song is truly independent. The name is funny, because Sasha's style is more suited to independence and transcendence. In this spirit, the style of the album is based on the dark, rolling noise. Roaring, burning, whining-like, whispering, there is still the promise of dynamic energy, the trembling of electric fashion happening. There’s a common sublimation of trance music, but Sasha adds a sense of danger and a terrifying premonition, this feeling has always been there, bringing the sweet ozone player to an album that can be bent and irrelevant. The intriguing introduction to this CD is \"Speak Yours\", a convert to Grand National, and Sasha wakes it up with an unmistakable rhythm that seems like an surge to jump and run. However, Sasha never let go of the strings, using the sparks of the salsa dance \"Dorset Perception\" by Shpongle, the soft sigh of \"What You Mean to Me\" by UNKLE, and the mechanical power of Felix Da Housecat leading emotions. \"Look at the passing cars\". And flying in the sky. This stormy summer sound, sometimes cloudy and dark, but always warm, always interesting, and always refreshing.","overall":5,"summary":"Involver Envelops","unixReviewTime":1173830400,"reviewTime":"03 14, 2007"}
{"orig_index":45810,"reviewerID":"A139ZF7CJVVTJU","asin":"B00020H9ZW","reviewerName":"Mark Eremite \"This Is A Display Model Only\"","helpful":[0,1],"reviewText":"Besides this, Sasha never stopped kidnapping. Da Housecat. This stormy summer sound, sometimes cloudy and dark, but always warm, always interesting, and always refreshing. \"This is the perfect ending to the record, between sleep and waking, between daydreams and nightmares, between sprints, walks and hikes. Sasha releases \"Involver\", another collection of songs mixed up separately to carry Sasha's trademark. Normal light is mixed with muddy tricks. have an effect and can be dismissed. \"Trembling that occurs in electrical energy. A dangerous crust with a terrible, permanent premonition, gives a piece that can otherwise be hot and irritating. The CD is flawless, but the sheer beauty of the first six tracks demands my five stars. The constant mixing and perfect selection of the first six songs is just fun. Roseth (Dennis Roseth).) I think when you have to pay for the songs you choose, ‘put everything you really want in C. However, this CD is good to buy . Compared to Digweeds MMII. I hope this helps.","overall":5,"summary":"Involver Envelops","unixReviewTime":1173830400,"reviewTime":"03 14, 2007"}
{"orig_index":45810,"reviewerID":"A139ZF7CJVVTJU","asin":"B00020H9ZW","reviewerName":"Mark Eremite \"This Is A Display Model Only\"","helpful":[0,1],"reviewText":"Sasha does't let go of her ship, however, she guides the situation through Shpongle's salsa bubble \"View of Dorset,\" \"UNKLE's soft sigh\" \"What do you mean tell me, \"and even by Felix Da Housecat's\" Energy Watch Go By. \" It was a summer storm of noise, unintentional and dark, but always warm, always fun, and always relaxing. \"This is an appropriate conclusion to the continuing note of the dark boundary between sleep and waking, between dreams and nightmares, between running, walking, and lifting. Taught as, however, an uninterrupted one string music, but this time every song is really alone. Sasha's reputation for appeal: A combination of light waves with inn-slushy deception.a dangerous and progressive trend that exists, which gives on the album a fragile and ozone-like sweetness","overall":5,"summary":"Involver Envelops","unixReviewTime":1173830400,"reviewTime":"03 14, 2007"}
{"orig_index":45924,"reviewerID":"A2OGE60OKOFMQF","asin":"B00026WVC2","reviewerName":"Michael Barrera \"www.silentrival.com\"","helpful":[1,1],"reviewText":"I know. long-time Underoath fans feel left out in the cold, a band that once cranked out Black metal-inspired music (The Act of Depression) to a dynamic combination of metal and hardcore on \"The Changing of Times\". And yes, without Dallas the vocals are not the same, this deathly screeches will be missed but I must address that Spencer is has a great singing voice to compliment the bands 'new' sound. The first track \"Young and Aspiring\" is full of adrenaline combining sincere back-up vocals with pulsating guitar riffs and scathing screams. The next track was the one that established in my mind that UO were going into new territory, \"A Boy Brushed Red. Living in Black and White\" drives an almost Dead Poetic (Newer material) sound, but in spite of how many similarities this album has to other suppose 'emocore' and 'hardcore' offerings, Underoath are still steps above most of the pack. Sure, a song like \"Reinventing your Exit\" is bound to attract a bigger legion of fans than before, the song itself is admittedly extremely catchy. The band brushes off their older sound on \"I Don't Feel Very Receptive Today\" as Spencer unleashes this best vocal performance in terms of screaming. The most experimental songs on the album are \"It's Dangerous Business Walking Out Your Front Door\", which ascends forward with a trance-esque break and than a choir sings in the distance as the vocals blare in the background. it's actually quite effective and works pooh-so nice. Than the slowest tempo track, \"Some Will Seek Forgiveness, Others Escape\" beckons back to the bands' Christian roots, gorgeous compliment of Copelands lead singer paves the way for a beautiful closure to the album. So have Underoath sold out? I really don't want to answer that question, because chances are plenty of enthusiast are proclaiming they have. But I will finish with this, I can't stand most scream\/emocore\/hardcore outside a few bands but Underoath remain on top of my A-list. The album is warm, dark and pleasantly catchy. So far it's been one of my top ten albums this year --so in every way of the word I've embraced it yet and appreciate a band that might actually start getting noticed.","overall":5,"summary":"UO changed, but still remain among the elite in the genre","unixReviewTime":1094256000,"reviewTime":"09 4, 2004"}
{"orig_index":45924,"reviewerID":"A2OGE60OKOFMQF","asin":"B00026WVC2","reviewerName":"Michael Barrera \"www.silentrival.com\"","helpful":[1,1],"reviewText":"I know. Long-time fans of the Underoath felt left out. The band performed black metal style music (Pressure Law) on a changing metal mix and hard theme in \"Change of Times\". Yes, with the exception of Dallas, the human voice is different. This deadly outcry will be thrown out, but I have to show that Spencer has a great singing voice to praise the band's \"new\" voice. The first track “Little and Longing” is full of adrenaline, combining genuine harmony with a change of guitar enhancement and a strong cry. The next song developed in my mind that UO will enter a new field, \"Boy Brushed Red. Staying Black and White\" promotes the almost dead sound of the poem (new stuff), but no matter how similar The album has other ideas 'emocore products' and and ‘hardcore’, and the Underoath is still higher than most people. Yes, songs like \"Come Out Again\" will definitely attract more fans than never before, and the song itself is undoubtedly very appealing. When Spencer released the best soundtrack, the band dropped their old voice \"I don't feel welcome today\". The best test song on the album is \"Getting Out Your Front Door is a risky business\", which goes up and down, and the choir sings in the distance, while the human voice in the background is also cloud. up. It really works very well and works very well. Compared to the slow-moving song \"Some Will Seek Forgiveness, Some Run Away\", \"Some Will Seek Forgiveness, Some Flee\" calls for the Christian roots of the group, and the beautiful song of the leading Copelands singer paved the way for a beautiful musical ending. compact. So the Underoath is for sale? I don’t want to answer this question, because it’s likely that most fans will claim they do. But I’ll conclude with this, I can’t resist crying too much \/ feeling \/ hardcore without a few groups, but the Underoath is still at the top of my A list. The plate is warm, dark, and lovely to the year. So far, it has been my top ten album of the year so by all means I have embraced and appreciated the band that may have started to again attention.","overall":5,"summary":"UO changed, but still remain among the elite in the genre","unixReviewTime":1094256000,"reviewTime":"09 4, 2004"}
{"orig_index":45924,"reviewerID":"A2OGE60OKOFMQF","asin":"B00026WVC2","reviewerName":"Michael Barrera \"www.silentrival.com\"","helpful":[1,1],"reviewText":"Long-time Underoath fans feel left out, the band once released music inspired by black metal. \"Little and Interesting\" is full of adrenaline, which combines genuine accompaniment and refinement of the guitar with sharp melodies. The band has dropped its old lyrics to the song \"I Don't Feel Easy to Accept Today\"","overall":5,"summary":"UO changed, but still remain among the elite in the genre","unixReviewTime":1094256000,"reviewTime":"09 4, 2004"}
{"orig_index":45924,"reviewerID":"A2OGE60OKOFMQF","asin":"B00026WVC2","reviewerName":"Michael Barrera \"www.silentrival.com\"","helpful":[1,1],"reviewText":"instead of a slow song \"Some people will seek forgiveness, some people will run away\" the called back to the Christian music group. the roots, the sweet praise of the leading Copelands singer paved the way for the beautiful send of the album. \"Living in Black and White\" drives the sound of almost dead poetry (new stuff), but despite the similarities between this album and other \"emocore\" and \"hardcore\" products, the Underoath is still better than most people at the same high level. Yes, songs like \"Reinventing your Exit\" will surely attract more fans than never before. The song itself is undoubtedly very interesting. Yes, with the exception of Dallas, the voices will be different. The most experimental song on the album is \"Getting Out Your Front Door is a risky business\", Singing away and resting trance instead of the chorus moves forward and the lyrics in the background Long-time Underoath fans feel left out. entering a new field in my mind, \"The Boy Broken Red.\"","overall":5,"summary":"UO changed, but still remain among the elite in the genre","unixReviewTime":1094256000,"reviewTime":"09 4, 2004"}
{"orig_index":46535,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0002L57OG","reviewerName":"Chris","helpful":[0,0],"reviewText":"The craps on this album sound battle oriented. I believed this album was going to be an all party album well luckily it is not. The Best tracks are the honest one-\"Lean Back\" and \"Streets of N. Y.\" They all do a good job representing and the beats are at the top of the line in wrap. A Great album this is good. Lyrics-nine\/ten Production-ten\/ten X Factor-nine\/ten Classic weight\/ten ReplaytenTotal=nine out of ten Fingers","overall":5,"summary":"I like this one","unixReviewTime":1095897600,"reviewTime":"09 23, 2004"}
{"orig_index":46535,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0002L57OG","reviewerName":"Chris","helpful":[0,0],"reviewText":"The sound of rolling dice on this album is aimed at combat. I believe this album will be a national album, fortunately it is not. The best songs are loyal songs - \"Lean Back\" and \"Streets of N. Y\". They all do a great job, and hitting is the most important part of the pack. Nice compact, good. Songs-Nine \/ Ten Productions-Ten \/ Ten X Article-Nine \/ Normal Five Weight \/ Ten PlaybackTotal = Nine Ten Fingers","overall":5,"summary":"I like this one","unixReviewTime":1095897600,"reviewTime":"09 23, 2004"}
{"orig_index":46535,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0002L57OG","reviewerName":"Chris","helpful":[0,0],"reviewText":"I believe this album will be the album for the whole party, Fortunately not. The best songs are loyal songs- \"Lean Back\" and \"Streets of N. The sound of crap in this album is aimed at fighting. \" Songs-Nine \/ Ten Production-Ten \/ Ten X Factor-Nine \/ Ten Normal Weight \/ Ten ReplaytenTotal = Nine Fingers Ten","overall":5,"summary":"I like this one","unixReviewTime":1095897600,"reviewTime":"09 23, 2004"}
{"orig_index":46535,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0002L57OG","reviewerName":"Chris","helpful":[0,0],"reviewText":"This dice on the plate sounded like they were ready to fight. The best ways are honest songs - \"Leaning back\" and \"NY Ways\".","overall":5,"summary":"I like this one","unixReviewTime":1095897600,"reviewTime":"09 23, 2004"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"Ludacris has always done a good job with all this albums. Someting to hear in this album is #one Spot,Get back,Put your money with DMXChild of the night with nate dog and the rest is very good. The track that gives a important fact is hopeless featuring Trick Daddy. Holla at the A and for Luda!","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"All Ludacris albums are doing very well. What I heard on this album is #one Spot, Come Back, invest in DMXChild of the night with nate dog, and the rest is fine. Songs that provide important facts with Trick Daddy are hopeless. Holla to A and Luda!","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"A song that conveys important truths is hopeless. Songs that provide important facts with Trick Daddy are hopeless.","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":47817,"reviewerID":"A24FCRSK4MJWZ9","asin":"B00065JTAQ","reviewerName":"Alex","helpful":[0,0],"reviewText":"Ludacris has done a great job on all of these plates. What I hear from this album is #onewhere, Come Back, Put Your Money With DMXMntwana for","overall":4,"summary":"Luda has done it again !","unixReviewTime":1109116800,"reviewTime":"02 23, 2005"}
{"orig_index":48293,"reviewerID":"A25P6DY6ARTCGZ","asin":"B0006ZQ9BS","reviewerName":"Ghost in the Matrix \"Ghost in the Matrix\"","helpful":[42,46],"reviewText":"I have to give credit where credit is due. Game had an uphill battle from day one. I'm sure any star will testify that the problem with starting at the top is that almost everybody is waiting for you to fall instantly to the bottom. With Dre underscoring this credibility, Game's inherent buzz quickly became a \"hype\" and raised the pressing question of NOT wether the could meet your expectations but rather if the could EXCEED them. Let's face it. That's what the critics, and perhaps some buyers, are all waiting for: To have their expectations blown out of the water. Well. there's one vote that the did it. And this is coming from one wary and reluctant buyer. To be quite honest, my radar was phoning more on Dre and this label than the Game himself. As the mastermind behind everything that leaves the Aftermath, I was scared that maybe Aftermath was on it's way to becoming an After Thought (like DeathRow). I think many will agree that wrap has become painfully redundant, uncreative and unoriginal. Outside of the actual CD was an overwhelming amount of evidence that Game was doomed to the same tired pseudo-thug content of so many other wrappers - many of whom represent Dre's label. Of course, Game does in fact deliver the same old West Coast Game of low-riders, chronic, loose women, sneakers, guns ada, ada, ada. It would't be Game without it. But where I have to give him mad credit is that the stone of this lyrics seems to give the Gangster Lifestyle a three-Dimensional view and the masterfully gives us a glimpse of all angles. Some of the songs on there have a regretful stone that is probably more accurate of real gangsters than the pro-violent latitude exemplified by your vinyl thugs of past. No doubt, this more complex position is borrowed more so from Ice Cube and twoPac (who borrowed from Cube and Ren) than any of the other legends that Game acknowledges as this primary source of inspiration. And while Gangster Rap initially was morally claustrophobic and grammy like the NWA Straight Outta Compton Album, Game manages to maintain this feeling (as promised) as well as give us more uplifting and maybe even hopeful tracks. One track involves Game's voice cracking as if the's fighting back painful thoughts and regrets - a very clever delivery since the song itself is about all the things the would change, if the could change them. And then there's the beats. The beats are just incredible on this Album and stop just short of overshadowing Game's delivery. The Documentary is the best title for this album because so many of the tracks on this Album are cinematic in stone. \"Dream\", produced by Kayne West, is nothing short of a masterpiece. And \"Church for Thugs\", produced by Just Blaze is possibly the strongest production on this whole album. And I can't send this without giving a nod to the man who blueprinted this album. I must say that I was a little sad that Dre covers less than half of the musical output of this album. I was a little more sad when I had to admit to myself that many of the Guest Producer beats top some of Dre's beats. But if anything it only further underscores Dre's immaculant year for amazing material and this maturity for allowing that material to come before this own (no doubt the produced several tracks that the himself edited out from the final album). And as Executive Producer of this Album, Dre has orchestrated a CD that is even better than fifty's \"Get Rich. \" and far better than Eminem's Encore - both great albums in their own right. And where Drei is a true genius is that the seems to have added sounds for every listener from every corner of America, just to make sure that this West Coast Ressurection in't exclusive to just the West Coast. And finally, \"Higher\" and \"Start from Scratch\" are among the most memorable tracks on this CD. \"Higher\" is just downright infectious and so full of adrenaline that it almost promotes violence without any lyrics placed on top of it. Without a doubt, Aftermath is still on track and if they continue to put out this level of wrap, they might possibly dominate the airwaves of two thousand and five. If nothing else, it could breathe some much needed life into wrap. Consider this one a classic.","overall":5,"summary":"This is beyond anything I expected.","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48293,"reviewerID":"A25P6DY6ARTCGZ","asin":"B0006ZQ9BS","reviewerName":"Ghost in the Matrix \"Ghost in the Matrix\"","helpful":[42,46],"reviewText":"I have to give credit when it expires. Since the first day of the game, there has been an escalation fight. I believe that any star will show that the problem that starts from the top is that almost everyone expects it to come down quickly. As Dre emphasized this loyalty, the natural buzz of the Game quickly turned into a \"grace\" and raised the question of whether it could satisfy your expectations, but whether it could exceed them. Let's face it. This is what critics, and perhaps even some consumers, are waiting for: their expectations have been dashed. That's OK. One vote the thought the did. This came from a cautious and sceptical consumer. Honestly, my radar is more focused on Dre and brand than Game itself. As the mastermind behind everything that has left Aftermath, I'm afraid that Aftermath could be a part of Aftermath (like DeathRow). I think most people will agree that wrapping has been a very painful, invisible and unusual thing. In addition to the original CD, there is sample evidence that the Game is set to have the same pseudo-mob theme as other threatening objects - many of which represent Dre's labels. Yes the game offers the same West Coast games, including a low, endless rider, immoral rooms, it-shirts, guns, ducks, ducks. Without it, there would be no games. But the crazy title I have to give him is that the word stone seems to give a three-dimensional view of the gangster lifestyle, subtly giving us an overview of all the angles. Some of the songs feature remorse, which may well describe the real gangsters more than the violence perpetrated by the giants of the past. Without a doubt, this very difficult place has been borrowed from Ice Cube and twoPac (borrowed from Cube and Ren), instead of any other myth known by Game as the main source of encouragement. Although Gangster Rap was originally claustrophobic and Grammy as the NWA Straight Outta Compton album, The Game managed to keep that feeling (as the promised) and gave us a strengthening track and a full Hope. A track that involves the demise of the game’s voice, as if it counts sad thoughts and regrets — this is a very clever act, because the song itself is about everything that will change, if it can be changed. There is also a rhythm. The rhythm of this album is amazing, almost surpassing the distribution of the Game. The document is the title of the album, since most of the songs on this album are like a movie. The \"dream\" produced by Kay West is a work of part. And “Church of the Thugs” produced by Just Blaze could be the most powerful work on the entire album. I can't post this album without nodding to the person who created the plan for this album. I must say that I am a little disappointed because Dre covers less than half of the music on this album. When I have to admit to myself that a lot of guest producers beat some of Dre’s beats, I feel even more sad. But if anything, it will focus even more on Dre’s amazing year of amazing things and the growth of allowing these things to appear before him (no doubt, many of the songs the has edited on the last album). As the lead producer of this album, Dre's carefully crafted CDs are even better than \"Get Rich\" in the one thousand, nine hundred and fiftys, and much better than Eminem's Encore — both of these albums are great albums. Drei's true wisdom is that it seems to add a voice to all audiences across America to ensure that this West Coast revival is not limited to the West Coast. Lastly, \"Top\" and \"Start from scratch\" are some of the most memorable tracks on this CD. \"High\" is directly contagious, full of adrenaline, and almost no words are put in it to encourage violence. There is no doubt that the result is still in the right direction. If they continue to inform this packing stage, they can control two for five waves. If nothing happens, it can add a lot of life needed for packaging. Think of it as a classic.","overall":5,"summary":"This is beyond anything I expected.","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48293,"reviewerID":"A25P6DY6ARTCGZ","asin":"B0006ZQ9BS","reviewerName":"Ghost in the Matrix \"Ghost in the Matrix\"","helpful":[42,46],"reviewText":"Yes, The Game offers classic West Coast games, including low-rise, steady rides, free women, sneakers, guns ada, ada, ada. A track that involves the demise of the game’s voice, as if it counts sad thoughts and regrets — this is a very clever act, because the song itself is about everything that will change, if it can be changed. As Dre emphasized this reliability, the natural buzz of the Game quickly became a kind of \"hype\" and raised the question of whether it would be table to meet your expectations, but even more. This is what critics, and perhaps some consumers, are all waiting for: their expectations should be completely dashed. There is no doubt that the result is still in the right direction. If they continue to inform this packing stage, they can control two for five waves. The \"dream\" produced by Kay West is a work of part. Although Gangster Rap was originally claustrophobic and Grammy as the NWA Straight Outta Compton album, The Game managed to keep that feeling (as the promised) and gave us interesting and possible songs of Hope.","overall":5,"summary":"This is beyond anything I expected.","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":48293,"reviewerID":"A25P6DY6ARTCGZ","asin":"B0006ZQ9BS","reviewerName":"Ghost in the Matrix \"Ghost in the Matrix\"","helpful":[42,46],"reviewText":"Mike fell to the ground: \"The Game\" has experienced escalating battle from day one. Critics say that there may be consumers waiting for the game to fulfill their expectations. bottom: \"The stone in this song seems to give a three-dimensional view of gang life\"","overall":5,"summary":"This is beyond anything I expected.","unixReviewTime":1106006400,"reviewTime":"01 18, 2005"}
{"orig_index":50834,"reviewerID":"A1AT95C4D1Q3OF","asin":"B000B9UHSU","reviewerName":"Zengrrl","helpful":[3,4],"reviewText":"This is such an amazing collection of singles from one of my all-time favourite duos\/groups. It is definitely one of the best collections that I have seen compiled in some time. For me, it ranks even higher than the Eurythmics' most recent \"Ultimate Collection\", which is quite a feat. While I love New Order and have almost every single one of their albums, from the indespensible \"Power, Corruption, and Lies\" to their multiple \"best of\" CDs, this one really reminds me of just how great they really are. I always seem to forget how many my favourite songs they performed, and it's great to have them all neatly packaged in one single collection for easy reach. If you are a New Order fanatic, like myself, for simply the casual fan looking for the all-in-one package, this is not to be missed. Your music collection will thank you for this addition.","overall":5,"summary":"The definitive collection for any New Order enthusiast","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":50834,"reviewerID":"A1AT95C4D1Q3OF","asin":"B000B9UHSU","reviewerName":"Zengrrl","helpful":[3,4],"reviewText":"This is one of my favourite duo \/ groups. It's amazing. This is definitely one of the best collections I've never seen in a while. To me, it’s in a higher and higher position than the ‘General Collection’ Eurythmics, which is amazing. Although I love New Order and have almost all of their albums, from \"Power, Corruption and Lying\" to their many \"excellent\" CDs, this one really reminds me of them. I always seem to forget how many of my favourite songs they play, and it’s good to pack them properly in the collection so they are easily accessible. If you are a follower of the New Order like me, for casual lovers who want a one-piece package, this should not be missed. Your music collection will thank you for joining.","overall":5,"summary":"The definitive collection for any New Order enthusiast","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":50834,"reviewerID":"A1AT95C4D1Q3OF","asin":"B000B9UHSU","reviewerName":"Zengrrl","helpful":[3,4],"reviewText":"Although I love the New Commandment and carry almost all of its records, from “Power, Corruption and Falsehood” to their many “best” CDs, this reminds me that they are really great. . If you are a person who loves a new arrangement like me, this should not be missed by ordinary fans who want to pack everything. To me, it’s at a much higher level than Eurythmics ’latest“ Collection ”, which is amazing. I always seem to forget how many of my favourite songs they play, and it’s okay to pack them properly in the collection so they are easily accessible. This is one collection from one of my favourite duo \/ bands, it's amazing. This is definitely one of the best collections I've never seen in a while. Your music collection will thank you for joining.","overall":5,"summary":"The definitive collection for any New Order enthusiast","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":50834,"reviewerID":"A1AT95C4D1Q3OF","asin":"B000B9UHSU","reviewerName":"Zengrrl","helpful":[3,4],"reviewText":"This is one of my favourite duo \/ groups. It's amazing. This is definitely the best collection I've never seen. For me, it's at a higher level than Eurythmics' latest \"Collection\"","overall":5,"summary":"The definitive collection for any New Order enthusiast","unixReviewTime":1142035200,"reviewTime":"03 11, 2006"}
{"orig_index":51967,"reviewerID":"A6UW2KEO5UOSA","asin":"B000EMGAOY","reviewerName":"Corey Turner \"The Musician\"","helpful":[2,3],"reviewText":"Red Hot Chili Peppers a band unrecognized in the eighty's and adored by the early ninety's. A band of Funk and amazing melodies and never changing music.\"Blood Sugar Sex Magik\" was their greatest achievement many will tell you, and in some since it was, but that does't mean they can't wop out a new album and still make it marvellous.two thousand and two's \"By The Way\" caught the band in a mellowed out predicament very played back featuring great melodies, this too follows that recipe with a few innovative twists worth relistining too for years to come. Opening with the catchy radio friendly \"Dani California\" The Chili's find them selves at the top of their game again. Featuring some of John's most amazing guitar work to date. Listen to \"Dani California's\" outdo\/solo for the breath taking solo to \"Turn It Again\" and be reminded of RHCP's earlier works. Oh don't forget Flea, stumbling out more quirky basslines like the intro to \"Charlie\" and the Tom Petty like bassline to \"Dani California\"(listen to \"Mary Janes Last Dance\" very similar)powerful basslines. Anthony too throws out catchy phrases and lines like \"Born in the state of Mississippi\/Pappa was a Copper\/Mamma was a hippy\". Even Chad who is often forgotten is at the top of this game banging this drum set like crazy with this own brilliant solo in \"Hump de Bump\". The albums comes in three doses,(the first) a slow as can possibly be tempo, for a funky all over the place good to be back tempo. The third is a weird surreal hard to describe sound. As if they wanted to make a follow up to \"Venice Queen\"(off of \"By The Way, last track) for an otherworldly moving sound.\"Animal Bar\" catches the best of all three of these attributes starting off with a bizzar intro seasoned with effects, thus leading to a slowish mid tempo arrival then sharply cuts to a rockfish section. Many of these songs were't derived to be hits like the funkafied \"Storm In A Teacup\" (my favourite so far). Yet they still manage to have radio play, because they are so good! Some songs have some residue from the past on them like \"Snow ((Hey Oh))\" and a \"Scar Tissue\"(on one thousand, nine hundred and ninety-nine's award winning achievement \"Californication\")like \"She's Only Eighteen\". It's truly not a bad thing but will be taken into consideration.\"So Much I\" could pose as a \"Californacation\" era hit. All these songs in many ways feel like a sum up of the bands career, holding true to each of their many albums by grabbing other potentials and shoving them into these songs. By this point you'll more for less think this is the ultimate album if so. not exactly, but close. Define the best album? High quality, a strong variety, no fillers, fantastic musicianship. Then yes this is the \"ultimate album\". When stacked up to classics like \"Let It Be\", and \"Dark Side Of The Moon\", this does't hold too well. It's amazing and in my opinion the best album of two thousand and six and possibly within the last few years, but will it hold up to the test of time? Peek at older RHCP material if you agree then more then likely you'll agree with this too. The point is the Chili's are finally back after what felt like the four longest years of my life, and are in their prime. It's nice to see they are still together after all these years and still as strong as never. A band like this will continue to grow and experiment with today music needs more then never. Long live the Chilis.","overall":5,"summary":"Frantic,Freaky,And Funky After All These Years.","unixReviewTime":1147564800,"reviewTime":"05 14, 2006"}
{"orig_index":51967,"reviewerID":"A6UW2KEO5UOSA","asin":"B000EMGAOY","reviewerName":"Corey Turner \"The Musician\"","helpful":[2,3],"reviewText":"Red Hot Chili Peppers is a band that was not recognized in the one thousand, nine hundred and eightys but was worshipped in the early one thousand, nine hundred and ninetys. Funk band with amazing music, unchanging music. \"Blood of Magik Sugar\" is their biggest achievement. A lot of people will tell you, and some will tell you, but that does't mean they can't release new albums and they're still amazing. two thousand and two’s “By the Way” put the band on a mature note, and it features a fun song, following this formula, with new changes that need to be are-enacted in the next few years. Opening with the popular broadcast \"Dani California\", Hot Peppers once again found themselves at the top of the game. It contains John's most amazing guitar work to date. Listen to the album \"Turn It Up\" from the \"Dani California's\" outdo \/ solo and be reminded of the first RHCP activities. Oh, don't forget Flea, I stumbled upon strange bass lines, like the introduction of \"Charlie\" and Tom Petty's bass lines, similar to the \"Dani California\" bass line (very similar to \"Mary Janes Last\". Dance \") is a powerful Bass . The disc is divided into three doses. (First) can be a slow stamp. For fashionable people everywhere, it is good to return to the stamp. The third is an unusual, surreal, indescribable sound. \") to find a strange and moving sound.\" Animal bar \"has caught three main characters. unless the medium speed is slightly low, then cut it quickly into the part of the stone fish. Most of these songs did't sound like \"Storm in a Teacup\" (my favourite so far). But they were table to broadcast it because they were good! Some songs have remnants of the past in them, such as \"Snow ((Hey, ooh))\" and \"Scar Tissue\" (Award one thousand, nine hundred and ninety-nine), a successful \"California\") work is like \"She's only eighteen years old. It's not bad, but will be considered. \"Very much for me\" you can make yourself a popular song of the \"California\" era. All these songs in many ways feel like they summarize the group's work, grabbing some potential and pushing them inside, sticking to every electronic song on their many albums. \" classic like \"Let It Be\" and \"Dark Side of the Moon\", this is not so good. This is very good. In my opinion, it is the twond album sixty-six. If you agree, please review the old RHCP material, so you can agree with this. The point is that Pepper finally came back after four long years of my life and it was in its infancy. It is wonderful to see that they have been together all these years and are as strong as never. Bands like this will continue to grow and try out the needs of today’s music. Long live the pepper.","overall":5,"summary":"Frantic,Freaky,And Funky After All These Years.","unixReviewTime":1147564800,"reviewTime":"05 14, 2006"}
{"orig_index":51967,"reviewerID":"A6UW2KEO5UOSA","asin":"B000EMGAOY","reviewerName":"Corey Turner \"The Musician\"","helpful":[2,3],"reviewText":"two thousand and two's \"By the way\" has put the group in a serious problem. It has John’s amazing guitar work to date. \"Animal Bar\" hosted the best of the three.","overall":5,"summary":"Frantic,Freaky,And Funky After All These Years.","unixReviewTime":1147564800,"reviewTime":"05 14, 2006"}
{"orig_index":51967,"reviewerID":"A6UW2KEO5UOSA","asin":"B000EMGAOY","reviewerName":"Corey Turner \"The Musician\"","helpful":[2,3],"reviewText":"Two thousand and two \"The By the Way\" put the group in a difficult situation. Showcasing some of John’s most impressive guitar works to date. “Animal Bar” holds the three best.","overall":5,"summary":"Frantic,Freaky,And Funky After All These Years.","unixReviewTime":1147564800,"reviewTime":"05 14, 2006"}
{"orig_index":54467,"reviewerID":"A2P9QIX5NIHPQ0","asin":"B000OQF6N6","reviewerName":"Brian C. Shapiro \"Deftones Worldwide\"","helpful":[2,4],"reviewText":"Probably the most unique part rock mainstream band of the ninety's, The Smashing Pumpkin are reborn and rock harder(or as hard) than they have before with Zeitgeist! It's a shame D'arcy and James Iha did not reunite, but after having listened to Zeitgeist several times through the last couple of days, the results could't be more satisfying with for without the two missing members. Ok, wok, that was a lie. I miss them! Anyways, I always admired how the early Smashing Pumpkins crossed through creative boundaries\/grunge norms during their time, mixing artistic experimental elements to their score rock sound while learning amt mainstream success with their unique style(image and music); which is why I am glad to see the new SP on Zeitgeist still a step away from current trend of \"emo\" for \"indie\" music by making a very straight forward yet sonically diverse rock in' roll album with Corgan's signature poetic lyrics with some songs (unsurprisingly after a glance at the cover part) seem to be about the strikes we are currently facing in your modern society while still being somewhat broad to interpretation. This is probably the Pumpkins most solid rock record since \"Gish\". The songs of Zeitgeist? \"Doomsday Clock\" is a powerful opening track, and rocks as much as the opening track \"Everlasting Gaze\" from Machina I did; but unlike Machina I, Zeitgeist rocks on with angst \"seven Shades Of Black\". \"Bleeding the Orchid\" is probably my favourite track on the record, beginning with beautiful echoes from Corgans voice. The song is very \"Adorish\", but with fantastic Camberlin drumming! A dream come true. \"Thats The Way(My Love Is)\" Is a cheerful sounding rock tune some what reminecent of \"Siamese Dream\" with some experimental elements, and ends beautifully. The mood is ruined(in a good way!) as \"Tarantula\", the first album single, rocks your brains out with its anthemic chorus and Corgans squealing guitar. \"Starz\" is a very stop-and-start song with cloud and quiet parts. I think Jimmy shows off lot in this track :). \"United States\", probably my atwood fax. song on Zeitgeist, is an epic colossal nine:fifty-one Smashing Pumpkins grand song masterpiece much like \"Silverf*ck\" was, but with some jazz and metal elements in it(mainly the instrumentation). The song is angry! \"Neverlost\" to me is kind of sappy softy with a bubbly noise(zilaphone?) in the background. \"Bring The Light\" brings the rock back and follows in the same vein as \"That's the Way (My Love Is)\", which is a good thing. \"(Come On) Let's Go!\" demands your attention like \"Tarantula\" did and rocks just as hard. \"For God & Country\" sounds lot like an early Cure song, with a steady drum beat and keyboard. The songs lyrics (to me) are very inspirational and have a hopeful message in them. ahhhh. the final song \"Pomp And Circumstance\" is the most old SP sounding song on the record and continues the SP's reputation of ending records with painfully beautiful grand finally song. Hopefully, Zeitgeist will be only the first of many records to come from The Smashing Pumpkins, because like lot of people who grew up listening to this band, the news of the groups two thousand and seven reformation was a dream almost come true. Maybe in the near future D'arcy and Iha will rejoin, but if not, whatever. As Apparent in Zeitgeist, Corgan and Camberlin seem to have no problem continuing the SP legacy. Highly Reccomended.","overall":5,"summary":"The (new) Smashing Pumpkins Return!","unixReviewTime":1184112000,"reviewTime":"07 11, 2007"}
{"orig_index":54467,"reviewerID":"A2P9QIX5NIHPQ0","asin":"B000OQF6N6","reviewerName":"Brian C. Shapiro \"Deftones Worldwide\"","helpful":[2,4],"reviewText":"Probably the most special part of the ninetys rock band, Pumpkin Smashing has been reborn and heavier (or heavier) than never using Zeitgeist! It is unfortunate that D'arcy and James Iha never met again, but after listening to Zeitgeist several times over the past few days, with the exception of the two missing members, the results could not be satisfactory. Yeah, wow, that's a lie. I miss them! In any case, I have always recommended how the former Smashing Pumpkins transcended the design boundaries \/ grunge standards of their time, incorporated artistic materials into their rock of musical notes, and at the same time learned common success with their unique style (images and music). ; That’s why I’m excited to see that the new SP at Zeitgeist is one step away from the current “emo” of “indie” music, and has produced a straightforward but unique disc that contains the lyrics of Coron’s poems and specific songs. (Not surprisingly after looking at the router section) It seems to be the strike we are facing now in modern society, but the explanation is still broad. This could be the Pumpkins' hardest rock record since \"Gish\". A song of the spirit of the times? \"Doomsday Clock\" is a powerful opening song, as shocking as my opening song \"Everstanding Gaze\" in Machina; but unlike Machina I, the Zeitgeist moves with \"seven dark shadows\". \"Bleeding Orchid\" is probably my favourite song, which begins with the sweet sound of Corgans' voice. This song is very \"religious\", but with the amazing Cumberlin drums! The dream is coming true. \"That's the Way (My Love Is This)\" is a happy rock song, reminiscent of \"Siamese Dream\", with some experimental elements and a beautiful ending. The air is spoiled (in a good way!) Because \"Tarantula\", the first one on the album, shocks your mind with the chorus of the national anthem and the playing Kogans guitar. \"Starz\" is a very central song, with bright spaces and atmosphere. I think Jimmy has shown a lot in this song :). \"America\", may be my Fawood fax. The song on Zeitgeist is nine outstanding songs: fifty-one Smashing Pumpkins songs are excellent, like \"Silverf * eck\", but have some elements of jazz and metal (mostly musical instruments). The song is cloud! \"Neverlost\" to me is a soft and soft background with a bubble noise (phones?). \"Bring light\" replaces rock and roll, and like \"That's the way (My love is)\", this thing is fine. \"(Come) Let's go!\" It demands your attention like a \"tarantula\", and it moves very much. \"To God & Earth\" sounds very much like an instant healing song, with stable drums and keyboards. The lyrics of this song (mine) are encouraging and have a message of hope. Tshotsho. The last song \"Pomp And Circumstance\" is the oldest SP song on record, and continues the SP fame to send the record with a sad and beautiful song at the send. I hope the Zeitgeist is the first of many Smashing Pumpkins records, because like so many people who grew up listening to this band, the news of the band’s transformation in two thousand and seven is almost a dream come true. Maybe in the near future, D'arcy and Iha will rejoin, but if not, that's fine. As is clear from the Zeitgeist, Corgan and Camberlin seem to have no problem with continuing the legacy of SP. highly recommended.","overall":5,"summary":"The (new) Smashing Pumpkins Return!","unixReviewTime":1184112000,"reviewTime":"07 11, 2007"}
{"orig_index":54467,"reviewerID":"A2P9QIX5NIHPQ0","asin":"B000OQF6N6","reviewerName":"Brian C. Shapiro \"Deftones Worldwide\"","helpful":[2,4],"reviewText":"In any case, I have always admired the way Smashing Pumpkins crossed the boundaries of design \/ grunge traditions during their time, incorporating artistic elements into their rock music, and at the same time with their unique style. (image and music); which is why I am so happy to see that the new SP in Zeitgeist is one step away from the current meaning of \"emo\" of \"indie\" music, and has produced a straight but distinct album with the Coron logo. The lyrics of the sex poem and some of the songs (not surprisingly after looking at the outside section) seem to be about the strike we are currently facing in modern society, but the explanation is still broader. \"Doomsday Clock\" is a very powerful opening song, as shocking as Machina's opening song \"Everstanding Gaze\"; but unlike Machina I, the Zeitgeist moves with \"seven black shadows\". The song on Zeitgeist is epic nine:fifty-one Smashing Pumpkins is a masterpiece of part, similar to \"Silverf * eck\", but has some elements of jazz and instrumentals (mostly musical instruments). \"Thats the Way (My Love Is)\" is an exciting rock music, some reminiscent of the \"Siamese Dream\", with some experimental elements and a beautiful ending. \"Bring light\" replaces rock and roll, and like \"That's the way (My love is)\", this thing is fine. I hope Zeitgeist is only one of the first records in Smashing Pumpkins, because like so many people who grew up listening to this band, the news of the music change in two thousand and seven is almost complete. As the first single in the album \"Tarantula\", the choir of the national anthem and the singing Corgans guitar startle your mind.","overall":5,"summary":"The (new) Smashing Pumpkins Return!","unixReviewTime":1184112000,"reviewTime":"07 11, 2007"}
{"orig_index":54467,"reviewerID":"A2P9QIX5NIHPQ0","asin":"B000OQF6N6","reviewerName":"Brian C. Shapiro \"Deftones Worldwide\"","helpful":[2,4],"reviewText":"Compared to Zeitgeist, Smashing Pumpkin is reborn and heavier (or even heavier) than before. This could be the strongest record of all the stones since the rebirth of \"Gish\"","overall":5,"summary":"The (new) Smashing Pumpkins Return!","unixReviewTime":1184112000,"reviewTime":"07 11, 2007"}
{"orig_index":54544,"reviewerID":"A3LIWTQDSQ5UOO","asin":"B000OYC3J8","reviewerName":"Jonathan Oyama \"Welcome to die!\"","helpful":[1,1],"reviewText":"It's undisputed that the White Stripes are one of the best rock bands of all time. Although I might need some time to think about where to place them in my list of favourite bands, this album proves that they rank pretty high on the Richter scale.\"Icky Thump\" is an earthquake-shaker of an album, starting off with a title track with slamming guitar chords, Meg White's cloud cymbals and an angular guitar solo acting as the chorus. The solo is followed by a schizophrenic keyboard solo that adds much more excitement to a spectacular start. And the excitement never ceases. Jack White literally turns into a wannabe-Spanish tenor, with this cry on the epic \"Conquest\". Who would have thought that Jack would go so far with this cloud songs? Another original twist comes in the form of bagpipes. \"Prickly Thorn\" starts as a folk-song, complete with clapping. However, it changes gears in a psychedelic bagpipe melody, mixed with strange quotes and laughs. And it still features awesome exploding songs, such as \"Little Cream Soda\". Although I have heard Jack White give odd monologues alongside cloud guitar blasts, this coolest one yet came in this song. He spends time reminiscing about times when the wanted this nice cream soda a little colder, passing it off by saying \"oh well.\"I'd have to say that Jack White is starting to develop quite an lego, though. With \"Rag and Bone,\" Jack literally brags that \"If it's just things that you don't want, I can use 'em\/Meg can use 'em\/Make some money out of 'em, at least\". Still, I'd have to say that Jack White has every reason to brag--they're the hottest band out in America right now, and still as explosive as they were when they began. But still, back to rocking. In fact, \"Catch Hell Blues\" shows off Jack's wacky slide guitar effects. I love how inventive Jack is with high-pitched guitar squeals. I missed these squeals from bands such as \"Rage Against the Machine,\" and I'm glad White has made the squeals cool again (thank goodness!). And finally, Jack has never sounded so soulful as in the last jam, \"Effect and Cause\". There's nothing better than a simple acoustic guitar song, with excellent protest lyrics such as \"Well you can't take the effect\/And make it the cause\/I did't rob a bank\/Cos you made up the law\". This is, to date, The White Stripes' explosion album that shows them off at their best. There's so much original material, so many awesome sound effects and so much protest angst that I could't give this album any less than my highest recommendation. Go get it if you're a rock fan. You won't regret it.","overall":5,"summary":"Now seven albums strong","unixReviewTime":1209772800,"reviewTime":"05 3, 2008"}
{"orig_index":54544,"reviewerID":"A3LIWTQDSQ5UOO","asin":"B000OYC3J8","reviewerName":"Jonathan Oyama \"Welcome to die!\"","helpful":[1,1],"reviewText":"There is no doubt that White Stripes is one of the best rock bands of all time. While it may take some time for me to figure out where I can put them on my favourite band list, this album proves that they are ranked high on the Richter scale. \"Icky Thump\" is a thriller, which comes out of a title track with strings of guitar strings, Meg White's melodies and angular guitar solo. The solo is followed by a schizophrenic solo keyboard, which adds to the fun of an amazing start. And the joy is unending. Jack White becomes a tenor who wants to become a Spanish tenor, shouting in the epic \"victory\". Who would have thought that Jack could walk on this cloud song? Another original method is a pipe. \"Prickly\" began with a traditional song, accompanied by applause. However, it changes gears to the mental song of the bagpipe, by discussing exotic quotes and jokes. It still has great explosive songs such as \"Little Cream Soda\". Although I have heard Jack White perform an unusual monologue accompanied by the explosion of a guitar cloud, this is the coolest monologue to this song. He gave himself time to remember when the wanted this sweet cream soda a little cold, passing it by saying \"Oh, that's fine\". However, I must say that Jack White started developing a few Lego bricks. In \"Rag and Bone\", Jack boasted \"If they are just things you don't want, I can use them \/ Meg can use them \/ at least make money from them\". However, I must say that Jack White has good reason to be proud — now I see the hottest team in the United States, and they are still exploding as they were when they first started. But still, go back to the swing. After all, \"Catch Hell Blues\" showed Jack's unusual guitar slide effect. I love Jack’s ability to cry on a tweeter. I missed the sound of bands like \"Rage Against the Machine\" and I'm glad White made the sound cool again (thank god!). In the send, Jack's voice was not as romantic as the previous jam \"Influence and Reason\". There is nothing better than a simple acoustic guitar song and excellent protest songs like \"Yeah, you can't make a result \/ be the cause \/ I did't rob the bank \/ because you made the law\". So far, this is a blast sheet of White Stripes, which shows their good condition. There are so many original stuff, so many shocking sounds, and so much protest pressure that my top recommendation for this album could never be lower than my top recommendation. If you are a rock fan, go buy it. You will not regret it.","overall":5,"summary":"Now seven albums strong","unixReviewTime":1209772800,"reviewTime":"05 3, 2008"}
{"orig_index":54544,"reviewerID":"A3LIWTQDSQ5UOO","asin":"B000OYC3J8","reviewerName":"Jonathan Oyama \"Welcome to die!\"","helpful":[1,1],"reviewText":"\"Icky Thump\" is an album vibration. It has great explosive songs, such as \"Little Cream Soda\" and \"Catch Hell Blues\" featuring Jack's weird slide guitar effect.","overall":5,"summary":"Now seven albums strong","unixReviewTime":1209772800,"reviewTime":"05 3, 2008"}
{"orig_index":54544,"reviewerID":"A3LIWTQDSQ5UOO","asin":"B000OYC3J8","reviewerName":"Jonathan Oyama \"Welcome to die!\"","helpful":[1,1],"reviewText":"\"Icky Thump\" is an exciting album that begins with a theme song with guitar chords, Meg White cloud guitar and angular guitar solo. Jack White becomes the employer who wants to be a Spanish team, shouting at the epic \"victory\". Another former type is the type of bagpipes.","overall":5,"summary":"Now seven albums strong","unixReviewTime":1209772800,"reviewTime":"05 3, 2008"}
{"orig_index":55454,"reviewerID":"A18OBUSMXVE8R0","asin":"B000ZK0CKI","reviewerName":"J. Guild","helpful":[0,0],"reviewText":"If you're a Nelson fan; you'll want to add this to your collection. There are thirteen tracks on the CD, but only three of them were written by Willie. However there are ten other tracks written by Kris Kristofferson,Kenny Chesney,Bob Dylan and others. This CD is somewhat different from the typical Willie album, but it is great, as you will quickly see from listening to some of the samples there. You may find several of the tracks new to you, but fear not, all the lyrics to all the songs are provided in the insert. Just when you think there's nothing new from Willie, the comes out with another gem; but haven't wee all come to expect that?","overall":5,"summary":"Another great Willie album.","unixReviewTime":1376870400,"reviewTime":"08 19, 2013"}
{"orig_index":55454,"reviewerID":"A18OBUSMXVE8R0","asin":"B000ZK0CKI","reviewerName":"J. Guild","helpful":[0,0],"reviewText":"If you are a follower of Nelson; you will want to add to your Collection. There are thirteen songs on the CD, but only three of them have been made by Willie. However, there are ten songs composed by Kris Kristofferson, Kenny Chesney, Bob Dylan and others. This CD is a little different from Willie's regular album, but it's good, and you'll see some samples there soon. You can find new songs, but don't worry, all the lyrics for all the songs are provided in the plugin. Just when you thought Willie had nothing new, something very important came up; but don’t we all expect it?","overall":5,"summary":"Another great Willie album.","unixReviewTime":1376870400,"reviewTime":"08 19, 2013"}
{"orig_index":55454,"reviewerID":"A18OBUSMXVE8R0","asin":"B000ZK0CKI","reviewerName":"J. Guild","helpful":[0,0],"reviewText":"There are thirteen tracks on the CD, but only three are written by Willie. There are ten other songs composed by Kris Kristofferson, Kenny Chesney and others.","overall":5,"summary":"Another great Willie album.","unixReviewTime":1376870400,"reviewTime":"08 19, 2013"}
{"orig_index":55454,"reviewerID":"A18OBUSMXVE8R0","asin":"B000ZK0CKI","reviewerName":"J. Guild","helpful":[0,0],"reviewText":"You can find a few new songs, but don't worry, all the lyrics for all the songs are provided in the plugin. This CD is a little different from Willie's regular album, but it's good, and you'll see some samples there soon. However, there are ten songs composed by Kris Kristofferson, Kenny Chesney, Bob Dylan and others. Just when you thought that Willie had nothing new, another treasure came up; but were we not all expecting it? There are thirteen songs on the CD, but only three are made by Willie. If you are someone who loves Nelson; you will want to add it to your collection.","overall":5,"summary":"Another great Willie album.","unixReviewTime":1376870400,"reviewTime":"08 19, 2013"}
{"orig_index":55621,"reviewerID":"ADKHI1TUGAX4","asin":"B0012DZA72","reviewerName":"E. Anderson","helpful":[0,0],"reviewText":"I have to admit I did't care much for Cascada's first album, much less listen to euro pop. I thought the group's previous album was repetitive and ridiculously cheesy. On a whim, I recently decided to check out the group's latest album PERFECT DAY. Much to my surprise I found myself enjoying the catchy euro-pop songs. The songs are pure year candy for my years. The infectious pop melodies are permanently stuck in my head. PERFECT DAY in't innovative. It is the same what one would expect from a group like Cascada, fun catchy pop\/dance songs. Natalie Horer has a pretty decent voice which reminded me a little of Christina Aguilera. The lyrics are stupid but the addictive pop hooks and throbbing dance beats makes up for the awful lyrics. I did't care much for \"Because the Night\". That song was not meant to be turned into a dance song. The ballads were awful. For all the flaws though, PERFECT DAY is still enjoyable enough for me to give it four stars. It is a nice change of space from all the goth, industrial, and metal I listen to all day long at work.","overall":4,"summary":"A guilty pleasure","unixReviewTime":1226016000,"reviewTime":"11 7, 2008"}
{"orig_index":55621,"reviewerID":"ADKHI1TUGAX4","asin":"B0012DZA72","reviewerName":"E. Anderson","helpful":[0,0],"reviewText":"I must admit that I am not interested in Cascada's first album, let alone listening to European pop music NS. I think the band’s last album was repetitive and funny. In a whim, I recently decided to watch the band's latest album, The Perfect Day. I was amazed to find that I was fascinated by popular European songs. These songs have been my purest sweet all these years. The most popular type of song will always be on my mind. PERFECT DAY is nothing new. This is similar to what people expect from interesting and exciting pop \/ dance songs such as Cascada. Natalie Horer's voice is very beautiful, which reminds me of Christina Aguilera. The songs are silly, but the addictive pop music and rhythmic rhythms make for bad words. I don’t care too much “because of the dark night”. That song is not meant to be a dance. Man's songs are shocking. However, Perfect Day is still fun enough, and I give it four stars. This is all the gothic change, business and metal I listen to all day at work.","overall":4,"summary":"A guilty pleasure","unixReviewTime":1226016000,"reviewTime":"11 7, 2008"}
{"orig_index":55621,"reviewerID":"ADKHI1TUGAX4","asin":"B0012DZA72","reviewerName":"E. Anderson","helpful":[0,0],"reviewText":"I'll admit I'm not interested in Cascada's first album, which very few listen to euro pop. I thought the band’s previous album was repetitive and funny. Feeling ‘We iran out of gas’ emotionally, I decided to check out the band’s latest album FULL DAY. I was amazed to find myself enjoying the enticing euro-pop songs. The songs have been a sweet year of candy for my years. Popular pop songs keep sticking in my head. EVERY DAY without creativity. This is the same as expected in a group like Cascada, an interesting pop song\/dance. Natalie Horer has a beautiful voice that somewhat reminds me of Christina Aguilera. The words are silly but the pop-ups and dancers make bad words. I did't bother too much \"Because of the Night\". This song is not intended to be a dance song. The wolves are horrible. With all the flaws, however, FULL DAY was still enough for me to give it four stars. It’s a beautiful space change from all the goth, industry, and metal I listen to all day at work.","overall":4,"summary":"A guilty pleasure","unixReviewTime":1226016000,"reviewTime":"11 7, 2008"}
{"orig_index":55621,"reviewerID":"ADKHI1TUGAX4","asin":"B0012DZA72","reviewerName":"E. Anderson","helpful":[0,0],"reviewText":"I have to admit that I don't care about Cascada's first album Yeah Al that sounds pretty crap to me, Looks like Al that sounds crap to me, Looks like Al that sounds crap to me, Looks like Al that sounds crap to me. In short, I recently decided to check out the band's latest album, Perfect Day. To my surprise, I found myself enjoying some of Euro-Pop's best songs. Songs are sweet for my year. Infectious pop music is constantly stuck in my head. There are no new skills in FULL DAY. This is what you would expect from a band like Cascada, entertaining pop \/ dance songs. Natalie Horrier has a polite voice that reminds me a little bit of Christina Aguilera. The names of the characters are silly but addictive pop hooks and fast beats make great words. I did't care much for \"because it's night.\" The song was not intended to be a dance song. The lumps were very good. Of all the mistakes, good day is still fun enough for me to give it four stars. It's a huge space change from all industries, industries and metals that I hear all day at work.","overall":4,"summary":"A guilty pleasure","unixReviewTime":1226016000,"reviewTime":"11 7, 2008"}
{"orig_index":59966,"reviewerID":"A3KJ6JAZPH382D","asin":"B004AE24HO","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,2],"reviewText":"These guys used to be cloud and gritty, even with the undertones of hidden anthems on their earlier albums. For their third full length album (and first for Geffen\/Interscope) \"Mine Is Yours,\" Cold War Kids drop all pretence towards indie-rock sound and go full charge for the arenas of the world. They've discovered their dinner Utwo and the ghost of Jeff Buckley as seeped in as well. They may have even caught a case of the Arcade Fires, while we're at it. Which is to say that \"Mine is Yours\" aims at big targets and bold sounds, and mostly hits its marks. Singer Nathan Willett is a pretty soulful dude for a better, which makes some of the more awkward lyrics (like \"the crown on my head is heavy on me\" from the otherwise great \"Out of The Wilderness) sound positively inspirational, and when the gets the perfect match, the is. The title track and \"Sensitive Kid\" are polar opposites with the same effect; where the title track roars forth like a star climbing anthem, \"Sensitive Kid\" strips down to a slinky bass and piano drop wins to just grab you by the collar for a good shaking. Then, when they sneak back to their earlier, grittier blues sound on \"Cold Toes on The Cold Floor,\" you understand that understated guitarist Jonnie Russell - who spends most of this album buried in producer Jaques King's reverb - is a coming axe-hero.\"Mine Os Yours\" is going to fluster some of the Cold War Kids fans that will scream sell-out at A) Signing to Interscope and B) CWK's new-found sonic richness. To me, it's just a natural progression. \"Mine Is Yours\" is an unexpected surprise for me, and has slowly climbed into the upper reaches of my two thousand and eleven favourites.","overall":4,"summary":"Cold War Kids in a Grown Up World","unixReviewTime":1305849600,"reviewTime":"05 20, 2011"}
{"orig_index":59966,"reviewerID":"A3KJ6JAZPH382D","asin":"B004AE24HO","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,2],"reviewText":"These people were once cloudy and zealous, even though they had hidden the national anthem from their first albums. On their third full album (Geoffen \/ Interscope's first album) \"Mine is yours\", the Cold War of the Children gave up all the hypocrisy of the voice of the indie rock and went out to the world stage. They found out that the ghosts of their dinner Utwo and Jeff Buckley had also entered. They may have encountered an Arcade Fires incident during your investigation. In other words, “Iyam is yours” focuses on big goals and bold words, and most of them are beat levels. Singer Nathan Willett is a very passionate guy, which makes the words even more embarrassing (like \"The crown on my head is heavy\" in \"Out of the Wild\") sounds very inspiring, when Find the perfect match, that's it. The title track is the opposite of \"Sensitive Kid\" and has the same effect; the title track sounds like the national anthem, \"Sensitive Kid\" is reduced to a strong bass, and the piano falls to success, hold your collar and move it smoothly. So, when they sneak back to their old, coarse voice, \"Cold Toes on the Cold Floor\", you'll realize the low guitarist Jonny Russell — the was on the album Most of the time the was buried in the producer's act. Jaques King — the future tax warrior. \"Your Mine Os\" will shock some Cold War Kids fans who will shout in the newly acquired rich voice of A) signing Interscope and B) CWK. To me, this is just a natural process. \"Mine is yours\" was a shock to me, and it has been a little more up-and-coming in two thousand and eleven which I love.","overall":4,"summary":"Cold War Kids in a Grown Up World","unixReviewTime":1305849600,"reviewTime":"05 20, 2011"}
{"orig_index":59966,"reviewerID":"A3KJ6JAZPH382D","asin":"B004AE24HO","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,2],"reviewText":"On their third full album, the Cold War Kids have given up all indoor sound effects and are all out to the world stage. The title track and \"Sensitive Kid\" are polar opposites and have the same effect.","overall":4,"summary":"Cold War Kids in a Grown Up World","unixReviewTime":1305849600,"reviewTime":"05 20, 2011"}
{"orig_index":59966,"reviewerID":"A3KJ6JAZPH382D","asin":"B004AE24HO","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,2],"reviewText":"Oral War Children no longer pretend to love the indie rock and go all out to the world stage. \"Mine is yours\" focused on big goals and bold words, and mostly achieves its goals. Singer Nathan Willett is a very loving man.","overall":4,"summary":"Cold War Kids in a Grown Up World","unixReviewTime":1305849600,"reviewTime":"05 20, 2011"}
{"orig_index":63719,"reviewerID":"A3MHGA6BJJ7P27","asin":"B00BI6SSMC","reviewerName":"W. T. Hoffman \"artist and musician\"","helpful":[3,5],"reviewText":"Each IRON AND WINE album has been a slow progression from the previous, often reminding me of Dylan's evolution from folk, to folk rock, to country rock, each album moving into someplace new, utterly creative and yet honest to the score belief of the artist. Sam Bean's score music has never changed. His lyrics have always been, and are, about Love and Sex, Sin and Christian spirituality, and rural southern pastoral imagery. Sean Beam's harmonic sophistication has grown, and now resides definitely in the extended chords, and key modulation, that screams JAZZ! However, the melodic movements remain folk like, almost simplistic, yet open to vocal harmonies. (another key element to the IRON AND WINE sound.) If GHOST ON GHOST had stayed where KISS EACH OTHER CLEAN was, I'd have been really disappointed, something I've never experienced with this music. GHOST ON GHOST has brought it all together, piece by piece, which you've seen in each previous routing. The country\/folk elements still show up in \"Baby Backstage\". The electronica the explored on songs like \"Carried Home\" still pop up on the songs. The tight rock song, perfected on this masterpiece THE SHEPHERDS DOG still exists on songs like \"Grace for Saints and Ramblers\"(the hit video is on Utoob). The heavy use of horns which first surfaced on IN THE REINS with Calexico, appears on almost all the songs. However, the previous album, KISS EACH OTHER CLEAN, showed the jazz chops that Sam Bean loves, like the insane sax solo on \"Your Fake Name\". Now, everything has come together, all invention has risen, and GHOST ON GHOST gives the fans the ultimate IRON AND WINE album. (At least until the next album.) Songs at times remains space, lots of negative space, only to slide into sonic textures, using the orchestral color studiously, like brass chops, vocal harmonizing, strings, keyboards, stand up bass, percussion, back up singing, and Sam's acoustic guitar riffs, and pedal steel. This album especially explores vocal experimentation hitherto unheard on IRON AND WINE albums. AT times the voice has deep reverb, other times the instrumentation includes layered vocal parts, as the primary instrument of the song. Even the string charts, often the bane of production, flicker thru the soundscape subtle. \"Sundown\", for example, only has a small violin lead during the final four measures of the song. Overall, mid and slow tempo songs tend to predominate. However \"Lover's Revolution\" (My favourite song), starts out largo, SLOWLY increases tempo, until the song becomes a hard bop jazz tune, with sax solo dripping it up, until the last verse hits at PRESTO speed, all jazz chords circling your head. Only to RETARD back to the first tempo to finish. Amazing. GHOST ON GHOST presents as a relaxing, deep, introspective, jazzy, kaleidoscopic, cinematic album. If you're a fan of the IRON AND WINE sound, for rather, SOUNDS, then get it. It will amaze.","overall":5,"summary":"Sam Bean smokes the Jazz Cigarette","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":63719,"reviewerID":"A3MHGA6BJJ7P27","asin":"B00BI6SSMC","reviewerName":"W. T. Hoffman \"artist and musician\"","helpful":[3,5],"reviewText":"The entire IRON NEWANINI album has been slightly developed from the past. It always reminds me of Dylan's evolution from folk rock to folk rock to country. Sam Bean's song has't changed. His songs have always been about love and sex, sin and the Christian spirit, and the unflattering images of the countryside in the south. The complexity of the Sean Beam harmony continues to grow, and now it is definitely present in the extended songs and songs, which makes JAZZ bring! However, the movement of the music is still similar to folk songs, almost simple, but open to voice harmony. (Another great feature of the sound of IRON AND NINE.) If GHOST ON GHOST resides where KISS EACHANE CLEAN, I would be very disappointed. This is music I have never heard before. GHOST ON GHOST combines everything you see in each previous track, piece by piece. The country \/ person material still appears in \"Baby Backstage\". Electronic music explored in songs such as \"Caried Home\" is still appearing in the songs. Strong rock songs, the perfect shepherd dog for this masterpiece still exist in songs such as \"Grace for Saints and Ramblers\" (a popular video on Utoob). The widespread use of horns first appeared in REINS and Calexico, and appeared in almost every song. However, the previous album KISS EACH OTHER ACLEAN featured Sam Bean's favourite jazz, like a crazy solo saxophone under the name \"Fake Name\". Now that everything is in place and all the fiction has been revealed, GHOST ON GHOST is providing fans with the latest album IRON AND WINE. (At least until the next album.) Sometimes there is still a place for songs, a lot of wrong places, just slipping into a sound network, deliberately using orchestras, such as brass bells, symphony, strings, keyboards, vertical scratch. , percussion, backing vocals, enhancements and a percussion instrument for Sam’s guitar sound. This album directly examines voicemails that have not been heard on IRON NEWANINI's album so far. Sometimes the sound has a deep sound, and sometimes the instrument includes the sleeping sound position as the main instrument of the song. Even the string charts, which are always in the fourth product, blink at hidden sounds. For example, \"Sundown\" has a short violin that leads to the last four bars of the song. In general, medium and slow songs tend to dominate. However, \"Lover's Revolution\" (my favourite song), started slowly, very fast, until the song became a heavy jazz song, and the saxophone just fell down until the last verse became PRESTO Speed ​​hits, the rest. Jazz songs around your head. Only when RETARD returns to the original rhythm can it be completed. It's amazing. GHOST ON GHOST is a cool, deep, visual album, jazz, kaleidoscope, movie-like. If you like the sound of IRON AND WINE, exactly, SOUNDS, come and listen. It will be amazing.","overall":5,"summary":"Sam Bean smokes the Jazz Cigarette","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":63719,"reviewerID":"A3MHGA6BJJ7P27","asin":"B00BI6SSMC","reviewerName":"W. T. Hoffman \"artist and musician\"","helpful":[3,5],"reviewText":"john salon: Each album progresses slightly faster than previous albums. Avlon: The whole album enters a new space, completely creative but reliable. He said GHOST IN GHOST puts it all together, breaking it into a piece. salon: If GHOST ON GHOST stays where KISS ONE CLEAN is, I'll be disappointed. However, the movement of the music is still similar to traditional songs, which are almost simple, but open to the harmony of the voice.","overall":5,"summary":"Sam Bean smokes the Jazz Cigarette","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":63719,"reviewerID":"A3MHGA6BJJ7P27","asin":"B00BI6SSMC","reviewerName":"W. T. Hoffman \"artist and musician\"","helpful":[3,5],"reviewText":"Sometimes there is a space in the song. Most of the negative space will slide into the soundtrack. being trampled. However, \"Lover's Revolution\" (my favourite song), started slowly, very fast, until the song became a heavy jazz song, and the saxophone just fell down until the last verse became PRESTO Speed ​​hits, the rest. Jazz songs around your head. Each album of IRON AND WINNER moves slightly from the previous one. It always reminds me of Dylan's evolution from folk to folk rock to another world. MISSION IN GHOST is a free, deep, visual album, jazz, kaleidoscope, and a movie-like album. However, the previous album KISS EACH OTHER featured Sam Bean's favourite jazz, as a solo saxophone solo on \"Your Fake Name\". His songs have always been about love and sex, sin and the Christian spirit, and the unflattering images of the countryside in the south. However, the movement of the music is still similar to traditional songs, which are almost simple, but open to the harmony of the voice.","overall":5,"summary":"Sam Bean smokes the Jazz Cigarette","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":64186,"reviewerID":"A1GN8UJIZLCA59","asin":"B00EH49FRE","reviewerName":"P Magnum","helpful":[6,9],"reviewText":"Katy Perry returns with another song destined for the top of the charts, \"Roar\". Ms. Perry does't break any new ground with the song (it is basically nicks the tune of Sara Bareilles' \"Brave\" completely), so long time fans will certainly lap it up by the truckloads. Most of Ms. Perry's work is generic pop and \"Roar\" is another mostly pleasant, but forgettable number.","overall":2,"summary":"Same Old, Same Old","unixReviewTime":1378425600,"reviewTime":"09 6, 2013"}
{"orig_index":64186,"reviewerID":"A1GN8UJIZLCA59","asin":"B00EH49FRE","reviewerName":"P Magnum","helpful":[6,9],"reviewText":"Katy Perry returns with another song focused on the charts, \"Roar.\" Ms. Perry did’t break any new ground with this song (basically it fits Sara Bareilles ’musical“ courage ”), so longtime fans will definitely be loaded with trucks. Much of Ms. Perry's work is universal pop music, and \"Roaring\" is another fun but easy to forget.","overall":2,"summary":"Same Old, Same Old","unixReviewTime":1378425600,"reviewTime":"09 6, 2013"}
{"orig_index":64186,"reviewerID":"A1GN8UJIZLCA59","asin":"B00EH49FRE","reviewerName":"P Magnum","helpful":[6,9],"reviewText":"Katy Perry returns with another song set at the top of the charts. \"Roaring\" is the sound of Sarah Bareilles \"brave\"","overall":2,"summary":"Same Old, Same Old","unixReviewTime":1378425600,"reviewTime":"09 6, 2013"}
{"orig_index":64186,"reviewerID":"A1GN8UJIZLCA59","asin":"B00EH49FRE","reviewerName":"P Magnum","helpful":[6,9],"reviewText":"Katy Perry returns with another song set to rise on the charts. Ms. Perry did not break any new world with this song. This song basically cuts Sara Bareilles 'song \"Brave\"","overall":2,"summary":"Same Old, Same Old","unixReviewTime":1378425600,"reviewTime":"09 6, 2013"}