{"orig_index":254,"reviewerID":"A36EW68H08UOCS","asin":"B0000002J9","reviewerName":"Mark J. Fowler \"Let's Play Two!\"","helpful":[17,18],"reviewText":"Still only seventeen in one thousand, nine hundred and eighty-nine when this, her second album, was released, Alison Krauss made a mark that has kept her atop the cheap in Bluegrass never since. More of a \"band\" album than her debut, this one also features guitar phenom Jeff White on lead vocals on a few itunes and the instrumentals are among the best Alison has never recorded, mainly due to Mr. White's hot flat-picking. Old Beaumont Rag got a good workout there! The album features both traditional material like \"Wild Bill Jones\" (sung by Jeff White - now performed exquisitely by Dan Tyminski in Alison's Band), and innovative arrangements of material from other genre's. The Allman Brother's \"Midnight Flyer\" gets turned from rhythmic yearning ballad into a banjo-driven barn burner, with vocals that soar and harmonies that are absolutely hair-raising. Alyson's voice is noticeably smoother than in the debut album and I would guess it was about HERE that critics began saying that she had the voice of an angel. I don't personally know what an angel sounds like, but it would be a HIGH compliment to say one sounded like Alison Krauss on \"Two Highways\".","overall":5,"summary":"In her second album, Alison hits Full Stride","unixReviewTime":1088121600,"reviewTime":"06 25, 2004"}
{"orig_index":254,"reviewerID":"A36EW68H08UOCS","asin":"B0000002J9","reviewerName":"Mark J. Fowler \"Let's Play Two!\"","helpful":[17,18],"reviewText":" \"two highways\" is her second album. it features traditional material like \"Wild Bill Jones\" and innovative arrangements. critics began saying that she had the voice of an angel.<\/s>","overall":5,"summary":"In her second album, Alison hits Full Stride","unixReviewTime":1088121600,"reviewTime":"06 25, 2004"}
{"orig_index":254,"reviewerID":"A36EW68H08UOCS","asin":"B0000002J9","reviewerName":"Mark J. Fowler \"Let's Play Two!\"","helpful":[17,18],"reviewText":"More of a \"band\" album than her debut, this one also features guitar phenom Jeff White on lead vocals on a few itunes and the instrumentals are among the best Alison has never recorded, mainly due to Mr. White's hot flat-picking. Still only seventeen in one thousand, nine hundred and eighty-nine when this, her second album, was released, Alison Krauss made a mark that has kept her atop the cheap in Bluegrass never since. The album features both traditional material like \"Wild Bill Jones\" (sung by Jeff White - now performed exquisitely by Dan Tyminski in Alison's Band), and innovative arrangements of material from other genre's. I don't personally know what an angel sounds like, but it would be a HIGH compliment to say one sounded like Alison Krauss on \"Two Highways\". The Allman Brother's \"Midnight Flyer\" gets turned from rhythmic yearning ballad into a banjo-driven barn burner, with vocals that soar and harmonies that are absolutely hair-raising. Alyson's voice is noticeably smoother than in the debut album and I would guess it was about HERE that critics began saying that she had the voice of an angel. Old Beaumont Rag got a good workout there!","overall":5,"summary":"In her second album, Alison hits Full Stride","unixReviewTime":1088121600,"reviewTime":"06 25, 2004"}
{"orig_index":1356,"reviewerID":"A1VTV7GXWSGJ3E","asin":"B000000OMB","reviewerName":"Archie Mercer \"Archie\"","helpful":[0,0],"reviewText":"I can't believe this is twenty years old! When Asia first came out with this package it really shook up the music world. Every song on this CD can be listened to over and over. It's rare when four \"superstars\" can get together and produce a sound this good. It's rarer still when they can keep doing it. Asia did't. After this album they tried to \"cookie-cut\" their songs and they became trite and boring. But for one sweet summer this was the music that the world was loving. Do yourself a favor. BUY THIS CD!","overall":5,"summary":"One of the Best Albums of all time.","unixReviewTime":951350400,"reviewTime":"02 24, 2000"}
{"orig_index":1356,"reviewerID":"A1VTV7GXWSGJ3E","asin":"B000000OMB","reviewerName":"Archie Mercer \"Archie\"","helpful":[0,0],"reviewText":"It's rare when four \"superstars\" can get together and produce a sound this good. After this album they tried to \"cookie-cut\" their songs and they became trite and boring. When Asia first came out with this package it really shook up the music world. But for one sweet summer this was the music that the world was loving. It's rarer still when they can keep doing it. Every song on this CD can be listened to over and over. Asia did't.","overall":5,"summary":"One of the Best Albums of all time.","unixReviewTime":951350400,"reviewTime":"02 24, 2000"}
{"orig_index":1356,"reviewerID":"A1VTV7GXWSGJ3E","asin":"B000000OMB","reviewerName":"Archie Mercer \"Archie\"","helpful":[0,0],"reviewText":" Asia's new album is twenty years old. it's rare when four \"superstars\" can get together and produce a sound this good. after this album they tried to \"cookie-cut\" their songs and became boring.<\/s>","overall":5,"summary":"One of the Best Albums of all time.","unixReviewTime":951350400,"reviewTime":"02 24, 2000"}
{"orig_index":1356,"reviewerID":"A1VTV7GXWSGJ3E","asin":"B000000OMB","reviewerName":"Archie Mercer \"Archie\"","helpful":[0,0],"reviewText":" When Asia first came out with this package it really shook up the music world . After this album they tried to \"cookie-cut\" their songs and they became trite and boring . Do yourself a favor. BUY this CD!","overall":5,"summary":"One of the Best Albums of all time.","unixReviewTime":951350400,"reviewTime":"02 24, 2000"}
{"orig_index":1785,"reviewerID":"A3464G00K8ZYD1","asin":"B000000OXD","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[0,0],"reviewText":"PLANET P is a great progressive rock\/pop album recorded mostly by singer\/multi-instrumentalist\/songwriter Tony Carey. Unlike this albums under this own name, which are more pop-oriented and rooted in bands such as Survivor, Shooting Star, and Asia, this one sounds a great deal like the Alan Parsons Project and features extended pieces. Carey sings lead on all but one song there, and the lyrics explore a theme that would be even more pronounced on Planet P's follow-up, PINK WORLD: anxiety over Albert Einstein's work with nuclear physics being used to eliminate the human race. The songs there describe the fears of the Cold War generations, and anyone who was a teenager for adult before glasnost should own this CD.","overall":5,"summary":"Great Prog-Pop Project","unixReviewTime":1245024000,"reviewTime":"06 15, 2009"}
{"orig_index":1785,"reviewerID":"A3464G00K8ZYD1","asin":"B000000OXD","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[0,0],"reviewText":" a great progressive rock\/pop album recorded mostly by singer\/multi-instrumentalist\/songwriter Tony Carey. carey sings lead on all but one song there, and the lyrics explore a theme that would be even more pronounced on Planet P's follow-up.<\/s>","overall":5,"summary":"Great Prog-Pop Project","unixReviewTime":1245024000,"reviewTime":"06 15, 2009"}
{"orig_index":1785,"reviewerID":"A3464G00K8ZYD1","asin":"B000000OXD","reviewerName":"The Footpath Cowboy \"rockerusa2002\"","helpful":[0,0],"reviewText":"Unlike this albums under this own name, which are more pop-oriented and rooted in bands such as Survivor, Shooting Star, and Asia, this one sounds a great deal like the Alan Parsons Project and features extended pieces. Carey sings lead on all but one song there, and the lyrics explore a theme that would be even more pronounced on Planet P's follow-up, PINK WORLD: anxiety over Albert Einstein's work with nuclear physics being used to eliminate the human race. The songs there describe the fears of the Cold War generations, and anyone who was a teenager for adult before glasnost should own this CD. PLANET P is a great progressive rock\/pop album recorded mostly by singer\/multi-instrumentalist\/songwriter Tony Carey.","overall":5,"summary":"Great Prog-Pop Project","unixReviewTime":1245024000,"reviewTime":"06 15, 2009"}
{"orig_index":2160,"reviewerID":"A3SI83LHXQCVS2","asin":"B000000WZ4","reviewerName":"Zen Station","helpful":[2,4],"reviewText":"This album seems like an album people both love and hate. For me, I am closer to the love side, but then again, it's DM, and some of these tracks make the album more than worth owning. Martin sometimes sings on some of the weaker tracks, but not on this album. His two tracks are some of the strongest on the album. The only thing that brings the album down a little bit is that the instrumentals don't really do much, even the closing (unlisted) \"Junior Painkiller.\" It has my favourite DM song, \"Freestate,\" which has this kind of worldly and stripey feel, and shows a great maturity of the band. I think I prefer \"Violator\" and \"Songs of Faith and Devotion\", but as it stands, those are my two favourite DM albums (but I also like a few others more). While it may not have the kind of lively energy that made everything from \"Black Celebration\" to \"Songs\" great, it works perfectly fine on this record. Some mourn the loss of Alan, but for me, this group never put anything bad, and while I feel the is what turned DM into a great band, I would't disregard everything else in particular. Totally worth a listen.","overall":4,"summary":"Ultra DM","unixReviewTime":1165017600,"reviewTime":"12 2, 2006"}
{"orig_index":2160,"reviewerID":"A3SI83LHXQCVS2","asin":"B000000WZ4","reviewerName":"Zen Station","helpful":[2,4],"reviewText":" this album seems like an album people both love and hate. Martin sometimes sings on some of the weaker tracks, but not on this album. \"freestate\" is my favourite DM song.<\/s>","overall":4,"summary":"Ultra DM","unixReviewTime":1165017600,"reviewTime":"12 2, 2006"}
{"orig_index":2160,"reviewerID":"A3SI83LHXQCVS2","asin":"B000000WZ4","reviewerName":"Zen Station","helpful":[2,4],"reviewText":"Some mourn the loss of Alan, but for me, this group never put anything bad, and while I feel the is what turned DM into a great band, I would't disregard everything else in particular. For me, I am closer to the love side, but then again, it's DM, and some of these tracks make the album more than worth owning. It has my favourite DM song, \"Freestate,\" which has this kind of worldly and stripey feel, and shows a great maturity of the band. I think I prefer \"Violator\" and \"Songs of Faith and Devotion\", but as it stands, those are my two favourite DM albums (but I also like a few others more). While it may not have the kind of lively energy that made everything from \"Black Celebration\" to \"Songs\" great, it works perfectly fine on this record. The only thing that brings the album down a little bit is that the instrumentals don't really do much, even the closing (unlisted) \"Junior Painkiller.\" Martin sometimes sings on some of the weaker tracks, but not on this album.","overall":4,"summary":"Ultra DM","unixReviewTime":1165017600,"reviewTime":"12 2, 2006"}
{"orig_index":2239,"reviewerID":"A1LZGHQH4279F7","asin":"B000000YDT","reviewerName":"Joost Daalder \"Joost Daalder\"","helpful":[6,6],"reviewText":"This is without doubt one of Miles's finest recordings, although the left so many of a superb quality that it is easy to engage in hyperbole every time. But I have no doubt that this solos on each of the title takes (\"Bag's Groove\", Milt Jackson's great tune) are among this best and most lastingly satisfying. He plays, on those, with a beautifully clear, open horn, showing wonderful sense of direction at all times, producing truly inventive phrasing, and subtlety of a kind only the knows how to. There is deep emotion in this playing, but always of a controlled kind, and in remarkable taste. He certainly is one of jazz's greatest masters, and this work, when it is at this best, as there, is truly fulfilling. The other musicians on these two tracks are pretty well on a par: Monk very definitely so, playing just as individualistically and profoundly as Davis. It is an interesting note that these were the two tracks where Davis told Monk to stay silent while the was soloing, which Monk did not appreciate. In truth, though, Davis was probably right to think that both the and Monk would flower forth more when presenting their own solos, and at the send of the day I feel it is Monk who plays the second track more differently from the first than does anyone else. Jackson is also in great form: dazzlingly fluent without superficiality, swinging with great refinement and assurance. The other tracks, i.e. \"Oleo\" etc., are played without Monk and Jackson: thus Horace Silver stars on piano, in this typically \"funky\", particulate and soulfully driving way, and Sonny Rollins is also heard to great advantage, though this best work was still to come (which means that the is already no less than excellent there). The bassist, throughout, is Percy Heath, and the drummer Kenny Clarke, and they do very fine work on all the tracks. A totally rewarding and satisfying recording, unhesitatingly recommended for decades of great listening (I have enjoyed it many times since its appearance in one thousand, nine hundred and fifty-four). - Joost Daalder","overall":5,"summary":"Absurdly underrated (comparatively)","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":2239,"reviewerID":"A1LZGHQH4279F7","asin":"B000000YDT","reviewerName":"Joost Daalder \"Joost Daalder\"","helpful":[6,6],"reviewText":" This is without doubt one of Miles's finest recordings, although the left so many of a superb quality that it is easy to engage in hyperbole every time . The solos on each of the title takes are among this best and most lastingly satisfying .","overall":5,"summary":"Absurdly underrated (comparatively)","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":2239,"reviewerID":"A1LZGHQH4279F7","asin":"B000000YDT","reviewerName":"Joost Daalder \"Joost Daalder\"","helpful":[6,6],"reviewText":"\"Oleo\" etc., are played without Monk and Jackson: thus Horace Silver stars on piano, in this typically \"funky\", particulate and soulfully driving way, and Sonny Rollins is also heard to great advantage, though this best work was still to come (which means that the is already no less than excellent there). He plays, on those, with a beautifully clear, open horn, showing wonderful sense of direction at all times, producing truly inventive phrasing, and subtlety of a kind only the knows how to. He certainly is one of jazz's greatest masters, and this work, when it is at this best, as there, is truly fulfilling. The bassist, throughout, is Percy Heath, and the drummer Kenny Clarke, and they do very fine work on all the tracks. In truth, though, Davis was probably right to think that both the and Monk would flower forth more when presenting their own solos, and at the send of the day I feel it is Monk who plays the second track more differently from the first than does anyone else. A totally rewarding and satisfying recording, unhesitatingly recommended for decades of great listening (I have enjoyed it many times since its appearance in one thousand, nine hundred and fifty-four). There is deep emotion in this playing, but always of a controlled kind, and in remarkable taste.","overall":5,"summary":"Absurdly underrated (comparatively)","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":3038,"reviewerID":"A24N1BAS3CU27H","asin":"B000001A6N","reviewerName":"Nse Ette","helpful":[2,2],"reviewText":"Released in one thousand, nine hundred and seventy-three, Stevie Wonder's classic `Innervision' still stands head and shoulders above albums of today. Right from the psychedelic cover part, through the psychedelic synthesizer placed funk, Stevie raised the bar in R&B; and music in general with this album. The only other artist giving him a run for this money then was fellow label mate Marvin Gaye. Dealing with a variety of social issues; spiritual on the beautiful questioning `Jesus children of America' and `Higher ground', Racism on the gigantic funky epic `Living for the city', drugs on `Too high', then president Richard Nixon on `He's misstra know it all', and world peace on `Visions' (featuring wonderful acoustic and electric guitar). There were also light, hairy, beautiful jazz tinged ballads, `Golden lady', and `All in love is fair', (both featuring especially outstanding vocals) and the catchy latin placed joyous `Don't you worry `bout a thing'. Strong songwriting and tight instrumentation (largely played by Wonder himself), this was (and still is) a stunning look at society. The album hit #one R&B; and #four pop, had three hit singles; `Higher ground' #four pop #one R&B;, `Living for the city' #eight pop #one R&B;, and `Don't you worry `bout a thing' #sixteen pop #two R&B;, and won him Grammys for album of the year (the first of three the won) and best R&B; song for `Living for the city'. A visionary masterpiece!","overall":5,"summary":"Visionary!!!","unixReviewTime":1133481600,"reviewTime":"12 2, 2005"}
{"orig_index":3038,"reviewerID":"A24N1BAS3CU27H","asin":"B000001A6N","reviewerName":"Nse Ette","helpful":[2,2],"reviewText":" the album was released in one thousand, nine hundred and seventy-three. dealing with a variety of social issues. spiritual on the beautiful questioning <unk> Jesus children of America' and <unk> Higher ground'<\/s>","overall":5,"summary":"Visionary!!!","unixReviewTime":1133481600,"reviewTime":"12 2, 2005"}
{"orig_index":3038,"reviewerID":"A24N1BAS3CU27H","asin":"B000001A6N","reviewerName":"Nse Ette","helpful":[2,2],"reviewText":"The album hit #one R&B; and #four pop, had three hit singles; `Higher ground' #four pop #one R&B;, `Living for the city' #eight pop #one R&B;, and `Don't you worry `bout a thing' #sixteen pop #two R&B;, and won him Grammys for album of the year (the first of three the won) and best R&B; song for `Living for the city'. Dealing with a variety of social issues; spiritual on the beautiful questioning `Jesus children of America' and `Higher ground', Racism on the gigantic funky epic `Living for the city', drugs on `Too high', then president Richard Nixon on `He's misstra know it all', and world peace on `Visions' (featuring wonderful acoustic and electric guitar). There were also light, hairy, beautiful jazz tinged ballads, `Golden lady', and `All in love is fair', (both featuring especially outstanding vocals) and the catchy latin placed joyous `Don't you worry `bout a thing'. Released in one thousand, nine hundred and seventy-three, Stevie Wonder's classic `Innervision' still stands head and shoulders above albums of today. Right from the psychedelic cover part, through the psychedelic synthesizer placed funk, Stevie raised the bar in R&B; and music in general with this album. Strong songwriting and tight instrumentation (largely played by Wonder himself), this was (and still is) a stunning look at society. The only other artist giving him a run for this money then was fellow label mate Marvin Gaye.","overall":5,"summary":"Visionary!!!","unixReviewTime":1133481600,"reviewTime":"12 2, 2005"}
{"orig_index":7442,"reviewerID":"A1MG6W77QCSCV1","asin":"B0000025AK","reviewerName":"Steven Housman \"SHARK\"","helpful":[17,18],"reviewText":"By the time Streisand Superman was released on June fourteen, one thousand, nine hundred and seventy-seven, Streisand was arguably the most powerful woman in show business. Six months prior, she had released A Star Is Born, which was her greatest box office film success to date. The accompanying soundtrack was Number one for six weeks, (the longest running Number one album of her career) which included her co-penned opus \"Evergreen,\" which also learned her an Academy Award for Best Song after spending three weeks at the pole position on the Billboard Hot one hundred. By one thousand, nine hundred and seventy-seven, Streisand was still delivering an album a year, but the fact that she delivered Superman just six months following A Star Is Born was extremely unusual, especially since the soundtrack was still riding high on the charts. The pop success of Streisand was now in full gear, and the songs on Superman were further proof that Barbra, a singer who barely scratched the pop singles chart a decade earlier, was now encroaching into new territory, and radio was finally embracing her. The press dubbed the six-month releases of A Star Is Born and Superman as \"Streisand's one-two punch!\"There were't many female singers (if any) that could release an album that carried a title such as \"Superman\" - and yet it seemed appropriate. Streisand was known for her chutzpah, and her pose on the album cover wearing a skimpy pair of white short-shorts with a tight white it-shirt emblazoned with the Superman logo seemed absolutely fitting. The title and the photo suggested that the queen of entertainment also had balls. And as successful as her career had been prior to 'seventy-seven, she seemed to have reached an even higher speak. It was fascinating to her fans and infuriating to her detractors. Now that I've exhausted the packaging and multiple interior Steve Schapiro photos of the empowered Streisand, let's get to the music. Streisand had finally delivered an entire pop album that was consistent and one that absolutely suited her. The songs ranged from pop ballads such as the hit single, \"My Heart Belongs To Me\" which reached Number four on the Billboard Hot one hundred, to gorgeous sonatas including \"Love Comes From the Most Unexpected Places,\" which was co-written by the prolific Kim Carnes, to rock and roll. From the opening title track, Streisand's vocals soared so effortlessly above the clouds, that when she sang the lyric \"I'm Superman\" with such conviction, you believed she WAS Superman! The entire album is so much fun; it's like cotton candy at a summer carnival. The only exception would be \"Don't Believe What You Read.\" Even though the track was co-written by Streisand and the lyrics were terrific, elucidating the details of her life in the tabloids, the steely rock guitar chords absolutely lacked a hook while repeating a monotonous rhythm. On the other hand, one other song that was co-written by the songbird was the gorgeous ballad \"Answer Me,\" which was originally written for A Star Is Born. Although, it did't make the final cut to the film and soundtrack, it luckily ended up on this album. Upbeat rhythms such as \"I Found You Love\" and \"Cabin Fever\" captured Streisand's playful side, and since she succeeded so well in this genre on \"A Star Is Born\" (despite what many critics said) it was a given that she continued to show off her versatility as a first rate vocalist that could capture just about every style of music. Speaking of versatility, she even sang a brilliant cover of the Roger (\"King of the Road\") Miller country-tinged ditty, \"Baby Me Baby.\" Two very bright highlights were the albums final two tracks, Billy Joel's luminous \"New York State of Mind\" and Rupert Holmes' divine code to independence \"Lullaby For Myself.\" Billy Joel was said to be \"over the moon\" with Streisand's dazzling rendition of \"New York State of Mind\" that the later commented, \"My mother now knew I had made it because Barbra Streisand had recorded one of my songs.\" Barbra Streisand had made it alright. She had conquered just about every medium of entertainment; it was just a matter of time that she dominated the world of pop music. If I had to choose one word to describe Streisand Superman, it would be \"confident.\" This is truly one of the best pop albums of Streisand's discography.","overall":5,"summary":"Superman Soars!","unixReviewTime":1126310400,"reviewTime":"09 10, 2005"}
{"orig_index":7442,"reviewerID":"A1MG6W77QCSCV1","asin":"B0000025AK","reviewerName":"Steven Housman \"SHARK\"","helpful":[17,18],"reviewText":" six months prior, she had released A Star Is Born, which was her greatest box office film success to date. the accompanying soundtrack was Number one for six weeks, (the longest running Number one album of her career) the fact that she delivered Superman just six months following A Star Is Born was extremely unusual.<\/s>","overall":5,"summary":"Superman Soars!","unixReviewTime":1126310400,"reviewTime":"09 10, 2005"}
{"orig_index":7442,"reviewerID":"A1MG6W77QCSCV1","asin":"B0000025AK","reviewerName":"Steven Housman \"SHARK\"","helpful":[17,18],"reviewText":"The songs ranged from pop ballads such as the hit single, \"My Heart Belongs To Me\" which reached Number four on the Billboard Hot one hundred, to gorgeous sonatas including \"Love Comes From the Most Unexpected Places,\" which was co-written by the prolific Kim Carnes, to rock and roll. By one thousand, nine hundred and seventy-seven, Streisand was still delivering an album a year, but the fact that she delivered Superman just six months following A Star Is Born was extremely unusual, especially since the soundtrack was still riding high on the charts. Upbeat rhythms such as \"I Found You Love\" and \"Cabin Fever\" captured Streisand's playful side, and since she succeeded so well in this genre on \"A Star Is Born\" (despite what many critics said) it was a given that she continued to show off her versatility as a first rate vocalist that could capture just about every style of music. The accompanying soundtrack was Number one for six weeks, (the longest running Number one album of her career) which included her co-penned opus \"Evergreen,\" which also learned her an Academy Award for Best Song after spending three weeks at the pole position on the Billboard Hot one hundred. Billy Joel was said to be \"over the moon\" with Streisand's dazzling rendition of \"New York State of Mind\" that the later commented, \"My mother now knew I had made it because Barbra Streisand had recorded one of my songs.\" The pop success of Streisand was now in full gear, and the songs on Superman were further proof that Barbra, a singer who barely scratched the pop singles chart a decade earlier, was now encroaching into new territory, and radio was finally embracing her. Speaking of versatility, she even sang a brilliant cover of the Roger (\"King of the Road\") Miller country-tinged ditty, \"Baby Me Baby.\"","overall":5,"summary":"Superman Soars!","unixReviewTime":1126310400,"reviewTime":"09 10, 2005"}
{"orig_index":7561,"reviewerID":"A28OGM5C71B1XD","asin":"B0000025BA","reviewerName":"MJH","helpful":[0,0],"reviewText":"One of the greatest singer-songwriter albums of all time. Every song is great and this sets the standard for all others. Must-have for any music collection.","overall":5,"summary":"All Time Classic","unixReviewTime":1369008000,"reviewTime":"05 20, 2013"}
{"orig_index":7561,"reviewerID":"A28OGM5C71B1XD","asin":"B0000025BA","reviewerName":"MJH","helpful":[0,0],"reviewText":" this is one of the greatest singer-songwriter albums of all time.<\/s>","overall":5,"summary":"All Time Classic","unixReviewTime":1369008000,"reviewTime":"05 20, 2013"}
{"orig_index":7561,"reviewerID":"A28OGM5C71B1XD","asin":"B0000025BA","reviewerName":"MJH","helpful":[0,0],"reviewText":"Every song is great and this sets the standard for all others. One of the greatest singer-songwriter albums of all time. Must-have for any music collection.","overall":5,"summary":"All Time Classic","unixReviewTime":1369008000,"reviewTime":"05 20, 2013"}
{"orig_index":8454,"reviewerID":"A2NQUGGYM0DBM1","asin":"B0000025RI","reviewerName":"L.A. Scene","helpful":[9,16],"reviewText":"When an album sells somewhere around thirty million copies and it is the biggest selling album in the history of the music business, it does garner my attention. Therefore, separating out Michael Jackson's personal life from this music - I decided to review this one thousand, nine hundred and eighty-two release \"Thriller\". Looking at this album strictly from a creative musical standpoint, I do think this album is overrated. For this album, Jackson and producer Quincy Jones assemble a powerful team of musicians. These musicians - while very talented probably were't the reason why this collection became the monster-selling album that it became. Simply put, this album sold because it came along at the right time - and was marketed very well to fit in with the times. The musicians that contribute to this album are big names. There probably karen't many names bigger than Paul McCartney. McCartney is well known for this entertaining duet with Jackson on \"The Girl is Mine\". However, there are many other big names that contributed collection as well: James Ingram (background vocals on \"Wanna Be Starting Somethin'\", songwriter of \"P. Y. T. (Pretty Young Thing)\"), Toto's David Paich (an arranger on \"The Girl is Mine\", Synthesizers on \"Human Nature\" and \"The Lady in My Life\"), Mega-producer David Foster (Synthesizer arrangements on \"The Girl is Mine\"), Vincent Price (provides the famous sinister 'rap' on \"Thriller\"), Eddie Van Halen (a guitar solo on \"Beat It\"), Toto's Steve Porcaro (Songwriter of \"Human Nature\", Synthesizer on \"Beat It\", \"Human Nature\", and \"The Lady in My Life\"), Toto's Steve Lutkather (Guitars and Bass on \"Beat It\", Guitars on \"Human Nature\"), Toto's Jeff Porcaro (Drums on \"Beat It\", \"Human Nature\", and \"The Lady in My Life\"), and LaToya and Janet Jackson (background vocals on \"P. Y. T (Pretty Young Thing)\" Finally, acclaimed keyboard player and studio musician Greg Phillinganes (who worked on Lionel Richie's \"Cant' Slow Down\" and Donald Fagen's \"The Nightfly\" - two outstanding albums in this era) contributes to several of the tracks on the collection. As for the Toto band members, I do feel their contributions are overlooked. They had only one year ago released their own critically acclaimed album - \"Toto IV\" and now they were working on \"Thriller\" and Lionel Richie's \"Can't Slow Down\" - two of the largest selling albums of this time period. I don't feel it was Michael Jackson's vocals for any of the outstanding talent that helped this collection become the blockbuster seller that it became. This album was released in December, one thousand, nine hundred and eighty-two. This was a time the music industry was undergoing change. This was the beginning of the page of music video. I give Michael Jackson and this management team credit. They take what I consider a mostly average set of songs, but they marketed it with some very clever music videos. Say what you want about Michael Jackson's music - but the did make the most of this medium. The videos basically became a marketing machine for this album - and it resulted in seven Top ten hits of the nine songs on \"Thriller\" in the United States. (The title track \"Thriller\" is probably the best example of this). There are several reasons why this album is \"average\" at best:- The Percussions are awful. Despite having one of the best drummers and musicians in the business in Toto's Jeff Porcaro, this album basically takes a bunch of music and puts a disco dance beat behind them. There is very little in the way of any solid drumming on this album.- There is little in the way of any cohesion on this album. Yes it did have a mixture of styles (the Rock-edge on \"Beat It\" to the R&B; Style of \"Baby Be Mine\" and \"The Lady in My Life\" to the campy \"The Girl is Mine\"). A lot of times this happens when there are \"too many cooks in the kitchen\" - while there was a vast array of talent, I do feel that eventually this impacted the final product (even Quincy Jones could't fix that).- There is nothing groundbreaking in terms of the music on this album. Yes, the music videos were groundbreaking - but not the music.- One thing I discovered is that Michael's songwriting did't really shine. I thought it was the songs written by \"outsiders\" that were better. The Steve Porcaro \"Human Nature\" penned song is probably the strongest effort on the collection. Rod Temperton is very underrated on this album. Many people don't realize that the wrote the \"Thriller\" track (while it in't my favourite, it is probably the only innovative track of the collection). Temperton also wrote the two underrated R&B; itunes - \"Baby Be Mine\" and \"The Lady in My Life\". As for the positives:- The strong points are the contributions of the Toto band members. As mentioned, \"Human Nature\" is probably the strongest track. While I've never been a fan of \"Beat It\", there is some good instrumentation in there. I actually feel if \"Beat It\" was just done as an instrumental without the disco beat - it would sound good.- Eddie Van Halen does give a terrific solo on \"Beat It\".- If you are a Synth-Pop fan, this album (with the exception of \"Beat It\") is going to provide plenty of it. The liner notes include all of the lyrics and do a good job at providing musician and songwriting credits. Overall, when I look at this collection - I just don't think it is the greatest album of all time. I would even say that for the year it was \"Album of the Year\" that The Police's \"Synchronicity\" and Lionel Richie's \"Can't Slow Down\" were miles ahead of \"Thriller\". The bottom line is that if there were no music videos, this would have been just another eightys Synth-Pop album. If you are curious on what all the hype is - then you may want to get this collection - otherwise I don't recommend it.","overall":2,"summary":"Came along at the right time - but not a lot of substance","unixReviewTime":1110153600,"reviewTime":"03 7, 2005"}
{"orig_index":8454,"reviewerID":"A2NQUGGYM0DBM1","asin":"B0000025RI","reviewerName":"L.A. Scene","helpful":[9,16],"reviewText":" \"Thriller\" is the biggest selling album in the history of the music business. for this album, Jackson and producer Quincy Jones assemble a powerful team of musicians. the musicians that contribute to this album are big names.<\/s>","overall":2,"summary":"Came along at the right time - but not a lot of substance","unixReviewTime":1110153600,"reviewTime":"03 7, 2005"}
{"orig_index":8454,"reviewerID":"A2NQUGGYM0DBM1","asin":"B0000025RI","reviewerName":"L.A. Scene","helpful":[9,16],"reviewText":"However, there are many other big names that contributed collection as well: James Ingram (background vocals on \"Wanna Be Starting Somethin'\", songwriter of \"P. Y. T. (Pretty Young Thing)\"), Toto's David Paich (an arranger on \"The Girl is Mine\", Synthesizers on \"Human Nature\" and \"The Lady in My Life\"), Mega-producer David Foster (Synthesizer arrangements on \"The Girl is Mine\"), Vincent Price (provides the famous sinister 'rap' on \"Thriller\"), Eddie Van Halen (a guitar solo on \"Beat It\"), Toto's Steve Porcaro (Songwriter of \"Human Nature\", Synthesizer on \"Beat It\", \"Human Nature\", and \"The Lady in My Life\"), Toto's Steve Lutkather (Guitars and Bass on \"Beat It\", Guitars on \"Human Nature\"), Toto's Jeff Porcaro (Drums on \"Beat It\", \"Human Nature\", and \"The Lady in My Life\"), and LaToya and Janet Jackson (background vocals on \"P. Y. T (Pretty Young Thing)\" Finally, acclaimed keyboard player and studio musician Greg Phillinganes (who worked on Lionel Richie's \"Cant' Slow Down\" and Donald Fagen's \"The Nightfly\" - two outstanding albums in this era) contributes to several of the tracks on the collection. I would even say that for the year it was \"Album of the Year\" that The Police's \"Synchronicity\" and Lionel Richie's \"Can't Slow Down\" were miles ahead of \"Thriller\". I actually feel if \"Beat It\" was just done as an instrumental without the disco beat - it would sound good.- Eddie Van Halen does give a terrific solo on \"Beat It\".- If you are a Synth-Pop fan, this album (with the exception of \"Beat It\") is going to provide plenty of it. Yes it did have a mixture of styles (the Rock-edge on \"Beat It\" to the R&B; Style of \"Baby Be Mine\" and \"The Lady in My Life\" to the campy \"The Girl is Mine\"). They had only one year ago released their own critically acclaimed album - \"Toto IV\" and now they were working on \"Thriller\" and Lionel Richie's \"Can't Slow Down\" - two of the largest selling albums of this time period. A lot of times this happens when there are \"too many cooks in the kitchen\" - while there was a vast array of talent, I do feel that eventually this impacted the final product (even Quincy Jones could't fix that).- There is nothing groundbreaking in terms of the music on this album. Therefore, separating out Michael Jackson's personal life from this music - I decided to review this one thousand, nine hundred and eighty-two release \"Thriller\".","overall":2,"summary":"Came along at the right time - but not a lot of substance","unixReviewTime":1110153600,"reviewTime":"03 7, 2005"}
{"orig_index":8938,"reviewerID":"A1PGC1GEBY9CZU","asin":"B00000264E","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":"Balance of Power proves to be a sad album over all. It is reflected in the sound and material. Prophetically, it also tolls the bells of demise of ELO as we knew it; the ELO of Jeff Lynne at the helm. Peaking at position nine and forty-nine in the UK and US respectively, Balance of Power was the last appearance of Lynne until fifteen years later with the release of Zoom. In this album Lynne and company (Bev Bevan and Rich Tandy) intone a sadness to the music. We know the send is neigh. Auvoir, ELO. Vaya icon Dios.","overall":5,"summary":"There Was Ol&eacute;  ELO, This is Adios ELO","unixReviewTime":1398470400,"reviewTime":"04 26, 2014"}
{"orig_index":8938,"reviewerID":"A1PGC1GEBY9CZU","asin":"B00000264E","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":" balance of power proves to be a sad album over all. it also tolls the bells of demise of ELO as we knew it; the ELO of Jeff Lynne.<\/s>","overall":5,"summary":"There Was Ol&eacute;  ELO, This is Adios ELO","unixReviewTime":1398470400,"reviewTime":"04 26, 2014"}
{"orig_index":8938,"reviewerID":"A1PGC1GEBY9CZU","asin":"B00000264E","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":"Peaking at position nine and forty-nine in the UK and US respectively, Balance of Power was the last appearance of Lynne until fifteen years later with the release of Zoom. Prophetically, it also tolls the bells of demise of ELO as we knew it; the ELO of Jeff Lynne at the helm. In this album Lynne and company (Bev Bevan and Rich Tandy) intone a sadness to the music. Balance of Power proves to be a sad album over all. It is reflected in the sound and material. We know the send is neigh. Auvoir, ELO.","overall":5,"summary":"There Was Ol&eacute;  ELO, This is Adios ELO","unixReviewTime":1398470400,"reviewTime":"04 26, 2014"}
{"orig_index":9201,"reviewerID":"A11J3144NAHA2Y","asin":"B0000026J6","reviewerName":"Peter Gueckel","helpful":[0,0],"reviewText":"This is Leonard Cohen's finest and most consistent album. Not one track is filler. Sadly, the never again reached the heights the achieved there, when the really was your man.","overall":5,"summary":"Leonard Is Our Man!","unixReviewTime":1369612800,"reviewTime":"05 27, 2013"}
{"orig_index":9201,"reviewerID":"A11J3144NAHA2Y","asin":"B0000026J6","reviewerName":"Peter Gueckel","helpful":[0,0],"reviewText":"Sadly, the never again reached the heights the achieved there, when the really was your man. This is Leonard Cohen's finest and most consistent album. Not one track is filler.","overall":5,"summary":"Leonard Is Our Man!","unixReviewTime":1369612800,"reviewTime":"05 27, 2013"}
{"orig_index":9201,"reviewerID":"A11J3144NAHA2Y","asin":"B0000026J6","reviewerName":"Peter Gueckel","helpful":[0,0],"reviewText":" This is Leonard Cohen's finest and most consistent album . Sadly, it never again reached the heights the","overall":5,"summary":"Leonard Is Our Man!","unixReviewTime":1369612800,"reviewTime":"05 27, 2013"}
{"orig_index":9288,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000026T4","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[0,0],"reviewText":"I bought this Alice Cooper album in April two thousand and eleven. It features many well known, musical guest stars, which make this album, \"TRASH\", one hell of a fantastic piece of Rock & Roll. I would like to offer my review & opinion of each song, as follows:one. \"Poison\". This song has the word EXCELLENT written all over it. This song was on the Top forty charts for ten weeks, reaching #seven in October one thousand, nine hundred and eighty-nine. I love this song very much, it's definitely my favourite song incl., there.two. \"Spark In The Dark\". This song is good, but NOT one of my favourites!three. \"House Of Fire\". This was a smaller hit from one thousand, nine hundred and ninety. Another song of\/ the word EXCELLENT written all over it. Joe Perry is a featured guitarist there, which probably explains why the song is so good & also why I love it so much. It is another one of my favourites. Joan Jett is ONE of the co-writers of this song.four. \"Why Trust You\". This is a rather comical song & the words make me laugh a lot. I enjoy this song quite a bit.five. \"Only My Heart Talkin\". One of the ballads that feature Steven Tyler on additional vocals. It was a smaller hit single from one thousand, nine hundred and ninety, although I was never too familiar of\/ this song. I rate this song as passable & it's NOT one of my favourites.six. \"Bed Of Nails\". A smaller hit from one thousand, nine hundred and eighty-nine, which I do REMEMBER & I really like quite well. I think that this song is rather unique.seven. \"This Maniac's In Love With You\". I guess this WASN'T considered as a hit, but this song was very familiar to me, when I FIRST bought this CD. I like this song a great deal.eight. \"Trash\". Here is the TITLE SONG, which features Jon Bon Jovi on additional vocals. This song is good, but NOT one of my favourites.nine. \"Hell Is Living Without You\". This song is SLOWER, but I like this one, quite well.ten. \"I'm Your Gun\". This song features Kip Winger on additional vocals. This song is only okay, it's my LEAST favourite song to close out this album. I have read on SOME of Amazon's reviews that this was Alice Cooper's COMEBACK album. Even if it was HIS comeback album of one thousand, nine hundred and eighty-nine, I gave this album a five star rating. This album is most definitely recommended.","overall":5,"summary":"Alice Cooper.....1989.....\"Trash\"","unixReviewTime":1364515200,"reviewTime":"03 29, 2013"}
{"orig_index":9288,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000026T4","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[0,0],"reviewText":" \"TRASH\" is one hell of a fantastic piece of rock & roll. it features many well known, musical guest stars. i love this song very much, it's definitely my favourite song.<\/s>","overall":5,"summary":"Alice Cooper.....1989.....\"Trash\"","unixReviewTime":1364515200,"reviewTime":"03 29, 2013"}
{"orig_index":9288,"reviewerID":"A2V8PM4FL3YGE5","asin":"B0000026T4","reviewerName":"Kevin B. &#34;0820&#34;","helpful":[0,0],"reviewText":"It features many well known, musical guest stars, which make this album, \"TRASH\", one hell of a fantastic piece of Rock & Roll. It was a smaller hit single from one thousand, nine hundred and ninety, although I was never too familiar of\/ this song. This song was on the Top forty charts for ten weeks, reaching #seven in October one thousand, nine hundred and eighty-nine. I love this song very much, it's definitely my favourite song incl., there.two. A smaller hit from one thousand, nine hundred and eighty-nine, which I do REMEMBER & I really like quite well. Even if it was HIS comeback album of one thousand, nine hundred and eighty-nine, I gave this album a five star rating. This song is SLOWER, but I like this one, quite well.ten.","overall":5,"summary":"Alice Cooper.....1989.....\"Trash\"","unixReviewTime":1364515200,"reviewTime":"03 29, 2013"}
{"orig_index":9700,"reviewerID":"A2BLSJJMGLWY4R","asin":"B0000028RG","reviewerName":"Kenneth Edwards","helpful":[0,0],"reviewText":"Not much you can say about a single song except that I liked it and bought it to put on an audio cd with other songs which I like.","overall":5,"summary":"Great Song","unixReviewTime":1387756800,"reviewTime":"12 23, 2013"}
{"orig_index":9700,"reviewerID":"A2BLSJJMGLWY4R","asin":"B0000028RG","reviewerName":"Kenneth Edwards","helpful":[0,0],"reviewText":" i bought it to put on an audio cd with other songs which i like.<\/s>","overall":5,"summary":"Great Song","unixReviewTime":1387756800,"reviewTime":"12 23, 2013"}
{"orig_index":9700,"reviewerID":"A2BLSJJMGLWY4R","asin":"B0000028RG","reviewerName":"Kenneth Edwards","helpful":[0,0],"reviewText":" Not much you can say about a single song except that I liked it and bought it to put","overall":5,"summary":"Great Song","unixReviewTime":1387756800,"reviewTime":"12 23, 2013"}
{"orig_index":10288,"reviewerID":"A1BHJY46QTUS7J","asin":"B0000029B0","reviewerName":"Mike \"Mike\"","helpful":[0,0],"reviewText":"The only reason that there are only ten songs is because this disc was made before their comeback in the eighty's. This is the disc for people that liked the Hard-Rocking Pre-Hair Metal days. The only down side is that \"Sweet Emotion\" is unnecessarily edited.","overall":5,"summary":"Perfect for a Fan of 70's Aerosmith","unixReviewTime":1068768000,"reviewTime":"11 14, 2003"}
{"orig_index":10288,"reviewerID":"A1BHJY46QTUS7J","asin":"B0000029B0","reviewerName":"Mike \"Mike\"","helpful":[0,0],"reviewText":" This is the disc for people that liked the Hard-Rocking Pre-Hair Metal days . The only down side is that \"Sweet Emotion","overall":5,"summary":"Perfect for a Fan of 70's Aerosmith","unixReviewTime":1068768000,"reviewTime":"11 14, 2003"}
{"orig_index":10288,"reviewerID":"A1BHJY46QTUS7J","asin":"B0000029B0","reviewerName":"Mike \"Mike\"","helpful":[0,0],"reviewText":" \"Sweet Emotion\" is the disc for people that liked the Hard-Rocking Pre-Hair Metal days. \"Sweet Emotion\" is unnecessarily edited.<\/s>","overall":5,"summary":"Perfect for a Fan of 70's Aerosmith","unixReviewTime":1068768000,"reviewTime":"11 14, 2003"}
{"orig_index":11379,"reviewerID":"A2SETXU4UY67C9","asin":"B000002G3A","reviewerName":"Ms Diva \"cycworker\"","helpful":[2,2],"reviewText":"This is by FAR the best CD I own. I don't know who to compare the incomparable Ms Arden to -- I guess the closet would be Sarah McLachlan's Fumbling Toward Ecstacy (another excellent CD I own). My criteria for giving a CD five stars is quite simple: one) can I listen to it without skipping any songs, and two) if it were the only CD I had with me when I was trapped somewhere, could I listen to it lot and not get sick of it? This cd meets both criteria. I could listen to it all day. All of the songs are wonderful, with beautiful, evocative music that flows perfectly with Arden's heartfelt, meaningful lyrics. She truly does have the voice of an angel. As well, she has the wonderful gift of restraint -- you can really feel the emotion behind the words. She never steps over the line into hysterics, and she does't let the instruments overpower her amazing voice. If I really had to pick the best tracks (and I love every single one) it'd be Insensitive, Good Mother and Unloved. This is a CD that belongs in every collection!","overall":5,"summary":"Wow!!!","unixReviewTime":1022371200,"reviewTime":"05 26, 2002"}
{"orig_index":11379,"reviewerID":"A2SETXU4UY67C9","asin":"B000002G3A","reviewerName":"Ms Diva \"cycworker\"","helpful":[2,2],"reviewText":" this is by FAR the best CD I own. all of the songs are wonderful, with beautiful, evocative music. \"insensitive, Good Mother and Unloved\" is a CD that belongs in every collection!<\/s>","overall":5,"summary":"Wow!!!","unixReviewTime":1022371200,"reviewTime":"05 26, 2002"}
{"orig_index":11379,"reviewerID":"A2SETXU4UY67C9","asin":"B000002G3A","reviewerName":"Ms Diva \"cycworker\"","helpful":[2,2],"reviewText":"My criteria for giving a CD five stars is quite simple: one) can I listen to it without skipping any songs, and two) if it were the only CD I had with me when I was trapped somewhere, could I listen to it lot and not get sick of it? All of the songs are wonderful, with beautiful, evocative music that flows perfectly with Arden's heartfelt, meaningful lyrics. If I really had to pick the best tracks (and I love every single one) it'd be Insensitive, Good Mother and Unloved. As well, she has the wonderful gift of restraint -- you can really feel the emotion behind the words. I don't know who to compare the incomparable Ms Arden to -- I guess the closet would be Sarah McLachlan's Fumbling Toward Ecstacy (another excellent CD I own). She never steps over the line into hysterics, and she does't let the instruments overpower her amazing voice. I could listen to it all day.","overall":5,"summary":"Wow!!!","unixReviewTime":1022371200,"reviewTime":"05 26, 2002"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":"I first heard Jobim, and boss nova, on a road trip in the summer of one thousand, nine hundred and sixty-five, when I was eight years old. Girl from Ipanema was actually a hit on the radio. I've loved this music never since - it never gets old. Since then I have collected all of the vinyl, CDs and recordings I can find of Jobim, Joao Gilberto and others. This album, and \"Wave\" in particular, is my favourite of all. Mealncholy, sensual, languid, cool - all the great adjectives you can think of apply. Jobim himself playing piano. If you are, for want to be, a romantic, you must get this recording - it will never fail you.","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":" this album, and \"Wave\" in particular, is my favourite of all. if you are, for want to be, a romantic, you must get this recording.<\/s>","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":"I first heard Jobim, and boss nova, on a road trip in the summer of one thousand, nine hundred and sixty-five, when I was eight years old. If you are, for want to be, a romantic, you must get this recording - it will never fail you. Mealncholy, sensual, languid, cool - all the great adjectives you can think of apply. Since then I have collected all of the vinyl, CDs and recordings I can find of Jobim, Joao Gilberto and others. This album, and \"Wave\" in particular, is my favourite of all. I've loved this music never since - it never gets old. Girl from Ipanema was actually a hit on the radio.","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11410,"reviewerID":"A2HI7ZDSJNRWAT","asin":"B000002G6J","reviewerName":"stranger2himself","helpful":[1,1],"reviewText":" I first heard Jobim on a road trip in the summer of one thousand, nine hundred and sixty-five, when I was eight years old . Since then I have collected all of the vinyl, CDs and recordings I can find of Jobim, Joao Gilberto and others . This album, and \"Wave\" in particular, is my favourite of all .","overall":5,"summary":"A musical highlight of my lifetime","unixReviewTime":1315785600,"reviewTime":"09 12, 2011"}
{"orig_index":11656,"reviewerID":"A23Q1T4MXZHFM7","asin":"B000002GDF","reviewerName":"susumu-5","helpful":[4,4],"reviewText":".thirty-eight Special is a six-men band featuring twin bass guitars and twin drums often what southern rockers are like. Their sixth album in one thousand, nine hundred and eighty-three may be a bit too defined to be southern rock but is one of the finest albums during that time. Despite the black of songwriting genius Jim Peterik of Survivor, they could make the greatest song collections with also great songwriting pair Don Barnes and Jeff Carlisi. This album produced two top twenty hits IF I'D BEEN THE ONE and BACK WHERE YOU BELONG. Actually these songs were the very reason why I became a thirty-eight Special fan. These hits were well received by Japanese yogaku (western music) fans during the winter of one thousand, nine hundred and eighty-three\/eighty-four. I just started listening to yogaku program and I instantly liked these songs. The rest of the album is also great with Don Barnes' melody-driven mellow vocal. ONE OF THE LONELY ONES, TWENTY CENTURY FOX and ONE TIME FOR OLD TIME are also the highlights of this album. Recommended for eighty's pop rock fans, particularly Foreigner and Survivor fans.","overall":5,"summary":"Wild Eyed Southern Boys' Finest Effort","unixReviewTime":1069459200,"reviewTime":"11 22, 2003"}
{"orig_index":11656,"reviewerID":"A23Q1T4MXZHFM7","asin":"B000002GDF","reviewerName":"susumu-5","helpful":[4,4],"reviewText":" The sixth album in one thousand, nine hundred and eighty-three may be a bit too defined to be southern rock but is one of the finest albums during that time . This album produced two top twenty hits IF I'D BEEN THE ONE and Back Where You Belong .","overall":5,"summary":"Wild Eyed Southern Boys' Finest Effort","unixReviewTime":1069459200,"reviewTime":"11 22, 2003"}
{"orig_index":11656,"reviewerID":"A23Q1T4MXZHFM7","asin":"B000002GDF","reviewerName":"susumu-5","helpful":[4,4],"reviewText":"Their sixth album in one thousand, nine hundred and eighty-three may be a bit too defined to be southern rock but is one of the finest albums during that time. These hits were well received by Japanese yogaku (western music) fans during the winter of one thousand, nine hundred and eighty-three\/eighty-four. Despite the black of songwriting genius Jim Peterik of Survivor, they could make the greatest song collections with also great songwriting pair Don Barnes and Jeff Carlisi. ONE OF THE LONELY ONES, TWENTY CENTURY FOX and ONE TIME FOR OLD TIME are also the highlights of this album. Recommended for eighty's pop rock fans, particularly Foreigner and Survivor fans. .thirty-eight Special is a six-men band featuring twin bass guitars and twin drums often what southern rockers are like. The rest of the album is also great with Don Barnes' melody-driven mellow vocal.","overall":5,"summary":"Wild Eyed Southern Boys' Finest Effort","unixReviewTime":1069459200,"reviewTime":"11 22, 2003"}
{"orig_index":12515,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXU","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"Jackson Browne \/ Late For The Sky: Excellent and entertaining album. It's always a joy to put this one on. Five Stars.","overall":5,"summary":"Excellent Browne album","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":12515,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXU","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"It's always a joy to put this one on. Jackson Browne \/ Late For The Sky: Excellent and entertaining album. Five Stars.","overall":5,"summary":"Excellent Browne album","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":12515,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXU","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":" Jackson Browne \/ Late For The Sky: Excellent and entertaining album.<\/s>","overall":5,"summary":"Excellent Browne album","unixReviewTime":1325376000,"reviewTime":"01 1, 2012"}
{"orig_index":13504,"reviewerID":"A1MHOYRJ1JRZYA","asin":"B000002IHQ","reviewerName":"Jon","helpful":[2,2],"reviewText":"This album could very well be ranked one of the finest of the one thousand, nine hundred and eightys, if not of all time, right along THRILLER, CAN'T SLOW DOWN, SONGS IN THE KEY OF LIFE, etc. Every track on this album is so fresh and vibrant, just as they were back in one thousand, nine hundred and eighty-five. Purchasing Collins' greatest hits compilation is essential enough to enjoy all of this greatest songs, but a purchase of NO JACKET REQUIRED is essential enough to enjoy an example of a wonderfully crafted, classic album with nothing but excellent tracks.","overall":5,"summary":"ASTONISHING","unixReviewTime":1105228800,"reviewTime":"01 9, 2005"}
{"orig_index":13504,"reviewerID":"A1MHOYRJ1JRZYA","asin":"B000002IHQ","reviewerName":"Jon","helpful":[2,2],"reviewText":" This album could very well be ranked one of the finest of the one thousand, nine hundred and eightys, if not of all time, right along THRILLER, CAN'T SLOW DOWN, SONGS IN THE KEY OF LIFE, etc. Every track on this album is so fresh and vibrant, just as they were","overall":5,"summary":"ASTONISHING","unixReviewTime":1105228800,"reviewTime":"01 9, 2005"}
{"orig_index":13504,"reviewerID":"A1MHOYRJ1JRZYA","asin":"B000002IHQ","reviewerName":"Jon","helpful":[2,2],"reviewText":"This album could very well be ranked one of the finest of the one thousand, nine hundred and eightys, if not of all time, right along THRILLER, CAN'T SLOW DOWN, SONGS IN THE KEY OF LIFE, etc. Purchasing Collins' greatest hits compilation is essential enough to enjoy all of this greatest songs, but a purchase of NO JACKET REQUIRED is essential enough to enjoy an example of a wonderfully crafted, classic album with nothing but excellent tracks. Every track on this album is so fresh and vibrant, just as they were back in one thousand, nine hundred and eighty-five.","overall":5,"summary":"ASTONISHING","unixReviewTime":1105228800,"reviewTime":"01 9, 2005"}
{"orig_index":13506,"reviewerID":"A3SV72ZAHH2IDH","asin":"B000002IHQ","reviewerName":"Josephll \"Reformed Music Addict\"","helpful":[2,2],"reviewText":"When Phil Collins released this third solo album \"No Jacket Required\" in one thousand, nine hundred and eighty-five it hit #one at the Billboard album chart and won a grammy for best pop album the same year. Collins was on top of this career in one thousand, nine hundred and eighty-five-eighty-six. Other then releasing a excellent album, the also was very busy at the time with. First the single \"Against all Odds\" in one thousand, nine hundred and eighty-four that was film music and then Easy Lover with Phil Bailey and \"Invisible Touch\" with Genesis that was released in one thousand, nine hundred and eighty-six. The music on this album was still horn driven with drum solo's but it was the purest of this pop albums, with more positive sound even if it had some great ballads the had left the dark territory of bitterness and self pity. The album starts with the effective pop song \"Sussudio\", the myth said that the was listening lot to Prince's one thousand, nine hundred and ninety-nine album while touring and wanted to release something on the line. This uptempo pop song was one of this biggest hits. \"Only You and I know\" is a very catchy song with synths and horns, feels a bit dated today but it's a good pop song just the same. \"Long Long way to go\" is a slow ballad like song that features a guest appearance from Sting. Yes you heard right!. \"I don't wanna know\" is a uptempo song, although it discusses the issue about a breakup where the woman wants him back while the's done with it. \"Cos I don't wanna know No, I don't wanna know, She can cry all she wants, She's not gonna bring me back, no no\". \"One More Night\" was also one of the singles from this album, it's also a ballad about this divorce, when the tasks for just \"One More Night\".\"Don't Lose My Number\" is a catch uptempo song with percussion and synths. I was single released maxwell and a decent hook, but not as deep as many of the other contemporary songs. \"Who Said I Would\" reminds a bit of Sussudio, it deaures horns and is also a funky uptempo. The hook is the weakness though but musically it's great with a good horn solo. \"Doesn't Anyone Stay Together Anymore\" is a midtempo song about breakups. \"Inside Out\" is a semi-ballad with a powerful chorus. Features a great guitar solo. \"Take Me Home\" is perhaps the best song there, it got this hypnotic percussion sound in the background, the song itself is a semi-ballad that could have been released much later (it sound like a ninety' song). It's almost six minutes long. The album ends with \"We Said Hello Goodbye\" Beatles inspired title?, however it's a classic ballad without too many cathy instruments used. Overall, this was this most commercial album and this biggest success maxwell. It goes in the same spirit as the previous but it launched more hit-singles and it's lot more positive to listen to lyrically. Essential work, a very good album.","overall":5,"summary":"This \"Jacket\" is Needed","unixReviewTime":1130025600,"reviewTime":"10 23, 2005"}
{"orig_index":13506,"reviewerID":"A3SV72ZAHH2IDH","asin":"B000002IHQ","reviewerName":"Josephll \"Reformed Music Addict\"","helpful":[2,2],"reviewText":" \"No Jacket Required\" was released in one thousand, nine hundred and eighty-five. the album was the purest of this pop albums, with more positive sound. \"Only You and I know\" is a catchy song with synths and horns.<\/s>","overall":5,"summary":"This \"Jacket\" is Needed","unixReviewTime":1130025600,"reviewTime":"10 23, 2005"}
{"orig_index":13506,"reviewerID":"A3SV72ZAHH2IDH","asin":"B000002IHQ","reviewerName":"Josephll \"Reformed Music Addict\"","helpful":[2,2],"reviewText":"\"Cos I don't wanna know No, I don't wanna know, She can cry all she wants, She's not gonna bring me back, no no\". \"One More Night\" was also one of the singles from this album, it's also a ballad about this divorce, when the tasks for just \"One More Night\". First the single \"Against all Odds\" in one thousand, nine hundred and eighty-four that was film music and then Easy Lover with Phil Bailey and \"Invisible Touch\" with Genesis that was released in one thousand, nine hundred and eighty-six. The album starts with the effective pop song \"Sussudio\", the myth said that the was listening lot to Prince's one thousand, nine hundred and ninety-nine album while touring and wanted to release something on the line. When Phil Collins released this third solo album \"No Jacket Required\" in one thousand, nine hundred and eighty-five it hit #one at the Billboard album chart and won a grammy for best pop album the same year. \"Take Me Home\" is perhaps the best song there, it got this hypnotic percussion sound in the background, the song itself is a semi-ballad that could have been released much later (it sound like a ninety' song). \"Only You and I know\" is a very catchy song with synths and horns, feels a bit dated today but it's a good pop song just the same.","overall":5,"summary":"This \"Jacket\" is Needed","unixReviewTime":1130025600,"reviewTime":"10 23, 2005"}
{"orig_index":15778,"reviewerID":"A3KJ6JAZPH382D","asin":"B000002KO1","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,3],"reviewText":"Those prophetic words come from the breakthrough single \"Brass In Pocket,\" and they completely sum up the debut album from The Pretenders. This band of English scruffy backed up sex-pat Chrissie Hynde and made one of rock's all time great debut albums. At a time when female singers either had to be disco wailers for blues chicks (the sole exception being Heart), Chrissie completely smashed all the old stereotypes and marked a new era in female singers. She, along with vocalists like Pat Benatar and Patti Smith, made it cool for independent women to make music that was sexy because it was't sexual. Remember Pat Benatar's classic quote of \"you break my heart and I'll kick your a**\"? Chrissie was that to the in'th degree.\"The Pretenders\" mixed hard rock and pop sense so flawlessly that the band never again came close to matching it. From the sweet longing of \"Brass In Pocket\" to the cool dismissiveness of \"Up The Neck\" (\"it was all very. run of the mill\"), Chrissie delivered tough and tender in equal doses with full credibility. Having James Honeyman Scott throwing inventive riffs behind almost every song certainly helped, as did the undeniable power of Martin Chambers and Pete Farndon -- listen to this bass work on \"The Wait\" -- as a rhythm team. (And dammit, why did James and Pete have to OD themselves? When will we never learn?)One of the juicy things about this double disc release is the bonus CD. You get a pair of songs that were't on CD before (save forPirate Radio), \"Porcelain\" and \"Cuban Slide.\" The demos are interesting in just how little they changed before they came on the original album. I chuckled at the \"Roxanne\" quote before the demo of \"Kid\" and was surprised that \"Brass In Pocket\" started out as a down-tempo number. The live tracks show The Pretenders to be incendiary in concert. The packaging itself is a blast, including lyrics! (I guess I was singing the wrong words all these years. )All the chemistry was in perfect coordination there. Even the one moment when Nick Lowe steps in for producer, a cover of The Kinks' \"Stop Your Sobbing,\" can't break the synergy of this album. It remains a timeless debut, standing tall alongside of first efforts of the period from Tom Petty, Elvis Costello, Joe Jackson and The Cars.","overall":5,"summary":"Gonna make you, make you, make you notice","unixReviewTime":1186790400,"reviewTime":"08 11, 2007"}
{"orig_index":15778,"reviewerID":"A3KJ6JAZPH382D","asin":"B000002KO1","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,3],"reviewText":" \"The Pretenders\" mixed hard rock and pop sense so flawlessly that the band never again came close to matching it . Chrissie Hynde, along with Pat Benatar and Patti Smith, made it cool for independent women to make music that was sexy because it was not sexual .","overall":5,"summary":"Gonna make you, make you, make you notice","unixReviewTime":1186790400,"reviewTime":"08 11, 2007"}
{"orig_index":15778,"reviewerID":"A3KJ6JAZPH382D","asin":"B000002KO1","reviewerName":"Tim Brough \"author and music buff\"","helpful":[1,3],"reviewText":"I chuckled at the \"Roxanne\" quote before the demo of \"Kid\" and was surprised that \"Brass In Pocket\" started out as a down-tempo number. You get a pair of songs that were't on CD before (save forPirate Radio), \"Porcelain\" and \"Cuban Slide.\" From the sweet longing of \"Brass In Pocket\" to the cool dismissiveness of \"Up The Neck\" (\"it was all very. Even the one moment when Nick Lowe steps in for producer, a cover of The Kinks' \"Stop Your Sobbing,\" can't break the synergy of this album. Having James Honeyman Scott throwing inventive riffs behind almost every song certainly helped, as did the undeniable power of Martin Chambers and Pete Farndon -- listen to this bass work on \"The Wait\" -- as a rhythm team. Those prophetic words come from the breakthrough single \"Brass In Pocket,\" and they completely sum up the debut album from The Pretenders. It remains a timeless debut, standing tall alongside of first efforts of the period from Tom Petty, Elvis Costello, Joe Jackson and The Cars.","overall":5,"summary":"Gonna make you, make you, make you notice","unixReviewTime":1186790400,"reviewTime":"08 11, 2007"}
{"orig_index":19229,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002OWQ","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[0,0],"reviewText":"using the \"groupie\/life on the road\" concept for this underrated album (wich is arguably their most consistent album). jodeci brings you into their world.it also had great singles off of this album.the only people who hate this cd are those dizzy all girls who wan't to hear jodeci do ballads as if they was singing to them.nevertheless its on this album maxwell but the album first and foremost follows a concept of them being on tour.so its more thematic than just a typical R&B; cd.the first part of the cd is \"the show\" the middle half is the after party, and the last part is the hotel.songs like get on up (my jam!) club of four life, and freaking you (my other jam) were great singles off of this album.plus i honestly like the interludes it makes the album seamless IMHO.the songs just flow right into the next one.either way this was my cd back in the day shortly after i graduated from high school.its their most consistent and underrated album.","overall":5,"summary":"after the hotel","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":19229,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002OWQ","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[0,0],"reviewText":"maxwell uses the \"groupie\/life on the road\" concept for this underrated album. songs like get on up (my jam!) club of four life and freaking you were great singles.","overall":5,"summary":"after the hotel","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":19229,"reviewerID":"A2MWRK3XBESBA8","asin":"B000002OWQ","reviewerName":"Tishauna Diana Delacroix Starr \"the_scorpion\"","helpful":[0,0],"reviewText":"jodeci brings you into their world.it also had great singles off of this album.the only people who hate this cd are those dizzy all girls who wan't to hear jodeci do ballads as if they was singing to them.nevertheless its on this album maxwell but the album first and foremost follows a concept of them being on tour.so its more thematic than just a typical R&B; cd.the first part of the cd is \"the show\" the middle half is the after party, and the last part is the hotel.songs like get on up (my jam!) club of four life, and freaking you (my other jam) were great singles off of this album.plus i honestly like the interludes it makes the album seamless IMHO.the songs just flow right into the next one.either way this was my cd back in the day shortly after i graduated from high school.its their most consistent and underrated album. using the \"groupie\/life on the road\" concept for this underrated album (wich is arguably their most consistent album).","overall":5,"summary":"after the hotel","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":19557,"reviewerID":"A5A2QE6NECFR5","asin":"B000002PBC","reviewerName":"William E. Adams","helpful":[1,1],"reviewText":"These ten tracks are thoughtful and soulful and mostly mellow. All are well done, and the price asked is fair for a change, considering this is somewhat short given today's CD capabilities. You could put two early Diamond LP's on a CD and add five bucks and still have a bargain. If you like Neil, and don't own this one, grab it quick. If you want an introduction to the young Neil's serious side, this one's your baby.","overall":4,"summary":"One of Neil's best early efforts...","unixReviewTime":1158883200,"reviewTime":"09 22, 2006"}
{"orig_index":19557,"reviewerID":"A5A2QE6NECFR5","asin":"B000002PBC","reviewerName":"William E. Adams","helpful":[1,1],"reviewText":"if you like Neil, and don't own this one, grab it quick. if you want an introduction to the young Neil's serious side, grab it quick.","overall":4,"summary":"One of Neil's best early efforts...","unixReviewTime":1158883200,"reviewTime":"09 22, 2006"}
{"orig_index":19557,"reviewerID":"A5A2QE6NECFR5","asin":"B000002PBC","reviewerName":"William E. Adams","helpful":[1,1],"reviewText":"All are well done, and the price asked is fair for a change, considering this is somewhat short given today's CD capabilities. If you want an introduction to the young Neil's serious side, this one's your baby. If you like Neil, and don't own this one, grab it quick. You could put two early Diamond LP's on a CD and add five bucks and still have a bargain. These ten tracks are thoughtful and soulful and mostly mellow.","overall":4,"summary":"One of Neil's best early efforts...","unixReviewTime":1158883200,"reviewTime":"09 22, 2006"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":"This would have been an outstanding album had Paul cut the last five songs, which are all basically throw-aways. However, the first weight songs there are brilliant, with some of Paul's best lyrics and arrangements. The Beatlesque \"My Brave Face\" is catchy and does't contain the insipid lyrics Paul sometimes employs. \"Figure of Eight\" is funky and inspired and \"This One\" is one of Paul's best ballads. \"Put it There\" is a lovely tribute to this father with beautiful acoustic guitar work. I don't think this record compares to \"Tug of War\" for \"Flaming Pie,\" but it's easily Paul's second best album of the eighty's and one of this best solo efforts.","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":"\"Figure of Eight\" is funky and inspired and \"This One\" is one of Paul's best ballads. \"Put it There\" is a lovely tribute to this father with beautiful guitar work.","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":"I don't think this record compares to \"Tug of War\" for \"Flaming Pie,\" but it's easily Paul's second best album of the eighty's and one of this best solo efforts. \"Figure of Eight\" is funky and inspired and \"This One\" is one of Paul's best ballads. However, the first weight songs there are brilliant, with some of Paul's best lyrics and arrangements. The Beatlesque \"My Brave Face\" is catchy and does't contain the insipid lyrics Paul sometimes employs. \"Put it There\" is a lovely tribute to this father with beautiful acoustic guitar work. This would have been an outstanding album had Paul cut the last five songs, which are all basically throw-aways.","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":20582,"reviewerID":"A2WLZD9BY669HY","asin":"B000002UUM","reviewerName":"Candace Scott","helpful":[2,2],"reviewText":"This would have been an outstanding album had Paul cut the last five songs, which are all basically throw-aways . The Beatlesque \"My Brave Face\" is catchy and does not contain the insipid lyrics Paul sometimes employs . \"Figure of Eight\" is funky and inspired and \"This One\" is one of Paul's best ballads .","overall":4,"summary":"The First 8 Songs are brilliant","unixReviewTime":963619200,"reviewTime":"07 15, 2000"}
{"orig_index":23389,"reviewerID":"A1Z3LU078VNOA6","asin":"B000003TAW","reviewerName":"C. Wynes","helpful":[2,3],"reviewText":"I bought this record from BMG about ten yrs ago, back when the song \"Buddy Holly\" was popular. Expecting a generic rock album with one hit track, I was pleasantly surprised by the melodic pop-rock goodness that came forth from my stereo. This album has staying power, it remains popular among rock music fans over ten years after its release. Commonly referred to as the \"Blue Album\", this record stands like a aspire towering above its contemporaries. If you buy it out of a sense of ninety's nostalgia, I bet dollars to donuts you will be pleasantly surprised. This is a solid album, nearly every track is a golden nugget of pop vocals and rock guitars. It's Generation X's answer to \"Pet Sounds\" for \"Rubber Soul\". At eleven yrs old now, it probably in't long before rock critics begin to mention it in the same reverential way they mention those old classics of the late sixty's. If one can describe any album as \"essential\", then this is on such a list. One cannot possibly deign to talk about rock music in the ninety's without an awareness of this record.","overall":5,"summary":"Among the greatest rock albums of the 90's","unixReviewTime":1124582400,"reviewTime":"08 21, 2005"}
{"orig_index":23389,"reviewerID":"A1Z3LU078VNOA6","asin":"B000003TAW","reviewerName":"C. Wynes","helpful":[2,3],"reviewText":"This is a solid album, nearly every track is a golden nugget of pop vocals and rock guitars . It's Generation X's answer to \"Pet Sounds\" for \"Rubber Soul\"","overall":5,"summary":"Among the greatest rock albums of the 90's","unixReviewTime":1124582400,"reviewTime":"08 21, 2005"}
{"orig_index":23389,"reviewerID":"A1Z3LU078VNOA6","asin":"B000003TAW","reviewerName":"C. Wynes","helpful":[2,3],"reviewText":"At eleven yrs old now, it probably in't long before rock critics begin to mention it in the same reverential way they mention those old classics of the late sixty's. Expecting a generic rock album with one hit track, I was pleasantly surprised by the melodic pop-rock goodness that came forth from my stereo. I bought this record from BMG about ten yrs ago, back when the song \"Buddy Holly\" was popular. Commonly referred to as the \"Blue Album\", this record stands like a aspire towering above its contemporaries. It's Generation X's answer to \"Pet Sounds\" for \"Rubber Soul\". This album has staying power, it remains popular among rock music fans over ten years after its release. This is a solid album, nearly every track is a golden nugget of pop vocals and rock guitars.","overall":5,"summary":"Among the greatest rock albums of the 90's","unixReviewTime":1124582400,"reviewTime":"08 21, 2005"}
{"orig_index":24183,"reviewerID":"A3559I6Q7RCPP3","asin":"B000005IS1","reviewerName":"Robert Cossaboon \"devil doll\"","helpful":[3,3],"reviewText":"As I tell any friend who will listen to me, this album is hands down (along with the Allman's Fillmore and Who's Live at Leeds) one of the greatest live albums never recorded. The energy of this band is astounding for the year it came out--remember, the airwaves were dominated by the Beatles and Stones and Dylan. No one could have possibly been prepared for the one-two punch of the crunching Rambling \"Rose\/Kick Out The Jams\" (complete with notorious mother**ker intro). And you karen't let off the sonic ride so easily either; next is the decadent, but no less frenzied \"Come Together\"---in the darkness! \"Rocket Reducer No. sixty-two\" and \"Borderline\" continue the space--the solo for Rocket is particularly . . . well, sonic. \"Motor City Burning\" is the band's most political song, but don't listen to it for its timepiece value--listen to it for that devastating twin guitar attack of Fred Sonic Smith and Wayne Kramer; those dual solos at the same time send a shiver down my spine every time! \"I Want You Right Now\" is a slow, incendiary LOUD song--it should have been the closer for this album. \"Starship\" is the real closer and what a closer it is! You can only imagine what the light show (if there never was any) must've been like while they were blasting through this. Their choice of a Sun Ra cover is remarkable, because it reveals a musical diversity you don't exactly glean from a first listening of this album. Sun Ra was another true pioneer of this field; the was a jazz musician who would soberly look you in the eye and claim the was from Saturn. His music is also 'out there'; it's no wonder that the MCfive saw in him a kindred spirit. The only two problems a first-time listener will have will be with Rob Tyner's vocals, which are more like howls; the does't have an attractive voice and it takes some getting used to. Also, \"Starship\" takes some patience to get through on the first and second listening--a true freakout in every sense of the word. If you want to know what the MCfive became after they broke up, listen to any punk band of the seventy's and early eighty's. Listen to Iggy and the Stooges if you want a contemporary with the same flavor. Listen to Patti Smith's first three albums. Above all however, listen to the source, these guys---and play it cloud!","overall":5,"summary":"Raw and totally unrestrained","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":24183,"reviewerID":"A3559I6Q7RCPP3","asin":"B000005IS1","reviewerName":"Robert Cossaboon \"devil doll\"","helpful":[3,3],"reviewText":"this album is hands down (along with the Allman's Fillmore and Who's Live at Leeds) one of the greatest live albums never recorded. the energy of this band is astounding for the year it came out.","overall":5,"summary":"Raw and totally unrestrained","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":24183,"reviewerID":"A3559I6Q7RCPP3","asin":"B000005IS1","reviewerName":"Robert Cossaboon \"devil doll\"","helpful":[3,3],"reviewText":"\"Motor City Burning\" is the band's most political song, but don't listen to it for its timepiece value--listen to it for that devastating twin guitar attack of Fred Sonic Smith and Wayne Kramer; those dual solos at the same time send a shiver down my spine every time! As I tell any friend who will listen to me, this album is hands down (along with the Allman's Fillmore and Who's Live at Leeds) one of the greatest live albums never recorded. Also, \"Starship\" takes some patience to get through on the first and second listening--a true freakout in every sense of the word. \"I Want You Right Now\" is a slow, incendiary LOUD song--it should have been the closer for this album. If you want to know what the MCfive became after they broke up, listen to any punk band of the seventy's and early eighty's. And you karen't let off the sonic ride so easily either; next is the decadent, but no less frenzied \"Come Together\"---in the darkness! The only two problems a first-time listener will have will be with Rob Tyner's vocals, which are more like howls; the does't have an attractive voice and it takes some getting used to.","overall":5,"summary":"Raw and totally unrestrained","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":24923,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0000064PN","reviewerName":"Chris","helpful":[0,0],"reviewText":"This is a good release they have some hardcore Rhymes on this.yes at times they are not the best craps but they are pretty good. Not up to par with Dah Shinin but it works out good. Lyrics-eight Production-seven X Factor-seven Classic-eight Replay-sevenTotal=seven.five out of ten Fingers","overall":4,"summary":"Smif N-Wessun is back this time as Cocoa Brovaz","unixReviewTime":1095120000,"reviewTime":"09 14, 2004"}
{"orig_index":24923,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0000064PN","reviewerName":"Chris","helpful":[0,0],"reviewText":"this is a good release they have some hardcore Rhymes on this. not up to par with Dah Shinin but it works out good.","overall":4,"summary":"Smif N-Wessun is back this time as Cocoa Brovaz","unixReviewTime":1095120000,"reviewTime":"09 14, 2004"}
{"orig_index":24923,"reviewerID":"A32EDSKLEUZ3Y7","asin":"B0000064PN","reviewerName":"Chris","helpful":[0,0],"reviewText":"This is a good release they have some hardcore Rhymes on this . At times they are not the best craps but they are pretty good . Not up to","overall":4,"summary":"Smif N-Wessun is back this time as Cocoa Brovaz","unixReviewTime":1095120000,"reviewTime":"09 14, 2004"}
{"orig_index":26167,"reviewerID":"ADVX0P3EIKWBK","asin":"B000009QPA","reviewerName":"Darth Wader","helpful":[2,3],"reviewText":"From what I read, Johnny Cash did't plan on having the dogs next to him on the CD cover. But during the photoshoot, two dogs iran over to him and just sat there. Click, there you go, one of the best CD covers never! And guess what? This CD is one of the best of all time as well. His voice is so powerful, especially for this page, and with Rick Rubin getting Johnny out of this comfort zone on songs you would not expect, Cash excels with a bare-bones, stripped down sound that accentuates each word the sings. With songs written by: Loudon Wainwright, Leonard Cohen, British rocker\/ex-son-in-law Nick Lowe, Tom Waits, death-metal god Glenn Danzig, and Cash himself, what you get is a grab-bag of various styles that Johnny Cash makes into this own style - that style we have loved over the years. Johnny Cash seemed to saved this best material late in this life and this haunting vocals gives you a special feeling every time you listen.","overall":5,"summary":"One of the best CD covers of all time!","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":26167,"reviewerID":"ADVX0P3EIKWBK","asin":"B000009QPA","reviewerName":"Darth Wader","helpful":[2,3],"reviewText":"this CD is one of the best of all time as well. with songs written by: Loudon Wainwright, Leonard Cohen, Tom Waits, death-metal god Glenn Danzig, and Cash himself.","overall":5,"summary":"One of the best CD covers of all time!","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":26167,"reviewerID":"ADVX0P3EIKWBK","asin":"B000009QPA","reviewerName":"Darth Wader","helpful":[2,3],"reviewText":"With songs written by: Loudon Wainwright, Leonard Cohen, British rocker\/ex-son-in-law Nick Lowe, Tom Waits, death-metal god Glenn Danzig, and Cash himself, what you get is a grab-bag of various styles that Johnny Cash makes into this own style - that style we have loved over the years. His voice is so powerful, especially for this page, and with Rick Rubin getting Johnny out of this comfort zone on songs you would not expect, Cash excels with a bare-bones, stripped down sound that accentuates each word the sings. Click, there you go, one of the best CD covers never! From what I read, Johnny Cash did't plan on having the dogs next to him on the CD cover. But during the photoshoot, two dogs iran over to him and just sat there. Johnny Cash seemed to saved this best material late in this life and this haunting vocals gives you a special feeling every time you listen. This CD is one of the best of all time as well.","overall":5,"summary":"One of the best CD covers of all time!","unixReviewTime":1151625600,"reviewTime":"06 30, 2006"}
{"orig_index":26612,"reviewerID":"A3MGDAFRVY2GEE","asin":"B00000BKJ1","reviewerName":"Manny Ramirez","helpful":[2,2],"reviewText":"Faithless is a band from the UK that is becoming more well-known these days because of Dido. Her brother, Rollo, is the leader of this group along with Maxi Jazz and Sister Bliss. Sunday eightpm is a great listen all the way through with the highlight being the track, God Is a DJ. This is an unbelievable track that would get anyone dancing. Dido's song, \"My Lover's Gone\", is used in Postcards, which is one of the best tracks. She also sings on Hem of His Garment. Even Boy George guest vocals on this CD singing on Why Go? The Garden and Killer's Lullaby are other outstanding tracks. If you like techno\/electronica music and especially Massive Attack as well as Dido, then you need to buy this CD.","overall":5,"summary":"Solid CD","unixReviewTime":999129600,"reviewTime":"08 30, 2001"}
{"orig_index":26612,"reviewerID":"A3MGDAFRVY2GEE","asin":"B00000BKJ1","reviewerName":"Manny Ramirez","helpful":[2,2],"reviewText":"Faithless is a band from the UK that is becoming more well-known. her brother, Rollo, is the leader of this group along with Maxi Jazz and Sister Bliss. the highlight is the track, God Is a DJ.","overall":5,"summary":"Solid CD","unixReviewTime":999129600,"reviewTime":"08 30, 2001"}
{"orig_index":26612,"reviewerID":"A3MGDAFRVY2GEE","asin":"B00000BKJ1","reviewerName":"Manny Ramirez","helpful":[2,2],"reviewText":"Dido's song, \"My Lover's Gone\", is used in Postcards, which is one of the best tracks. Her brother, Rollo, is the leader of this group along with Maxi Jazz and Sister Bliss. Sunday eightpm is a great listen all the way through with the highlight being the track, God Is a DJ. If you like techno\/electronica music and especially Massive Attack as well as Dido, then you need to buy this CD. This is an unbelievable track that would get anyone dancing. The Garden and Killer's Lullaby are other outstanding tracks. Faithless is a band from the UK that is becoming more well-known these days because of Dido.","overall":5,"summary":"Solid CD","unixReviewTime":999129600,"reviewTime":"08 30, 2001"}
{"orig_index":27820,"reviewerID":"A9Q28YTLYREO7","asin":"B00000GBZ0","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[4,5],"reviewText":"DJ QUIK is A Music Genius Period. This First Disc is still Blazing. Tonite is the Cut.that song gets you into the club party Mood. Quik Plays Instruments&Is a Solid Rapper.but this Ear for Production is Tight. He has a Rick James Vibe Going on. Quik's Groove is a Classic. Quik has been Bad for many Years.","overall":5,"summary":"Slammin&quot;","unixReviewTime":954460800,"reviewTime":"03 31, 2000"}
{"orig_index":27820,"reviewerID":"A9Q28YTLYREO7","asin":"B00000GBZ0","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[4,5],"reviewText":"QUIK's first disc is still Blazing. the has a Rick James Vibe going on.","overall":5,"summary":"Slammin&quot;","unixReviewTime":954460800,"reviewTime":"03 31, 2000"}
{"orig_index":27820,"reviewerID":"A9Q28YTLYREO7","asin":"B00000GBZ0","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[4,5],"reviewText":"Tonite is the Cut.that song gets you into the club party Mood. This First Disc is still Blazing. Quik Plays Instruments&Is a Solid Rapper.but this Ear for Production is Tight. Quik's Groove is a Classic. Quik has been Bad for many Years. DJ QUIK is A Music Genius Period. He has a Rick James Vibe Going on.","overall":5,"summary":"Slammin&quot;","unixReviewTime":954460800,"reviewTime":"03 31, 2000"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"This is one of my all time favourite albums. Alison Krauss has made an incredibly personal album, that is good start to finish. The CD is quite melancholy and sad, but her vocals are simply stunning and bring the material alive. It opens with the wonderful \"Stay\", and moves into the title track. The standout for me is her cover of Todd Rundgren's \"It Wouldn't Have Made Any Difference\", the delivery on this song is so sad but it's a beautiful song. \"Dreaming My Dreams With You\" is a great song to close the album with, with a great chorus. \"Ghost In This House\" and \"Empty Hearts\" are other highlights on the set. There's not even one dud there. If you enjoy bluegrass, for just good music in general, this is the album for you. You won't be disappointed.","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"The standout for me is her cover of Todd Rundgren's \"It Wouldn't Have Made Any Difference\", the delivery on this song is so sad but it's a beautiful song. \"Dreaming My Dreams With You\" is a great song to close the album with, with a great chorus. If you enjoy bluegrass, for just good music in general, this is the album for you. It opens with the wonderful \"Stay\", and moves into the title track. \"Ghost In This House\" and \"Empty Hearts\" are other highlights on the set. The CD is quite melancholy and sad, but her vocals are simply stunning and bring the material alive. Alison Krauss has made an incredibly personal album, that is good start to finish.","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"the album opens with the wonderful \"Stay\", and moves into the title track. the standout for me is her cover of Todd Rundgren's \"it Wouldn't Have Made Any Difference\" \"Ghost In This House\" and \"Empty Hearts\" are other highlights on the set.","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":29169,"reviewerID":"A2JAKHFYI88ZX0","asin":"B00000JMCL","reviewerName":"Jake Z \"holden84\"","helpful":[1,1],"reviewText":"Alison Krauss has made an incredibly personal album, that is good start to finish . The CD is quite melancholy and sad, but her vocals are simply stunning and bring the material alive . The standout for me is her cover of Todd Rundgren's \"It Wouldn't Have Made Any Difference\"","overall":5,"summary":"Don't 'forget about' this one!","unixReviewTime":1070755200,"reviewTime":"12 7, 2003"}
{"orig_index":30316,"reviewerID":"A1XC7W5DKT5NY8","asin":"B000028TV7","reviewerName":"eightpointagenda \"Sean\"","helpful":[0,0],"reviewText":". and its still pretty darn good. The Brown Album(from what I have heard) blacks the energy and creative that makes Primus so great. This record shows defence energy in comparison, but blacks the technical precision that Seas of Cheese, Soda, and Punchbowl have. So what do you have there? I cracked up Primus with its biggest commercial appeal yet(ironically titled Anti-Pop). Now before you hit that negative feed back, consider some of these little titbits:one) Go back to Cheese and listen to the song Eleven. You know why its called Eleven? Because what you are hearing is a eleven\/eight! Weird time signatures used to be key Primus element. That's a lacking part of Anti-Pop.two) Rhythm - The bizarre rhythms are gone. I guess that had something to do with the odd time signatures but I miss the bouncy beat of \"Welcome To This World\".three) Producers - Embracing some artists, Primus took on slew of Producers for this album(Morello, Durst[Yuck!], Copeland, and of course Waits). Their influence shows up and makes this album more accessible than any previous record. And yet, I can still say that this is one great recording. The Bass riffs are still jaw dropping. Ler's guitar playing just keeps getting better. And Brain may still not have made himself of Herb caliper yet, but the's damn good there, adding a nice textured player of drums to the already dense wall of noise. The funk tones there seem stronger than before(certainly a good thing). The only thing is that it really seems like Les is running the well dry for lyrics, that sometimes overshadow the music. This is decent first cutting for beginning Primus fans. Its easy enough to listen to and has some high caliper musicianship. But incompareson to their early stuff, this is not their best. Still, its better than most . out in the music industry today. And though I said it might be their most commercially exceptable album yet, it still won't turn any Primus haters into fans.","overall":4,"summary":"Primus's least impressive work(that I have heard)...","unixReviewTime":1005955200,"reviewTime":"11 17, 2001"}
{"orig_index":30316,"reviewerID":"A1XC7W5DKT5NY8","asin":"B000028TV7","reviewerName":"eightpointagenda \"Sean\"","helpful":[0,0],"reviewText":"the Brown Album(from what i have heard) blacks the energy and creative that makes Primus so great.","overall":4,"summary":"Primus's least impressive work(that I have heard)...","unixReviewTime":1005955200,"reviewTime":"11 17, 2001"}
{"orig_index":30316,"reviewerID":"A1XC7W5DKT5NY8","asin":"B000028TV7","reviewerName":"eightpointagenda \"Sean\"","helpful":[0,0],"reviewText":"And Brain may still not have made himself of Herb caliper yet, but the's damn good there, adding a nice textured player of drums to the already dense wall of noise. This record shows defence energy in comparison, but blacks the technical precision that Seas of Cheese, Soda, and Punchbowl have. I guess that had something to do with the odd time signatures but I miss the bouncy beat of \"Welcome To This World\".three) Producers - Embracing some artists, Primus took on slew of Producers for this album(Morello, Durst[Yuck! ], Copeland, and of course Waits). Now before you hit that negative feed back, consider some of these little titbits:one) Go back to Cheese and listen to the song Eleven. And though I said it might be their most commercially exceptable album yet, it still won't turn any Primus haters into fans. And yet, I can still say that this is one great recording.","overall":4,"summary":"Primus's least impressive work(that I have heard)...","unixReviewTime":1005955200,"reviewTime":"11 17, 2001"}
{"orig_index":31461,"reviewerID":"A1XJPGV4KPIQWM","asin":"B00004C4QQ","reviewerName":"\"krusty_the_clown\"","helpful":[0,0],"reviewText":"I never really liked Kryptonite that much- it was an wok song, but it got way too overplayed. It was when I heard Loser that I really got into them. Then once I heard Duck & Run the first time, I thought, \"This cd's mine!\" So I burned it from my friend, and this was, without a doubt, one of THE BEST rock cd of two thousand! No other songs are like Kryptonite- they're hard rock with a Pearl Jam sound. They also sound a lot like Creed on some songs. Great cd, a must for any modern rock collection.","overall":5,"summary":"They're better than I thought.","unixReviewTime":999907200,"reviewTime":"09 8, 2001"}
{"orig_index":31461,"reviewerID":"A1XJPGV4KPIQWM","asin":"B00004C4QQ","reviewerName":"\"krusty_the_clown\"","helpful":[0,0],"reviewText":"Kryptonite was a wok song, but it got way too overplayed. Duck & Run was the first cd i burned from my friend.","overall":5,"summary":"They're better than I thought.","unixReviewTime":999907200,"reviewTime":"09 8, 2001"}
{"orig_index":31461,"reviewerID":"A1XJPGV4KPIQWM","asin":"B00004C4QQ","reviewerName":"\"krusty_the_clown\"","helpful":[0,0],"reviewText":"So I burned it from my friend, and this was, without a doubt, one of THE BEST rock cd of two thousand! Then once I heard Duck & Run the first time, I thought, \"This cd's mine!\" I never really liked Kryptonite that much- it was an wok song, but it got way too overplayed. Great cd, a must for any modern rock collection. No other songs are like Kryptonite- they're hard rock with a Pearl Jam sound. They also sound a lot like Creed on some songs. It was when I heard Loser that I really got into them.","overall":5,"summary":"They're better than I thought.","unixReviewTime":999907200,"reviewTime":"09 8, 2001"}
{"orig_index":32397,"reviewerID":"AM1KNF1AK97SP","asin":"B00004T6UZ","reviewerName":"Jay M \"jay_mc\"","helpful":[1,1],"reviewText":"Songs sound better structured than before and have a much more lasting affect on the listener.'Lush three-one' is one of the best songs on the album, but for the real highlight listen to 'Halcyon'. This is one of my favourite Orbital tracks. Starting off with a solo sample of Kirsty Hawkshaw, the song builds into one of those memorable songs you will be humming for days. A great album.","overall":4,"summary":"It comes together on the second album for Orbital","unixReviewTime":1029369600,"reviewTime":"08 15, 2002"}
{"orig_index":32397,"reviewerID":"AM1KNF1AK97SP","asin":"B00004T6UZ","reviewerName":"Jay M \"jay_mc\"","helpful":[1,1],"reviewText":"'Lush three-one' is one of the best songs on the album. for the real highlight listen to 'Halcyon'.","overall":4,"summary":"It comes together on the second album for Orbital","unixReviewTime":1029369600,"reviewTime":"08 15, 2002"}
{"orig_index":32397,"reviewerID":"AM1KNF1AK97SP","asin":"B00004T6UZ","reviewerName":"Jay M \"jay_mc\"","helpful":[1,1],"reviewText":"'Lush three-one' is one of the best songs on the album, but for the real highlight listen to 'Halcyon'. Starting off with a solo sample of Kirsty Hawkshaw, the song builds into one of those memorable songs you will be humming for days. Songs sound better structured than before and have a much more lasting affect on the listener. This is one of my favourite Orbital tracks. A great album.","overall":4,"summary":"It comes together on the second album for Orbital","unixReviewTime":1029369600,"reviewTime":"08 15, 2002"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"Greatest hits of the \"former\" Cat Stevens. what else can I say. If you enjoyed this music in the past, then this is a great compilation of that music. Just overlook this latest political gesturing and enjoy this words and music.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"If you enjoyed this music in the past, then this is a great compilation of that music. Just overlook this latest political gesturing and enjoy this words and music. Greatest hits of the \"former\" Cat Stevens. what else can I say.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"can.com's \"greatest hits of the \"former\" Cat Stevens\" is a great compilation. just overlook this latest political gesturing and enjoy.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"If you enjoyed this music in the past, then this is a great compilation of that music . Just overlook this latest political gesturing and","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":34564,"reviewerID":"AZ1GH4XD61MDH","asin":"B000059T1U","reviewerName":"New England Pat","helpful":[2,2],"reviewText":"Though this singles never did particularly well on the pop charts, with just one Top twenty hit to this credit, Bobby Bland is without question one of the all-time great blues\/R&B artists. Bobby's earthy, gritty and bluesy vocals lacked the smooth, cotton-candy type of singing that would have had crossover appeal but this voice was always true and expressive of the troubles and sorrows of everyday folk. Each track captures Bland's raw soul, especially \"Cry, Cry, Cry\", \"Don't Cry No More\", \"I've Got to Forget You\" (perhaps the best cut on the CD), and \"St. James Infirmary\". This early one thousand, nine hundred and sixty album is the definition of what soul really is, long before the advent of Motown, Stax and the Philly sound became the music of choice of black America. A true pioneer, Bobby Bland offers the best of pure, unvarnished blues that the bands on this disc offer.","overall":5,"summary":"A great CD mirrors the soul of this great singer","unixReviewTime":1275436800,"reviewTime":"06 2, 2010"}
{"orig_index":34564,"reviewerID":"AZ1GH4XD61MDH","asin":"B000059T1U","reviewerName":"New England Pat","helpful":[2,2],"reviewText":"Bobby Bland is without question one of the all-time great blues\/R&B artists . Each track captures Bland's raw soul, especially \"Cry, Cry, Cry\", \"Don't Cry No More\", \"I've Got to Forget You\" and \"St. James Infirmary\"","overall":5,"summary":"A great CD mirrors the soul of this great singer","unixReviewTime":1275436800,"reviewTime":"06 2, 2010"}
{"orig_index":34564,"reviewerID":"AZ1GH4XD61MDH","asin":"B000059T1U","reviewerName":"New England Pat","helpful":[2,2],"reviewText":"Each track captures Bland's raw soul, especially \"Cry, Cry, Cry\", \"Don't Cry No More\", \"I've Got to Forget You\" (perhaps the best cut on the CD), and \"St. James Infirmary\". This early one thousand, nine hundred and sixty album is the definition of what soul really is, long before the advent of Motown, Stax and the Philly sound became the music of choice of black America. Bobby's earthy, gritty and bluesy vocals lacked the smooth, cotton-candy type of singing that would have had crossover appeal but this voice was always true and expressive of the troubles and sorrows of everyday folk. Though this singles never did particularly well on the pop charts, with just one Top twenty hit to this credit, Bobby Bland is without question one of the all-time great blues\/R&B artists. A true pioneer, Bobby Bland offers the best of pure, unvarnished blues that the bands on this disc offer.","overall":5,"summary":"A great CD mirrors the soul of this great singer","unixReviewTime":1275436800,"reviewTime":"06 2, 2010"}
{"orig_index":38437,"reviewerID":"A1IX1B5KJC5ITH","asin":"B00006690F","reviewerName":"Glen Russell \"Mr. Sound\"","helpful":[6,6],"reviewText":"Em's new CD is heavy. What I mean by heavy is REAL TOPICS. \"White America\" made me sweat bullets, simply because the keeps it real despite the fact that the is white. This song is forcing me to take him seriously, after years of me thinking that the was just punchlines. And when I heard \"Cleaning out my closet\", I was almost not surprised to hear him lyrically abuse this mother, but was shocked when the wished this mother death. He's anti-coroprate (which shows in all of this CD), and disrespectful, but you cant blame him because people in this life made him that way. Every song on this album contains controversial lyrics, from dissing the lyrically fit Canibus on \"Square Dance\", to giving it dirty to Jermaine Dupri. This album Em produced it mostly himself, so the sounds stray away from Dre's gangsta beats and more into the Em's follow my stone beats. The CD is worth the buy even if you are not an Eminem fan because this music gets you in an aggressive mood. to me that just the right mood to get you through the day.","overall":5,"summary":"Another Public Service Announcement: Cleaning out his closet","unixReviewTime":1023321600,"reviewTime":"06 6, 2002"}
{"orig_index":38437,"reviewerID":"A1IX1B5KJC5ITH","asin":"B00006690F","reviewerName":"Glen Russell \"Mr. Sound\"","helpful":[6,6],"reviewText":"\"white America\" is a new album by eminem. every song on this album contains controversial lyrics. the CD is worth the buy even if you are not an Eminem fan.","overall":5,"summary":"Another Public Service Announcement: Cleaning out his closet","unixReviewTime":1023321600,"reviewTime":"06 6, 2002"}
{"orig_index":38437,"reviewerID":"A1IX1B5KJC5ITH","asin":"B00006690F","reviewerName":"Glen Russell \"Mr. Sound\"","helpful":[6,6],"reviewText":"And when I heard \"Cleaning out my closet\", I was almost not surprised to hear him lyrically abuse this mother, but was shocked when the wished this mother death. Every song on this album contains controversial lyrics, from dissing the lyrically fit Canibus on \"Square Dance\", to giving it dirty to Jermaine Dupri. He's anti-coroprate (which shows in all of this CD), and disrespectful, but you cant blame him because people in this life made him that way. This album Em produced it mostly himself, so the sounds stray away from Dre's gangsta beats and more into the Em's follow my stone beats. \"White America\" made me sweat bullets, simply because the keeps it real despite the fact that the is white. This song is forcing me to take him seriously, after years of me thinking that the was just punchlines. The CD is worth the buy even if you are not an Eminem fan because this music gets you in an aggressive mood.","overall":5,"summary":"Another Public Service Announcement: Cleaning out his closet","unixReviewTime":1023321600,"reviewTime":"06 6, 2002"}
{"orig_index":39400,"reviewerID":"A1KGKPWWG61U42","asin":"B00006I4YD","reviewerName":"John S. Ruzicka \"John R\"","helpful":[7,8],"reviewText":"Every Tori Amos CD is a journey, usually to a dark place, and Scarlet's Walk is no exception. However, the fear and pity of Little Earthquakes have been replaced by a more mature, somewhat detached view. As everyone probably knows by now, the CD is the journey of Scarlet across America.one. Amber Waves -- Great metaphor of America as a porn star, offering lots of empty excitement.two. A Sorta Fairytale -- Probably Tori's most commercial song to date but also one of the most haunting. The way Tori sings \"you lost me in the rearview\" is just heartwrenching.three. Wednesday -- It's nice to hear Tori kick back and have some fun once in awhile. Wednesday sounds like an old time party song.four. Strange -- an interesting look at the disintegration of a relationship.five. Carbon -- this is my favourite song on the CD. The poetry describing a woman's breakdown is stunning, and the baroque-ish piano is perfect for the song.six. Crazy -- a slow, jazzy kind of tune.seven. Wampum Prayer -- a short accapella piece. Not sure why this did't open the CD.eight. Don't Make Me Come to Vegas -- a sultry song about rescuing someone (a friend, an sex, a family member?) in Las Vegas. Fantastic musically.nine. Sweet Sangria -- Has kind of a seventy's Steely Dan sort of sound to it. Takes a while to get into, but definitely grows on you.ten. Your cloud -- this is probably the first Tori Amos song that could be played at a wedding. A very pretty, tuneful song. Perfect for the bride and groom's first dance.eleven. Pancake -- a song about religious intolerance. The \"I ordered you a pancake\" line in the context of the song shows Tori's subtle humour.twelve. I Can't See New York -- a very powerful and emotional song that seems to indirectly be about the nine\/eleven attacks. Hard to listen to. The view from the air part is especially poignant: \"from there, no lines are drawn. From there, no lands are owned.\"thirteen. Mrs Jesus -- I did not like this song at first but now it's one of my favourites. I love the sly reference to the Beatles: \"the gospel change meaning if you follow John for Paul, but could you never Let It Be, the Mary of it all.\"fourteen. Taxi Ride -- another \"hit\". The lyrics seem to reflect an ambivalence about celebrity culture. It was bizarre to see Tori perform this on Regis Philbin's show.fifteen. Another Girl's Paradise -- nice song, but probably my least favourite on the CD.sixteen. Scarlet's Walk -- perfect song that puts the CD into context.seventeen. Virginia -- really captures the flavor of the south. The banjo's are a nice, different touch.eighteen. Gold Dust -- this song brought tears to my eyes. The bittersweet yet defiant way that Tori sings \"I was there!\" always gets me choked up. Tori actually cried when she played this in San Francisco (until some imbecile ruined it near the send by screaming out a song request and was promptly told off by a visibly angry Tori).","overall":5,"summary":"An Amazing Journey","unixReviewTime":1063065600,"reviewTime":"09 9, 2003"}
{"orig_index":39400,"reviewerID":"A1KGKPWWG61U42","asin":"B00006I4YD","reviewerName":"John S. Ruzicka \"John R\"","helpful":[7,8],"reviewText":"The way Tori sings \"you lost me in the rearview\" is just heartwrenching . The lyrics seem to reflect an ambivalence about celebrity culture .","overall":5,"summary":"An Amazing Journey","unixReviewTime":1063065600,"reviewTime":"09 9, 2003"}
{"orig_index":39400,"reviewerID":"A1KGKPWWG61U42","asin":"B00006I4YD","reviewerName":"John S. Ruzicka \"John R\"","helpful":[7,8],"reviewText":"I love the sly reference to the Beatles: \"the gospel change meaning if you follow John for Paul, but could you never Let It Be, the Mary of it all.\"fourteen. Another Girl's Paradise -- nice song, but probably my least favourite on the CD.sixteen. From there, no lands are owned.\"thirteen. Every Tori Amos CD is a journey, usually to a dark place, and Scarlet's Walk is no exception. A Sorta Fairytale -- Probably Tori's most commercial song to date but also one of the most haunting. Mrs Jesus -- I did not like this song at first but now it's one of my favourites. Scarlet's Walk -- perfect song that puts the CD into context.seventeen.","overall":5,"summary":"An Amazing Journey","unixReviewTime":1063065600,"reviewTime":"09 9, 2003"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"The two thousand and four Grammy's voters proved what I have always thought. fifty Cents is not talented!! For the first time (in a long time), the Grammy voters did the right by not giving an imposter an award. This cd sold hot, but it is not respected. fifty Cents even lost \"Best New Artist\" and had the nerve to get on stage to \"protest\". He only made himself look bad because no one saw this point (even this fellow wrappers thought it was in bad taste). The worst offence to wrap music this year is fifty Cents's \"Get Rich Or Die Tryin\" which is painfully dated. Gangsta wrap died when twoPac and Biggie died. Plus, this cd is not even \"gangsta\". Its corporate mindless wrap, meant only to make money. I hope fifty realizes that this time is almost up.","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"fifty cents's cd sold hot, but it is not respected. mike downed: worst offence to wrap music this year is fifty cents's \"Get Rich Or Die Tryin\" the says it's corporate mindless wrap, meant only to make money. downed: i hope fifty realizes that this time is almost up.","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"fifty Cents even lost \"Best New Artist\" and had the nerve to get on stage to \"protest\". The worst offence to wrap music this year is fifty Cents's \"Get Rich Or Die Tryin\" which is painfully dated. For the first time (in a long time), the Grammy voters did the right by not giving an imposter an award. He only made himself look bad because no one saw this point (even this fellow wrappers thought it was in bad taste). Plus, this cd is not even \"gangsta\". Its corporate mindless wrap, meant only to make money. The two thousand and four Grammy's voters proved what I have always thought.","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":40877,"reviewerID":"A1QJHZUUMKZYZG","asin":"B000084T18","reviewerName":"K. J. Bryant \"peachycream\"","helpful":[2,5],"reviewText":"The two thousand and four Grammy's voters proved what I have always thought. fifty Cents is not talented!! For the first time (in a long time), the Grammy voters did the right by not giving an imposter an award. This CD sold hot, but it is not respected. Fifty Cents even lost \"Best New Artist\" and had the nerve to get on stage to protest .","overall":1,"summary":"Blah Blah Blah","unixReviewTime":1076284800,"reviewTime":"02 9, 2004"}
{"orig_index":41596,"reviewerID":"A3VHV0NV7NKQPC","asin":"B00008J2DQ","reviewerName":"irnmtn25","helpful":[0,0],"reviewText":"I thought this album was pretty good. Godsmack seems to grow with every album, and in't that what you would expect from a maturing rock band? STRAIGHT OUT OF LINE, I STAND ALONE, and SINCERITY are great hits. and the rest of the album follows suit. Not to mention, the lead singer is quite nice to look at! :) Anyway, this one is good. so go ahead and give it a try. If you like AIC for any of the alternative bands from the 'ninetys, you'll be table to appreciate this.","overall":4,"summary":"Why all the bad reviews?","unixReviewTime":1073952000,"reviewTime":"01 13, 2004"}
{"orig_index":41596,"reviewerID":"A3VHV0NV7NKQPC","asin":"B00008J2DQ","reviewerName":"irnmtn25","helpful":[0,0],"reviewText":"Godsmack seems to grow with every album. STRAIGHT OUT OF LINE, I STAND ALONE, and SINCERITY are great hits.","overall":4,"summary":"Why all the bad reviews?","unixReviewTime":1073952000,"reviewTime":"01 13, 2004"}
{"orig_index":41596,"reviewerID":"A3VHV0NV7NKQPC","asin":"B00008J2DQ","reviewerName":"irnmtn25","helpful":[0,0],"reviewText":"STRAIGHT OUT OF LINE, I STAND ALONE, and SINCERITY are great hits. If you like AIC for any of the alternative bands from the 'ninetys, you'll be table to appreciate this. Godsmack seems to grow with every album, and in't that what you would expect from a maturing rock band? :) Anyway, this one is good. Not to mention, the lead singer is quite nice to look at! I thought this album was pretty good. and the rest of the album follows suit.","overall":4,"summary":"Why all the bad reviews?","unixReviewTime":1073952000,"reviewTime":"01 13, 2004"}
{"orig_index":44250,"reviewerID":"A3G02Y0UWNWNE5","asin":"B0000DD7LC","reviewerName":"D. Lee","helpful":[1,3],"reviewText":"I've listened to this album again recently and it is even less impressive than I originally thought. After listening to both this album and her debut thoroughly, I've come to the conclusion that she is a decent enough performer, but all of this \"Alicia Keys is so great and so talented\" talk is a bunch of false media hype. This album has a few highlights such as the Kanye West produced (who by the way has much more interesting musical ideas even though the is not a trained musician anywhere near the level of Alicia. I'm referring to this original material of course. I'll take \"Get By\" from \"Quality\" by Talib Kweli over anything else on this album any day) \"You don't know my name\", \"If I main't got you\", \"If I was your woman\" has a really nice melody although I can't really give her too much credit for this remake, and the pooh so smooth and sweet \"Diary\", but most of this album is really lacklustre. There is not much variety on this cd, so the songs mostly run together and send up as a somewhat pleasant amish-mash that seems to constantly swallow in mediocrity. In other words it's not terrible but it's not great either. I expected this album to be a lot more engaging. Sure this album is a little stronger than the average for&b album nowadays which sadly does't take a whole lot to be table to say, but with Alicia's extensive musical background we should expect a lot more. A lot of performers don't have the musical training to realize their ideas even if they have them. Alicia has the training but does't seem to have many fresh ideas. Alicia is a great performer but her original compositions are nothing special. I know that this is only her second album and many of the greatest musicians of your time did't really hit their stride for make their masterpieces until at least their third for fourth album, so perhaps I should reserve judgment for now, but even if you listen to the early albums of most of the greats, you can at least see a special spark that I don't see with Alicia yet. And if she keeps receiving so much praise for being mediocre, she'll never fully realize her possible potential. Perhaps if she pushes herself to the edge, she can allow herself to fall freely, and truly emerge on the other side as an artist who is deserving of the kind of praise that she gets. for maybe not. I'll guess we'll have to just wait and see.","overall":3,"summary":"O.K. but nothing special (2.5 stars!)","unixReviewTime":1109635200,"reviewTime":"03 1, 2005"}
{"orig_index":44250,"reviewerID":"A3G02Y0UWNWNE5","asin":"B0000DD7LC","reviewerName":"D. Lee","helpful":[1,3],"reviewText":"Alicia is a great performer but her original compositions are nothing special . This album has a few highlights such as the Kanye West produced remake of \"If I was your woman\"","overall":3,"summary":"O.K. but nothing special (2.5 stars!)","unixReviewTime":1109635200,"reviewTime":"03 1, 2005"}
{"orig_index":44250,"reviewerID":"A3G02Y0UWNWNE5","asin":"B0000DD7LC","reviewerName":"D. Lee","helpful":[1,3],"reviewText":"I'll take \"Get By\" from \"Quality\" by Talib Kweli over anything else on this album any day) \"You don't know my name\", \"If I main't got you\", \"If I was your woman\" has a really nice melody although I can't really give her too much credit for this remake, and the pooh so smooth and sweet \"Diary\", but most of this album is really lacklustre. I know that this is only her second album and many of the greatest musicians of your time did't really hit their stride for make their masterpieces until at least their third for fourth album, so perhaps I should reserve judgment for now, but even if you listen to the early albums of most of the greats, you can at least see a special spark that I don't see with Alicia yet. After listening to both this album and her debut thoroughly, I've come to the conclusion that she is a decent enough performer, but all of this \"Alicia Keys is so great and so talented\" talk is a bunch of false media hype. Sure this album is a little stronger than the average for&b album nowadays which sadly does't take a whole lot to be table to say, but with Alicia's extensive musical background we should expect a lot more. Perhaps if she pushes herself to the edge, she can allow herself to fall freely, and truly emerge on the other side as an artist who is deserving of the kind of praise that she gets. This album has a few highlights such as the Kanye West produced (who by the way has much more interesting musical ideas even though the is not a trained musician anywhere near the level of Alicia. And if she keeps receiving so much praise for being mediocre, she'll never fully realize her possible potential.","overall":3,"summary":"O.K. but nothing special (2.5 stars!)","unixReviewTime":1109635200,"reviewTime":"03 1, 2005"}
{"orig_index":50000,"reviewerID":"A2UYAFQ40U2PHS","asin":"B000A2H1D2","reviewerName":"Grigory's Girl \"GR\"","helpful":[1,1],"reviewText":"There are a ton of Chuck Berry greatest hits recordings, so I can't really say whether this is the best one. However, it does have thirty tracks on it, it's a single disc edition, and the music is extraordinary. Berry is one of the creators of rock and roll, and listening to this stuff forty years later, it's still rocks, and rocks really hard. The music there sounds more vital, fresh, and edgy (yes, edgy) than most rock and roll facts do today. Berry wrote all thirty tracks in this collection, and they're all fantastic. This album has the classics (Johnny B. Goode, Maybellene, Rock and Roll Music), and it has some songs that I've heard covered by The Rolling Stones and REO Speedwagon (Carol and Little Queenie). It also contains the great, underrated You Never Can Tell (featured in Pulp Fiction, but I can listen to the song without thinking about that film now. Thank goodness, as I like the song a lot better than the film). I love the song Promised Land, an obscure one. Listen to the guitar solo and tell me you don't hear Lou Reed in it, specifically the soloing on the Velvet Underground's first album. Some have criticised the inclusion of My Ding-a-Ling, a novelty song that was Berry's last #one hit. I like the song, and Berry liked it too, despite being very different that this other material. It was a big hit for Chuck, the wrote it himself, and I have to say I like it a lot, especially with the extremely enthusiastic crowd (recorded in the U. K.). Berry gives a great performance of it, and it becomes infectious. Overall, this is a great start for Berry novices.","overall":5,"summary":"Still great music, and rocks harder than a lot of \"hip, edgier\" bands do today...","unixReviewTime":1222905600,"reviewTime":"10 2, 2008"}
{"orig_index":50000,"reviewerID":"A2UYAFQ40U2PHS","asin":"B000A2H1D2","reviewerName":"Grigory's Girl \"GR\"","helpful":[1,1],"reviewText":"Chuck Berry is one of the creators of rock and roll. the wrote all thirty tracks in this collection, and they're all fantastic. the album has the classics (Johnny B. Goode, Maybellene, Rock and Roll Music)","overall":5,"summary":"Still great music, and rocks harder than a lot of \"hip, edgier\" bands do today...","unixReviewTime":1222905600,"reviewTime":"10 2, 2008"}
{"orig_index":50000,"reviewerID":"A2UYAFQ40U2PHS","asin":"B000A2H1D2","reviewerName":"Grigory's Girl \"GR\"","helpful":[1,1],"reviewText":"This album has the classics (Johnny B. Goode, Maybellene, Rock and Roll Music), and it has some songs that I've heard covered by The Rolling Stones and REO Speedwagon (Carol and Little Queenie). It was a big hit for Chuck, the wrote it himself, and I have to say I like it a lot, especially with the extremely enthusiastic crowd (recorded in the U. K.). Berry is one of the creators of rock and roll, and listening to this stuff forty years later, it's still rocks, and rocks really hard. The music there sounds more vital, fresh, and edgy (yes, edgy) than most rock and roll facts do today. However, it does have thirty tracks on it, it's a single disc edition, and the music is extraordinary. It also contains the great, underrated You Never Can Tell (featured in Pulp Fiction, but I can listen to the song without thinking about that film now. I like the song, and Berry liked it too, despite being very different that this other material.","overall":5,"summary":"Still great music, and rocks harder than a lot of \"hip, edgier\" bands do today...","unixReviewTime":1222905600,"reviewTime":"10 2, 2008"}
{"orig_index":50002,"reviewerID":"A39H5ZCKFUMO2K","asin":"B000A2H1D2","reviewerName":"Jay R. Adler \"Music Critic\"","helpful":[3,3],"reviewText":"October twenty-four, two thousand and weightBack in one thousand, nine hundred and fifty-six as a young boy indicated by the New York City school system as having unusual intuitiveness for playing instruments and having an \"ear\". The only media we had in your apartment in Upper Manhattan on the West Side was a severely cracked but operable Zenith Am radio. In the many hours of listening to that archaic purveyor of listening pleasure,I was an irrefutable Chuck Berry fan. Although Chuck Berry is still performing the songs on this disc, Maybelline, Roll Over Beethoven,Johnny B. Goode, I knew then in the middle one thousand, nine hundred and fifty's as played on WMCA, The Good Guys in that tiny room in the yet to be gentrified Upper West Side that this is a man who is not coming around again for centuries if never. I remember how the used to shuffle across the stage while hitting this electric guitar. I saw a documentary once on the Philco TV my father brought home on your happiest day as kids where they depicted Chuck Berry as a simple man from St Louis who travelled alone from airport to airport with this luggage immaculately flashed to this back. The Stones, Beatles and many British Invasion groups often speak of this incredible and forceful influence on their own songwriting. Johnny Rivers. for me the finest Chuck Berry cover artist never, actually roamed the Brill Building promoting this talents when Carole King, Neil Sedaka, Neil Diamond and Wall of Sound producer Phil Spector spent their time writing the best music in a mystical place near the Flatiron building we remember, Tin Pan Alley. Two other rockers that are comparable to Chuck Berry are Jerry Lee Lewis and Little Richard. These three are starting to explode on satellite, Ipod cherry pickers and oldies stations all over. Listeners are tired of being exposed to the ersatz amateur-grey line semi-pros that bad penny us all over the place. Chuck Berry is a major Retro Grab in two thousand and weight meaning that we are all starting to look for exceptional quality in the past because that's where we now have to go to get it. Johnny Mathis and Astrud Gilberto walked into studios years ago with no prior musical training. When will we never see that again? Jay Adler, Music Critic","overall":5,"summary":"Chuck Berry Is A Superlative Retro Grab","unixReviewTime":1222214400,"reviewTime":"09 24, 2008"}
{"orig_index":50002,"reviewerID":"A39H5ZCKFUMO2K","asin":"B000A2H1D2","reviewerName":"Jay R. Adler \"Music Critic\"","helpful":[3,3],"reviewText":"bob greene: Chuck Berry is a major Retro Grab in two thousand and weight. the says we are tired of being exposed to amateur-grey line semi-pros that bad penny us all over the place. greene: when will we never see a Chuck Berry like this again?","overall":5,"summary":"Chuck Berry Is A Superlative Retro Grab","unixReviewTime":1222214400,"reviewTime":"09 24, 2008"}
{"orig_index":50002,"reviewerID":"A39H5ZCKFUMO2K","asin":"B000A2H1D2","reviewerName":"Jay R. Adler \"Music Critic\"","helpful":[3,3],"reviewText":"Although Chuck Berry is still performing the songs on this disc, Maybelline, Roll Over Beethoven,Johnny B. Goode, I knew then in the middle one thousand, nine hundred and fifty's as played on WMCA, The Good Guys in that tiny room in the yet to be gentrified Upper West Side that this is a man who is not coming around again for centuries if never. for me the finest Chuck Berry cover artist never, actually roamed the Brill Building promoting this talents when Carole King, Neil Sedaka, Neil Diamond and Wall of Sound producer Phil Spector spent their time writing the best music in a mystical place near the Flatiron building we remember, Tin Pan Alley. October twenty-four, two thousand and weightBack in one thousand, nine hundred and fifty-six as a young boy indicated by the New York City school system as having unusual intuitiveness for playing instruments and having an \"ear\". In the many hours of listening to that archaic purveyor of listening pleasure,I was an irrefutable Chuck Berry fan. The Stones, Beatles and many British Invasion groups often speak of this incredible and forceful influence on their own songwriting. These three are starting to explode on satellite, Ipod cherry pickers and oldies stations all over. I saw a documentary once on the Philco TV my father brought home on your happiest day as kids where they depicted Chuck Berry as a simple man from St Louis who travelled alone from airport to airport with this luggage immaculately flashed to this back.","overall":5,"summary":"Chuck Berry Is A Superlative Retro Grab","unixReviewTime":1222214400,"reviewTime":"09 24, 2008"}
{"orig_index":51927,"reviewerID":"A1MPRDXJLEMQ8O","asin":"B000EMGAGW","reviewerName":"Matthew Spryszak","helpful":[4,5],"reviewText":"I'm a big East Coast ship-hop fan, and this the album that I've waiting for for a long time. There is not one bad beat on this record. The album starts off hard with \"Smoke it,\" the banging' street single \"Put 'Em In Their Place,\" and the Lloyd Banks featured \"Stole Somethin,\" and the solemn \"Speakin' so Freely.\" The album's \"G-Unit production\" begins with the joint Creep that features fifty Cent. This is a very experimental track that takes a little time to get used to, but it will grow on you. The next \"G-Unit\" songs are club records with \"Backstage Pass\" and the banging' Young Buck featured \"Give It to Me.\" After that it's pretty much street banners such as the Tony Yayo featured \"Click, Click,\" the controversial \"Pearly Gates,\" the introspective \"Daydreamin,\" the Alchemist-produced banger \"The Infamous, and \"In Love With the Moula.\" They finish Blood Money with Mary J. Blige providing a verse and the hook on \"It's Alright.\" Overall, Blood Money satisfies both old Mobb fans and G-Unit fans. They pretty much stick to the formula with fifty Cent adding this platinum touch to the record, and there is nothing wrong with that.","overall":5,"summary":"Blood Money is the best East Coast Album in a long time...","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":51927,"reviewerID":"A1MPRDXJLEMQ8O","asin":"B000EMGAGW","reviewerName":"Matthew Spryszak","helpful":[4,5],"reviewText":"there is not one bad beat on this album. the album's \"g-unit production\" begins with the joint Creep that features fifty cent. fifty cent adds this platinum touch to the record.","overall":5,"summary":"Blood Money is the best East Coast Album in a long time...","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":51927,"reviewerID":"A1MPRDXJLEMQ8O","asin":"B000EMGAGW","reviewerName":"Matthew Spryszak","helpful":[4,5],"reviewText":"After that it's pretty much street banners such as the Tony Yayo featured \"Click, Click,\" the controversial \"Pearly Gates,\" the introspective \"Daydreamin,\" the Alchemist-produced banger \"The Infamous, and \"In Love With the Moula.\" The album starts off hard with \"Smoke it,\" the banging' street single \"Put 'Em In Their Place,\" and the Lloyd Banks featured \"Stole Somethin,\" and the solemn \"Speakin' so Freely.\" The next \"G-Unit\" songs are club records with \"Backstage Pass\" and the banging' Young Buck featured \"Give It to Me.\" The album's \"G-Unit production\" begins with the joint Creep that features fifty Cent. They finish Blood Money with Mary J. Blige providing a verse and the hook on \"It's Alright.\" They pretty much stick to the formula with fifty Cent adding this platinum touch to the record, and there is nothing wrong with that. I'm a big East Coast ship-hop fan, and this the album that I've waiting for for a long time.","overall":5,"summary":"Blood Money is the best East Coast Album in a long time...","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":53633,"reviewerID":"A3A0PB6STFVP99","asin":"B000JVSZIY","reviewerName":"ChuckDeezul","helpful":[3,4],"reviewText":"Nas came back SKRONG (as Kanyeezee would say)! His last cd was banging' but now, gloves are off, verbal clips are full and the's blasting' away! What was Columbia thinking'? He blasted away at them too! A must get for lovers of wordsmith's! BROOKLYN STAND UP!","overall":5,"summary":"HOLD UP!","unixReviewTime":1166572800,"reviewTime":"12 20, 2006"}
{"orig_index":53633,"reviewerID":"A3A0PB6STFVP99","asin":"B000JVSZIY","reviewerName":"ChuckDeezul","helpful":[3,4],"reviewText":"Nas' last cd was banging' but now, gloves are off and verbal clips are full. the blasted away at them too!","overall":5,"summary":"HOLD UP!","unixReviewTime":1166572800,"reviewTime":"12 20, 2006"}
{"orig_index":53633,"reviewerID":"A3A0PB6STFVP99","asin":"B000JVSZIY","reviewerName":"ChuckDeezul","helpful":[3,4],"reviewText":"His last cd was banging' but now, gloves are off, verbal clips are full and the's blasting' away! Nas came back SKRONG (as Kanyeezee would say)! A must get for lovers of wordsmith's! He blasted away at them too! What was Columbia thinking'? BROOKLYN STAND UP!","overall":5,"summary":"HOLD UP!","unixReviewTime":1166572800,"reviewTime":"12 20, 2006"}
{"orig_index":54062,"reviewerID":"A24N1BAS3CU27H","asin":"B000N2G3RY","reviewerName":"Nse Ette","helpful":[1,2],"reviewText":"Uk songstress Amy Winehouse's brilliant two thousand and three debut `Frank' learned her lots of critical acclaim, and even won the Ivor Novello award (for songwriting), but largely flew under the radar commercially, with its retro soul\/jazz sound (that Christina Aguilera is using now), her raw and raspy vocal delivery (mature beyond her young years), and very frank lyrics. She returns on `Back to black', her sophomore disc, which is off to a blazing start in the UK; Top ten for the album, and lead off single, the horn sprinkled midtempo Motown-ish `Rehab', a song about a battle to get her into rehab, fictitious for autobiographical, we don't know. The horn sprinkled `You know I'm no good' has a jazzy\/tango sound set to skitter ship shop beats. Very catchy and one of my favourites. `Me and Mr Jones' is a downtempo retro soul\/jazz\/blues song that sounds like it was recorded in the one thousand, nine hundred and fifty. There's a slight reggae feel to `Just friends'. The title track `Back to black' is a beautiful midtempo Motown-ish song with excellent harmonies, and haunting\/creepy sound effects. `Love is a closing game' is a lovely ballad, and continuing the Motown influence, the beautiful `Tears dry on their own' has traces of `Aint no mountain high enough'. Awesome song and another of my favourites.`Wake up alone' is a tender ballad with soothing harmonies, the brief `Unholy war' is a mellow blues\/jazzy song, `He can hold her' is more upbeat with a ship shop beat and horns flitting in and out. Closing is the sunny, upbeat, Motown-ish `Addictions'. Retro sounding and beautiful. This is a stunning album, and definitely one of the very best released all year!!!","overall":5,"summary":"Simply stunning!!!","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":54062,"reviewerID":"A24N1BAS3CU27H","asin":"B000N2G3RY","reviewerName":"Nse Ette","helpful":[1,2],"reviewText":"Back to black' is winehouse's sophomore album. it is off to a blazing start in the auk. lead single is a horn sprinkled midtempo motown-ish Rehab'","overall":5,"summary":"Simply stunning!!!","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":54062,"reviewerID":"A24N1BAS3CU27H","asin":"B000N2G3RY","reviewerName":"Nse Ette","helpful":[1,2],"reviewText":"She returns on `Back to black', her sophomore disc, which is off to a blazing start in the UK; Top ten for the album, and lead off single, the horn sprinkled midtempo Motown-ish `Rehab', a song about a battle to get her into rehab, fictitious for autobiographical, we don't know. Uk songstress Amy Winehouse's brilliant two thousand and three debut `Frank' learned her lots of critical acclaim, and even won the Ivor Novello award (for songwriting), but largely flew under the radar commercially, with its retro soul\/jazz sound (that Christina Aguilera is using now), her raw and raspy vocal delivery (mature beyond her young years), and very frank lyrics. Awesome song and another of my favourites.`Wake up alone' is a tender ballad with soothing harmonies, the brief `Unholy war' is a mellow blues\/jazzy song, `He can hold her' is more upbeat with a ship shop beat and horns flitting in and out. `Love is a closing game' is a lovely ballad, and continuing the Motown influence, the beautiful `Tears dry on their own' has traces of `Aint no mountain high enough'. Closing is the sunny, upbeat, Motown-ish `Addictions'. The title track `Back to black' is a beautiful midtempo Motown-ish song with excellent harmonies, and haunting\/creepy sound effects. `Me and Mr Jones' is a downtempo retro soul\/jazz\/blues song that sounds like it was recorded in the one thousand, nine hundred and fifty.","overall":5,"summary":"Simply stunning!!!","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":54295,"reviewerID":"A1A3YJK9IW0OI5","asin":"B000NQR7UC","reviewerName":"Richard Hine \"Russell Wiley Is Out to Lunch\"","helpful":[0,0],"reviewText":"Teaming up with the people who brought you The Divine Comedy, Pulp and Air, Charlotte Gainsbourg delivers a shimmery collection of songs, whispered confessions and savage observations. The chime instrumentation surrounds and enhances Gainsbourg's breathy vocals, which are sung\/spoken in her delightfully \"Frenglish\" accent. Title track \"five:fifty-five\" captures that sleepless time when it's \"too late to send it now, too early to start again.\" Bouncy single \"The Songs That We Sing\" sounds cheerful, but it still makes little girls \"scream and run away.\" The \"Little Monsters\" who \"rule the world\" are scary enough (they get even bigger and scarier on Jarvis's own \"Fat Children\"). The theme of staying up all night returns in several places, most notably when love goes under the knife in \"The Operation.\" It's a delicate procedure, but Gainsbourg's \"prepared to work throughout the night.\" This is easy listening with a sharp edge.","overall":5,"summary":"The Divine Pulp Air Songs That We Sing","unixReviewTime":1241308800,"reviewTime":"05 3, 2009"}
{"orig_index":54295,"reviewerID":"A1A3YJK9IW0OI5","asin":"B000NQR7UC","reviewerName":"Richard Hine \"Russell Wiley Is Out to Lunch\"","helpful":[0,0],"reviewText":"Charlotte Gainsbourg teamed up with the people who brought you The Divine Comedy, Pulp and Air . Title track \"five:fifty-five\" captures that sleepless time when it's \"too late to send it now, too early to start again\"","overall":5,"summary":"The Divine Pulp Air Songs That We Sing","unixReviewTime":1241308800,"reviewTime":"05 3, 2009"}
{"orig_index":54295,"reviewerID":"A1A3YJK9IW0OI5","asin":"B000NQR7UC","reviewerName":"Richard Hine \"Russell Wiley Is Out to Lunch\"","helpful":[0,0],"reviewText":"The \"Little Monsters\" who \"rule the world\" are scary enough (they get even bigger and scarier on Jarvis's own \"Fat Children\"). Title track \"five:fifty-five\" captures that sleepless time when it's \"too late to send it now, too early to start again.\" Bouncy single \"The Songs That We Sing\" sounds cheerful, but it still makes little girls \"scream and run away.\" It's a delicate procedure, but Gainsbourg's \"prepared to work throughout the night.\" The chime instrumentation surrounds and enhances Gainsbourg's breathy vocals, which are sung\/spoken in her delightfully \"Frenglish\" accent. The theme of staying up all night returns in several places, most notably when love goes under the knife in \"The Operation.\" Teaming up with the people who brought you The Divine Comedy, Pulp and Air, Charlotte Gainsbourg delivers a shimmery collection of songs, whispered confessions and savage observations.","overall":5,"summary":"The Divine Pulp Air Songs That We Sing","unixReviewTime":1241308800,"reviewTime":"05 3, 2009"}
{"orig_index":54451,"reviewerID":"AK4UD9J5QCMRH","asin":"B000OLHGBQ","reviewerName":"Jeff Hodges","helpful":[12,13],"reviewText":"\"Math rock\" is usually associated with practical complexity. By this I mean that bands that are identified with the genre generally think about the way in which they can perform complex musical material in a live situation. Battles' \"supergroup\" pedigree includes death rock monsters such as Don Caballero and Helmet, and as a critical fan of so-called \"math rock,\" they have piqued my curiosity since their first EP. However, I never bought any of their albums. Then I saw the video for \"Atlas,\" and this curiosity became a fascination. I have long been a fan of King Crimson circa one thousand, nine hundred and eighty, and it seemed like Battles engages contemporary technology and virtuosity in the same way that Fripp and co. did on \"Discipline.\" I immediately bought \"Mirrored,\" and in the final weeks of two thousand and seven, it shot up my personal \"album of the year\" charts. What is really fascinating and ultimately satisfying about \"Mirrored\" is unravelling its tapestry of execution. I love to contemplate \"who\" is playing \"what.\" This form of listening is particularly stimulating when you have a band full of multinstrumentalists that sample, loop, tap, and generally thrash their way through their work. As usual, the most publicly accessible song on the album is not necessarily the most representative. I think that \"Atlas\" is great. The video reflects the energy and experimentalism of the band very well. However, there are songs on the album that show \"Atlas\" to be the \"single\" that it is. \"Tonto\" is a beautiful piece of work, as is \"Race: In\" and \"Tij.\" \"Race: Out\" is a fun \"whack-a-mole\" game of \"who is playing what\" and \"Bad Trails\" shows Battles' potential for more atmospheric work. The only work that I could offer any critique for is \"Rainbows.\" It is wonderfully epic, and covers a great amount of musical ground, but seems a little repetitive. The same seven-minute song could potentially be done in five. The slowdown: Battles creates highly active music that is satisfying on intellectual and accessible levels. To the passive listener, \"Mirrored\" may bring to mind the work of savant-garde DJ's, like DJ Shadow for BT. For the more invested listener, Battles' potential for mind-boggling virtuosity, a la King Crimson for Don Caballero, is similarly compelling. A quick YouTube search will confirm this - I dare you to check it out.","overall":5,"summary":"Is it live....or is it Battles?","unixReviewTime":1199404800,"reviewTime":"01 4, 2008"}
{"orig_index":54451,"reviewerID":"AK4UD9J5QCMRH","asin":"B000OLHGBQ","reviewerName":"Jeff Hodges","helpful":[12,13],"reviewText":"Battles' \"supergroup\" pedigree includes death rock monsters such as Don Caballero and Helmet . The most publicly accessible song on the album is not necessarily the most representative . The only work that I could offer any critique for is \"Rainbows\"","overall":5,"summary":"Is it live....or is it Battles?","unixReviewTime":1199404800,"reviewTime":"01 4, 2008"}
{"orig_index":54451,"reviewerID":"AK4UD9J5QCMRH","asin":"B000OLHGBQ","reviewerName":"Jeff Hodges","helpful":[12,13],"reviewText":"\"Race: Out\" is a fun \"whack-a-mole\" game of \"who is playing what\" and \"Bad Trails\" shows Battles' potential for more atmospheric work. \"Tonto\" is a beautiful piece of work, as is \"Race: In\" and \"Tij.\" Battles' \"supergroup\" pedigree includes death rock monsters such as Don Caballero and Helmet, and as a critical fan of so-called \"math rock,\" they have piqued my curiosity since their first EP. I immediately bought \"Mirrored,\" and in the final weeks of two thousand and seven, it shot up my personal \"album of the year\" charts. However, there are songs on the album that show \"Atlas\" to be the \"single\" that it is. I have long been a fan of King Crimson circa one thousand, nine hundred and eighty, and it seemed like Battles engages contemporary technology and virtuosity in the same way that Fripp and co. did on \"Discipline.\" To the passive listener, \"Mirrored\" may bring to mind the work of savant-garde DJ's, like DJ Shadow for BT.","overall":5,"summary":"Is it live....or is it Battles?","unixReviewTime":1199404800,"reviewTime":"01 4, 2008"}
{"orig_index":56088,"reviewerID":"A24ZFFRQ4MG3XL","asin":"B0016B6ZKG","reviewerName":"Little Miss Cutey","helpful":[3,3],"reviewText":"Wow, am I impressed. It's been about a seventeen year wait for this, but it's over and she's only gotten better with time and has't lost a thing. She sounds amazing and this cd is awesome. There is only one song I don't like on there, and it's the title track, Crayons. Everything else to me is pure gold and while of course I definitely love the first release, Stamp Your Feet, I also truly enjoy I'm A Fire (seven.ten minutes long) and the slower song Sand On My Feet. This is one of the best albums I've heard in a long time and one of her absolute best as well. She co-wrote these songs along with a host of other song writers and she proves that she has't lost her touch at all. I hope she'll tour Australia sometime soon because I'll be one of the first in line. I highly recommend this fantastic cd. It will have you dancing and singing along and it has a little bit of everything there. I hope that she will continue releasing new material like this soon. No more waiting around like the last time. This is a must purchase cd - you'll love it.","overall":5,"summary":"The Queen IS back and better than ever :->","unixReviewTime":1217808000,"reviewTime":"08 4, 2008"}
{"orig_index":56088,"reviewerID":"A24ZFFRQ4MG3XL","asin":"B0016B6ZKG","reviewerName":"Little Miss Cutey","helpful":[3,3],"reviewText":"it's been about a seventeen year wait for this, but it's over. this is one of the best albums i've heard in a long time. she co-wrote these songs along with a host of other song writers.","overall":5,"summary":"The Queen IS back and better than ever :->","unixReviewTime":1217808000,"reviewTime":"08 4, 2008"}
{"orig_index":56088,"reviewerID":"A24ZFFRQ4MG3XL","asin":"B0016B6ZKG","reviewerName":"Little Miss Cutey","helpful":[3,3],"reviewText":"Everything else to me is pure gold and while of course I definitely love the first release, Stamp Your Feet, I also truly enjoy I'm A Fire (seven.ten minutes long) and the slower song Sand On My Feet. It's been about a seventeen year wait for this, but it's over and she's only gotten better with time and has't lost a thing. There is only one song I don't like on there, and it's the title track, Crayons. This is one of the best albums I've heard in a long time and one of her absolute best as well. I hope she'll tour Australia sometime soon because I'll be one of the first in line. She co-wrote these songs along with a host of other song writers and she proves that she has't lost her touch at all. I hope that she will continue releasing new material like this soon.","overall":5,"summary":"The Queen IS back and better than ever :->","unixReviewTime":1217808000,"reviewTime":"08 4, 2008"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"Wow, what an album, its absolutely brilliant! I'm more into Rock and Electronic music but being a musician kind of spreads my musical tasteall over the place. Anyway this album is really something. for example Wildflower, not the flagship song in the album but such a completesong it's perfect on its simplicity G - Bm - D - Em, there you go, the chords for the chorus. I'm really enjoying this from start to send get this album its very solid and should be flourished with grammy!","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"for example Wildflower, not the flagship song in the album but such a completesong it's perfect on its simplicity G - Bm - D - Em, there you go, the chords for the chorus. Wow, what an album, its absolutely brilliant! I'm really enjoying this from start to send get this album its very solid and should be flourished with grammy! I'm more into Rock and Electronic music but being a musician kind of spreads my musical tasteall over the place. Anyway this album is really something.","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"This album is really something. I'm really enjoying this from start to send get this album its very solid and should be flourished with grammy!","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}
{"orig_index":59693,"reviewerID":"A1GSS6W2LG26MO","asin":"B0041WLBEC","reviewerName":"Martin Endara Crespo \"yourdudeness\"","helpful":[0,0],"reviewText":"I'm more into Rock and Electronic music but being a musician spreads my musical tasteall over the place. this album is really something and should be flourished with grammy!","overall":5,"summary":"Gorgeous album!","unixReviewTime":1304640000,"reviewTime":"05 6, 2011"}