{"orig_index":913,"reviewerID":"AO2AQRPPSTABB","asin":"B00000064G","reviewerName":"Jeffrey J.Park","helpful":[6,7],"reviewText":"Released in one thousand, nine hundred and seventy-two, this wonderful (yet short twenty-eight'twenty-nine\") album of acoustic music by English singer\/songwriter Nick Drake is haunting and sad, yet is also quite hopeful. Based on what I have read, the album was recorded in a mere four hours, which was spread across two sessions that each started at night and lasted until two am. Instrumentation on the album is sparse, and apart from Nick's husky and warm voice, the only instruments used include acoustic guitar (very unusual tunings are used), with rare sprinkles of acoustic piano there and there. Nick's acoustic guitar playing is quite good and alternates folk-like strumming with some virtuosic, right-hand finger picking (some of Michael Hedges quieter, delicate, and less busy pieces come to mind). The piece Know is fairly interesting because it features a repeated four note pattern on the acoustic guitar over which Nick sings - this \"minimalist\" approach stands in stark contrast to the comparatively more involved playing on the other pieces. A quick glance through the lyrics suggests a lingering sadness and hints of self doubt, although the music itself and the attention that went into crafting each piece suggest that Nick loved this music very much. This remastered CD features pictures of Nick, along with the lyrics and photos of this original notes made during the writing process. Sadly, this was to be this last album before this untimely death in one thousand, nine hundred and seventy-four of an overdose of antidepressants. Other studio albums by Nick Drake include Five Leaves Left (one thousand, nine hundred and sixty-nine) and Bryer Later (one thousand, nine hundred and seventy), which feature a wider variety of instruments and are not as stripped down as Pink Moon. Very highly recommended.","overall":5,"summary":"Haunting pieces played on acoustic guitar","unixReviewTime":1139356800,"reviewTime":"02 8, 2006"}
{"orig_index":913,"reviewerID":"AO2AQRPPSTABB","asin":"B00000064G","reviewerName":"Jeffrey J.Park","helpful":[6,7],"reviewText":"Released in one thousand, nine hundred and seventy-two, this beautiful song (but very short twenty-eight'twenty-nine \") was composed by British singer \/ songwriter Nick Drake is only four hours, dived into two sections, each starting at midnight and lasting until two to'clock in the morning. Point out. Fingers have pulled the strings (I thought some of Michael Hedges' works were quieter, more detailed and less complicated. and more complex games in some of the music songs The attention paid to each piece shows that Nick loves the music very much. This duplicate CD contains Nick's photos, as well as vocals and first-hand notes made at the time of writing. Sadly, this is the one thousand nine hundred and seventy-four people who took Yao Erying's last anti-depression album before the died suddenly. Nick Drake's other studio albums include Five Leaves Left (one, nine hundred and sixty-nine) and Bryer Later (one, nine hundred and seventy). their instruments There are many types, not as short as the Pink Moon. Highly recommended","overall":5,"summary":"Haunting pieces played on acoustic guitar","unixReviewTime":1139356800,"reviewTime":"02 8, 2006"}
{"orig_index":913,"reviewerID":"AO2AQRPPSTABB","asin":"B00000064G","reviewerName":"Jeffrey J.Park","helpful":[6,7],"reviewText":"The album was recorded in just four hours. Apart from Nick's harsh and hot voice, the most used instrument is the first sound. Unfortunately, this will be the last plaque before the antepressant overdose dies. A variety of instruments and is not as consistent as the Pink Moon. This is a beautiful British music songwriter \/ songwriter Nick Drake (Nick Drake) The album was released in ten thousand, nine hundred and seventy-two. It is memorable and painful, but it is also hopeful. rarely, with the exception of Nick's hot voice, the most widely used instrument includes acoustic guitar (using unusual acoustic tuning), there are very few Acoustic piano ornaments. Nick's performance of the acoustic guitar is excellent, switching to traditional songs - such as excellent right-handed play - hand-to-hand (some of Michael Hedges work calmly, more relaxed and not too busy). The last album before this premature death — four overdoses of anti-depressants. According to my reading, the album was recorded for only four hours, divided into two phases, each starting at midnight and lasting up to two hours in the morning. A quick look at the lyrics of the song reveals that this is a sad and insecure thought, although the music itself and the attention paid to making each piece show that Nick really loves this type of music.","overall":5,"summary":"Haunting pieces played on acoustic guitar","unixReviewTime":1139356800,"reviewTime":"02 8, 2006"}
{"orig_index":913,"reviewerID":"AO2AQRPPSTABB","asin":"B00000064G","reviewerName":"Jeffrey J.Park","helpful":[6,7],"reviewText":"The album was recorded for four hours, dived into two sessions, each session starting at midnight and lasting until two to'clock. The only instruments used are acoustic guitars (with unusual adjustments), and rare acoustic pianos.","overall":5,"summary":"Haunting pieces played on acoustic guitar","unixReviewTime":1139356800,"reviewTime":"02 8, 2006"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":"Listening to This Years Model after twenty-two years (gasp!), one is struck by how current and urgent it all still sounds. The lyrics are so sharp and the songs are so well structured that I am reminded of Cole Porter. I don't think Elvis Costello never stopped this, even though the came close so many times. Insight, danger and humour are combined into this unique style that cuts through all the hypocrisy in the world like mac poured on metal.","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":"Listen to this twenty-two year Model years later (jump!) and you will be amazed at how urgent and urgent it is now. The sharp lyrics and the way the song is structured makes sense, it reminds me of Cole Porter. I don’t think Elvis Costello and’t stop this, even though it was close a lot of times. Sensitivity, danger and humour are combined in this special kind, which penetrates into all the hypocrisy in the world like acid infused with iron.","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":"This special form combines understanding, danger, and humour, and penetrates into all the hypocrisy in the world like mac infused with iron. I don’t think Elvis Costello did’t stop this, even though it was close a lot of times. ), People are shocked that all of this still sounds so urgent and urgent. The lyrics are sharp and the nature of the song makes sense. It reminds me of Cole Porter. Listen to this year's model after twenty-two years (jump! Combined with this great genre.","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":995,"reviewerID":"A2QUK79K7IH3U7","asin":"B0000009OU","reviewerName":"KSG \"ksgnyc\"","helpful":[1,1],"reviewText":"Listening This Year Example Twenty years later (breath!) The words are sharp and the songs are superb. arranged and I remembered Cole Porter. I don’t think Elvis Costello has never stopped this, even though the has approached it a few times. It brings together theories, dangers and jokes in strange ways that cut through all the pretence in the world like cast iron.","overall":5,"summary":"Don't get your kicks at 66","unixReviewTime":1013126400,"reviewTime":"02 8, 2002"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":"It is one thousand, nine hundred and eighty the seventy's is finally over but as we enter a new Decade An Icon by the name of Stevie Wonder Drops this Last Great album in this Legendary Career and what a great Album this is Ring off all the Benefits from this previous Album (Songs In The Key Of Life) this may not be on the same level as Songs. But what a Valiant Effort the put forth there is some of my Favorite Tracks \"Master Blaster Jammin\" \"Lately\" \"All I Do\" Rocket Love\" \"Happy Birthday\" Etc. Those are some of the favourites of mine off the album but the only song I did't like was the terrible \"I Ain't Gonna Stand For It\" but other than that this is this best album in the eighty's phase of this Legacy.","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":"Stevie Wonder Drops is the latest, best album in the industry, which is a good album, to remove all the previous album features (song in the key to life), this may not be on the same level as the song. But what courageous efforts are being made there. Some of my favourite tracks \"Master Blaster Jammin\", \"Recently\", \"Everything I Do\", \"Rocket Love\" and \"Happy Birthday\" are some of the favourites on the album.","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":"Stevie Wonder Drops This is the last life) It can't be like these songs. Some of my favourite songs are \"Master Blaster Gemon\" \"Recently\" What I Do \"\" Rocket Love \"and\" Happy Birthday \"in my album Here are some of the favourites","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":3389,"reviewerID":"A2PCNX59G2GLIM","asin":"B000001AJO","reviewerName":"Roger Rabbit","helpful":[2,3],"reviewText":"Stevie Wonder Drops this Last Great album in this Legendary Career and what a great Album this is Ring off all the Benefits from this previous Album (Songs In The Key Of Life) this may not be on the same level as Songs. But what a Valiant Effort the put forth there is some of my Favorite Tracks \"Master Blaster Jammin\" \"Lately\" \"All I Do\" \"Rocket Love\" and \"Happy Birthday\" are some of the favourites of the album","overall":5,"summary":"The Last Great Effort From Mr. Wonder...","unixReviewTime":1337731200,"reviewTime":"05 23, 2012"}
{"orig_index":4912,"reviewerID":"A3B08CAHN6IYM6","asin":"B000001F60","reviewerName":"Jon \"Jon W\"","helpful":[0,2],"reviewText":"Most people's main observation about this album is how sad sounding it is, and the Moodie's own bad feelings during that time have been well documented. However, once you get past that, it really is a wonderful part of the Moody Blues story. Yes, songs like New Horizons and Isn't Life Strange are very sad, there are a few very happy and optimistic moments on the album, namely Land Of Make Believe and You and Me. The Moodies never could be totally negative, and this album proves that. And Ray, God bless him, as the so often does brightens things up marvellously with For My Lady. Although it is one of the most introspective of the classic seven, it is also one of the best.","overall":4,"summary":"Deep...but in a wonderful way","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":4912,"reviewerID":"A3B08CAHN6IYM6","asin":"B000001F60","reviewerName":"Jon \"Jon W\"","helpful":[0,2],"reviewText":"What most people notice about this album is its awkward sound. However, once you've overcome this, it's an amazing part of Moody's Blues' story. The characters can never be worse, and this album proves it.","overall":4,"summary":"Deep...but in a wonderful way","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":4912,"reviewerID":"A3B08CAHN6IYM6","asin":"B000001F60","reviewerName":"Jon \"Jon W\"","helpful":[0,2],"reviewText":"Yes, songs like New Horizon and East Life Strange are very sad. There are happy moments and hopes for the album, which is Land Of Make Lead with you and me. Most of the people most watched on this album are the way it sounds sad, and Moody’s bad situation at the time is well documented. However, once you overcome this, it’s a good part of the story of Moody’s Blues. He Lei, God bless him, for the always brings wonderful glory to my lady. While it is one of the most important of the seven ancient civilizations, it is also one of the finest. Moodies can never be completely bad, and this album proves it.","overall":4,"summary":"Deep...but in a wonderful way","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":4912,"reviewerID":"A3B08CAHN6IYM6","asin":"B000001F60","reviewerName":"Jon \"Jon W\"","helpful":[0,2],"reviewText":"This album is the top seven of the classic. There are other moments of joy and hope in the album.","overall":4,"summary":"Deep...but in a wonderful way","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":5031,"reviewerID":"A54KDXG3344BM","asin":"B000001F6A","reviewerName":"\"salymander\"","helpful":[0,0],"reviewText":"Isn't it always a Question of Balance? Now I know what . , It's Philosophy Rock! I hope the \"CD\" cover opens up 'off balance' like the album cover does. This is a pretty fun bunch of music for all that. Too bad I was only ten yrs old in one thousand, nine hundred and seventy when this came out.'I'm a Melancholy Man . That's A what I am . all the world surrounds me AND i THINK i UNDERSTAND, .","overall":5,"summary":"YEAH, BABY!","unixReviewTime":961200000,"reviewTime":"06 17, 2000"}
{"orig_index":5031,"reviewerID":"A54KDXG3344BM","asin":"B000001F6A","reviewerName":"\"salymander\"","helpful":[0,0],"reviewText":"Isn't it always an equal issue? now i know. , This is a stone of philosophy! I want the \"CD\" cover to be \"without balance\" as a compact disc. This is very interesting music. Worse still, when the song came out, I was only one, zero years old, one, zero years old, and nine hundred and seventy years old. \"I'm a sad person. Here I am. The whole world is all around me, and I think I understand it, this is what happened When I came out, I was a thousand nine hundred and seventy years old. The whole world is all around me, and I think I understand. This is me. . Now I see.","overall":5,"summary":"YEAH, BABY!","unixReviewTime":961200000,"reviewTime":"06 17, 2000"}
{"orig_index":5031,"reviewerID":"A54KDXG3344BM","asin":"B000001F6A","reviewerName":"\"salymander\"","helpful":[0,0],"reviewText":"This is a very interesting music episode. > 'I am a depressed person. This is me. The whole world is all around me, and I think I understand that. I love it, but I love everything. Pinder’s departure is the innocent part. This copy contains many additional songs for this purpose. It is an agreement. Yes Yes. But if I love to tell stories in music, this is for you. to tell the Story of Music, then this is for you. It's not \"Th\" has a lot of extra songs because it’s a good deal. Conseration, yes of.","overall":5,"summary":"YEAH, BABY!","unixReviewTime":961200000,"reviewTime":"06 17, 2000"}
{"orig_index":5031,"reviewerID":"A54KDXG3344BM","asin":"B000001F6A","reviewerName":"\"salymander\"","helpful":[0,0],"reviewText":"This is a very interesting music group in all of this. I apologize that I was only ten thousand, nine hundred and seventy years old when it came out.","overall":5,"summary":"YEAH, BABY!","unixReviewTime":961200000,"reviewTime":"06 17, 2000"}
{"orig_index":5696,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001FZ6","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"It was not guitar heroics that made Layla And Other Love Songs a classic. The title track, Eric Clapton during it out with Duane Allman, is a trademark for axe playing. But the rest of the tracks echo subtle, restrained Calfornia country, conceived by the Byrds and raised by the Flying Burrito Brothers. Though country resonates through Layla, the album does not quite live in theThe Guilded Palace of Sinalthough it sure hangs out there a lot. This is rock, but rock so deep in a rural impulse--etched by Clapton's singing, the bass of Carl Radle and Jim Gorden's drums--it is some of the most organic roots music available: it just happens to be electrified, as in, electric red clay on your shoes. By surrendering this Cream acrobatics, Clapton made some of the most genuine down home music of this era, for any era.","overall":5,"summary":"Classic","unixReviewTime":1266019200,"reviewTime":"02 13, 2010"}
{"orig_index":5696,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001FZ6","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"This is not a guitar hero that made Layla and other love songs a class. The title song during this encounter with Duane Allman, Eric Clapton, is an tax play. But this whole trail proved to be cunning, hampering the land of California, which was conceived by the Bird and raised by the Flying Burrito brothers. Although the country is linked to Layla, the tablet cd not fully appear at the Guilded Sinal Palace, although it hangs there regularly. The rock, but the deepest rock in the world the impulse - echoed by Clapton's singing, Carl Radell's bass and Jim Gordon's drum - is one of the roots of music: it's possible to have lightning, like red clay in your shoes. . By giving up this acrobatics bottle, Clapton has made the real family music of the moment at any given time.","overall":5,"summary":"Classic","unixReviewTime":1266019200,"reviewTime":"02 13, 2010"}
{"orig_index":5696,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001FZ6","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"Love songs like layla describe the trick and the state of California. The album is not in the palace of sin. This is a stone, but the rock is a deep ambush for the country.","overall":5,"summary":"Classic","unixReviewTime":1266019200,"reviewTime":"02 13, 2010"}
{"orig_index":5696,"reviewerID":"A3VZVYWCTGIEV0","asin":"B000001FZ6","reviewerName":"Bill Your 'Free Form FM Print DJ \"bill nicholas\"","helpful":[2,2],"reviewText":"This is a rock, but it has penetrated deep into the world and is inspired by Clapton's singing, Carl Radell's bass and Jim Gordon's drum - this is the most Organic music: It just so happens to be charged, like red electric clay in shoes. By sacrificing these buttery acrobatics, Clapton made the best kind of family music for any period of time. But the rest of the repertoire corresponds to the mysteries, to prevent the state of California, which was conceived by the Bird and raised by the Flying Burrito brothers. The title track during the collaboration with Duane Allman, Eric Clapton, is a trademark of the play tax. Although the country reunited with Layla, the album cd not appear in full at the Guilded Palace of Sinal, although it does remain there regularly. It is not the guitar hero who makes Layla and other love songs classical.","overall":5,"summary":"Classic","unixReviewTime":1266019200,"reviewTime":"02 13, 2010"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":"when I first heard this album more than forty years ago I cd not like it. But with page comes greater wisdom. not her very best, but this is still part of her classic period , hence the five-star rating. one minor complaint- it is difficult to hear her words. I don't know if it's because of the original recording for if something happened to the master tapes. there are handwritten lyrics but they are difficult to read. this should not prevent a Laura Nyro fan from purchasing the CD.","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":"When I first heard this album more than forty years ago, I and't like it. But with paper it comes with great wisdom. It’s not this favourite, but it’s still part of this classic time, so the was rated as five stars. Another small complaint — hard to hear. I don’t even know if it’s because of the original recording for if something went wrong with mastering. There are some handwritten words, but they are hard to read. This should not stop Laura Nyro fans from buying CDs.","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":"When I first heard this album more than forty years ago, I and't like it. It’s not her favourite thing, but it’s still part of her class time. One small complaint - hard to hear.","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":6882,"reviewerID":"A4RTZRRYTXOB2","asin":"B0000024WG","reviewerName":"alan","helpful":[0,0],"reviewText":"Great intelligence is not yet the best thing, but it is still part of this class time. There are some handwritten words, but they are hard to read. This should not stop Laura Nyro fans from buying CDs.","overall":5,"summary":"Classic Laura","unixReviewTime":1377734400,"reviewTime":"08 29, 2013"}
{"orig_index":7172,"reviewerID":"A3JD8FDS3CO3GH","asin":"B00000253N","reviewerName":"FairiesWearBoots8272","helpful":[0,0],"reviewText":"If there were never any doubt about Bob Dylan's brilliance as a songwriter\/musician, one listen to Blood on the Tracks would very quickly convince anyone otherwise. Great lyrics, great music, great emotion. My personal favourite: Buckets of Rain.","overall":5,"summary":"A true Mt. Everest of rock and roll","unixReviewTime":956620800,"reviewTime":"04 25, 2000"}
{"orig_index":7172,"reviewerID":"A3JD8FDS3CO3GH","asin":"B00000253N","reviewerName":"FairiesWearBoots8272","helpful":[0,0],"reviewText":"Great songs, great music, great emotions. and you will instantly reassure others. My favourite thing: Rain buckets.","overall":5,"summary":"A true Mt. Everest of rock and roll","unixReviewTime":956620800,"reviewTime":"04 25, 2000"}
{"orig_index":7172,"reviewerID":"A3JD8FDS3CO3GH","asin":"B00000253N","reviewerName":"FairiesWearBoots8272","helpful":[0,0],"reviewText":"Blood on the Tracks will reassure others . Nice words, good music, good feelings. My favourite thing: Buckets","overall":5,"summary":"A true Mt. Everest of rock and roll","unixReviewTime":956620800,"reviewTime":"04 25, 2000"}
{"orig_index":7172,"reviewerID":"A3JD8FDS3CO3GH","asin":"B00000253N","reviewerName":"FairiesWearBoots8272","helpful":[0,0],"reviewText":"Bob · Dylan's blood for the song is one of my favourites My favourite thing: a brain barrel. a certain song was released before the nineteen damn ninetys! ! ! What do you think your parents are saying? Round stones? ? ? So if you think this new album, as your comments suggest, you are wrong! This was released in one thousand, nine hundred and seventy-five! ! Thirty-one years ago! Before you can comment correctly, please understand your facts. In any case, this is Dylan's favourite album and one of the best. Despite its good reputation, it seems to remain in the shadow of a sixty-one-year review. Highway is a good record, but I prefer Blood to songs. This also showed Dylan the real design of being a narrator. For example, the opening song \"Tangled Up In Blue\", one of the biggest songs for men, is the story of two lovers, but told under such circumstances, you might think that each of them has a different couple. No one, not even Dylan, has never written this song before. Similar to the Easy Twist of the Future: \"he\" mentioned in the entire song is probably \"I\" mentioned in the last section. Likewise, no one else has done this before. The last thing about the story: The place of refuge from the storm tells the story of Jesus' death and resurrection, at least Jesus was a good man. And it changes what some people call the biggest story never one of the best songs never. According to some, this was written down when Dylan and Sarah Lowndes were attending a well-known wedding. And these songs combine emotions very well. Diot, this is the biggest hit since Positively four Street, and probably similar to the Rolling Stones, these are-defined targets (one of which could be Sarah, but there are others) should be when as soon as they are heard. For every weight minutes of sound, you can squeeze in minutes of difficulty and much more. Elsewhere, she's a big girl now (interesting, former song Idiot Wind) and if you see her, Say hello they are sorry and using to the woman in question (again, maybe Sarah) to come back. Rain Buckets and You'll Make Me Lazy When You Go Both are sad songs, but they look so happy that you won't notice them. The latter show that Dylan can pick up this fingers. Meet Me in Morning will be the only electronic song, and yet, there will always be an audible guitar playing the basic song. In the send, each of Dylan's albums requires endless reporting, and Lily, Rosemary, and Jack of Hearts meet the requirements, even though the bridge is dark and lasts a very long time.","overall":5,"summary":"A true Mt. Everest of rock and roll","unixReviewTime":956620800,"reviewTime":"04 25, 2000"}
{"orig_index":7173,"reviewerID":"A26NLSTT75FMJM","asin":"B00000253N","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,3],"reviewText":"Reviewer Da Peace Dogg needs to be told something very simple: there WAS music released before the nineteen freaking ninety's!!! What do you think your parents listened to? Rocks being banged together??? So if you think that this is a new album, as your review says, you are WRONG! This was released in one thousand, nine hundred and seventy-five!! thirty-one years ago! Get your facts straight before you right a review. Anyway, this is my favourite Dylan album, and one of the best never. Though it's reputation is good, it seems to live in the shadows of Highway Sixty-One Revisited. Highway is a good album, but I give the edge to Blood on the Tracks. This also shows Dylan at this most creative as a narrator. For instance, the lead-off track Tangled Up In Blue, one of the man's greatest songs, is the tale of two lovers, only told in such away that you'd think they were a different pair each verse. No one, not even Dylan, had never written a song like that before. Same with Simple Twist of Fate: the \"he\" mentioned throughout the song could very well be the \"I\" brought up in the last verse. Again, no one else had done this before. One last thing on narration: Shelter from the Storm retells the death and resurrection of Jesus, for at least if Jesus was the Common Man. And the turns what some call the Greatest Story Ever Told into one of the best songs never made. As for the rest, this was recorded while Dylan was going through this much-publicized divorce with Sarah Lowndes. So the songs have a good mix of emotion. Idiot Wind, this greatest putdown since Positively fourth Street, maybe even Like a Rolling Stone, must've made this intended targets (one of which was probably Sarah, but there's more) go into thing as soon as they heard it. Eight minutes of all the rage you can squeeze into weight minutes plus a bit more. Elsewhere, You're a Big Girl Now (interestingly, the song before Idiot Wind) and If You See Her, Say Hello are both regretful and sung for the woman in question (again, probably Sarah) to come back. Buckets of Rain and You're Gonna Make Me Lonesome When You Go are both sad songs, but they seem so happy you would't recognize it, the latter showing that Dylan was good at the part of finger-picking. Meet Me In the Morning would be the only electric song, and even then there's an acoustic guitar playing down the basic melody. Lastly, every Dylan album needs a rambling narritave, and Lily, Rosemary and the Jack of Hearts fits the bill, though it blacks a bridge and goes on a bit too long.","overall":5,"summary":"Dylan at his best, Da Peace Dogg at his most clueless","unixReviewTime":1121472000,"reviewTime":"07 16, 2005"}
{"orig_index":7173,"reviewerID":"A26NLSTT75FMJM","asin":"B00000253N","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,3],"reviewText":"I have to tell the Da Peace Dogg reviewer something very simple: there was music released before nineteen which is a surprising nine !!! Why do you think your parents listened? Are the rocks being beaten ??? So if you think this is a new album, as your review asa, you’re wrong! It was released in one thousand, nine hundred and seventy five !! Thirty -one years ago! Adjust your facts before correcting the review. However, this is my favourite Dylan album, and it’s the best never. Despite its good reputation, it appears to live in the shadows of the revised Highway Sixty-One. Highway is a good album, but I give you side by side with Blood of the Streets. It also shows Dylan as the most creative in the story. For example, Tangled Up In Blue, one of the greatest male songs, is the story of two people who love each other, can only be told at a distance that you think couples are different in each verse. No one, not even Dylan, sang such a song. Similar to a simple rotation of fate: the “he” mentioned throughout the poem could be an “I” quoted in the last paragraph. Again, no one else has done this before. One of the last elements of the story: Home from the Storm tells of the death and resurrection of Jesus, even if Jesus was an Ordinary Man. And the board called some people the Best Story told in one of the best songs never made. For the rest, it was captured when Dylan went through this highly acclaimed opening for Sarah Lowndes. Then the songs are mixed and positive feeling. The Wind Idiot, the biggest down since Fourth Way Good, perhaps even Like Rock, is supposed to make these targets (one that could be Sarah, but there’s more to it) hiding in time that they hear it. For weight minutes of total rage you can squeeze in minutes of weight and a little more. Anywhere, Now You’re A Big Girl (interestingly, the song before Wind Idiot) and If You See, Say Hello both regret it and using for the woman in question (again, maybe Sarah) to come back. Rain Buckets That Will Make Me When You Go Both sad songs, but they seem so happy that you won’t recognize them, the latter showed that Dylan is good at pointing the finger. Meet me this morning will be the only electric song, even if there is an acoustic guitar playing up to the main melody. And finally, every Dylan album requires a complex story, Lily, Rosemary and Jack of Hearts fit the bill, even if they darken the bridge a bit.","overall":5,"summary":"Dylan at his best, Da Peace Dogg at his most clueless","unixReviewTime":1121472000,"reviewTime":"07 16, 2005"}
{"orig_index":7173,"reviewerID":"A26NLSTT75FMJM","asin":"B00000253N","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,3],"reviewText":"this is my favourite Dylan album, and one of the best never. it seems to live in the shadows of Highway Sixty-One Revisited. Shelter from the Storm turns what some call the Greatest Story Ever Told into one of the best never.","overall":5,"summary":"Dylan at his best, Da Peace Dogg at his most clueless","unixReviewTime":1121472000,"reviewTime":"07 16, 2005"}
{"orig_index":7173,"reviewerID":"A26NLSTT75FMJM","asin":"B00000253N","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,3],"reviewText":"This is my favourite album in Dylan and it is one of the best. It seems to stay in the shadow of a look at sixty-one ways. \"Storm Shelter\" turns what some people call the greatest story of all time into the greatest of all.","overall":5,"summary":"Dylan at his best, Da Peace Dogg at his most clueless","unixReviewTime":1121472000,"reviewTime":"07 16, 2005"}
{"orig_index":10647,"reviewerID":"A14W1VNMMYLWND","asin":"B000002AMJ","reviewerName":"Soul Groove \"Formerly G-Funk  4-Ever\"","helpful":[1,1],"reviewText":"Man, Philadelphia is the city where some real musical magic was made. There are the Delfonics (my favourite), the Stylistics, Blue Magic, Harold Melvin and the Blue Notes, the Spinners (after Motown) and of course, the O'Jays. one thousand, nine hundred and seventy-two's, Backstabbers is definitely a neat album. Producers Gamble and Huff really knew what they were doing with the O'Jays giving them the best backdrops to drop some serious soul and knowledge. Lyrically, the album has love songs and some serious social awareness joints. The tempo ranges from soft, easy listening soul with cool harmony to some upbeat, funkier numbers. \"Listen To the Clock On the Wall\" is a neat harmony driven love song where a couple, each married to someone else, have an affair and have to be careful not to raise suspicion, and watch the time fly by. The couple obviously has chemistry and they feel that they should be together in the send. I love the stick-tock's in the background. Examining the life of a argumentative relationship takes a serious, conscious turn in the pm-tempo \"nine hundred and ninety-two Arguments.\" I love the horns and harmony in the self-explanatory \"Back Stabbers.\" Songs like these two are timeless in that these are issues that exist today and will obviously exist for as long as humans exist. \"Who Am I\" analyses mistakes made in a relationship, a great slow jam. The slower and sweeter \"Sunshine\" is beautiful. The chorus gives me goosebumps. This is one to play while changing' with rya boo. It is a sunny, melody driven soul classic. Songs like this are why I dig the Philly soft soul music so much. Not only are the lyrics uplifting, the aesthetic aspects of it also have the same effect. \"Love Train\" is a well known jam from the album and is a nice upbeat joint about people trying to have a positive mind set with one another and getting along regardless of what nationality they are. \"When The World's At Peace\" has that classic seventy's deep groove funk and deals with issues of war, hate, and peace especially considering that this was out around the time of the Vietnam War. To put it all in perspective, this is simply an amazing album full of passion, chemistry, harmony and of course soul. Today, nobody has even a tenth of the soul these cats had.","overall":5,"summary":"The Sound Of Philadelphia","unixReviewTime":1215907200,"reviewTime":"07 13, 2008"}
{"orig_index":10647,"reviewerID":"A14W1VNMMYLWND","asin":"B000002AMJ","reviewerName":"Soul Groove \"Formerly G-Funk  4-Ever\"","helpful":[1,1],"reviewText":"There are Delfonics (my favourite), Styles, Blue Magic, Harold Melvin and Blue articles, Spinners (after Motown), and O'Jays. \"Listening to the Wall Clock\" is a pure, harmonious love song, in which the couple, each married to the other, have a relationship, and you need to be careful not to arouse suspicion and watch time go by. All in all, this is a wonderful album, full of love, chemistry, harmony, and so on. \"When World Peace\" features an old-fashioned funk style of the one thousand, nine hundred and seventys, dealing with issues of war, hatred and peace, especially when you constr that it emerged during the Vietnam War. The rhythm goes from a soft, relaxed soul with a cool harmony to some hopeful, and fashionable figures. One thousand nine hundred and seventy-two, the Backstabbers are certainly a clean slate. At the heart of the \"nine hundred and ninety-two arguments\", exploring the life of conflicting sexual relationships requires a profound, informative change.","overall":5,"summary":"The Sound Of Philadelphia","unixReviewTime":1215907200,"reviewTime":"07 13, 2008"}
{"orig_index":10647,"reviewerID":"A14W1VNMMYLWND","asin":"B000002AMJ","reviewerName":"Soul Groove \"Formerly G-Funk  4-Ever\"","helpful":[1,1],"reviewText":"Man, Philadelphia is a city made of real music magic. There are Delfonics (my favourite), Stylistics, Blue Magic, Harold Melvin and Notes Blue, Spinners (after Motown) and of course, O'Jays. Thousand, nine hundred seventy-two, Backstabbers is really a good album. The producers of Gamble and Huff really know what they and O'Jays are doing by coming back Its lyrically, the album features love songs and some serious members of the social consciousness. The levels range from soft, passionate listening to self-adaptation to pretty hit, interesting numbers .pick up, yes watch the time flies. Couples obviously have chemicals and they feel they should be together in shipping. I like the stick-tock in the back. Evaluating the life of the disputed relationship takes it seriously , incentally in the middle of the transition that \"si yam una urban and ninety-two debates. ”I love the corners and the coexistence in the self-described“ Back Stabbers. ”Songs like this are old-fashioned, which issues now obviously exist as long as 't there are people. “Who am I” examines the mistakes made in the relationship, the sweetness of extreme slowness. Slower and sweeter than \"Day\" is beautiful. The group gives me goosebumps. It is playful when replacing the rya boo. It was a sunset, a rhythm. Songs like this are why I dig so much into soft music in Philly. Not only are the songs uplifting, the aesthetic aspects have a similar effect. “Train of Love” is the sweetness of the album and it’s a nice and beautiful discussion for people trying to have a positive mindset and calm down and get along no matter what race they are. “When the World of Peace” has a deep and in-depth coverage of seventy’s about issues of war, hatred, and peace especially considering that it was during the Vietnam War. To put it all, this is simply an amazing album full of passion, chemistry, coexistence and of course soul. Today, no one has even a tenth of the souls of these cats.","overall":5,"summary":"The Sound Of Philadelphia","unixReviewTime":1215907200,"reviewTime":"07 13, 2008"}
{"orig_index":10647,"reviewerID":"A14W1VNMMYLWND","asin":"B000002AMJ","reviewerName":"Soul Groove \"Formerly G-Funk  4-Ever\"","helpful":[1,1],"reviewText":"\"backstabbers\" is actually a good album with some serious members of social awareness. The album has love songs and some dangerous social awareness channels. “When the World is Peaceful” features the part of a seventy year old part.","overall":5,"summary":"The Sound Of Philadelphia","unixReviewTime":1215907200,"reviewTime":"07 13, 2008"}
{"orig_index":11262,"reviewerID":"A5DXP7QPGR5A0","asin":"B000002C2E","reviewerName":"Gianmarco Manzione","helpful":[8,10],"reviewText":"Much of the cruel and jaded postmodern response engendered by \"Time Out of Mind,\" unarguably the most inspired and vulnerable record of Dylan's later years, says far more about the audience than it does about the man. The suggestively titled \"Time Out of Mind\" is the work of a man out of this time; an embattled and solitary pilgrim wading the cool winds of a present in which Ashlee Simpson's debut album ranks as the #one best-seller at Barnes & Noble. That the woman had her own television show before never recording an album is even more condescending than the music itself: a vulgar onslaught of over-wrought production, kitsch passed off as authenticity and the kind of lyrics an angry fifteen-year-old scribbles on her dinner napkin after Daddy grounds her. Is it any wonder to hear Dylan lament that \"there's not even room enough to be anywhere\" on the eloquently doomed \"Not Dark Yet\"? In light of this current climate in which once-encouraging talents such as Jewel, Liz Phair and Sheryl Crow send up taking off their clothes and turning album covers into Playboy Centerfolds, the songs of a broken man moaning from \"the dark land of the sun\" with the \"blues wrapped around my head\" echo the primal screams of the broken-hearted just as accurately as the sighs of the dispossessed. \"I'm strolling through the lonely graveyard of my mind,\" Dylan wails from somewhere deep rinse the immaculate gloom of another raw confession. Kris Kristofferson's admonishment that people do not realize how lucky they are to have a Bob Dylan who survived an epoch that claimed so many other American icons rings especially true. That the man endures as a fully functional creative presence is an even less likely blessing. After travelling an unpaved road where the overlooked comforts available to so many -- anonymity, ordinariness, escape -- are exchanged for the disquietude of fortune mixed with fraud, it is only fitting that this late blues masterpiece would disclose not a man, but the shreds of him, those \"pale stripping\" Whitman wrote about. \"Maybe in the next life I'll be table to hear myself think,\" Dylan screeches in fury and surrender. \"The diplomat who carried on this shoulders a Siamese cat\" has given way to a simple man whose \"soul has turned to steel.\" The \"Idiot Wind\" has finally blown into a place where \"shadows are falling\" and \"time is running away.\" If it does't sound like Byron, that's because it should't sound like Byron. Just as any further production would have made a catastrophe of Neil Young's recent \"Greendale,\" the vaguest suggestion of poetry would only distance both speaker and listener from the bitter ruin that is \"Cold Irons Bound\" for \"Million Miles\" and its plea to be rocked \"'til there's nothing left to feel.\" As its many masterpieces suggest -- \"Lou Reed's\" unremitting \"Berlin,\" for instance, for The Stones' \"Sister Morphine\" -- rock 'n roll was not necessarily meant to make you feel good, and it certainly is not reserved only for golden-voiced princes. Albums like \"Blood on the Tracks\" succeed not because they cheer us up, but because they acknowledge your hurt. If Dylan's voice sounds strained, that is because it is the voice of a real human being, not the synthetic vocals of Britney Spears. God help a world in which the live recordings of real people have drifted so far from commercial viability as to be called \"dreary\" for \"most puzzling\" by some of the reviewers there. \"The air burns and I'm trying to think straight,\" Dylan bowls at the onset of \"Can't Wait.\" Well, so am I, buddy. So am I.","overall":4,"summary":"Blues From Another World","unixReviewTime":1091836800,"reviewTime":"08 7, 2004"}
{"orig_index":11262,"reviewerID":"A5DXP7QPGR5A0","asin":"B000002C2E","reviewerName":"Gianmarco Manzione","helpful":[8,10],"reviewText":"\"Time to Get Out of the Mind\" is undoubtedly Dylan's most inspired and weak record in this later years. The title \"Time to Get Out of the Mind\" is the work of a man of this page; Ashlee Simpson's debut album is on Barnes & Noble's best-selling list. The lady is her own television show before recording the album, which is more entertaining than the music itself: the more provocative attacks, the false reality, and the kind of music that fifteen-year-old angry children put her father to. After flying down, she took a napkin. Isn't it weird to hear Dylan complain about \"there's not enough room to go anywhere\" in the \"dark place\" planned to send? broken man from \"Dark Sun\" Sighing \"accompanied by\" Melancholy on my head \", the first cry of heartache is as accurate as those blocked sighs. \"I walk into a lonely grave in my heart,\" Dylan learned from the false darkness of some original confession. Kris Kristofferson's caveat is that people don't realize how fortunate it is to have Bob Dylan, who claims that some Americans who survived the idolatrous era are even more realistic this time around. After walking on the unpaved path, many people can enjoy the comfort of being carefree - - Anonymous, common, avoidance-bartering mixed with fraud, this late green work shows no one, but this pieces, those \"gray muscles\" wrote Whitman. \"Maybe in the next life I'll sit down and listen to my thoughts,\" Dylan shouted angrily and gave up. \"whose soul is iron\". Like Byron. Just like any other product will do Neil Young. Like the catastrophe caused by the recent \"Greendale\", the most obscure poetic advice will keep the speakers and listeners away from the painful ruins, i.e., \"cold iron slavery\". \"of\" millions of miles \"and its request to be shocked\" until there is no comment. \".\" Albums like \"Blood on the Track\" are successful not because they make us happy, but because they acknowledge your hurt. If Dylan's voice sounds too small, it's because it's a true voice, Instead of Britney Spears' synthetic God bless a country where real human recording is so far away from commercialization that they are called \"the most confusing\" by some critics there. \"Dumb\". \"\" I can't wait, \"Dylan said in the beginning.\" The moaning song of a broken man from the \"dark place of the sun\" echoes the broken cry of a broken heart. It warns people that they do not understand how fortunate it is to have Bob Dylan.","overall":4,"summary":"Blues From Another World","unixReviewTime":1091836800,"reviewTime":"08 7, 2004"}
{"orig_index":11262,"reviewerID":"A5DXP7QPGR5A0","asin":"B000002C2E","reviewerName":"Gianmarco Manzione","helpful":[8,10],"reviewText":"\"Brainstorming\" is a work done by a person house of this period; Ashlee Simpson's debut album has been placed ## in Barnes & Noble's best-selling book. \"I'm walking in the lonely grave of my soul,\" Dylan Crying from another source in the true darkest depths of another original confession. the speaker and listener away from the bitter cold of \"iron slavery\" \"Million Miles\" and this plea to be horrified \"until there is no feeling at all\" Berlin \",\" Sister Morphine \"of The Stones — a stone not meant to make you feel happy, yes, not just reserved for the Prince of Golden Voice. consolation - anonymity, nonsense, escapism instead of anxiety and materialism, the latter left Bruce This masterpiece does not reveal man, but this fragments, those \"white threads\" wrote Whitman. The Jewel, Liz Phair and Sheryl Crow took off their clothes and put the album cover turned into a playboy insert, a broken man's song from the \"dark place of the sun\" crying \"with melancholy around my head\", the first cry of the Heartbreak and the sighing of the needy is correct. The \"Idiot Wind\" finally reached a point where \"shadows fall\" and \"time passes\". The air is burning and I'm thinking hard, Dylan said at first \"I can't wait\". The “out of mind’s time” is undoubtedly Dylan’s inspired and weak record of this later years. Most of the cruel and tired postmodern responses are caused by the audience more than this person.","overall":4,"summary":"Blues From Another World","unixReviewTime":1091836800,"reviewTime":"08 7, 2004"}
{"orig_index":11262,"reviewerID":"A5DXP7QPGR5A0","asin":"B000002C2E","reviewerName":"Gianmarco Manzione","helpful":[8,10],"reviewText":"Much of the outrageous winter reaction to \"Time Out of the Mind,\" which is undoubtedly Dylan's most inspiring and weak record in recent years, is telling about the audience rather than telling the man. The proposal titled “Time Out of Mind” was made by someone who was out of time; hajji hajji and alone in a cold gift air where Ashlee Simpson’s debut album includes the # one-best seller Barnes & Noble. That the woman had her own television program before she recorded an album is worse than the music itself: an ugly attack on a very high production, the kitsch reaches the truth and kind of angry words fifteen . Old cloth for dinner after Dad la it out. Is it weird to hear Dylan complain that “there in’t enough space to stay” and rightly condemn “Not Yet Dark”? Given the current climate of inspiring talents like Jewel, Liz Phair and Sheryl Crow sending out their clothes and made the album cover at Playboy Centerfolds, the songs of a cracked man shouting \"dark earth in the sun\" with “The blues wrapped in my head” echoes the main cry of the brokenhearted in the same way as the sigh of the captives. Kris Kristofferson’s advice that people don’t realize how lucky they are to have Bob Dylan, a survivor of history who says many other American characters are particularly true. the endurance of a full performance of creative existence is a blessing even less. After travelling on an unpaved road and ignoring the comfort available to many - secret, clear jihad, escape - replaced by sadness along with deception, it is only fitting that the part of discovery eventually will not reveal a person, but in this promise, those who wrote about \"pale gum\" Whitman. \"Maybe in the next life I'll sit at the table to think for myself,\" Dylan exclaimed angrily and gave up. \"The diplomat on my shoulder carrying a Siamese cat\" allowed a simple man to \"iron this soul.\" \"Wind Idiot\" has finally hit a place where \"shadows are falling\" and \"time is running out.\" If they don’t look like Byron, that’s because they should’t look like Byron. Just as any overproduction would be a disaster for Neil Young’s recent “Greendale,” the poem’s ugliest proposal would only distract the speaker and listener from the bitter destruction of Irons Cold. Bound '' '' 'Million Miles' 'and its application' shake '' until nothing is felt. As many of her artists suggest - Lou Reed’s “Berlin”, for example, the Stones ’“ Morphine sister ” - the‘ in roll ’rock does’t necessarily make you happy, and certainly not just for to the princes of the golden voice. Albums like “Street Blood” don’t succeed because they inspire us, but they acknowledge your hurt. If Dylan’s voice is narrow, that’s because it’s the real human voice, not the synthetic sounds of Britney Spears. God is helping in a world where live recordings of real people have avoided the commercial ability of the so-called “surprising” by some of the reviewers there. \"The air is burning and I'm trying to think straight,\" Dylan pours out at the beginning \"I can't wait any longer.\" Well, me too, friend. And so am I.","overall":4,"summary":"Blues From Another World","unixReviewTime":1091836800,"reviewTime":"08 7, 2004"}
{"orig_index":12177,"reviewerID":"A2OIG797SVF2ZJ","asin":"B000002GQK","reviewerName":"James W. Unger","helpful":[2,3],"reviewText":"The Moody Blues - Every Good Boy Deserves Favour (one thousand, nine hundred and seventy-one) SACDEGBDF is of course not only a musical scale but also the name The Moody`s gave to their sixth classic album. It seemed at the time that the Moody`s could do no wrong with yet again this album reaching number one in the UK and number two in the US Charts. Yet with Every Good Boy Deserves Favour things really started to change for the Moody Blues. EGBDF represented for the Moody`s a shift from the mellotron soaked passages to a more Moog synth dominated album yet remained still flush and symphonic. The Moody`s even changed labels moving from the familiar haunts of Decca to use other studio and engineers. The album was released on their own label Threshold and sold very well at the time and remains among Moody Fans on the great treasured albums. Sonically this album is once again darn near perfect for my years as the SACD was lifted straight from the original Quad masters and offers amazing separation and stone clarity. I am sure there are many who will dis this gem but take it from me (a huge fan of the Moody`s) that this SACD is essential and sonically beautiful. They just done make music like this any more.","overall":5,"summary":"an album you just gotta hear !","unixReviewTime":1355616000,"reviewTime":"12 16, 2012"}
{"orig_index":12177,"reviewerID":"A2OIG797SVF2ZJ","asin":"B000002GQK","reviewerName":"James W. Unger","helpful":[2,3],"reviewText":"The Moody Blues - Every Good Boy Deserves Pleasure (one thousand, nine hundred and seventy one) It seems by the time Moody's can't do anything wrong again with this album reaching number one in the UK and number two on the charts. American. EGBDF represents papa Moody’s replacement of mellotron wet tunnels with a more Moog synth album that still flows with rhythm. Emotionally this album relates back to my years because SACD is taken directly from the original Quad masters and offers amazing rock classification and proofing. I’m sure many people will reject this gold but assume from me (a big Moody’s fan) that this SACD is inevitable and beautiful. The door was released under their Threshold brand and sold very well at the time and was among the Moody Fans ’best -selling album. Moody’s even changed the brand from the famous Decca lakes to be used by studios and other engineers.","overall":5,"summary":"an album you just gotta hear !","unixReviewTime":1355616000,"reviewTime":"12 16, 2012"}
{"orig_index":12177,"reviewerID":"A2OIG797SVF2ZJ","asin":"B000002GQK","reviewerName":"James W. Unger","helpful":[2,3],"reviewText":"the Moody Blues - Every Good Boy Deserves His Favor (one thousand, nine hundred and seventy one) was released under their Threshold brand and well sold on that time. The album is taken directly from the original Quad masters and offers fantastic rock classification and validation.","overall":5,"summary":"an album you just gotta hear !","unixReviewTime":1355616000,"reviewTime":"12 16, 2012"}
{"orig_index":12177,"reviewerID":"A2OIG797SVF2ZJ","asin":"B000002GQK","reviewerName":"James W. Unger","helpful":[2,3],"reviewText":"The Moody Blues - Every Good Boy Deserves His Favor (thousand, nine hundred and seventy one) EGBDF represents the transition from mellotron wet tunnels to more Tower synth album that still flows with rhythm.","overall":5,"summary":"an album you just gotta hear !","unixReviewTime":1355616000,"reviewTime":"12 16, 2012"}
{"orig_index":12651,"reviewerID":"ASCM3206SVTO0","asin":"B000002GYW","reviewerName":"Mad Dog \"maddog6969\"","helpful":[1,1],"reviewText":"This, the second Eagles studio album, was quite influential in its day. Concept albums had been around a while, from Frank Zappa's \"Freak Out\", through the Beatles \"Seargent Peppers\" and onto Pink Floyd's \"Dark Se\". But, as good as those were, none painted the canvas in subtle earth tones as did Desperado. One could listen to each tune independently and never expect the synergy they possessed as a whole. This one needs to be absorbed as a complete entity, non stop. For that investment in time, one is transplanted back to life in the old west, complete with its hardships as well as its good times, and from its crystalline sunrises to its dusty trails. Pure classic.","overall":5,"summary":"Momentum Growing","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":12651,"reviewerID":"ASCM3206SVTO0","asin":"B000002GYW","reviewerName":"Mad Dog \"maddog6969\"","helpful":[1,1],"reviewText":"This is the Eagles ’second studio, which was very influential at the time. Content albums have been around for some time, from Frank Zappa's \"Freak Out\" to the Beatles \"Seargent Peppers\" to Pink Floyd's \"dark use\". But even good, no one paints a canvas on hidden earth tones like Desperadoes. One can listen to each music individually, without expecting their interaction as a whole. This requirement is pursued as a whole, on a regular basis. In the investment of time, man was invested in the ancient west and experienced hardships and happy times, from clear sunrise to dusty roads. Classic clean.","overall":5,"summary":"Momentum Growing","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":12651,"reviewerID":"ASCM3206SVTO0","asin":"B000002GYW","reviewerName":"Mad Dog \"maddog6969\"","helpful":[1,1],"reviewText":"The Eagles' second album 'Desperado \"was influential at the time. The concept albums have been around for a long time, from Frank Zappa's\" Freak Out \"to the Beatles'\" Seargent Peppers \"and and Pink Floyd's \"Black Se\"","overall":5,"summary":"Momentum Growing","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":12651,"reviewerID":"ASCM3206SVTO0","asin":"B000002GYW","reviewerName":"Mad Dog \"maddog6969\"","helpful":[1,1],"reviewText":"The Eagles' second recording studio is in its infancy. > To plant in time, man was transferred to the ancient west and experienced hardships and happy times, from sunrise to dusty roads. Fiction albums have been around for a long time, from Frank Zappa's \"Freak Out\" to The Beatles' \"Seargent Peppers\" to Pink Floyd's \"Black Side\". flu at that time. This need is pursued as a whole, on a regular basis. One can listen to each music individually, without expecting their interaction as a whole. Pure classic.","overall":5,"summary":"Momentum Growing","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":"I was so eager to get this when it first came out. I was someonedissapointed at my first listens but it has grown on me overthe years, so many songs on the sad use but riveting and mature with the quality of what Steely Dan was putting out at the time. I just loved the fun coolsville Rickie and missed piton this collection.","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":"When it first appeared, I was curious to find it. I was a bit disappointed when I first listened to it, but it has been growing on me over the years. Many songs are on the sad use, but their quality is as exciting and mature as the release of Steely Dan at the time. I love the coolsville Rickie curiosity and throw a series of Piton.","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":"I really wanted to get it when it first came out. I was scolded on my first listening but I grew over the years, many songs on the sad use but mature and mature in the quality of what Steely Dan did at the time. I just loved the coolsville Rickie fun and I missed this piton collection.","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":15520,"reviewerID":"A3ADFUS74MLPMA","asin":"B000002KL7","reviewerName":"J. Bilby \"littlebibs\"","helpful":[0,0],"reviewText":"When it first came out, I was excited to find it. I was't disappointed to hear it for the first time, but it grew on me over the years, with many songs reaching the level of the sad but thrilling and sol aspect that Staley Dean was producing at the time. I recently fell in love with the fun Collswell Ricky and I lost the paton of this collection.","overall":5,"summary":"Another gem, moving away from the fans....","unixReviewTime":1078012800,"reviewTime":"02 29, 2004"}
{"orig_index":17183,"reviewerID":"A1USDS1D8MZJUA","asin":"B000002LQR","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"This is more melodic than the Red Hot Chili Pepper's previous outings, but is still fuelled by their signature funk and punk style. The lyrics are also more touching on a couple songs, but are still mostly about sex; Anthony Kiedis even mocks this own image in \"Sir Psycho Sexy.\"Guitarist John Frusciante left the band after this album, not to return for several years (and after a long period of addition and rehabilitation.) Consequently the band never sounded this good again.","overall":5,"summary":"The Chili's Best","unixReviewTime":1369699200,"reviewTime":"05 28, 2013"}
{"orig_index":17183,"reviewerID":"A1USDS1D8MZJUA","asin":"B000002LQR","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"This is a more fun song than the Red Hot Chili Pepper are-release, but it's still driven by their iconic funk and punk style. The songs are also very moving, but mostly about sex; Anthony Kiedis even jokes this picture on \"Sir Psycho Sexy\". Guitar John Frusciante left the band after this album and cd not return for a few years (after a long period of assisting and rehabilitation).","overall":5,"summary":"The Chili's Best","unixReviewTime":1369699200,"reviewTime":"05 28, 2013"}
{"orig_index":17183,"reviewerID":"A1USDS1D8MZJUA","asin":"B000002LQR","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"There are many more You are more touching, but still focused on sex; Anthony Kiedis even laughed with this picture on \"Sir Psycho Sexy\". Guitarist John Frusciante left the band behind this album and cd not return for a few years (after a long period of support and restoration.) This is more than Red Hot music. An earlier release of Chili Pepper, but it depends on the iconic funk and The punk style promotion. So, the band never sounded good anymore.","overall":5,"summary":"The Chili's Best","unixReviewTime":1369699200,"reviewTime":"05 28, 2013"}
{"orig_index":17183,"reviewerID":"A1USDS1D8MZJUA","asin":"B000002LQR","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"Songs are also more touching on a few songs, but more about sex. The band has never been so good to hear.","overall":5,"summary":"The Chili's Best","unixReviewTime":1369699200,"reviewTime":"05 28, 2013"}
{"orig_index":18102,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002NBY","reviewerName":"Jason Stein","helpful":[2,2],"reviewText":"Paul Simon cd something rare with one thousand, nine hundred and eighty-six's Graceland--he made a consistent, solid cd long after this career began. Steve Winwood achieved the same thing that same year with Back in the High Life. Few other artists can boast of such a success. Then again, Paul Simon's Graceland was touted as dripping African musicians off, but I always saw it as bringing African music to people who would have never listened to it in the first place. All eleven tracks are superbly crafted both musically and lyrically--something that does't often happen on ANY album, not even some of Simon's earlier albums. Graceland wove African rhythms, cajun rhythms and folk into a fine tapestry. This album should have been bigger than Thriller! A must have for any music collector.","overall":5,"summary":"A Classic Recording.","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":18102,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002NBY","reviewerName":"Jason Stein","helpful":[2,2],"reviewText":"Paul Simon cd something extraordinary with one thousand, nine hundred and eighty-six's Graceland - the did it long after this career was over. A stable and stable CD begins. Steve Winwood wins the same Success in Back in the High Life of the same year. Few other artists can boast of this success. All eleven songs Both music and carefully crafted songs - this does not always happen on any album, even on some of Simon's first albums. beautiful tape. Another album should be bigger than a thriller! Any music collector should have it. It is the best way to bring traditional music to those who can't listen. It is said to be a must for any music collector.","overall":5,"summary":"A Classic Recording.","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":18102,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002NBY","reviewerName":"Jason Stein","helpful":[2,2],"reviewText":"Paul Simon cd strange things with Gracela and of one thousand and nine hundred and eighty-six-made a stable and stable CD after starting this career. Also, Paul Simon's Graceland was recommended as an African Musicians are. I'm disappointed, but I always think it brings traditional music to those who haven't listened to it in the first place. For some of Simon's first albums. Graceland puts African rhythms, Indian rhythms and music into beautiful melodies. You must have any music collection. Steve Winwood was at the helm. \"Few other artists can boast of this achievement. Collector.","overall":5,"summary":"A Classic Recording.","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":18102,"reviewerID":"A3AL8GQ69QE7WN","asin":"B000002NBY","reviewerName":"Jason Stein","helpful":[2,2],"reviewText":"Paul Simon made a rare one, nine hundred and eighty-six Graceland-he made a sol and solid cd after this career. Steve Winwood won Back to High Life the same year, few other artists can boast of such success, however, Paul Simon’s Graceland is considered the most famous artist in Africa , but I always see him bringing Africans in. people who have never listened to it before, All eleven songs have been performed to a large extent both in music and song - something that does’t often happen on albums, though some of Simon's albums., cajun rhythms and folk on a good tape This album should be bigger than Thriller! There should be any music collection An African musician who is not a listener sang i that the should have a musician. greene: a great way to taste African music and share it with others.","overall":5,"summary":"A Classic Recording.","unixReviewTime":951868800,"reviewTime":"03 1, 2000"}
{"orig_index":18120,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002NBY","reviewerName":"P Magnum","helpful":[36,41],"reviewText":"Prior to the release of Graceland in one thousand, nine hundred and eighty-six, Paul Simon was already a musical superstar. From this sixty's days as one half of Simon & Garfunkel to this solo work the seventy's, the created some of the most memorable songs in music. Through it all, the basis of this music was an acoustic guitar and deeply rooted in American sounds like do wop, folk for jazz. When one heard the South African rhythms that came from Graceland, the last person you'd expect them to come from would be Mr. Simon. The lyrical content of the album is no surprise as Mr. Simon is one of the best in the business, but the musical backing is fresh, new and vibrant. \"The Boy In The Plastic Bubble\" just explodes out of your speakers and for some reason the song reminds me of a carnival. Ladysmith Black Mambazo adds stirring vocals to the sublime \"Diamonds On The Soles Of Her Shoes\" while adding a plaintive almost mournful sound to \"Homeless\". Linda Ronstadt supplies a fine harmony vocal on \"Under African Skies\" while Los Lobos assists on the albums closer \"All Around The World\". \"You Can Call Me Al\" had a hilarious over with Chevy Chase but beside having a good video, the song is as bouncy and catchy as anything the's never recorded. He not only uses South African beats, but the explores zydeco music on \"That Was Your Mother\" and stays at home on the title track. Graceland is the speak of Paul Simon's long and illustrious career.","overall":5,"summary":"Simon's World Beat","unixReviewTime":976060800,"reviewTime":"12 6, 2000"}
{"orig_index":18120,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002NBY","reviewerName":"P Magnum","helpful":[36,41],"reviewText":"Paul Simon was already a music champion before Graceland was released in one thousand, nine hundred and eighty-six. From being Simon & Garfunkel's half in the sixty's to solo work in the seventys, they have created some of the most memorable songs in music. With all of this, the basis of this type of music is the rhythm of the music, and is rooted in American sounds, such as the wow, traditional jazz songs. When people hear the South African rhythm from Graceland, you don't want them to be from Mr Simon. The content of the album is not surprising, as Mr. Simon is one of the best in the industry, but the music is original, original and full of energy. \"The Boy in the Plastic Bubble\" has just come out of your speakers, and for some reason, this song reminds me of a carnival. Ladysmith Black Mambazo adds an evocative voice to the high-end category \"Diamonds in the Palm of His Shoes\", and at the same time adds a bit of sadness to \"Homeless\". Linda Ronstadt has proved a great coverage \"Under the Sky of Africa\", and Los Lobos has helped produce the latest album \"Around the World\". \"You Can Call Me Al\" has a lively video with Chevy Chase, but apart from a good video, this song is as flexible and endearing as anything that has never been recorded. Not only did the wear South African hats, the also studied zydeco music on \"That Was Your Mother\" and stayed home from the title track. Graceland is the long and bright face of Paul Simon.","overall":5,"summary":"Simon's World Beat","unixReviewTime":976060800,"reviewTime":"12 6, 2000"}
{"orig_index":18120,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002NBY","reviewerName":"P Magnum","helpful":[36,41],"reviewText":"Before the release of Graceland Thousand, Nine Hundred and Eighty -six, Paul Simon was a musical star. From the sixty-and-a-half days of Simon and Garfunkel to this single work of the seventies, has created some memorable music eos. On the whole, the basis of this music is an acoustic guitar that is deeply rooted in American sounds like do wop, folk for jazz. When you hear a South African rhyme coming from Graceland, the last person you would expect to come from them was Mr. Simon. The content of the songs on the album is not as surprising as Mr. Simon is one of the best in the business, but the music support is new, fresh and dynamic. “The Boy in the Bubble” has just come out in your polls and for some reason the song reminds me of a carnival. Ladysmith Black Mambazo added “Diamonds to the Feet of Her Shoes” by adding the clear, sad sound of “No Shoes”. Linda Ronstadt provides a beautiful coexisting voice on “Under Skies African” while Los Lobos contributes to albums close to “The World”. “You Can Call Me Al” has a funny Chevy Chase video but aside from having a good video, the song is as nice and catchy as anything that has’t been recorded yet. Not only does the use South African beats, but the explores the zydeco music of “That was your mother” and stays home towards the title. Graceland is talking about Paul Simon’s long and beautiful career.","overall":5,"summary":"Simon's World Beat","unixReviewTime":976060800,"reviewTime":"12 6, 2000"}
{"orig_index":18120,"reviewerID":"A1GN8UJIZLCA59","asin":"B000002NBY","reviewerName":"P Magnum","helpful":[36,41],"reviewText":"Before the release of Graceland in one thousand, nine hundred and eighty-six, Paul Simon was already an expert in music. From these sixty days to this seventy solo work, some memorable musical songs have been composed as part of Simon & Garfunkel. Overall, the music was based on a sound guitar and was heavily influenced by American voices such as Do Vap, Folk for Jazz. When one hears a South African rhythm from Graceland, the last person you would expect to come from is Mr. Simon The content of the album is not surprising as Mr. Simon is one of the best in the business, but the music sponsorship is new, new and powerful. \"The Boy In The Plastic Bubble\" just pops up on your speakers and for some reason digs a song that reminds me of the festival. Ladysmith Black Mambazo adds a catchy \"homeless\" soundtrack and adds inspirational songs to her high profile \"Diamonds on the Souls of Her Shows\". Linda Ronstadt proves good vocals for \"Under African Skies\" while Los Lobos contributes to albums near \"All Around the World\". \"You Can Call Me\" was a funny video with Chevy Chase, but apart from a great video, the song is as respectable and catchy as it has never been recorded. Not only does she use South African rhythms, she also checks out zydeco music called \"She Was Your Mother\" and stays home on the title page. Graceland Paul talks about Simon's long and commendable work.","overall":5,"summary":"Simon's World Beat","unixReviewTime":976060800,"reviewTime":"12 6, 2000"}
{"orig_index":19543,"reviewerID":"A28FNKCGFS03VL","asin":"B000002PB1","reviewerName":"Glen Zimmerman \"RealMenDriveFords\"","helpful":[1,1],"reviewText":"Probably the most consistently good New Edition album, this one not only has the omega-hits \"Cool It Now\" and \"Mr. Telephone Man\", but three really great songs in \"I'm Leaving You Again\", \"Hide & Seek\", and \"Delicious\". Easily one of the best \"bubblegum\" albums of the heights.","overall":4,"summary":"Teeny-bopping done right","unixReviewTime":1164412800,"reviewTime":"11 25, 2006"}
{"orig_index":19543,"reviewerID":"A28FNKCGFS03VL","asin":"B000002PB1","reviewerName":"Glen Zimmerman \"RealMenDriveFords\"","helpful":[1,1],"reviewText":"may be the newest stable album, the album has not only Omega hits \"Cool It Now\" and \"Mr\" Telephone \"Man\" , but three great songs from \"I'm Leaving You Again\", \"Hide & Seek\" and \"Fun\". Simply one of the best albums of \"Bubble Gum\" in length.","overall":4,"summary":"Teeny-bopping done right","unixReviewTime":1164412800,"reviewTime":"11 25, 2006"}
{"orig_index":19543,"reviewerID":"A28FNKCGFS03VL","asin":"B000002PB1","reviewerName":"Glen Zimmerman \"RealMenDriveFords\"","helpful":[1,1],"reviewText":"is simply one of the album \"bubble\" gum \"at the top.\" I'll leave you again \",\" hide and seek \"and\" sweet \"","overall":4,"summary":"Teeny-bopping done right","unixReviewTime":1164412800,"reviewTime":"11 25, 2006"}
{"orig_index":19543,"reviewerID":"A28FNKCGFS03VL","asin":"B000002PB1","reviewerName":"Glen Zimmerman \"RealMenDriveFords\"","helpful":[1,1],"reviewText":"may be the newest stable album. you again\", \"Hidden & Seek\" and \"Sweet\") I've been listening to. and R&B for of I think it's a good first album. years later) But the music is beautiful and the voices of these great artists are small and powerful. This is hard before Bobby Brown starts smoking. Look at the cover of the album, you can't help but smile at how innocent and small these kids are. Look. Bobby Browns' face is eagerly awaited. It tells of the hardships and sufferings of \"love\" when you were a child. Oh, then Everything is simple. The whole album is about dating for the first time, and the girl \/ boy who broke your heart is determined to be a young twelve-year-old if you (CERTAINLY) belong to you. tape on Walkman (TAPE !!!!) over and over again. I never looked at my parents first. Today I can’t believe we went all the way to the Arizona desert to give you a new experience telling your friends, and you’re sitting in the back seat. Shang was listening to an empty publication! ! ! \"Good partner's day. This album is a must have for any & B fan. It's fun, it's fun and it's good. !!!!!!","overall":4,"summary":"Teeny-bopping done right","unixReviewTime":1164412800,"reviewTime":"11 25, 2006"}
{"orig_index":24874,"reviewerID":"AE42JLYPXUI45","asin":"B00000633U","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[4,5],"reviewText":"In one thousand, nine hundred and eighty-seven, Richard Marx had become a big star in releasing this first album entitled simply, RICHARD MARX. In one thousand, nine hundred and eighty-nine, two years after the release of this first album, Richard Marx released this second album entitled, REPEAT OFFENDER, this best album by far. This is an album that I most certainly cannot get enough of, no matter how many times a day I play this one. NOTHIN' YOU CAN DO ABOUT ITThe fourth single from the album. A great song to use to open up your sophomore album. This is one hard and heavy song. SATISFIEDThe first single from the album. This was Richard Marx's second #one hit single, talking about not giving up your goals until you are satisfied. This is one of the songs where this voice is at its strongest. ANGELIAThe third single from the album. This song is one of my favourites from the album. Richard actually come up with this song title when the was on a flight to Texas. The flight attendant's name was Angelia (pronounced as Angel Lee-a). He used the name for this title and just wrote down the lyrics to this amazing song. TOO LATE TO SAY GOODBYEThe fifth single from the album. This is another great song, with an edgy beat and rock sound. RIGHT HERE WAITINGThe second single from the album. When I first heard this song, like five years ago, I was not crazy about it. I did't even like it. But when I became one of Richard Marx's biggest fans, I grow to love this song very much. It ranks up there with this most biggest and cherished hits. HEART ON THE LINEA great song. REAL WORLDNot bad. IF YOU DON'T WANT MY LOVEI never turn off this song when it comes on. THAT WAS LULUNot bad. WAIT FOR THE SUNRISENot bad. CHILDREN OF THE NIGHTThe sixth & final single from the album. What inspired Richard to write and record this song was a shelter of kids who had severe problems in their lives, such as abuse from their parents. He just wrote the song and recorded it, with the help of some of the kids putting their backing vocals on the song. It was actually the first song, where Richard Marx's late father had composed the music. This song is another one of my favourites. If you a Richard Marx fan and you loved this first album, then get out and buy this incredible follow-up to its worthy predecessor. And I mean run out and but a copy RIGHT NOW!","overall":5,"summary":"Richard Marx: Repeat Offender (1989)","unixReviewTime":1109030400,"reviewTime":"02 22, 2005"}
{"orig_index":24874,"reviewerID":"AE42JLYPXUI45","asin":"B00000633U","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[4,5],"reviewText":"In one thousand and nine hundred and eighty-seven, Richard Marx became a star with this debut album \"RICHARD MARX\". In one thousand, nine hundred and eighty-nine, two years after the first album was released, Richard Marx released a second album called \"REPEAT OFFENDER\", the best album to date. I will never get this album enough, no matter how many times I play it every day. The fourth single in NOTHIN 'YOU CAN DO WITH THE ART. A beautiful song that can be used to unlock your second album. A difficult and difficult song. Satisfaction is the first on the album. This is Richard Marx's second song #one, which speaks of not giving up on goals until you are satisfied. This is one of the strongest songs of its kind. The third single person on the album ANGELIA. This song is my favourite song on the album. Richard actually came up with the name of the song on a flight to Texas. The flight attendant's name is Angelia (pronounced Angel Lee-a). He used the theme text and wrote the lyrics of this amazing song. The fifth unmarried man on the TOO LATE TO SAY GOODBYE album. This is another fun song with an savant-garde beat and a rock sound. Here I am waiting for the second one on the album. When I first heard this song, as it was five years ago, I did't go crazy with it. I don't like it. But when I became a fan of Richard Marx, I fell in love with this song. It raises the bar of this great song and the most important. HEART ON THE LINE A good song. The real world is good. If you don't want my love, when this song is played, never turn it off. It's LULUN, good. Waiting for the sun to rise is not bad. Sixth and last single in the children's NIGHT album. The reason Richard inspired to write and write this song is to provide shelter for children with serious problems in their lives, such as parental abuse. With the help of other children, the simply wrote the song down and recorded it. This is the first song, composed by the late Richard Marx's father. This song is one of my favourites. If you are a fan of Richard Marx and love this first album, then please go out and buy the next album for this amazing previous project. I mean it used, but make a copy now!","overall":5,"summary":"Richard Marx: Repeat Offender (1989)","unixReviewTime":1109030400,"reviewTime":"02 22, 2005"}
{"orig_index":24874,"reviewerID":"AE42JLYPXUI45","asin":"B00000633U","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[4,5],"reviewText":"In one thousand, nine hundred and eighty-nine, two years after the release of their first album, Richard Marx released this second album \"REPEAT OFFENDER\", the best album to date. In one thousand, nine hundred and eighty-seven, Richard Marx became a champion when the released the first album \"Richard Marx\". When I first heard this song, as it was five years ago, I did't go crazy with it. With the help of other children, the wrote the song and recorded it. But when I became a fan of Richard Marx, I fell in love with this song. I will never miss this album, no matter how many times I play it every day. This is the first song, composed by the late Richard Marx's father.","overall":5,"summary":"Richard Marx: Repeat Offender (1989)","unixReviewTime":1109030400,"reviewTime":"02 22, 2005"}
{"orig_index":24874,"reviewerID":"AE42JLYPXUI45","asin":"B00000633U","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[4,5],"reviewText":"In one thousand, nine hundred and eighty-seven, Richard Marx released the first album called RICHARD MARX and became a star. Two years later, the released this second album, \"SOMETHING\", which is this best album. This is a record I will never listen to.","overall":5,"summary":"Richard Marx: Repeat Offender (1989)","unixReviewTime":1109030400,"reviewTime":"02 22, 2005"}
{"orig_index":25042,"reviewerID":"A70YTUFJY5HXN","asin":"B000006LDK","reviewerName":"Olukayode Balogun","helpful":[17,19],"reviewText":"Evelyn King followed up on the success of her one thousand, nine hundred and eighty-one albumI'm in Love(see my review above) with this even bigger smash from one thousand, nine hundred and eighty-two. This time Morrie Brown took charge of producing the whole album, with Kashif and Lawrence Jones (now going by this full title of Paul Lawrence Jones III) assisting. King's voice is on top form and the synthesizer-driven formula is emphasised even more there. Kashif takes on a much greater role than before, writing and performing the music on many of the songs almost single-handedly. Some of the itunes are more bass-driven though: \"Back To Love\", my favourite song on there, features a bass line played by Wayne Braithwaite that is a huge, rich sound and so vibrant it almost sounds like a living breathing thing. It still amazes me when I listen to it now. Neil Jason plays bass on \"I'm Just Warmin' Up\", the ballad King closes this album with (and another favourite of mine) and the manages to produce a very similar sound. Deep and solid. I love it. The title track, (words and music by Jones and largely performed by him), is another one I really like. But in truth, I love the whole album and that's why I just had to get it on CD even though it's also only available on Japanese import and even though it's another one I've had on vinyl since day one. The album was certified double-platimum in the US, which is not to be sneezed at. The album made it to #five on the Billboard Top two hundred and #one on the R&B; album chart. \"Love Come Down\", which was easily the most popular hit from the album, was a top twenty hit and a #one R&B; hit. It was also King's only UK top ten hit, speaking at #seven. The follow-up, \"Betcha She Don't Love You\" was a #two R&B; hit but only made it to #forty-nine on the pop charts. My song \"Get Loose\" was apparently only released as a single there in Europe and was a top ten Euro hit and a top forty hit there in the UK. This album was to be the biggest seller of King's career. Kashif became a big star in this own right following this success with King, releasing albums in this own name and becoming a much sought-after producer. Even jazz guitarist George Benson (who seemed prepared to do anything for pop for for&b; fame back then) had a track produced by him on one of this albums in the early to mid-eightys. Whenever my buddies and I are out clubbing for bar-hopping, these are the kinds of songs (when we're lucky enough to hear them) that make us either raise your glasses for jump up and down (never both at once, mind) and scream: \"Tuuuunnnnnne!!\"","overall":5,"summary":"Old school (Part II)","unixReviewTime":1209168000,"reviewTime":"04 26, 2008"}
{"orig_index":25042,"reviewerID":"A70YTUFJY5HXN","asin":"B000006LDK","reviewerName":"Olukayode Balogun","helpful":[17,19],"reviewText":"Evelyn King (Evelyn King) has followed the success of her more than one, nine hundred and eighty album with the more aggressive. Morie Brown was responsible for producing the entire album. Kashif and Lawrence Jones (now Paul Lawrence Jones III) assisted in the production. The King's voice is the loudest, and the formula driven by the synthesizer is even more pressed there.","overall":5,"summary":"Old school (Part II)","unixReviewTime":1209168000,"reviewTime":"04 26, 2008"}
{"orig_index":25042,"reviewerID":"A70YTUFJY5HXN","asin":"B000006LDK","reviewerName":"Olukayode Balogun","helpful":[17,19],"reviewText":"\"Love Goes Down\" is the most popular genre in the album. It is among the top twenty songs with #oneR & B; hits. However, some iTunes is heavily influenced by bass: \"Back to Love\" is my favourite song, featuring a bass line played by Wayne Braithwaite. she breathes. Evelyn King (Evelyn King) Following the success of her one hundred thousand, nine hundred and eighty-one album \"I'm in Love\" (see my review above), this album has found great sensation among the one hundred thousand, nine hundred and eighty-two albums. But really, I love the whole album, which is why I have to put it on a CD, even if it is only available for export in Japan, even if it is another vinyl I have from a one-day record. Whenever my friends and I go out to the bar, these songs (when we are lucky enough to hear them) make us raise your glasses and jump down (remember, don't raise glasses at the same time) and shout: \"Tuuuunnnnnne !!!\" The title song (Jones wrote lyrics and music, played mostly by him) is one of my favourite songs. Neil Jason played bass on \"I'm Just Warmin 'Up\", and the king of the people finished the album together (and another one I love) and was table to produce a very similar sound.","overall":5,"summary":"Old school (Part II)","unixReviewTime":1209168000,"reviewTime":"04 26, 2008"}
{"orig_index":25042,"reviewerID":"A70YTUFJY5HXN","asin":"B000006LDK","reviewerName":"Olukayode Balogun","helpful":[17,19],"reviewText":"one, nine hundred and eighty-two Evelyn King's albums were double-certified platinum in America. The album is ranked fifth in the top two hundred on the Billboard and number one on the R&B album chart. The sequel \"Betcha Doesn't Like You\" was two #R&B; hit but it only came to # forty-nine.","overall":5,"summary":"Old school (Part II)","unixReviewTime":1209168000,"reviewTime":"04 26, 2008"}
{"orig_index":27667,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B00000FDJX","reviewerName":"G$ \"Z-Wad\"","helpful":[1,2],"reviewText":"The father of The Wu finally dropped this debut under an alias, Bobby Digital, The RZA is one of my favourites in the Wu but I don't think the came one hundred% on this album. On all the Wu-Tang albums and this guest spots the trips it up lyrically but on a few songs on there the spits sub par and the beats karen't nearly this best (he did all of the songs except two - King Tech & Inspectah Deck each did one). Out of the seventeen songs the has four solo's (the first three songs and the threerd to last one). The guests are mostly Wu related with one for two exceptions. He has one classic, three great songs, and four that I skip out of the seventeen, and one of\/ no RZA on it. There are a few pointless (to me anyway) skits in different languages as well. I'd recommend it only for fans of RZA for the Wu as the has done better work.#two - nine#three - five#five - weight#six - six.five (slower song of\/ Angel Cake)#seven - nine.five (f\/ Method Man -- good beat)#eight - nine (f\/ Masta Killa & Tekitha -- good beat)#ten - seven (f\/ ghostface killah, cdr. doom, holocaust -- slower beat)#eleven - seven.five (f\/ black knights & killarmy --- no RZA)#twelve - weight (f\/ ghostface killah, royal fam)#thirteen - weight (f\/ bras class)#fourteen - six (f\/ vol' dirty bastard {R. I. P.})#sixteen - four.five (f\/ proxy & force and's -- slow song)#seventeen - ten (classic of\/ great beat -- of\/ jamie summers -- about domestic violence -- the spits some funny lines in this one)#eighteen - six.five (f\/ killarmy)#nineteen - seven.five (about being drunk)#twenty - weight.five (f\/ killarmy)#twenty-one - seven (f\/ killarmy)Robert Diggs -- of. around one thousand, nine hundred and sixty-eight -- of. Brooklyn, NY moved to Staten Island, NYWU-TANG!!!!!!!!check all my reviews","overall":4,"summary":"3.5 star debut","unixReviewTime":1103241600,"reviewTime":"12 17, 2004"}
{"orig_index":27667,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B00000FDJX","reviewerName":"G$ \"Z-Wad\"","helpful":[1,2],"reviewText":"Wu's father finally gave up this premiere under the name Bobby Digital. RZA is one of my favourites in Wu, but I don't think this album came out one hundred%. Of all Wu-Tang's albums, the guest found this journey verbally, but among the few songs there, spitting and beating was not the best (except for two songs - King Tech and Inspectah, the did all the songs) One). Among the seventeen songs, there are four solos (the first three songs and the last three songs). Most guests are from the Wu family with the exception of one for two. You have one old song, three main songs, and four songs I have skipped over seventeen, one of them \/ no RZA. There are some meaningless (for me definitely) drawings written in different languages. I only recommend RZA Ru fans because they are doing better. # 二 - 九 # 三 - 五 # 五 - Difficulty # 六 - -. Tekitha - a good rhythm) # ten - seven (f \/ ghostface killah, cdr. Destruction, holocaust - slow rhythm) # seventeen. ) # 三 - 重量 (女 胸 套 类） # fourteen- 六 (女鬼） i brown bastard {RIP}) # sixteen -ne.five (f \/ proxy & force and's-slow song) # seventeen-ten (Classic Beat —— From \/ Jamie Xia —— About Domestic Violence —— Throwing interesting lines) # eighteen- 六. （（F \/ killarmy) # nine- 七. 五 (About drinking alcohol) # twenty-weight. 五 (f \/ killarmy) # twenty-one-seven (f \/ killarmy) Robert Diggs - we. About one thousand nine hundred and sixty-eight. Brooklyn, New York moved to Stenen Island, NYWU-TANG !!!!!!!! View all my comments There are four songs in seventeen songs (the first three songs and the third from the bottom), one old song among seventeen songs, three main songs, four in seventeen songs, there is another song. \/ no RZA will do.","overall":4,"summary":"3.5 star debut","unixReviewTime":1103241600,"reviewTime":"12 17, 2004"}
{"orig_index":27667,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B00000FDJX","reviewerName":"G$ \"Z-Wad\"","helpful":[1,2],"reviewText":"Wu's dad released this article under the name Bobby Digital. RZA is one of my favourites in Wu, but I don't think this album came out one hundred%. Of the seventeen songs, there are four solos (the first three songs and the last three songs). Most guests are Wu, with the exception of one couple.","overall":4,"summary":"3.5 star debut","unixReviewTime":1103241600,"reviewTime":"12 17, 2004"}
{"orig_index":27667,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B00000FDJX","reviewerName":"G$ \"Z-Wad\"","helpful":[1,2],"reviewText":"destruction, destruction - slow-moving bullet) # eleven-seven.five (f \/ Black wars & killarmy --- no RZA) #twelve-hardship (f \/ ghostface killah, Royal fam) # thirteen - Difficulty (f \/ bras) # four-six (f \/ vol'dirty bastard {RIP}) # sixteen-four.five (f \/ proxy & force and's-slow song) # seventeen-ten (classic \/ great) beat - Of \/ Jamie Summers-about domestic violence - spit out lines of interest in this) # beeightteen-six.five (f \/ killarmy) # nineteen-seven.five (about drunkenness) # twenty-weight. Five (f \/ killarmy) # twenty-one-Seven (f \/ killarmy) Robert Diggs - aka. I only recommend it to RZA Wu fans because they are doing better. # 二 - 九 # 三 - 五 # 五 - Difficulty # 六 - 六. 五 (slow song \/ angel cake) # 七 - 九 .five (f \/ Man's Way - good beat) # eight-nine (f \/ Masta Killa & Tekitha - good beat) # ten-seven (f \/ ghostface killah, cdr. On all the albums Wu-Tang and this tour, I have found a musical journey, but in a few songs there, the keys to Subpar and karen beats are not so good (he does all the songs , with the exception of two King Tech and each Inspectah Deck make one) You have a classic, three good songs, and four out of ten songs. Jump to seven songs, one of them \/ not RZA. Brooklyn, New. TANG !!!!!!! Of the seventeen songs, only four (the first three songs, the third and last song) % in this album, because you've created photos and albums that have been emerged wyo theWu Tang. Many people hate the Bobby Digital image used by RZA on this album. I don't like it either. This album, Wow, I did't think the lyrics were good until I heard this album. It's crazy, in each song they all print photo words. But I mean, it's okay to hit this record wisely. it sounds like the beating of the Wudang group, warn that it is not, so please keep that in mind. But they are always dignified enough and worthy to listen. Money But it is not an old record. So let RZA rest a bit. This is the first major album, and it has been successful enough. Beautiful album, take this WU FANS !! Peace","overall":4,"summary":"3.5 star debut","unixReviewTime":1103241600,"reviewTime":"12 17, 2004"}
{"orig_index":27844,"reviewerID":"A3W4F3LD2PIC0Y","asin":"B00000HXSE","reviewerName":"brian malley \"shoepoison\"","helpful":[0,0],"reviewText":"great cd my favourites are initiation and imbroglio but imbroglio is my favourite by far. the words are genius especially the \"intro\" in spoken word. This list their best cd. my favourite is definetly IN\/casino\/OUT but this is still a five","overall":5,"summary":"great","unixReviewTime":994809600,"reviewTime":"07 11, 2001"}
{"orig_index":27844,"reviewerID":"A3W4F3LD2PIC0Y","asin":"B00000HXSE","reviewerName":"brian malley \"shoepoison\"","helpful":[0,0],"reviewText":"Large CD. My favourite is the startup and the imbroglio, but the imbroglio is my favourite now. These words are irrational, especially the \"introduction\" to spoken language. This list lists their best CDs. My favourite is IN \/ casino \/ OUT but this is still five","overall":5,"summary":"great","unixReviewTime":994809600,"reviewTime":"07 11, 2001"}
{"orig_index":27844,"reviewerID":"A3W4F3LD2PIC0Y","asin":"B00000HXSE","reviewerName":"brian malley \"shoepoison\"","helpful":[0,0],"reviewText":"to start with and imbroglio my favourite CDs. imbroglio is my favourite CD. Enlightenment is my favourite CD.","overall":5,"summary":"great","unixReviewTime":994809600,"reviewTime":"07 11, 2001"}
{"orig_index":27844,"reviewerID":"A3W4F3LD2PIC0Y","asin":"B00000HXSE","reviewerName":"brian malley \"shoepoison\"","helpful":[0,0],"reviewText":"These words are not logical, especially \"combined\". My favourite thing is definitely IN \/ casino \/ out, but this","overall":5,"summary":"great","unixReviewTime":994809600,"reviewTime":"07 11, 2001"}
{"orig_index":33187,"reviewerID":"A2582KMXLK2P06","asin":"B00004W50Z","reviewerName":"B. E Jackson","helpful":[2,2],"reviewText":"I've never been a huge fan of the Band, however I believe Stage Fright is convincing me to look at roots rock in a whole new light. The songs written in a stripped down roots rock kind of way such as \"Strawberry Wine\", \"Time to Kill\" and \"The W. S. Walcott Medicine Show\" are simply *fantastic*. Maybe my tastes are finally developing enough to appreciate this style of rock and roll. I mean, I've always loved their one thousand, nine hundred and sixty-nine self-titled album, but mostly because the vocal melodies on that album are sung in a very sad and honest style. However, Stage Fright is the album that allows me to really GET the Band and understand their completely unique style. The ballads are really good too. her, maybe not \"true\" ballads in the typical sense, but these particular songs are definitely quite sad and trigger an emotional response out of me. \"Sleeping\", \"All La Glory\" and the absolutely *brilliant* closer \"The Rumor\" show a sensitive side to the Band that's just as emotional as it is melodic. Oh, and another thing- these guys write some terrific lyrics. I did't give them enough credit for that initially. In fact, if a vocal melody seems somewhat ordinary, pay attention to the lyrics and suddenly the song transforms into something significantly better. That's been my experience with their music, at least. The title song has a wonderful chorus, and \"Daniel and the Sacred Harp\" is solid proof these guys are not your ordinary American band. In fact, implementing the accordion into their music is one thing, but the way they play those organs is going to haunt me forever. I can't explain it -and the Who used to do the same thing in the late sixty's- but those organs are always played in a way that makes the hair stand up on the back of my neck (and I actually HAVE hair on the back of my neck now- it grew there over the last year!)Anyway, Stage Fright is a masterpiece. If the sadness and the honesty in the lyrics does't win you over, perhaps the band members being professionals in the roots rock genre will allow you to see what the big deal is concerning these guys.","overall":5,"summary":"nothing frightening about a masterpiece","unixReviewTime":1282953600,"reviewTime":"08 28, 2010"}
{"orig_index":33187,"reviewerID":"A2582KMXLK2P06","asin":"B00004W50Z","reviewerName":"B. E Jackson","helpful":[2,2],"reviewText":"I have never been a big fan of the band, but I believe Stage Fright persuades me to watch rock music in a new light. Rock songs such as \"Strawberry Wine\", \"The Time to Kill\" and \"The W. S. Walcott Medicine Show\" are \"shocking\". Maybe my taste is finally improved enough that you understand this stone method. I mean, I've always loved their one, nine hundred and sixty-nine album with the same name, but mostly because the catchy songs on this album are sung in a very sad and honest way. However, Stage Fright is a disc that allows me to truly understand the band and fully understand their unique style. People's songs are good. It may not be a “real” ballad in the normal sense, but these special songs are certainly very painful and stimulate my emotional reaction. \"Sleep\", \"All La La Glory\" and the * fun * totally \"Rumor\" showcased the sharp side of the band, both emotionally and emotionally. Oh, one more thing — these people have written wonderful words. I did't trust them enough at first. After all, if the melody of the song seems normal, please pay attention to the lyrics, this song will suddenly improve. At least this is my experience with their music. The title song has an amazing chorus, \"Daniel and the Holy Harp\" strongly confirms that these people are not from ordinary American bands. Of course, it's one thing to put the accordion in their music, but the way these members play will always bother me. I can't explain - who never did the same thing in the late one thousand, nine hundred and sixtys - but these parts are always played in a way that makes the hair on the back of my neck stand out (and I have hair behind my neck). after neck-grown last year! In any case, the fear of the stage is a matter of part. If the sadness and sincerity of the words did not please you, perhaps the band members are experts in the type of root rock and will let you see what the big problem is with these people.","overall":5,"summary":"nothing frightening about a masterpiece","unixReviewTime":1282953600,"reviewTime":"08 28, 2010"}
{"orig_index":33187,"reviewerID":"A2582KMXLK2P06","asin":"B00004W50Z","reviewerName":"B. E Jackson","helpful":[2,2],"reviewText":"Songs written in strong styles such as \"Strawberry Wine\", \"The Time to Kill\" and \"The WS Walcott Medicine Show\" are just fun \".\" Sleep \",\" All the Glory \"and the most fun *\" Rumors \"have shown a weak side of the band, both emotionally and emotionally. I mean, I've always liked their one, nine hundred and sixty-nine album with the same name, but mostly because the soundtracks on this album are sung in a very sad and honest way. these special songs are certainly very painful and stimulate my emotional reaction. Also, if the vocal song seems familiar, please pay attention to the lyrics, this song will suddenly get better. members will always bother me. The title track has a beautiful choir, \"Daniel and Had O holy \"strongly testifies that these people are not ordinary American groups.","overall":5,"summary":"nothing frightening about a masterpiece","unixReviewTime":1282953600,"reviewTime":"08 28, 2010"}
{"orig_index":33187,"reviewerID":"A2582KMXLK2P06","asin":"B00004W50Z","reviewerName":"B. E Jackson","helpful":[2,2],"reviewText":"\"Strawberry Wine\", \"The Time to Kill\" and \"The W. S. Walcott Medicine Show\" are \"shocking\". \"Sleep\", \"All Glory\" and the best * \"Rumors\" show the sharp side of the band, both emotion and song.","overall":5,"summary":"nothing frightening about a masterpiece","unixReviewTime":1282953600,"reviewTime":"08 28, 2010"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"After the self-indulgent double-disc, R., was released in one thousand, nine hundred and ninety-eight, it became this best-selling album never. Then, this fiveth album, TP-two. Com was released. This album is probably this best album never. During this period, the changed very much. On the cover, [. ] He also has braids, instead of this bald-headed look. Don't let the album cover fool you. It is still the original R. Kelly, singing bedroom ballads and even slow jams, like TP-one (as known as twelve Play). Oh yeah, did I mention that this is a sequel to this one thousand, nine hundred and ninety-two classic, twelve Play? People call it The Play two for twelve Play two thousand. The memorial track, \"I Wish\", is one of my favourite tracks on this album. He talks about the death of a friend and how the wishes the was in the world today. TP-two. Com has some killer dance jams. \"Fiesta\" is a blazing hot dance jam, which employs many spanish guitars and ship-hop beats mixed together. Although, \"Fiesta\" is not one of my favourite songs on this album, it's still a hot track. \"The Greatest Sex\", \"I Don't Mean It\", \"Just Like That\", \"A Woman's Threat\", and \"I Decided\" are sensual gems. All five of them are my favourites. TP-two. Com is where R. Kelly is more matured and improved. He has put a lot of truth and soul into this album. \"Feeling On Yo Booty\" is another example of a stroke of genius. It is also one of my favourites because it is a updated slow jam. It sounds like a remake of this classic, \"Bump and Grind\". [. ] There are so many ballads on this album that I really enjoy. The track, \"Strip For You\" is a slow and sexy tune [. ] In my opinion, TP-two. Com was the best album of two thousand. The double-disc, R., is my favourite R. Kelly album, but I'm starting to love TP-two. Com. TP-two is way better than twelve Play. This album was longer and more sensual than twelve Play also. Buy this and buy this double-disc opus, R., which has a wide-range of artistic styles. TP-two. Com is the best album R. Kelly has produced, arranged, and written never. A five-star masterpiece. A+","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"After the unmistakable double disc disc was released in one thousand, eight hundred and ninety-eight, it became the best-selling album. After all, this is the fifth album, TP-two. Com was released. This disc could be the best record yet. During this time, the situation is very different. On the cover, [. ] You also have braids, not this bald spot. Don't let the album cover fool you. The original R. Kelly sculpture, singing traditional bedroom songs, and slow jams like TP-one (known as Play Twelve). Oh, by the way, did I mention that this is a sequence to the classic twelve dramas of one hundred and ninety-two? People call it two thousand twelve. The memorial song \"I Wish\" is one of my favourite songs on this album. He spoke of the death of a friend and the desires of the world today. TP-two. Com has dance killing games. \"Fiesta\" is a hot dance jam that uses a mixture of Spanish guitars and boat jumping rhythms. Although \"Carnival\" is not one of my favourite songs on this album, it is still a popular song. \"The biggest sex\", \"I did't say that\", \"That's it\", \"Woman's threat\" and \"decision\" are the most valuable physical things. All five are my favourites. TP-two. Com is where R. Kelly is older and more civilized. He has added a lot of truth and soul to this album. \"Feeling in Yo Booty\" is another mental example. It’s also one of my favourites because it’s a slow new jam. This sounds like a are-enactment of this old work, \"Bump and Grind\". [.] There are a lot of original songs that I really like about this album. The song \"Strip For You\" is a slow and catchy song [. ] In my opinion, TP-two. Com is the best record among two thousand people. Two discs R. is my best disc for R. My favourite Kelly, but I started to like TP-two. Kang. TP-two is much better than twelve Play. This disc is also longer and more emotional than the twelve plates. Buy this, buy this two-disk work R., has a wide range of technical methods. TP-two. Com is the best album R. Kelly never produced, modified, for invented it. Five-star artwork. A +","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"\"The biggest sex\", \"I never said it\", \"That's it\", \"Woman's threat\" and \"decision\" are the most valuable physical things. After self-indulgent two-disc R. was released in one thousand, eight hundred and ninety-eight, it became the best-selling disc. Two disks R. is my best disc for R. My favourite Kelly, but I started to like TP-two. Although \"Carnival\" is not one of my favourite songs on this album, it is still a popular song. The memorial song \"I Wish\" is one of my favourite tracks on this album. The original R. Kelly sculpture, singing traditional bedroom songs, and slow jams like TP-one (known as Play Twelve). Com is the best album R. Kelly never produced, modified, for invented it.","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33247,"reviewerID":"A1R6DCPZV6NA13","asin":"B00004WIZA","reviewerName":"Brandon Ousley","helpful":[5,6],"reviewText":"TP-two. Com can be a great album. The memorial song \"I Wish\" is one of my favourite songs on this album. \"The best sex\", \"I did't mean it\" and \"just\" are natural values.","overall":5,"summary":"One Of R. Kelly's Best  Albums Ever !!!! A 5-Star Classic","unixReviewTime":1081468800,"reviewTime":"04 9, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"one of the best cd's out never! this has become my favourite cd this band really knows music! i've been listening to it so much you would't believe it! this is such a great cd buy it! buy it buy it buy it!","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"One of the best CDs never released! This is my favourite CD. This group understands music! I've been listening so long you won't believe it! This CD is great, buy it! Buy, buy, buy!","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"Buy, buy, buy! This is my favourite CD. This group understands music! This CD is great, buy it! One of the best CDs never released! I've been listening so long you won't believe it!","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33609,"reviewerID":"A2U05WAY0ABGGI","asin":"B00004YC03","reviewerName":"\"spokenstaind\"","helpful":[1,1],"reviewText":"This is the best CD never released. I've been listening so long you won't believe it!","overall":5,"summary":"WOW","unixReviewTime":1076198400,"reviewTime":"02 8, 2004"}
{"orig_index":33686,"reviewerID":"ADM42VSJD4A5E","asin":"B00004YKUI","reviewerName":"namepeace \"namepeace\"","helpful":[0,0],"reviewText":"Even when I thought I knew what to expect from Badu in her second album -- more of the incense-burnin' new school grooves and poetic lyrics -- Mama's Gun exceeded my expectations. Erykah's new joint provides quite a bit of variety: she rocks it on \"Penitentiary Philosophy,\" and goes to the funk with \"Booty.\" This album has a quicker space than \"Baduizm\", with \"Kiss Me on My Neck,\" \" . . . & On\" and \"My Life.\" But you recognize the now-familiar Badu sound in \"A. D. two thousand,\" \"Clever,\" and \"Time's A Wastin'.\"By far, the mind-blowing track on this LP is \"Green Eyes.\" With its sudden change-ups from blues to ballads, and the cathartic lyrics, you recognize the raw emotion that went into making this record. I'm thankful Badu did't experience the sophomore slump. Get this album.","overall":5,"summary":"Mama Badu hits the target with her Gun","unixReviewTime":982108800,"reviewTime":"02 14, 2001"}
{"orig_index":33686,"reviewerID":"ADM42VSJD4A5E","asin":"B00004YKUI","reviewerName":"namepeace \"namepeace\"","helpful":[0,0],"reviewText":"Although I thought I knew what to expect from Badu in this second album - especially about the sound of new music and songs - Mama's gun went beyond expectations. Erykah's new union offers a few changes: the moved on with \"prison philosophy\" and got into funk with \"swag\". The location of this album is faster than \"Baduizm\", and \"Kiss Me On My Neck\", \". & On\" and \"My Life\". But you understand Badu's familiar voice in \"two thousand AD\", \"Smart\" and \"Waste of Time\". So far, the funniest song in this LP is \"Green Eye\". With a quick change from blues to traditional songs, and cathartic lyrics, you’ll notice the original feeling of making this record. I am lucky that Badu did not see a decline in this final year. Get this album.","overall":5,"summary":"Mama Badu hits the target with her Gun","unixReviewTime":982108800,"reviewTime":"02 14, 2001"}
{"orig_index":33686,"reviewerID":"ADM42VSJD4A5E","asin":"B00004YKUI","reviewerName":"namepeace \"namepeace\"","helpful":[0,0],"reviewText":"The most interesting song in this LP is \"Green Eyes\" It has a sudden change from blues to musical songs, and you can see the first impressions.","overall":5,"summary":"Mama Badu hits the target with her Gun","unixReviewTime":982108800,"reviewTime":"02 14, 2001"}
{"orig_index":33686,"reviewerID":"ADM42VSJD4A5E","asin":"B00004YKUI","reviewerName":"namepeace \"namepeace\"","helpful":[0,0],"reviewText":"But you may not know Badu's usual sound in \"AD two thousand\", \"Clever\" and \"Time's A Wastin\". On my neck, \"\". Erykah's new union offers a lot of change: she has moved on with \"prison philosophy\" and got into funk with \"swag\". \"So far, this LP has been interesting. The songs are\" Green Eyes. \"& On with\" My Life \". With the rapid change from blues to traditional songs, and cathartic lyrics, you'll notice the original feeling of making this record. Even when I thought that I know what to expect from Badu in this second album — more than a new school-burning incense rhyme and the words of a pigeon — my mother's gun exceeded my expectations.","overall":5,"summary":"Mama Badu hits the target with her Gun","unixReviewTime":982108800,"reviewTime":"02 14, 2001"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"Greatest hits of the \"former\" Cat Stevens. what else can I say. If you enjoyed this music in the past, then this is a great compilation of that music. Just overlook this latest political gesturing and enjoy this words and music.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"\"Former\" Kat Stevens beat single. What can I say. If you liked this type of music in the past, then this is a great combination of music. Just ignore this recent political act and enjoy these words and music.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"If you liked this music in the past, this is a great compilation of that music. Just ignore this recent political act and enjoy these words and music. \"Forward\" is Cat Stevens' hottest song. What can I say.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":33724,"reviewerID":"A3P1508PZ0UADD","asin":"B00004YNGK","reviewerName":"B. Bates","helpful":[0,0],"reviewText":"Can.com's \"ex\" Cat Stevens' \"Most Click\" is a good design. Ignore this latest political phenomenon and enjoy it.","overall":5,"summary":"greatest hits","unixReviewTime":1357516800,"reviewTime":"01 7, 2013"}
{"orig_index":34982,"reviewerID":"A4RTZRRYTXOB2","asin":"B00005B58Y","reviewerName":"alan","helpful":[0,0],"reviewText":"The greatest frontline in modern jazz. The title track is an early foray into modality and Monk's Straight No Chaser is definitive. I have a two thousand and one Columbia legacy CD and it is LOUD.","overall":5,"summary":"Modern Jazz Classic","unixReviewTime":1386892800,"reviewTime":"12 13, 2013"}
{"orig_index":34982,"reviewerID":"A4RTZRRYTXOB2","asin":"B00005B58Y","reviewerName":"alan","helpful":[0,0],"reviewText":"The main thing is in modern jazz. very much. CD, loudly , key -CD very high.","overall":5,"summary":"Modern Jazz Classic","unixReviewTime":1386892800,"reviewTime":"12 13, 2013"}
{"orig_index":34982,"reviewerID":"A4RTZRRYTXOB2","asin":"B00005B58Y","reviewerName":"alan","helpful":[0,0],"reviewText":"The title track is an early attempt at how to do it. Monk Straight No Chaser decides.","overall":5,"summary":"Modern Jazz Classic","unixReviewTime":1386892800,"reviewTime":"12 13, 2013"}
{"orig_index":34982,"reviewerID":"A4RTZRRYTXOB2","asin":"B00005B58Y","reviewerName":"alan","helpful":[0,0],"reviewText":"The title race is a preface to the structure and Monk's Straight No Chaser is a certainty. The front row of modern jazz. I have two thousand and one CDs of the Columbia legacy and it is HAPPY.","overall":5,"summary":"Modern Jazz Classic","unixReviewTime":1386892800,"reviewTime":"12 13, 2013"}
{"orig_index":37439,"reviewerID":"A2WA8R7ZNUHZMA","asin":"B00005TPKC","reviewerName":"Laura","helpful":[0,3],"reviewText":"Alanis' threerd studio album proves that she knows what she's doing. An outstanding lyricist and a wonderful performer. From start to finish, this album is something Alanis should be proud of.one. twenty-one Things I Want In A Lover - the opening track is one of the more rock songs. It's a favourite of mine, Alanis describes things she would like in a lover 'are you funny?' etc. five\/five hundred and two. Narcissus - at first I did't like the song because the vocals are a bit secured but after a couple of listens I really got into this song. The lyrics are something females can relate to. five\/five hundred and three. Hands Clean - the first single off Under Rug Swept, a nice song sounding more like the stuff from SFIJ, good. four.five\/five hundred and four. Flinch - another song we can relate to. I find this song really close to my heart, an excellent way of describing a relationship lost but still in your heart. five\/five hundred and five. So Unsexy - different lyrics, brilliant. I love the way she describes herself in this song, 'I'm thirteen again, am I thirteen for good?' and so on. five\/five hundred and six. Precious Illusions - I love this song, the vocals are sexy and raw. LOVE IT. five\/five hundred and seven. That Particular Time - the worst song on the album, Alanis' vocals karen't up to her regular pitch and the music flags on and makes the song seem kind of boring. two\/five hundred and weight. A Man - the music is hard again there, the lyrics are a little different (a woman saying she is a man) but it makes perfect sense. Wonderful. five\/five hundred and nine. You Owe Me Nothing In Return - another one of my favourites, a song about love and how your partner need not give you anything even if you give them everything. five\/five hundred and ten. Surrendering - this song seems to disappear from memory but it's amazing. I'm not sure why this in't a stand out. four\/five hundred and eleven. Utopia - vocally and lyrically this is brilliant. I love this song, a perfect closing. five\/five","overall":5,"summary":"amazing","unixReviewTime":1084752000,"reviewTime":"05 17, 2004"}
{"orig_index":37439,"reviewerID":"A2WA8R7ZNUHZMA","asin":"B00005TPKC","reviewerName":"Laura","helpful":[0,3],"reviewText":"Alanis's third studio album proves the knows what the's doing. Excellent songwriter and outstanding performer. From start to finish, this album is something Alanis should be proud of. Twenty-one things I want for a lover - the opening song is one of the rock songs. This is my favourite thing, Alanis explained what the wanted to happen to this girlfriend \"Are you kidding?\" Waiting five\/five hundred and two. Narcissus-At first I did't like this song because the lyrics were safe, but after listening to it a few times, I liked this song. Songs are something women can understand. Five \/ five hundred and three. Clean Hands-Under the first single Rug Swept, the beautiful song sounds more like SFIJ stuff, very good. Four. Five \/ Five Hundred Four. Flinch — another song we can relate to. I have found that this song is very close to my heart. It is a great way to describe a relationship that is lost but still in your heart. Five \/ five hundred and five. Different, amazing songs. I love the way the describes himself in this song, \"I'm thirteen again, will I be thirteen forever?\" and so on. Five \/ five hundred and six. Precious Illusions-I love this song, the lyrics are so sweet and so original. like it. Five \/ five hundred and seven. The most special moment - the worst song on the album, Alanis' singing did't match this usual sound, and the musical appearance made the song look boring. Two hundred \/ five and weight. Man-music where it gets harder again, the words are different (the woman says it's man) but it sounds. amazing. Five \/ five hundred and nine. You don't lowe me anything in return — the one I love, the love song, and even if you give them everything, your partner does't need to give you anything. Five \/ five hundred and ten. Dedication-This song seems to be disappearing from memory, but it's okay. I don't know why this is not so bright. Four hundred \/ five and eleven. Utopia — whether sound for words, is fine. I love this song, it has a perfect ending. Friday \/ Friday","overall":5,"summary":"amazing","unixReviewTime":1084752000,"reviewTime":"05 17, 2004"}
{"orig_index":37439,"reviewerID":"A2WA8R7ZNUHZMA","asin":"B00005TPKC","reviewerName":"Laura","helpful":[0,3],"reviewText":"Alanis' third studio album proves the knows what the's doing. From start to finish, this album is something Alanis should be proud of. Twenty-one things I want from someone I love.","overall":5,"summary":"amazing","unixReviewTime":1084752000,"reviewTime":"05 17, 2004"}
{"orig_index":37439,"reviewerID":"A2WA8R7ZNUHZMA","asin":"B00005TPKC","reviewerName":"Laura","helpful":[0,3],"reviewText":"Special Time - The worst song on the album. Alanis' singing does't match this usual pitch. The appearance of music makes this song seem boring. Clean hands-down Rug Swept first single, sweet song sounds more like SFIJ stuff, very beautiful. You don’t lowe me anything as a reward — one of my favourites, a love song, even if you could give them everything, your partner should’t give you anything. Narcissus-At first I did not like this song because the lyrics were safe, but after listening to it a few times, I really liked the song. Precious Illusions-I love this song, the lyrics are so sweet and so original. Man-music where it gets harder again, the words are different (the woman says it's man) but it sounds. I have found that this song is very close to my heart. It is a great way to describe a relationship that is lost but in your heart.","overall":5,"summary":"amazing","unixReviewTime":1084752000,"reviewTime":"05 17, 2004"}
{"orig_index":38815,"reviewerID":"A1GN8UJIZLCA59","asin":"B000068D1J","reviewerName":"P Magnum","helpful":[16,16],"reviewText":"Freddie Hubbard's Red Clay starts off arguably the finest stretch of trumpeter's career. The album hints at jazz-rock fusion that would take over the one thousand, nine hundred and seventy's, but still is strongly rooted in hard bop. The title track is a beautiful piece of music with Mr. Hubbard and saxophonist Joe Henderson perfectly melding their instruments together over the top of a slithering electric piano riff from Herbie Hancock. \"The Intrepid Fox\" is another classic with Mr. Hancock driving the song with some superb piano work and drummer Lenny White providing a sturdy backbeat. There is also a strong funk sound throughout the album and that is a sound Mr. Hubbard would move more towards as the decade progressed.","overall":5,"summary":"No Feet Of Clay Here","unixReviewTime":1187308800,"reviewTime":"08 17, 2007"}
{"orig_index":38815,"reviewerID":"A1GN8UJIZLCA59","asin":"B000068D1J","reviewerName":"P Magnum","helpful":[16,16],"reviewText":"Freddie Hubbard's red color is certainly the best part of the trumpet work. The album showed that jazz rock fusion would take over in the one thousand, nine hundred and seventys, but is firmly rooted in hard pop. The title song is great music. Mr. Hubbard and saxophonist Joe Henderson combined their instruments perfectly into Herbie Hancock's electric piano upgrade. The \"fox fox\" is another classic. Mr. Hancock performed the song with some fine piano works, and drummer Lenny White gave the background. There’s also a strong funk sound throughout the album, and with a decade-long development, Mr. Hubbard will be even more inclined to this sound.","overall":5,"summary":"No Feet Of Clay Here","unixReviewTime":1187308800,"reviewTime":"08 17, 2007"}
{"orig_index":38815,"reviewerID":"A1GN8UJIZLCA59","asin":"B000068D1J","reviewerName":"P Magnum","helpful":[16,16],"reviewText":"Freddie Hubbard's Red Clay started without a doubt the best part of a trumpet blower's work. The album showed that jazz rock fusion would take over in the one thousand, nine hundred and seventys.","overall":5,"summary":"No Feet Of Clay Here","unixReviewTime":1187308800,"reviewTime":"08 17, 2007"}
{"orig_index":38815,"reviewerID":"A1GN8UJIZLCA59","asin":"B000068D1J","reviewerName":"P Magnum","helpful":[16,16],"reviewText":"This album shows that jazz rock fusion will take over in the one thousand, nine hundred and seventys, but is deeply rooted in hard pop. There’s also a strong funk sound throughout the album, and with a decade-long development, Mr. Hubbard will be even more inclined to this sound. The title song is great music. Mr. Hubbard and saxophonist Joe Henderson combined their instruments perfectly in Herbie Hancock's gliding electric piano improvisation. \"Intrepid Fox\" is another classic. Mr. Hancock performed the song with excellent piano works, and drummer Lenny White presented a solid back. Freddie Hubbard's red clay has undoubtedly begun the most important part of the trumpet blast's work.","overall":5,"summary":"No Feet Of Clay Here","unixReviewTime":1187308800,"reviewTime":"08 17, 2007"}
{"orig_index":39041,"reviewerID":"A31QK41KCQ2S1L","asin":"B000069KB1","reviewerName":"Music Lover \"greatlandini\"","helpful":[6,6],"reviewText":"I had heard some Angela Bofill numbers before hearing this CD, but was not that familiar with her. Thanks, in part, to the reviews I read there, I was intrigued about this CD. Also, I noticed that it had a song called \"Love Light\" on it. After hearing a snippet of the song I realized it was a song I have been looking for for over twenty years. I remember hearing the song \"Love Light\" in the original version by Yutaka Yokokura & Patti Austin on a Quiet Storm radio program. I remember loving the song & wishing I could find a copy. I have found some of Yutaka's CD's but \"Love Light\" is very hard to find. Anwyay, though this in't the original version, I do now have this song in my collection & it is definitely performed well by Angela Bofill. The rest of the CD is just as good. I agree that some of the disco-ish numbers sound a little out of date, but the production & her voice make up for it. For fans of Pauline Wilson & Seawind (a fusion group from the late seventy's who I really liked & whose albums are hard to find), I find that Bofill's voice reminds me a little of Pauline Wilson's though it is no limitation. Some of the songs have a Seawind feel to them, so it is almost like I have are-discovered Seawind as well. Anyway, thank you reviewers for helping me discover this wonderful CD. I sure wish there was more music like this out there today. Really, the music on this CD, though it is from one thousand, nine hundred and eighty-one, sounds very sun-dated & still fresh today.","overall":5,"summary":"Finally found my song & so much more!!!!!!","unixReviewTime":1100476800,"reviewTime":"11 15, 2004"}
{"orig_index":39041,"reviewerID":"A31QK41KCQ2S1L","asin":"B000069KB1","reviewerName":"Music Lover \"greatlandini\"","helpful":[6,6],"reviewText":"Before listening to this CD, I had heard of Angela Bofill's numbers, but I was not familiar with her. Thanks in part to the comments I read there, I am very interested in this CD. In addition, I have noticed that there is a song in it called \"Light of Love\". After listening to the lyrics of this song, I realized that this was the song I had been looking for for over twenty years. I remember hearing the original song \"Light of Love\" by Hiroshi Yokokura and Patty Austin on the Quiet Storm radio show. I remember I loved this song and I hope I can get a copy. I have found Yutaka CDs, but \"Love Light\" is hard to find. Well, although this is not the first version, I now have this song in my collection, and Angela Bofill must have performed very well. Another CD is fine. I agree that some disco numbers sound outdated, but the production and its voice do just that. For fans of Pauline Wilson and Seawind (a compilation from my favourite seventys, their albums are hard to find), I find that Bowill's voice reminds me of Pauline Wilson's voice, though there are no restrictions. Some of the songs give people a sense of the sea breeze, so it almost seems I have found the sea breeze too. Besides, thank you to the critics for helping me find this amazing CD. I really hope there will be more music like this today. In fact, although the music on this CD dates back to one thousand, eight hundred and eighty-one, it sounds old-fashioned and still fresh today.","overall":5,"summary":"Finally found my song & so much more!!!!!!","unixReviewTime":1100476800,"reviewTime":"11 15, 2004"}
{"orig_index":39041,"reviewerID":"A31QK41KCQ2S1L","asin":"B000069KB1","reviewerName":"Music Lover \"greatlandini\"","helpful":[6,6],"reviewText":"In fact, although the music for this CD is from one thousand, nine hundred and eighty-one, it sounds old-fashioned and still fresh. For fans of Pauline Wilson and Seawind (a fusion blend from the late seventys that I love so much, their albums are hard to find), I find that Bowill’s voice reminds me of Pauline Wilson’s voice, though no restrictions. Well, although this is not the first version, I now have this song in my collection, and Angela Bofill must have performed very well. Thanks in part to the comments I read there, I am very interested in this CD. I agree that some disco numbers sound outdated, but the product and this voice are preparing for it. I remember hearing the original song \"Light of Love\" by Hiroshi Yokokura and Patty Austin on the Quiet Storm radio show. In addition, I have noticed that there is a song in it called \"Light of Love\".","overall":5,"summary":"Finally found my song & so much more!!!!!!","unixReviewTime":1100476800,"reviewTime":"11 15, 2004"}
{"orig_index":39041,"reviewerID":"A31QK41KCQ2S1L","asin":"B000069KB1","reviewerName":"Music Lover \"greatlandini\"","helpful":[6,6],"reviewText":"Angela Bofill's voice reminds me of Pauline Wilson's voice, though there are no restrictions. Some disco music sounds like modern, but the production and this voice are preparing for it.","overall":5,"summary":"Finally found my song & so much more!!!!!!","unixReviewTime":1100476800,"reviewTime":"11 15, 2004"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"This album should't really be analysed too much because it would trivialize the carefree enjoyment I've had listening this album with my cool pals. The music is somewhat \"Strokie\" but it's less dramatic, less girly, less contrived, guitars jangle with inspiration, the message is less serious, and honestly these guys are cool genuine rockers who don't \"try to impress\" nor do they come off looking like a 'Boyz-Band' like The Strokes. Another thing that makes this band unique, there's a black guy in the band. it's about time that indie rock music open up to miniorties.","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"There certainly should not be too much analysis on this album, as it will lessen the careless pleasure of listening to this album with my cool friends. The music is a little \"Strokie\", but not so much, not so much girl, not so real, the guitar is full of inspiration, the message is not so deep, honestly, these people are cool rock musicians. \"Try to leave people behind Meaning\", not \"Boyz-Band\" which looks like The Strokes. Another thing that makes this group special is that there is a black person in the group. It is time for indie rock music to be open to children.","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"Music is a little \"Strokie\", but it's not very vibrant, it's not a girl, it's not true, the guitar is full of encouragement, the message in't serious, honest, these guys are really cool rock musicians, They don't try to \"impress people\", and they don't look like us \"it's a band boy\" like The Strokes. Another thing that makes this group special is that there is a black person in the group. This album really does't need much analysis, because it will diminish the carefree enjoyment of listening to this album with my cool friends. It is time for indie rock music to be open to children.","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":39730,"reviewerID":"AXWMB2P548KLG","asin":"B00006JSIU","reviewerName":"Leclerk","helpful":[1,3],"reviewText":"Music is a little \"Strokie\", but it's not weird, it's not girlish, and it's not real. Stroke is very entertaining by rock musicians, they don't try to \"touch people\" composed to enjoy the carefree friends. The music is a bit \"Strokie\", but it's not weird, it's not girlish, it's not very real, the guitar is full of inspiration, the message is not sincere, honestly.","overall":5,"summary":"Fun Times Without Even Tryin'","unixReviewTime":1071100800,"reviewTime":"12 11, 2003"}
{"orig_index":40107,"reviewerID":"A68GUAHPBDUN","asin":"B00006ZCFH","reviewerName":"Andrew Jacob","helpful":[23,31],"reviewText":"I think Erykah Badu says it best: \"Back in the day when things were cool\"After the success of \"Love of my life [an code to ship shop]\" off the \"Brown Sugar\" Soundtrack, Ms. Badu comes back with her third studio offering, World Wide Underground. Erykah Badu was always known to reinvent herself from each album, almost her way of showing you that she's growing. Well. Maybe she grew too much, because this EP is in many ways a disappointment. One of the main problems that affect this album is the lyrics. The lyrics to \"I Want You\", although has it's guilty-pleasure of a rhythm, becomes very repetitive. Another problem lies in this new style of Erykah's. Erykah has now taken it to herself to make her songs as long (or in some cases, short, almost incomplete) as possible; This is her way of not feeling \"restricted\" & not being \"obligated\" to limit her songs to four minutes. \"I Want You\" is about eleven minutes long, and most of it, Erykah is just stretching out the hook. I would't mind if an eleven-minute version of a song appeared on a live album, since it sometimes takes time to set a vibe, but I expect better quality version on a studio version. The major problem is the length of the album as a whole. Excluding the pointless intro & outdo, \"World Keeps turning'\", this album only contains weight tracks: \"Think Twice\" is basically a filler, \"Love of My Life Worldwide\" is a horrible, and unnecessary remix, & \"Steady on the Grind\" sounds like the Mone (of Dead Prez) version of Me'Shell NdegéOcello's \"Dead N**** Blvd.\", just with Erykah singing the hook. \"Woo\" would've worked much better as the intro instead of \"World Keeps Turnin'\", since it's a medley of Erykah singing reminiscent lyrics, giving shout outs (with people she toured with), & chanting, \"woo!\" And although I do like the song \"Danger (Block On Lock)\", there something in me that wants to hate it, because this is yet another song where Erykah tries to remind us of her debut, \"Baduizm\"; On Mama's Gun, There is the track \". & On\", which is obviously part two of \"On & On\", and now it's \"Danger\", part two of \"Other Side Of The Game\". It's a little immature, and I'm beginning to think that Erykah can't let go of her past. She should take her own advice: No Turning Back (\"My Life\", Mama's Gun)But there is one song I like very well; the funky \"Bump It\" (although she some-what ruins it with the unnecessary echoing-vocal-harmonizing at about five:thirty-five, the song is weight:fifty-one)When it comes down to it, Erykah slacked off on this album, especially with the lyrics. She has this new \"let things flow\" attitude that just in't cutting it. The only good tracks are \"Bump It\", \"Woo\", & \"Danger\". They all possess that Funk. but they're not even all that great, aightt-at best. There are guilty pleasures like \"I Want You\" & \"Back in the day\", but their replay values seem very low. It seems that all the songs with at least a bit of substance are the shortest, while the low quality tracks seem to last forever. Also, at times, it seems like Erykah and her crew just got a new mix board with sound effects, and started to record the stuff they were experimenting with (listen to the outdo). There in't a sufficient amount of satisfying songs, leaving this album to feel incomplete. Still, Erykah Badu is very talented, and if you want to hear her best works, get \"Mama's Gun\"","overall":3,"summary":"&quot;Think Twice&quot;","unixReviewTime":1063929600,"reviewTime":"09 19, 2003"}
{"orig_index":40107,"reviewerID":"A68GUAHPBDUN","asin":"B00006ZCFH","reviewerName":"Andrew Jacob","helpful":[23,31],"reviewText":"I think Erykah Badu puts it better: \"Back to those good days\" after the success of \"Love of my life [shipping code]\" on the soundtrack \"Brown Sugar\", madam. Badu is back with this third studio production, World Wide Underground. Erykah Badu has always been known for are-enacting herself throughout the album, this is almost a way for her to show that she is growing. That's OK. You probably grew up fast, because this EP is disappointing in so many ways. One of the main issues affecting the album is verbal. The words \"I Want You\" have a guilty rhythm, but are very repetitive. Another problem is the new style of Erykah. Erykah has now decided to make her songs as long as possible (or in some cases, shorter and almost incomplete); this is how the feels “restricted” and “forced” to reduce this songs to four minutes. \"I want you\" about eleven minutes long, and most of the time, Erykah just pulls out the link. I don’t even care if the eleven-minute version of the song comes from a live album, because sometimes it takes time to create the atmosphere, but I hope the quality of the studio version is better. The main problem is the length of the entire plate. With the exception of meaningless intro and outgoing, \"The World Keeps Turning\", this album contains only the hardest songs: \"Think twice\" is basically a filler, and \"Love of My Life Worldwide\" is a bad and unnecessary mix. \"It sounded like Mone (Dead Prez) 's version of\" Dead N **** Blvd. \"by Me'Sll Ndegé Ocello, but Erykah sang the hook. unforgettable, shouting (people who travel with him), and shouting \"woo!\" \"Baduizm\"; in Mother's Gun On the previous page, there is a trail \". & On \", obviously the second part of\" On & On \", now\" Danger \", the second part of\" The Other Side of the Game \". am \", Mama's gun) but there's a song I really like;\" Bump It \"(although she used the unwanted Echo and the stone of the voice was depressing, the complexity of the song: fifty-one) new songs called \"Let Things Go As They Are\", which is impossible. Only good songs \"Bump It\", \"Woo\" and \"Danger\". They all own that Funk. But it's not so good, it's better. and \"Back to Time\", but their repetition value seems low. It seems that all songs with a small volume are the shortest, while low-dose vaccines seem to last forever. In addition, sometimes Erykah and her staff seem to have just acquired a new mixing board with sound and have started recording what they are trying to do (expiring). The number of satisfying songs is not enough to make this album feel incomplete. But Erykah Badu is still very talented. If you want to listen to this good works, take \"Mother's Gun\"","overall":3,"summary":"&quot;Think Twice&quot;","unixReviewTime":1063929600,"reviewTime":"09 19, 2003"}
{"orig_index":40107,"reviewerID":"A68GUAHPBDUN","asin":"B00006ZCFH","reviewerName":"Andrew Jacob","helpful":[23,31],"reviewText":"to exclude meaningless intro and outdo, \"World Keeps turn\", which contains only Weight's song: \"Think twice\" basically. to fill you in, \"The Love of My Life Worldwide\" is a bad and unnecessary mix, \"Stable in cutting\" sounds like Me'Shell Ndegé Ocello's \"Dead\" Mone (Dead Prez) version N *** She'll have to accept her opinion: No turning (\"My Life\" , Mom's gun) but there's a song I like; of the fashion \"Beat It\" (although it has damaged it) Unwanted sound and voice adjustment about five.thirty-five, song weight: fifty-one) In the final analysis, Erykah relaxed on this album, especially the lyrics. \"Woo\" could be used as an introduction instead of \"The World Saves Turnin\" because it is a mixture of Erykah singing funny words, shouting (people travelling with her) and shouting \"Wow!\" ugh I love this song \"Danger (Block On Lock)\", there is something in my heart that I want to hate because this is another song of Erykah trying to remind us for the first time \"Baduizm\"; In Mom's Gun, There's a song \". & In\", which is clearly the second part of \"On & On\", now \"Danger\", the second part of \"The Other Side of the Game\". I think Erykah Badu puts it well: \"Back to those cool days\" After the success of \"My Life's Love [distribution code]\" in the original \"Brown Sugar\" soundtrack, Ms. Badu took her back to the third studio. products, World Wide Underground. Only good songs are \"Bump It\", \"Woo\" and \"Danger\".","overall":3,"summary":"&quot;Think Twice&quot;","unixReviewTime":1063929600,"reviewTime":"09 19, 2003"}
{"orig_index":40107,"reviewerID":"A68GUAHPBDUN","asin":"B00006ZCFH","reviewerName":"Andrew Jacob","helpful":[23,31],"reviewText":"The only good songs are \"Bump It\", \"Woo\", and \"Danger\". No songs are satisfying enough. I feel that this album is not perfect. However, Erykah Badu is very talented.","overall":3,"summary":"&quot;Think Twice&quot;","unixReviewTime":1063929600,"reviewTime":"09 19, 2003"}
{"orig_index":45517,"reviewerID":"A3W0POMI33YQXQ","asin":"B0001MDPQ8","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[2,3],"reviewText":"I never really was a fan of Lil Flip. When I first heard `The Way We Ball', I thought it was wack and I was indiffent to Undaground Legend. Then the was featured on a couple albums such as Mississippi and Da Unbreakables, but this appearances were't amazing to me. He was just sorta there. To me the's not a great lyricist but the can at times be witty. Wit can carry you a far ways in the music industry. Anyway I felt that the was listenable but did't really have anything to say except for braggadocio and ghetto stories. But that's fine the has this place. However, that changes on this album as the churns out some great verses. His beats are tight, the has flow, and the has the \"it\" factor. Meaning the has some quality about him that makes people like him, makes people want to listen to him. and at the time I can't pinpoint exactly what it is. Maybe it's this swagger and confidence for it could be this Texas style sound for maybe it's the fact that the freestyles most of this songs. Whatever it is the has star like quality. Anyways Lil Flip delivers on the album. The beats are off the frigging chain. Nearly every song rides out. Tight. Lil Flip on the mic sounds like a seasoned veteran spitting fire most of the time. Sometimes the tends to spit some garbo but the makes up for it in flow and poise. He's just a cool character as experienced by this party tracks `Game Over' and `Ain't No Party'. I like this choruses as well. I also like how the lets the beat ride out at the send of each song. Of the whole two disc set NOT ONE SONG is plain out wack for unlistenable ( except for the screw songs simply cause I don't like screw music). There's not a song that makes you say `What is This?!\" and hit the fast forward button. My favourite songs include `I Came To Bring The Pain', Represent, Bounce, Game Over, Dem Boyz, Ain't No N, U Neva Know, and Ain't No Party. Lil Flip is, as the title suggests, somebody you have to feel. Either you'll like him for you won't. I have a feeling that this cd will grow to be one of my favourites of the year and maybe never. That's saying a lot. I highly recommend this cd to any fan of ship shop. five stars.","overall":5,"summary":"U Neva Know....Somebody Might Be Rocking Yo (Girl)","unixReviewTime":1083628800,"reviewTime":"05 4, 2004"}
{"orig_index":45517,"reviewerID":"A3W0POMI33YQXQ","asin":"B0001MDPQ8","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[2,3],"reviewText":"I never became a Lil Flip fan. When I heard “The Way We Were Football” for the first time, I thought it was shocking and I did’t care about the Undaground Story. It then appeared on many albums, such as Mississippi and Da Unbreakable, but this look does't surprise me. He just exists. To me, this is not a big song, but it can be clever at times. The plan is to move you forward in the music industry. In any case, I think this makes sense, but apart from bragging and the stories of the shack, nothing can be said. But this is good, there is this place. However, the text of the disc has changed with the result that it produces some excellent text. His beat is very strong, there’s a movement, and there’s something that says “it”. This means that the has certain qualities that endear him to people and that move him to listen to them. At the time I could’t really figure out what exactly it was. Maybe this is swagger and self-confidence, because it could be a Texas-style voice, maybe it’s because most of the freestyle song. Whatever the case, it has the same characteristics as the stars. In any case, Lil Flip gave it to the record. Beat ended in link. Almost every song will be heard. Strengthen. The Lil Flip on the microphone sounds like an experienced veteran in most cases. Sometimes it likes to spray garbo, but it does make for mobility and balance. She is a cool character due to the party songs \"Over Game\" and \"No Value\". I love it with this chorus. I also like the way the rhythm disappears when each song is sent. On all two discs, NO ONE SONG is a bit unfamiliar (other than a screw song because I don't like screw music). No song makes you say \"What is this ?!\" and press the fast forward button. My favourite songs include \"I'm Here To Come With The Pain\", Representation, Piercing, Game Transfer, Dem Boyz, Not N, Neva Know, and Ain't No Party. As the title suggests, Lil Flip is someone you need to hear. Or you will love him, because you will not love him. I feel like this cd will grow into one of my favourite songs this year, maybe never. This means a lot. I highly recommend this CD to all ship shop fans. Five stars.","overall":5,"summary":"U Neva Know....Somebody Might Be Rocking Yo (Girl)","unixReviewTime":1083628800,"reviewTime":"05 4, 2004"}
{"orig_index":45517,"reviewerID":"A3W0POMI33YQXQ","asin":"B0001MDPQ8","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[2,3],"reviewText":"My favourite songs include \"I'll Bring In The Pain\", Mela, Bounce, Game Over, Dem Boyz, Ain't No N, Neva Know, and Ain't No Party. On all two discs, there is no song that is completely obscure (other than a screw song because I don't like screw music. It has a rhythmic rhythm, rhythm, and something like \"it\". cool. Yes, the experience of this organization is \"the game is over\" and \"not outside the team.\" As the title suggests, Lil Flip is a must-feel.","overall":5,"summary":"U Neva Know....Somebody Might Be Rocking Yo (Girl)","unixReviewTime":1083628800,"reviewTime":"05 4, 2004"}
{"orig_index":45517,"reviewerID":"A3W0POMI33YQXQ","asin":"B0001MDPQ8","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[2,3],"reviewText":"No song has yet to be fully heard. over game 'And it's not that no team' in't the song that tasks you to say what is this? and press the fast forward button. so the plate. When \"The Game Is Over\" \"When I appeared, I really liked him, even though DJ Clue found out that Game Over was defeated a few years ago. It was normal and just released another one. ninety-five% of the sounds of the paper wrap? Lil Flip is part of that percentage., although DJ Clue was a few years old The previous Game Over Beat is normal. Either way, it's hot. such an album. single let me go out and get it. This album. In general, I only listen to Sunshine and it is only appropriate to download singles. I like to skip a ship, but in my opinion it is not a skipping ship. Lil Flip is a percentage.","overall":5,"summary":"U Neva Know....Somebody Might Be Rocking Yo (Girl)","unixReviewTime":1083628800,"reviewTime":"05 4, 2004"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"I think I might be the minority there, I actually like this one better than this first album. Cincotti simply sings much better now. Although this voice still does't quit grab me, maybe the should focus more on this piano solo, the surely can play piano quite well. And add some spark. For this young page, I would expect more energy.","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"I think I could be one of the few people out there, and I like this album better than the first album. Cincotti sings better now. Although the sound is not quite right, I will probably have to pay more attention to the piano, and I will definitely play the piano better. And add some sparks. On this small page, I look forward to more energy.","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"\"Cincotti sings better now,\" said the singer. \"Maybe more attention should be paid to this solo piano\" \"On this small page, I hope you have a lot of energy\"","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46615,"reviewerID":"A2GU72RZHYA9TR","asin":"B0002MPU1K","reviewerName":"outsidelookingin","helpful":[6,7],"reviewText":"I think I may be one of the few there, and I like this album better than the first album. In this new page, I look forward to more energy. Cincotti sings much better now. Add some sparks.","overall":4,"summary":"Delightful","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"I BOUGHT MY FIRST CAM CD TODAY! PURPLE HAZE! HE IS SO SEXY! I LOVE THIS CD!five STAR *****","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"I bought my first CAM CD today! Purple mist! You are charming! I love this CD! Five stars *****","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"I bought my first CAM CD today! IPH","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":46893,"reviewerID":"A3UMY7W5AUQQH3","asin":"B0002TL6QQ","reviewerName":"pankysweet","helpful":[0,2],"reviewText":"I love this CD! Five stars ***** I bought my first CAM CD today! Purple mist! You are very interesting!","overall":5,"summary":"CAM'RON DID THAT!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":48499,"reviewerID":"A2PBH7IXBD6FZ2","asin":"B0007NFL18","reviewerName":"Alejandro Ramirez \"Diggidy\"","helpful":[5,5],"reviewText":"I will admit, I did like fifty Cent when the first came upon the scene. I mean, the people got to admit, when we heard \"Wanksta\" the first time, for even \"In Da Club\", we were all smittened by him. Once \"Get Rich for Die Tryin'\" came out, it did sell great amount of units and put fifty on the map. However, the still shadows this producestors (Dr. Dre & Eminem). His beef with Ja Rule became so ridiculous that everyone agreed with him on the fact that Ja was a fake. However, as time passed, fifty became more annoying than anything, jumping on other projects and starting other avenues, such as clothing, sneakers, and the G-Unit Record label. However, the claims that the is not like Ja Rule at all, in any way. But, once I heard \"The Massacre\", that is exactly what the title stated, a massacre. The album showed no growth in this lyrical ability for this depth. More of the songs were about just partying for shaking @#$!$, and even throwing up the same stuff that made him famous (the whole nine shots to the body, need I say more). Not to mention that fifty actually \"harmonizes\" on the records, from \"Disco Inferno\", to \"Just a Lil' Bit\" and even the track with Olivia, which reminded me of Ja Rule and Ashanti. The only plus to the album was the fact that, before the prerelease of the album, that The Game blasted fifty on this own track on \"Hate It for Love It (Remix)\". Not to mention the production from Dr. Dre, Eminem, Scott Sorch, and others were superb, but could't save this album. Overall, The Massacre is not worth buying, for not even downloading. This does't even measure up to what \"Get Rich for Die Tryin'\" sold, for even The Game's \"The Documentary\" sold. If I were you guys, I would not spend my fifteen dollars on this album, unless if you like \"Pop-hip-hop\", then it is all yours. Damn, it is even bad that I even gave chime two stars for this album, it is not worthy to even get two stars. OOOOOO! Don't get me started on G-Unit! No more comments!","overall":2,"summary":"50 Needs a Doctor, Literally!","unixReviewTime":1134518400,"reviewTime":"12 14, 2005"}
{"orig_index":48499,"reviewerID":"A2PBH7IXBD6FZ2","asin":"B0007NFL18","reviewerName":"Alejandro Ramirez \"Diggidy\"","helpful":[5,5],"reviewText":"I agree that when it first appeared, I liked fifty cents. I mean, people have to admit that when we first heard “Wanksta”, and even “Da Club”, we were all interested in him. Once launched, \"Get Rich on Die Tryin\" sold a large number of units and put fifty on the map. However, the reputation of this producer (Dr. Dre & Eminem) remains. His argument with Ja Rule has become so absurd that everyone agrees that Ja is a liar. However, over time, the fifty became more angry than anything else, jumping on other projects and launching other methods, such as clothing, it-shirts and G-Unit Records. However, the claim is not the same as Ja Rule in any way. But when I heard the \"Holocaust\", that's exactly what the title, the Holocaust, really means. The album did not show the growth of this serious musical talent. More songs go to circles just to move # # $! $, And the pulled out the same thing that made him famous (all nine punches are in the body, I have to say more). Not to mention that Fifty really “coordinated” the record, from “Disco Inferno” to “Just Lil’Bit” and Olivia’s songs, reminding me of Ja Rule and Ashanti. The only advantage of this album is that, prior to the release of the previous album, the Game made a fifty-point impression on its song “Hate It for Love It (Remix)”. Moreover, the productions of Dr. Dre, Eminem, Scott Sorch and others are good, but they cannot keep this record. In general, Homicide is not necessary to purchase, for transfer. This is not the same as the \"get rich quick\" had, even if the \"document\" of the Game has already been sold. If I were you, I would't spend my fifteen dollars on this album, unless you like \"Pop-hip-hop\", then it's yours. Damn, even worse if this album is given two stars, neither of them deserves it. Oh ooh ooh! Don't let me start using G-Unit! No more comments!","overall":2,"summary":"50 Needs a Doctor, Literally!","unixReviewTime":1134518400,"reviewTime":"12 14, 2005"}
{"orig_index":48499,"reviewerID":"A2PBH7IXBD6FZ2","asin":"B0007NFL18","reviewerName":"Alejandro Ramirez \"Diggidy\"","helpful":[5,5],"reviewText":"However, over time, fifty became more annoying than anything else, and jumped on other projects and started other alternatives, such as clothing, sports shoes, and G-Unit Records. I mean, people have to admit that when we first heard “Wanksta”, and even “Da Club”, we were all interested in him. Not to mention that Fifty really “coordinated” the record, from “Disco Inferno” to “Just Lil’Bit” and Olivia’s songs, reminding me of Ja Rule and Ashanti. What's more, the productions of Dr. Dre, Eminem, Scor Sorch and others are good, but they can't keep this album. If I were you, I would't spend my $ fifteen on this album, unless you like \"Pop-hip-hop\", it's yours. But when I heard \"Holocaust\", that's exactly what the title, the Holocaust, really means. The only advantage of this album is that, prior to the release of the previous album, Game made a sense of fifty points in their song “Hate It for Love It (Remix)”.","overall":2,"summary":"50 Needs a Doctor, Literally!","unixReviewTime":1134518400,"reviewTime":"12 14, 2005"}
{"orig_index":48499,"reviewerID":"A2PBH7IXBD6FZ2","asin":"B0007NFL18","reviewerName":"Alejandro Ramirez \"Diggidy\"","helpful":[5,5],"reviewText":"\"Genocide\" is not eligible for purchase, nor for download. The album did not grow in this deep musical ability. Chime gave the album two stars, neither of them deserved it.","overall":2,"summary":"50 Needs a Doctor, Literally!","unixReviewTime":1134518400,"reviewTime":"12 14, 2005"}
{"orig_index":51111,"reviewerID":"A1L36BMCCFFE1W","asin":"B000BLI4UG","reviewerName":"LyricalPoet23","helpful":[1,2],"reviewText":"I think I've probably listened this album over fifty times now. Simply Incredible. I love practically every cut on this album, especially the three versions of Carter II (particularly Fly In, home dude is insane.) I remember back in the day i did't really like wayne too. I guess join to part school improves your flow. I also like how a lot of tracks on this album are different from your everyday wrap album. \"Mo Fire\" with the reggae feel, and \"shooter\" with. i don't even know how to describe it. Ironically my least favourite track is this first single \"fireman.\" Dude's lyrical ability definitely improved tho, i mean, going from lyrics of \"bling bling\" to \"in the clouds where the thunder's crying\" is a huge jump.","overall":5,"summary":"Favorite album of the year so far","unixReviewTime":1146787200,"reviewTime":"05 5, 2006"}
{"orig_index":51111,"reviewerID":"A1L36BMCCFFE1W","asin":"B000BLI4UG","reviewerName":"LyricalPoet23","helpful":[1,2],"reviewText":"I think I would have listened to this album more than fifty times now. It's unbelievable. I love almost every clip on this album, especially the three versions of Carter II (especially Fly In, man is crazy.) I remember that day I did't like Wayne very much. I think joining other schools can improve your system. I love that most of the songs on this album are different from your daily albums. \"Mo Fire\" has a reggae feel, which matches the \"Shooter\" perfectly. I don't even know how to explain it. Surprisingly, my favourite song is the first \"firefighter\". Dude's singing ability has really improved. I mean it was a big jump from the words \"bling bling\" to the words \"Clouds cry in thunder\".","overall":5,"summary":"Favorite album of the year so far","unixReviewTime":1146787200,"reviewTime":"05 5, 2006"}
{"orig_index":51111,"reviewerID":"A1L36BMCCFFE1W","asin":"B000BLI4UG","reviewerName":"LyricalPoet23","helpful":[1,2],"reviewText":"Dude's songs are really good. I mean, it's a big jump from the words \"bling bling\" to \"thunder clouds\". \"Fire\" has a reggae feel, complementing the \"Shooter\" perfectly. I almost liked every clip on this album, especially the three versions of Carter II (especially Fly In, man is crazy.) I love that most of the songs on this album are different from your daily pack album. Surprisingly, my favourite song is the first \"firefighter\". I think I would have listened to this album more than fifty times now. I remember I did't like Wayne that day.","overall":5,"summary":"Favorite album of the year so far","unixReviewTime":1146787200,"reviewTime":"05 5, 2006"}
{"orig_index":51111,"reviewerID":"A1L36BMCCFFE1W","asin":"B000BLI4UG","reviewerName":"LyricalPoet23","helpful":[1,2],"reviewText":"can's john butter may have listened to the disc more than fifty times. Butter: I love almost every clip on this album, especially the three versions of Carter II. Surprisingly, my favourite song is the first \"firefighter\"","overall":5,"summary":"Favorite album of the year so far","unixReviewTime":1146787200,"reviewTime":"05 5, 2006"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"Some cats at my workplace told me this was good. They played it for me and I was hooked. It is a nice mix of electronics and rock music. The groove of the music is catchy and the sound is alluring. i recommend it. I have heard other albums by them which are good as well. I do not think they have anything that is bad.","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"Some cats in my workplace have told me this is okay. They played me and I was fascinated. This is the perfect combination of electronic music and rock music. The rhythm of the music is captivating, and the sound is tempting. I recommend it. I’ve listened to some of their albums and they’re not bad. I don't think there's anything wrong with them.","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"This is the perfect combination of electronic music and rock music. I’ve listened to some of their albums and they’re not bad. I don't think there's anything wrong with them.","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":52629,"reviewerID":"A32Y785UUJ2GOG","asin":"B000FVQYYK","reviewerName":"ME","helpful":[1,2],"reviewText":"Some cats in my workplace told me it was okay. They played me crazy. This is the perfect combination of electronic music and rock music. The rhythm of the music is very attractive, the sound is very attractive","overall":5,"summary":"An enjoyable listen.","unixReviewTime":1260230400,"reviewTime":"12 8, 2009"}
{"orig_index":53287,"reviewerID":"A2XZLC7FU3HUMP","asin":"B000ICM5QW","reviewerName":"John D. Williams \"John\"","helpful":[2,4],"reviewText":"This CD is so good it almost outdoes Be Here. which is hard to do. but the versitallity of this CD makes it what it is. AMAZING! BUY IT","overall":5,"summary":"Another Grammy Winner!","unixReviewTime":1162857600,"reviewTime":"11 7, 2006"}
{"orig_index":53287,"reviewerID":"A2XZLC7FU3HUMP","asin":"B000ICM5QW","reviewerName":"John D. Williams \"John\"","helpful":[2,4],"reviewText":"This CD is so beautiful, it's almost over there. This is hard to do. But the versatility of this CD makes it what it is. It's amazing! Buy","overall":5,"summary":"Another Grammy Winner!","unixReviewTime":1162857600,"reviewTime":"11 7, 2006"}
{"orig_index":53287,"reviewerID":"A2XZLC7FU3HUMP","asin":"B000ICM5QW","reviewerName":"John D. Williams \"John\"","helpful":[2,4],"reviewText":"This CD is very good, almost surpassed Be Here. But the versatility of this CD does exactly what it is. This is hard to do. It's amazing!","overall":5,"summary":"Another Grammy Winner!","unixReviewTime":1162857600,"reviewTime":"11 7, 2006"}
{"orig_index":53287,"reviewerID":"A2XZLC7FU3HUMP","asin":"B000ICM5QW","reviewerName":"John D. Williams \"John\"","helpful":[2,4],"reviewText":"This CD is very good and will be coming soon. which is hard to do. but the diversity of this CD makes it what it is. KAGANDAHAN! BUY","overall":5,"summary":"Another Grammy Winner!","unixReviewTime":1162857600,"reviewTime":"11 7, 2006"}
{"orig_index":54326,"reviewerID":"ARWFZ5QJI051S","asin":"B000NVIXFK","reviewerName":"J. Niss","helpful":[5,8],"reviewText":"i was never a fan of Rush. then i heard the covers thing they did of sixty's songs. incredibly well done versions. then i saw a clip of them playing live recently. incredibly tight. very talented.then i heard the honest song on this album!!! amazing stuff, but would the rest of it hold up? so i bought it yesterday. put it on in the car, confirmed that my reaction to cut #one was't a fluke and, incredibly, found every one of the next three as incredible! saved the rest for today and sure enough every cut is THAT good. hot dang! this is gonna stand as tall as who next and the honest few keep albums. i kid you not, that how good it is. a classic, best of the year, probably best straight ahead rock album of the decade so far. weird cause that would make it the greatest rock album of the millennium and that might start to sound like i'm overstating my case. but still. i'm not. this smokes ninety% of my collection.","overall":5,"summary":"killer album. one of the best rock albums ever recorded*****","unixReviewTime":1178496000,"reviewTime":"05 7, 2007"}
{"orig_index":54326,"reviewerID":"ARWFZ5QJI051S","asin":"B000NVIXFK","reviewerName":"J. Niss","helpful":[5,8],"reviewText":"I have never been a Rush player. Then I heard sixty of their songs. It’s a pretty amazing version. Then I saw a clip of their recent broadcast. He stands miraculously. She is very talented. Then I heard a song of sincerity on this album! ! ! Good stuff, but can others be supported? I bought it yesterday. Put it in the car and make sure my reaction when I cut # one was not a virus, and, unbelievably, I found out that each of the following was incredible! Keep the rest of today, and of course, all cut right. too hot! This will keep the record high as the next few are honest. I did not lie to you, this is good. Classical, best of the year, and probably the best rock album of the decade to date. For some strange reason it makes it the biggest rock album of the millennium, which may sound like I'm exaggerating my situation. But still. I'm not. This is ninety% of my collection.","overall":5,"summary":"killer album. one of the best rock albums ever recorded*****","unixReviewTime":1178496000,"reviewTime":"05 7, 2007"}
{"orig_index":54326,"reviewerID":"ARWFZ5QJI051S","asin":"B000NVIXFK","reviewerName":"J. Niss","helpful":[5,8],"reviewText":"Put it in the car, confirming that the way I responded when I cut #one was not fluke, and, incredibly, I found that each of the following three was incredible! Classical, best of the year, and probably the best rock album of the decade to date. Unusual reasons make it the largest rock album in the millennium, which may sound like an exaggeration to my situation. Keep the rest of today, and of course, all cut right. She is very talented. Then I heard a song of sincerity on this album! ! ! This will keep the record high as the next few are honest. I'm not flying to you, how beautiful this is.","overall":5,"summary":"killer album. one of the best rock albums ever recorded*****","unixReviewTime":1178496000,"reviewTime":"05 7, 2007"}
{"orig_index":54326,"reviewerID":"ARWFZ5QJI051S","asin":"B000NVIXFK","reviewerName":"J. Niss","helpful":[5,8],"reviewText":"\"Obviously this is important\" is a week, another can tech network project. This is the oldest and most direct rock album in the last decade. Jarrett said this did not exaggerate, but it did not.","overall":5,"summary":"killer album. one of the best rock albums ever recorded*****","unixReviewTime":1178496000,"reviewTime":"05 7, 2007"}
{"orig_index":55808,"reviewerID":"A2D7LL1KMNT040","asin":"B0013FDTYA","reviewerName":"RickyVoorhees","helpful":[0,2],"reviewText":"This album is crazy. I love it! Snoop was on one when the made it. . .","overall":5,"summary":"Ego Trippin","unixReviewTime":1205280000,"reviewTime":"03 12, 2008"}
{"orig_index":55808,"reviewerID":"A2D7LL1KMNT040","asin":"B0013FDTYA","reviewerName":"RickyVoorhees","helpful":[0,2],"reviewText":"This album is very Crazy. I love it! Snoop was one of them when it was made. .","overall":5,"summary":"Ego Trippin","unixReviewTime":1205280000,"reviewTime":"03 12, 2008"}
{"orig_index":55808,"reviewerID":"A2D7LL1KMNT040","asin":"B0013FDTYA","reviewerName":"RickyVoorhees","helpful":[0,2],"reviewText":". The plate is crazy. Snoop was one of them when it was made. I love it!","overall":5,"summary":"Ego Trippin","unixReviewTime":1205280000,"reviewTime":"03 12, 2008"}
{"orig_index":55808,"reviewerID":"A2D7LL1KMNT040","asin":"B0013FDTYA","reviewerName":"RickyVoorhees","helpful":[0,2],"reviewText":"Snoop was one of them when it was made. Sno","overall":5,"summary":"Ego Trippin","unixReviewTime":1205280000,"reviewTime":"03 12, 2008"}
{"orig_index":56222,"reviewerID":"A5Y2KX0J3KZ2I","asin":"B0017PB5TW","reviewerName":"Jay Stevens","helpful":[1,1],"reviewText":"Like my title says, I'm slightly disappointed with \"Evil Urges\" but the experience is still enjoyable. However, I'm not necessarily looking for just enjoyable when listening to My Morning Jacket. I have become accustomed to epic journey's that grind at your soul when listening to My Morning Jacket. There in't a lot of that going on with \"Evil Urges\" - but that in't to say this release is bad. That's why I gave it four stars. This is an enjoyable, fun, risky, and entertaining album. That's hard to dispute. But it in't grandiose like the MMJ we have all grown to love. If it was't for \"Touch Me I'm Going to Scream opt two\" I probably would have been forced to give this three stars.","overall":4,"summary":"Slightly disappointed, yet an enjoyable experience","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":56222,"reviewerID":"A5Y2KX0J3KZ2I","asin":"B0017PB5TW","reviewerName":"Jay Stevens","helpful":[1,1],"reviewText":"\" Bad wishes \" interesting The album. It's awesome. However, when I listen to my Morning Jacket, I'm not just aiming for fun. time and again, I have come to the conclusion that this is a valuable disc. There’s enough content that keeps me thinking about it, like “catch up and I’ll shout out first and second place”, “I’m amazed”, “thank you”, “Sec Walkin”, “Aluminum Park”, and the beautiful “Smoking from Shotin”. I think everyone is criticizing this, Yes, artists have a certain responsibility for fans. After all, it is Jones who has supported them and followed them for many years. However, as a singer and songwriter, I sometimes have to follow my heart. The Museum will take you in a certain direction, and you should follow it. I think Jim James has already done this, which makes long-time fans feel unhappy. Many people say that Wilco's album \"Sky Blue Sky\" is a bad record. So far, I think this is the best. Most music fans tend to bring their favourite artists to certain patterns. So, after they released the salty land, astronauts, and air fog, they left these spiritual lovers behind. The feelings are painful and the fans feel betrayed. It happened. It has to happen there. I try to keep my mind open. This album has tested my patience without a doubt. But I really like this album. It does't match \"Z\", but I still give it four stars. I’m not going to argue with people who say this album is “mixed” because it takes time for me to understand some of the songs there. But it worked for me in the send, and now I think it's one of the weight best so far. Each person individually. overall.","overall":4,"summary":"Slightly disappointed, yet an enjoyable experience","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":56222,"reviewerID":"A5Y2KX0J3KZ2I","asin":"B0017PB5TW","reviewerName":"Jay Stevens","helpful":[1,1],"reviewText":"\"Bad Objectives\" is an entertaining, fun, dangerous, and fun album. but it’s not as big as the MMJ we all grew up to love.","overall":4,"summary":"Slightly disappointed, yet an enjoyable experience","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":56222,"reviewerID":"A5Y2KX0J3KZ2I","asin":"B0017PB5TW","reviewerName":"Jay Stevens","helpful":[1,1],"reviewText":"As my title says, I kind of regret the \"Bad Purposes\" but the experience was still enjoyable. This is an interesting, fun, dangerous, and entertaining album. If it was't just \"Touch me, I'll beat the two\" I might have to give the three stars. Nothing more is happening with “Bad Desire” - but that does’t mean this release is bad. However, I don’t have to ask for comfort just when listening to My Morning Jacket. I’m used to the legendary journey of crushing yourself while listening to my jacket in the morning. But it’s not as big as the MMJ that we all love.","overall":4,"summary":"Slightly disappointed, yet an enjoyable experience","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":58403,"reviewerID":"A2OTT4J4JLCL1G","asin":"B002HP8EKE","reviewerName":"C. Gregory \"C. Gregory\"","helpful":[0,6],"reviewText":"Why this was even on my list of items to review, I never downloaded it.","overall":1,"summary":"I have no idea","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":58403,"reviewerID":"A2OTT4J4JLCL1G","asin":"B002HP8EKE","reviewerName":"C. Gregory \"C. Gregory\"","helpful":[0,6],"reviewText":"Why this is on the list of things I want to check, I did not download it.","overall":1,"summary":"I have no idea","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":58403,"reviewerID":"A2OTT4J4JLCL1G","asin":"B002HP8EKE","reviewerName":"C. Gregory \"C. Gregory\"","helpful":[0,6],"reviewText":"I did not download it","overall":1,"summary":"I have no idea","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":58403,"reviewerID":"A2OTT4J4JLCL1G","asin":"B002HP8EKE","reviewerName":"C. Gregory \"C. Gregory\"","helpful":[0,6],"reviewText":"I did not download this","overall":1,"summary":"I have no idea","unixReviewTime":1287187200,"reviewTime":"10 16, 2010"}
{"orig_index":59120,"reviewerID":"A21OCTLQQOTXII","asin":"B003AO1SVS","reviewerName":"Antiquity","helpful":[1,2],"reviewText":"Absolutely a great album in every respect. If you like one Black Keys song, you'll like them all. This album is a bit funkier and soulful than their others, but The Black Keys stay true to their sound and put out another fantastic album. Better than Attack and Release, and as good as Rubber Factory. I cannot understand how some reviewers are longtime fans of the band, and lament how this is a complete new direction and they lost their way. Can anyone think a band seven albums in (counting Chulahoma) that have changed LESS than the Black Keys? Seriously. Play their albums back to back, these songs belong alongside their earlier jones in spirit and sound.","overall":5,"summary":"Fantastic, of course","unixReviewTime":1276473600,"reviewTime":"06 14, 2010"}
{"orig_index":59120,"reviewerID":"A21OCTLQQOTXII","asin":"B003AO1SVS","reviewerName":"Antiquity","helpful":[1,2],"reviewText":"Definitely a good record in every way. If you like the Black Keys song, you'll love it. This album is more fashionable and romantic than any other album, but the Black Keys are true to their word and have released another beautiful album. Better than attacking and releasing, ideally like a rubber factory. Little did I realize that some critics had become the team's long-term supporters, and lamented that this was a brand new approach, closing their way. Who would have thought (including Chulahoma) that the group's seven albums had changed under the Black Keys? deep. Playing their albums in the background, these songs are their previous Jones in spirit and sound.","overall":5,"summary":"Fantastic, of course","unixReviewTime":1276473600,"reviewTime":"06 14, 2010"}
{"orig_index":59120,"reviewerID":"A21OCTLQQOTXII","asin":"B003AO1SVS","reviewerName":"Antiquity","helpful":[1,2],"reviewText":"The Black Keys remained true to their word and released another beautiful album. If you like the Black Keys song, you'll love it.","overall":5,"summary":"Fantastic, of course","unixReviewTime":1276473600,"reviewTime":"06 14, 2010"}
{"orig_index":59120,"reviewerID":"A21OCTLQQOTXII","asin":"B003AO1SVS","reviewerName":"Antiquity","helpful":[1,2],"reviewText":"This album is fashionable and more romantic than any other album. But the Black Keys remained true to their word and released another great album. Who would have thought that the seven band albums have changed under the Black Keys?","overall":5,"summary":"Fantastic, of course","unixReviewTime":1276473600,"reviewTime":"06 14, 2010"}
{"orig_index":60388,"reviewerID":"AVYHWCIW5LNAX","asin":"B004L5D5JI","reviewerName":"M. Mariba \"the teacher\"","helpful":[9,13],"reviewText":"This is a fantastic CD release by the talented Swedish indie pop trio Peter Bjorn & John, titled 'Gimme Some'. The band has reportedly sought out the services of an independent producer for the first time in this album. The result is a well crafted CD, rich in melodies, choruses & harmonies. With the solid tracks\/gems \"Dig A Little Deeper\" (a tracy-tempo, wonderful melody & harmonies) & \"Eyes\" (beautiful guitar improvisation\/syncopation plus great drums), they deserve more than three thumbs up for their efforts! Great tracks in this album include \"Tomorrow Has To Wait\" (great opening track), \"Second Chance\", \"Breaker Breaker\" (great drum\/guitar combination), \"May Seem Macabre\", \"Down Like Me\" (a slow track with great guitar\/bass\/vocal combination), \"Lies\" & \"I Know You Don't Love Me\". Okay tracks include \"(Don't Let Them) Cool Off\" & the rather 'noisy' \"Black Book\". On overall, this is a well crafted CD release, deserving a great applause, a highly recommended CD listening.","overall":5,"summary":"\"A Well Crafted Indie Pop Album!\"","unixReviewTime":1301443200,"reviewTime":"03 30, 2011"}
{"orig_index":60388,"reviewerID":"AVYHWCIW5LNAX","asin":"B004L5D5JI","reviewerName":"M. Mariba \"the teacher\"","helpful":[9,13],"reviewText":"This is an amazing CD called \"Gimme Some\" released by the talented Swedish pop trio Peter Bjorn & John. According to reports, the band sought the services of an independent producer for the first time on this album. The result is a well-crafted CD with rich music, chorus and harmony. With a repertoire \/ solid rock \"Gumba Little\" (singing, beautiful music and harmony) and \"Eyes\" (a great refreshing \/ splash guitar and great drums), their efforts are worth more than a third! Highlights from the album include \"Tomorrow Must Wait\" (big opening song), \"Second Chance\", \"Breaker Breaker\" (big drum \/ guitar combination), \"May Seem Macabre\", \"Down Like Me\" (Slow Music) guitar. \/ bass \/ combination of voice), \"lies\" and \"I know you don't like me\". Outstanding reports include \"(Don't let them) calm down\" and instead \"there's a\" Black Book \"noise. In general, this is a carefully crafted CD release, worthy of warm applause.","overall":5,"summary":"\"A Well Crafted Indie Pop Album!\"","unixReviewTime":1301443200,"reviewTime":"03 30, 2011"}
{"orig_index":60388,"reviewerID":"AVYHWCIW5LNAX","asin":"B004L5D5JI","reviewerName":"M. Mariba \"the teacher\"","helpful":[9,13],"reviewText":"This is an amazing CD release made by the talented Swedish legends Peter Bjorn and John, titled 'Gimme Some'. The group is said to have sought independent producer services for the first time on this album. The result is a well -made CD, rich in rhythm, melody and adaptation. Rocky rock tracks with “deep depth” (tracy-tempo, amazing rhythm and alignment) and “Eyes” (beautiful tuned guitar and big drums), deserve more than three thumbs up and their efforts ! Major tracks on this album include \"Tomorrow Must Wait\" (a big open road), \"Second Opportunity\", \"Breaker\" (drums \/ guitar), \"May Seem Macabre\", \"Down Like Me\" (run slow) with guitar \/ bass \/ mixed sound), “False” and “I know you don’t like me”. OK ways include “(Don’t let them) be cool” and “Black Book” being “loud”. Overall, this is a well-made CD release, worthy of great, highly recommended CD listening.","overall":5,"summary":"\"A Well Crafted Indie Pop Album!\"","unixReviewTime":1301443200,"reviewTime":"03 30, 2011"}
{"orig_index":60388,"reviewerID":"AVYHWCIW5LNAX","asin":"B004L5D5JI","reviewerName":"M. Mariba \"the teacher\"","helpful":[9,13],"reviewText":"This is a great CD released by Swedish indie pop trio Peter Bourne and John, titled 'Game Sim'. The group is said to have hired a freelance producer for the first time for the album. The result is a well-designed CD, full of music, courses and harmony. Solid tracks \/ values ​​such as \"Doug Little Dipper\" (Tracy Tempo, fun and accompanying music) and \"Eyes\" (beautiful guitar \/ sync and beautiful drum development), they captivate more than three people. Deserve thumbs up for their efforts! The best songs on this album are \"Waiting for Tomorrow\" (opening song), \"Second Opportunity\", \"Breaker Breaker\" (good drum \/ guitar combination), \"May Sam Macbury\", \"Down Like Me\", Guitar \/ Bass \/ voice), \"wrong\" and \"I know you don't like me\". Accurate tracks include \"(Don't Let In) Cole\" and \"Black Book\" called 'Noise'. Overall, this is a well-played CD release, with great applause, a highly recommended CD to listen to.","overall":5,"summary":"\"A Well Crafted Indie Pop Album!\"","unixReviewTime":1301443200,"reviewTime":"03 30, 2011"}
{"orig_index":61159,"reviewerID":"A92F571Y9MTW6","asin":"B005I4UM1K","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"Back in one thousand, nine hundred and eighty-one, Prince started to branch out in this career to work with other artists. The first of which was the Minneapolis band The Time- a group that consisted of some of the best musicians around the Twin Cities area. He got them signed to Warner Bros. Records, where they would release their self-titled debut \"The Time\". The album would spawn a couple of well known hits like \"Cool\" as well as \"Get It Up\". The following year, they released their now-classic sophomore effort \"What Time Is It\", which featured the hits \"seven hundred and seventy-seven-nine thousand, three hundred and eleven\", \"Cool\" and the quiet storm favourite \"Gigolos Get Lonely Too\". By the time they released their third album \"Ice Cream Castle\", Jimmy Jam & Terry Lewis were fired from the band and Monte Moir would leave shortly thereafter. They were replaced with newcomers Mark Cardenas, Paul \"St. Paul\" Petersen and Jerry Hubbard. Despite gaining the biggest hit of their career with \"Jungle Love\", they decided to call it a day in early one thousand, nine hundred and eighty-five. Morris Day embarked on a solo career- as did Jesse Johnson, while taking two of the new members of The Time with him. Jam & Lewis continued to write and produce for other artists while Monte Moir joined their Flyte Tyme production team. The remaining lineup (Jellybean Johnson, Jerome Benton and Paul Petersen) were folded into Prince's newest creation The Family. In one thousand, nine hundred and ninety, they reunited for their next album \"Pandemonium\"- a project that was devoid of Prince's influence save for being released on this Paisley Park record label. After twenty years, the original lineup reformed. but there was one small problem. Due to Prince owning the legal rights to their name, they decided to change it to The Original sevenven and released the first album under their new name \"Condensate\". On the new recording Jimmy Jam & Terry Lewis handle most of the production with additional help on a few songs from Jesse Johnson. They start the album off with the song \"Strawberry Lake\", which sounds like a strange fusion of Prince's \"one thousand, nine hundred and ninety-nine\" as well as Sly & The Family Stone's \"Everyday People\". On the title track \"Condensate\", Morris responds to critics who wonder if they still have it. On the first single \"#Trendin'\", they using about their importance in the page of social media. Morris tries to woo a potential girlfriend on \"If I Was Yo Man\" and get sensual on \"Role Play\". They bring in a few rock inspired songs on there, such as female form admiring \"Sick\" and Morris confronting a woman who's hiding her past on \"AYDKMN\". They pay tribute to backstage groupies on \"Toast To The Party Girl\", a song that sounds noticeably similar to Coldplay's \"Viva La Vida\". They bring in the double entendres in full force on \"Cadillac\", and speak of a woman who's infatuated with material things on \"Lifestyle\". The Original sevenven's \"Condensate\" is a listenable album when they are doing what they know best. However, on a few songs, they sound out of place trying to keep up with the times. Still in all, despite the name change nothing has really changed for the band. They still sound sleazy and play funky- something that's been their trademark for thirty years.","overall":4,"summary":"The Time return as The Original 7ven for their new album \"Condensate\"","unixReviewTime":1341705600,"reviewTime":"07 8, 2012"}
{"orig_index":61159,"reviewerID":"A92F571Y9MTW6","asin":"B005I4UM1K","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"In the early one thousand's and nine hundred and eighty-one's, Prince began to get involved in this work with other artists. The first is the Minneapolis Time band - a group made up of some of the best musicians in the Twin Cities region. He asked them to sign with Warner Bros. Records, where they will release their first single titled title. This album will produce some popular songs such as \"Cool\" and \"Get It Up\". The following year, they released their second year single \"What Time Is It\", which included hits \"seven hundred and seventy-seven.ninety-nine, three hundred and eleven\", \"Cool\" and Quiet Storm's favourite \"Gigolos\" who also became bored. When they released their third album \"Ice Cream Castle\", Jimmy Jam and Terry Lewis were fired by the band, and Monte Moir left. They were replaced by rookies Mark Cardenas, Paul \"São Paulo\" Peterson and Jerry Hubbard. Although they achieved great success with their work \"Jungle Love\", they decided to finish it in early nine hundred and eighty-five in one thousand and nine. Morris Day began this career alone — and so did Jesse Johnson, when the took on two new members for the season. Jam & Lewis continued to design and produce other artists, with Monte Moir joining their production team Flyte Tyme. The remaining list (Jellybean Johnson, Jerome Benton and Paul Petersen) were added to the latest Prince. Paisley Park Records, this project does not have the influence of the Prince. Twenty years later, the first line was changed. But there was a minor problem. Since the prince had legal rights to their name, they decided to change it to Original Seven and release it. The first album under the new name \"Condensate.\" On the new record, Jimmy Jam and Terry Lewis managed most of the production and assisted Jesse Johnson with a few additional songs. They started the album with the song \"Strawberry Lake\", which sounds great. as Prince \"Nine Nine Hundred and Nine Hundred\" and Sly & The A rare fusion of the Family Stone \"Daily People.\" In the song \"Condensation,\" Morris responded to critics who doubted they still had it. In the first single \"# Trendin\", they used their importance in social media. Morris tried to attract potential girls to \"If I Were a Man\" and it became sexy in \"Cosplay\". who hides this past in \"AYDKMN\". They pay tribute to the fans of the backstage in \"Toast To The Party Girl\". the spoke of a woman who was very busy with material things in \"Lifestyle\". Original Seven's \"Condensate\" is a sound record when they do what they do. They still sound raw and play fashion — this is a sign of their decades three.","overall":4,"summary":"The Time return as The Original 7ven for their new album \"Condensate\"","unixReviewTime":1341705600,"reviewTime":"07 8, 2012"}
{"orig_index":61159,"reviewerID":"A92F571Y9MTW6","asin":"B005I4UM1K","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"The prince began working with other artists in one thousand, nine hundred and eighty-one. He asked them to sign with Warner Bros. and released their first name \"Time\" the following year. They released their second year work now \"What's Time\", and reunited in the next album \"Pandemonium\" \/ is. >","overall":4,"summary":"The Time return as The Original 7ven for their new album \"Condensate\"","unixReviewTime":1341705600,"reviewTime":"07 8, 2012"}
{"orig_index":61159,"reviewerID":"A92F571Y9MTW6","asin":"B005I4UM1K","reviewerName":"Perverted Alchemist \"music aficionado\"","helpful":[1,1],"reviewText":"The following year, they released their second year book \"What Time\", which included the popular songs \"seven hundred and seventy-seven.seventy-nine, three hundred and eleven\", \"Cool\" and Quiet Storm. Favorite \"Gigolos Get Lonely Too\". They began their album with the song \"Strawberry Lake\", which sounds like a strange reunion of Prince \"Nine Hundred and Nine Hundred and Nine Hundred\" and Sly & The Family Stone's \"Everyday People\". One thousand in nine hundred and ninety, they reunited on their next album \"Pandemonium\" - with the exception of release on Paisley Park Records, this project was not influenced by Prince. They bring rock and rock there. Encouraging songs such as appreciating the feminine nature of \"Sick\" and Morris. facing a woman hiding the past in \"AYDKMN\" They completely introduced the punches to the \"Cadillac\" and talked about another \"Living\" Women who are busy with material things. They paid fans for the backstage \"Toast To The Party Girl\". This song sounds very similar to Coldplay's \"Viva La Vida\". Although they found them with \"Jungle Love\" the biggest success of their career, they decided to finish one thousand, at the beginning of nine hundred and eighty-five.","overall":4,"summary":"The Time return as The Original 7ven for their new album \"Condensate\"","unixReviewTime":1341705600,"reviewTime":"07 8, 2012"}
{"orig_index":61952,"reviewerID":"A234IZP4U2Y0OQ","asin":"B007CKNX28","reviewerName":"Luke \"luke\"","helpful":[3,6],"reviewText":"This cd did not hit me like this others. First thing I noticed off this listen is jack's not doing what the did on other cd's but diving deeper into this music catalogue. The catchy choruses of \"Many shades of black\" for infectious bass of seven nation was not there. What is there are the lyrics and storytelling for your ass and a musician weaving in old I mean old country time blues then current rock in' roll and folk songs done perfectly. Most of the songs on this cd somehow put me in the same mindframe of that song about the Milk man and the boy killing on Carolina Drama. Songs like Poor boy are catchy but some of the songs I actually love best are the jones without the catchy choruses (hypocritical kiss, i'm shaking). Basically this is how the cd hit me. oneMissing pieces caught my year as an uptempo rock in'roll song with a beat that seems a little bit off from catching itself but completely works the beat is very catchy but the's telling a great story that does't blend you to be table to using with the chorus, but listen greatfully. Great song, liked it first listen and it had me thinking the whole album would move in this direction. twoSixteen saltines is that hard fast garage rock (tone similar to fell in love with a girl). This song gives the album that punch and fast space. threeFreedom at twenty-one is him singing in a wrap-like stone that works because of the style of singing voice the uses. It helps to add diversity to the album since the uses a choppy singing voice for most of the cd. fourI'm sure everyone's heard love interruption. Great song. fiveBlunderbuss is somewhat reminiscent of a Led Zepellin song that never was. Jack sings on this song and sings in a talking voice over a grand piano and violin. The melody is hypnotic and folksy. \"doing what two people need is never on my menu,\" that line is award but describes this attitude to me. sixHypocritical kiss starts off like it's gonna be symphonic the way the piano introduces itself with a flushing of the keys it leads up to the epicness of a guy having an argument with this girl about why the's right and she's wrong. This is a song that is needed during a time when so many men want to using apology songs about how men are wrong and stupid. Love this song, it reminds me i'm a man and have the right to be right (haha). sevenWeep themselves starts off with guitars, piano and drums that somehow make me feel like I'm in a western showdown. Jack speaks of beating this girl up in the first line and talks bad about the guys who are suckers for love. He's not really singing in this song, but like announcing in a singing stone things that are about men's feelings of the world and relationships. It's a song that takes a stand about the choice of how men decide to be a specific type of man and what they can expect for consequences. weightI'm shaking makes me feel like I'm trapped in drag time song in the twenty's and seventy's somehow as the describes how a woman makes him feel great and the's shaking from bad nerves. He likens this nervous wreck to leaves on a tree shaking but the's jumping from insecurity and likes it. This is an old time style of song and works for where the rest of the album goes. ninetrash tongue is like a Little Richard song. God only knows when I heard someone sound like little richard (maybe Awol Nation) on that one song. He's telling a song about some monkeys, the breaks into old time piano playing and tambourines. I think i even hear a banjo. This is like some old time Chuck Berry Rock in'roll stuff with Jack growling out blues singing on an rock song. I wanted to hear him scream on this one for have some more fun with it, but it seemed like the was trying to focus on making the song authentic. ten this song starts off like i'm on a carousel but then leads it's way into being a ballad and then reveals itself to be a definite folk song with a banjo for very old guitar a simple piano playing and a catchy as hell chorus. Jack sings and tells the story of a poor boy. This song is an easy going, uptempo, fun song to me. Some of the greatest love songs are the jones that don't praise love for speak of the good side. eleven this song is like an old gospel one thousand, nine hundred and ten song with folk song lyrics. I hate to put it that far back but I listen to a lot of music and this is definitely Jack showing the can take a song from one thousand, nine hundred and ten and somehow bring Queen remnants out then the original jack white somehow turning this into a lullaby. This song works on so many levels. I wish I was smoking, but that past is gone for me. I would like to know what the was smoking to go there with it though. twelveon and on \"sun and the moon never change, they just rearrange,\" parables, philosophies sung in a tenor, a duet partially in harmony, a soft song crooning then changes to somewhat a mix of a jazz, psychedelic rock song. This song just starts to cement the continuity of listenability of the cd that lets you know that no song is going to make it so you don't feel the album. thirteen is probably my favourite because of the very weird harmony the uses. It's jazzy and psychedelic, sorry to say that again but it uses jazz keys and I don't even listen to jazz. it just is. The only thing rock and roll about the song is Jack's singing in the send. This song is a using-a-long song and makes you want to be on the road looking at cornfields and blue skies. The send of the song breaks into a zepellin type rocking out to send the song of with probably one of the most pleasant unique falsetto and harmonies i've heard in a while. Perfect way to send of the cd. To summarize it all I wanted to hear Jack really showcase this vocal range and using steady long notes and harmonies (like many shades of black) instead the used a choppy singing voice most of the time. I wanted to hear choruses from White Stripes Elephants that make you incapable of getting the song out your head. Instead the introduced me to what seems to be a very natural place for him musically, but new to my year. It took a lot of listening until I could hear and love what the was doing. He somehow updated the oldest blues, before Muddy Waters, and brought in himself Jack and one thousand, nine hundred and sixty's seventy's psycadelic era. He left out the eighty's vibe completely that some of this other cd's gave to. Eclectic cd that shows Jack is a musician that has influences but is so educated in music that the is creating, recreating and making style of completely this own. So many of this songs do this that I just have to give him the credit for being one of the greatest musicians out there today. Great masterpiece classic.","overall":5,"summary":"11times i didn' like it 12th time i loved it","unixReviewTime":1335571200,"reviewTime":"04 28, 2012"}
{"orig_index":61952,"reviewerID":"A234IZP4U2Y0OQ","asin":"B007CKNX28","reviewerName":"Luke \"luke\"","helpful":[3,6],"reviewText":"This CD did not impress me like the others. The first thing I noticed in this listening was that Jack did not do what other CDs did, but delved deeper into the music catalog. An attractive chorus of \"many dark shadows\" on the infectious bass of the seven countries is missing. What words and storytelling does your donkey have, a singer weaving in an ancient place I mean the blues of the ancient world, and modern rock songs and folk songs are perfectly made. Most of the songs on this CD somehow remind me of the song about the murder of a boy in Milkman and the play of Carolina. Songs like Poor Boy are lovely, but some of my favourite songs are Jones without the catchy chorus (drinking lies, I shudder). Basically this is how I beat the CD. OneMissingpieces became my fastest rock song this year. The song seems to deviate from it but it works perfectly. Group, but listen carefully. It's a very beautiful song. I love it for the first time listening to it. It makes me think that the whole plate will develop in this direction. TwoSixteensaltines is a kind of heavy and fast rock garage (similar to a girl’s romantic stone). This song brings impact and speed to the album. The freedom of the three when the is twenty-one is that the sings on a folded rock, which works because of the style of singing the uses. It helps to increase the diversity of the disc, as most CDs use continuous singing. Fourth, I believe everyone has heard of the disruption of love. Great song. FiveBlunderbuss is reminiscent of Led Zepellin songs that never appeared before. Jack sings this song and sings with a voice that speaks on a grand piano and violin. The melodies are hypnotic songs and folk songs. “Doing what two people want can never be on my menu,” this sentence is rewarding, but it explains this attitude to me. six The kiss of hypocrisy was like the sound of piano music at first, and the flipping of keys, led to a man arguing with the girl about why she was right and wrong. This song is needed when many men want to show mistakes and stupidity with a song of apology. I love this song, it reminds me that I am a man and I have the right to do it well (haha). SevenWeep started with guitar, piano and drums, which made me feel like I was in the Western Conference. Jack talked about beating up the main girl, and talked about bad things about men who like to suck blood. He did’t really using in the song, but as a reflection of men’s feelings about the world and the relationship to the rock of singing. This is a song about how men decide to be a certain type of person and their expectations for the results. The shivering weight makes me feel like I’m stuck in the songs of the twenty-seven year old, because it describes how a woman makes her feel big and trembling because of bad nerves. He compared the shocking blows to the leaves of a tree, but the jumped for safety and fell in love with it. This is an old style of song, suitable for the whole album. Ninetrash's language is like Richard's little song. God only knows if I heard someone sound like little Richard in that song (probably Awol Nation). He talks about a song about monkeys, which breaks the old piano and tambourine. I think I also heard the banjo. Similar to the music of Chuck Berry Rock in the past, Jack roars and sings the blues in rock songs. I want to hear him shout at this song because it's more fun, but it seems like the's trying to focus on making this song a reality. ten The song started out as if I were in a merry-go-round, but later evolved into a traditional song, revealing that it was a clear traditional song with a very old guitar band, a simple piano composition and an attractive choir. Jack sang and told the story of the poor boy. This song is a relaxed, fast and interesting song for me. Some of the biggest love songs are Jones, and they don’t compliment love by talking about the positive side. Eleven This song is reminiscent of the thousand-year-old gospel, nine hundred and ten songs with folk songs. I don’t want to put it away, but I listen to a lot of music, certainly Jack shows that one can take a song from the one thousand, nine hundred and one song, then somehow take out the rest of the queen and then the first one somehow Jack White turned into a lullaby. The song works on many levels. I wish I had smoked, but that former thing is gone from me. However, I want to know what it means to smoke there. Twelve to'clock and \"Sun and moon will not change, they are just adjusted\", the myth and philosophy are sung in the tenor, part of the duet agrees, a cool song is whispered, and then it becomes a jazz mix. rock songs of the mind. This song is just beginning to blend in with the continuous sound of the CD, informing you that no song will perform, so you will not hear the album. Thirteen is probably my favourite because of the extraordinary harmony used. It’s jazz and psychedelic, I’m sorry to say it again, but it uses the key to jazz and I don’t even listen to jazz. That's it. The only rock music of this song is Jack's song on the release. This song is a very long song, which makes people want to look at the corn field and the blue sky along the way. The posting of this song breaks Zeppelin's style, sending it with one of the most special fests and conventions I've heard in the past. The perfect way to send CDs. All in all, I want to hear Jack really highlight this list and use long notes and harmony (like many black shadows) instead of singing bitterly most of the time. I want to hear the chorus of White Stripes Elephants, so you can't get this song out of your mind. On the contrary, it introduced me to a place where the seemed natural in music, but it was a new year for me. I spent a lot of time listening until I heard and loved what I was doing. He’s a mysterious review of Bruce’s oldest before Muddy Waters, bringing Jack and mental illness in the one thousand, nine hundred and sixtys and one thousand, nine hundred and seventys. He fully remembered the state of the eightys of some CDs. The eclectic cd shows that Jack is an influential but educated musician who creates, repeats this style. Many songs do this, and I have to praise him as one of the leading musicians today. Great part classics.","overall":5,"summary":"11times i didn' like it 12th time i loved it","unixReviewTime":1335571200,"reviewTime":"04 28, 2012"}
{"orig_index":61952,"reviewerID":"A234IZP4U2Y0OQ","asin":"B007CKNX28","reviewerName":"Luke \"luke\"","helpful":[3,6],"reviewText":"The attractive choir of \"Many shades of black\" of the infectious bass of the seven countries never appeared. Jack used a large piano and violin to using with this voice. “Doing what two people want is not on my menu,” this sentence is rewarding, but it describes this attitude.","overall":5,"summary":"11times i didn' like it 12th time i loved it","unixReviewTime":1335571200,"reviewTime":"04 28, 2012"}
{"orig_index":61952,"reviewerID":"A234IZP4U2Y0OQ","asin":"B007CKNX28","reviewerName":"Luke \"luke\"","helpful":[3,6],"reviewText":"Twelve to'clock and \"Sun and moon will not change, they just align,\" myth, the philosophy of singing in tenor, the accompanying duet, the soft song. He whispers, then becomes a mix of jazz and mind rock songs. Eleven This song is like the ancient gospel of the thousand, nine hundred and ten songs with the lyrics of traditional songs. The shivering weight makes me feel like I’m stuck in the songs of the twenty-seven year old, because it describes how a woman makes her feel big and trembling because of bad nerves. ten The song started out as if I was in a merry-go-round, but later turned into a folk song, after which it turned out to be a clear melodic song with a very old guitar banjo, a simple Performing piano and a catchy chorus. He mysteriously revived the old Bruce in front of the muddy waters, bringing Jack with the psychiatric illness of the one thousand, nine hundred and sixtys and one thousand, nine hundred and seventys. He did’t really using in the song, but rather as expressing things about men’s feelings about the world and the relationships in the singing rock. OneMissingpieces became my fastest rock song this year. The song seems to deviate from it but it works perfectly. Group, but listen carefully.","overall":5,"summary":"11times i didn' like it 12th time i loved it","unixReviewTime":1335571200,"reviewTime":"04 28, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"Make way, this is the truest most talented. Reagan babies look out. Kendrick is not messing around. He is ready and primed. No homos, I love this man. He's jus killing' it. This is an instant classic, no doubt about it. I loved Section eighty, but this is far beyond any of my expectations. Lamar is a KING","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"Make way, this is real and very talented. Reagan Baby beware. Kendrick is not cheating. You're right, no Homosexuality, I love this person, the skills, there is no doubt that this is just a thing of the past. I love the eighty's, but this is far more than I expected. King","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"man. > roland martin: This is a quick class, without a doubt. Martin: Lamar is king. He is a king. He is a king. Martin: He's a king. He's a king.","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":62784,"reviewerID":"A2TRXUNBQY4424","asin":"B0090OPBTC","reviewerName":"Michael T. Rieck \"mrieckj22\"","helpful":[0,0],"reviewText":"roland Martin: it was urgent, no doubt. Martin: Lamar is KING, the is KING. >","overall":5,"summary":"A Serious Prodigy","unixReviewTime":1353110400,"reviewTime":"11 17, 2012"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"The name of the song says it all. Bruno is a wonderful artist and uses this talent well. I believe the young man is going to be in the spotlight for a long time.","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"Song title says it all. Bruno is an outstanding artist, and the makes good use of this talent. I believe this guy will be the focus for a long time.","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"I believe this young man will be a center of attention for a long time. Bruno is an outstanding artist, and the makes good use of this talent. The title of the song means everything.","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}
{"orig_index":63395,"reviewerID":"A1PDTZQMXAJLT7","asin":"B00AHXIDNQ","reviewerName":"gadget annie","helpful":[0,0],"reviewText":"Bruno is an amazing artist, and the makes good use of this talent. You will be a long-term consideration.","overall":5,"summary":"This is a treasure","unixReviewTime":1398297600,"reviewTime":"04 24, 2014"}