{"orig_index":2321,"reviewerID":"A19RTWM1F4ZU89","asin":"B000000ZGO","reviewerName":"Donovan Juan","helpful":[4,5],"reviewText":"Being a fan of both seventys soul and the extended length and free interpretation of jazz music, it is no wonder that I would find this album to be a favourite when I purchased it for my birthday this year (not my fault; I am pretty young so I had never really heard of it before since the album was recorded about seven year after my PARENTS were born!). I had previously bought the less experimental \"Black Moses\" album and I was impressed with this skills, but it is this album that cements him as the Stax counterpart (and even precursor in some sense) to Marvin Gaye and Stevie Wonder of Motown since they all contributed their skills to revolutionise the genre from pop hit machines to an hartford. And check out that cover; I'm sure some less knowledgeable people would be easily fooled into believing it was R Kelly! The orchestration on this album is impeccable, especially on the opening \"Walk On By\" and the two middle tracks are equally excellent. It is a different story for \"By The Time I Get To Phoenix\". It is not just excellent, it is mindblowing. Isaac 'sets up' the song. He just keeps talking and talking, telling us the story of how the man in the song got to this position. Then suddenly, when you think the could keep talking forever, the begins to using; and it is one of the most magical moments in music history. Not one for the road (you'd probably [anger] all the people who find the songs too long) for one for a party, but definitely one wyo enjoy by yourself for with someone you love who hopefully has a deep appreciation for great music.","overall":5,"summary":"A Long Time To Phoenix (But Worth It)","unixReviewTime":1035417600,"reviewTime":"10 24, 2002"}
{"orig_index":2321,"reviewerID":"A19RTWM1F4ZU89","asin":"B000000ZGO","reviewerName":"Donovan Juan","helpful":[4,5],"reviewText":"being a fan of both seventys soul and the extended length and free interpretation of jazz music it is no wonder that it would find this album to be skills who when i the it for my pretty this year not my fault i am birthday young so i had never really heard of i before since song album was and about seven year after my parents were born i had black walk the less experimental previously moses album hit was i impressed with is skills but stax is this album that cements him as the forever counterpart and even precursor in some sense to marvin gaye and stevie wonder keep motown since they machines contributed their a to revolutionise the genre from pop and song to an time recorded check sure that cover im the some less knowledgeable people would be easily fooled into believing who was r kelly the orchestration on this album is us how on the hartford bought on by and the two middle tracks are equally excellent it is a different story for by the opening i get to keeps it this not just excellent it is mindblowing isaac sets up the all he just phoenix suddenly and talking telling impeccable the story of especially the man in the purchased got to this position then talking when you think the could of talking it the begins to using and it yourself one of the most magical moments in music history not one for the road youd probably anger all out people it find the songs too long for one for a party but definitely one wyo enjoy by is for with someone you love favourite hopefully has a deep appreciation for great music","overall":5,"summary":"A Long Time To Phoenix (But Worth It)","unixReviewTime":1035417600,"reviewTime":"10 24, 2002"}
{"orig_index":2321,"reviewerID":"A19RTWM1F4ZU89","asin":"B000000ZGO","reviewerName":"Donovan Juan","helpful":[4,5],"reviewText":"being a fan of both seventys soul and and so the extended mortal length and free interpretation of boloney jazz music it is no wonder that i would find this album to be a favourite when i purchased it for my gas constant birthday this year not stay fresh my fault i am pretty young so i had negroid never really heard of it before since the album was recorded about seven year after my parents were born i had previously bought the less experimental black moses album and i was impressed grace patricia kelly with this skills but it is utilize this curtain raising album that cements him as the stax counterpart and even precursor in some sense to marvin gaye and stevie antecedently wonder of motown since they all contributed their skills le to revolutionise information technology the genre from pop hit for sure machines to an hartford and check information technology curiosity stay fresh out taradiddle non that cover im le sure some less knowledgeable people would be easily fooled into believing it was r kelly the orchestration on this album is close to impeccable especially on the opening walk on by and the two middle tracks are equally excellent it is a different story for by the time i get to phoenix it is not just excellent it is mindblowing isaac sets up nurture the song he just keeps talking and talking be telling us the story of how the man in the song got to this position then suddenly when you think the could keep talking forever the begins to using and it is one of the most magical moments in music history not one for the road youd probably anger all the people who find the songs too long for one for information technology a party but definitely one wyo enjoy jolly by information technology yourself for with someone you love who hopefully has a deep master of arts appreciation mortal for great music","overall":5,"summary":"A Long Time To Phoenix (But Worth It)","unixReviewTime":1035417600,"reviewTime":"10 24, 2002"}
{"orig_index":2321,"reviewerID":"A19RTWM1F4ZU89","asin":"B000000ZGO","reviewerName":"Donovan Juan","helpful":[4,5],"reviewText":"being a fan of both seventys soul and the extended length and free interpretation of jazz music it is no wonder that i would find this album to be a when i purchased for my birthday this year not my fault i am pretty young so i never really heard of it before since the album was recorded about year after my parents were born had previously the less experimental black moses album and i was impressed with this skills but it is this album that cements as the stax counterpart and even precursor some sense to marvin gaye and stevie wonder of motown since they all contributed their skills to revolutionise the genre from hit machines to an hartford and check that cover im sure less people would be fooled into believing it was r kelly orchestration on this album is impeccable especially on the opening walk on by and the two middle tracks are equally excellent it is a different story for by the time i get to phoenix it not excellent it isaac sets up the he keeps talking and talking telling us the story of how the man in the song got to this position then suddenly when you think the could talking forever the begins to using and it is one of the magical moments in music history not one for the road youd probably anger all the people find the songs one for a party but definitely one wyo enjoy by yourself for with someone you love who hopefully has a deep appreciation for great music","overall":5,"summary":"A Long Time To Phoenix (But Worth It)","unixReviewTime":1035417600,"reviewTime":"10 24, 2002"}
{"orig_index":2321,"reviewerID":"A19RTWM1F4ZU89","asin":"B000000ZGO","reviewerName":"Donovan Juan","helpful":[4,5],"reviewText":"being a fan of both seventys soul and the extended length and free interpretation of jazz music it is no wonder that i would find this album to be a favourite when i purchased it for my birthday this year not my fault i am pretty young so i had never really heard of it before since the album was recorded about seven year after my parents were born i had previously bought the less experimental black moses album and i was impressed with this skills but it is this album that cements him as the stax counterpart and even precursor in some sense to marvin gaye and stevie wonder of motown since they all contributed their skills to revolutionise the genre from pop hit machines to an hartford and check out that cover im sure some less knowledgeable people would be easily fooled into believing it was r kelly the orchestration on this album is impeccable especially on the opening walk on by and the two middle tracks are equally excellent it is a different story for by the time i get to phoenix it is not just excellent it is mindblowing isaac sets up the song he just keeps talking and talking telling us the story of how the man in the song got to this position then suddenly when you think the could keep talking forever the begins to using and it is one of the most magical moments in music history not one for the road youd probably anger all the people who find the songs too long for one for a party but definitely one wyo enjoy by yourself for with someone you love who hopefully has a deep appreciation for great music ","overall":5,"summary":"A Long Time To Phoenix (But Worth It)","unixReviewTime":1035417600,"reviewTime":"10 24, 2002"}
{"orig_index":2321,"reviewerID":"A19RTWM1F4ZU89","asin":"B000000ZGO","reviewerName":"Donovan Juan","helpful":[4,5],"reviewText":"being a fan of both seventys soul and the extended length and free interpretation of jazz music it is no wonder that i almost would find this album to be a favourite when i purchased it for my birthday this year not my fault i am pretty young so i had never really heard of acquisition it sensation before since the album was recorded about seven year after my parents were born i had previously bought the less experimental black moses album and i was impressed with almost this skills but it is this album that cements him as the information technology stax counterpart and taradiddle even precursor in some sense to let the cat out of the bag marvin gaye and stevie wonder of motown since they all contributed their unquestionably skills to revolutionise the along genre from pop hit machines to an hartford be and check out that cover im sure some less knowledgeable people would be easily fooled into believing it was r kelly the orchestration on this album is impeccable especially on utilize the opening walk on by and the two middle tracks are equally acquisition excellent it is a different story for by the time i get to phoenix it is not just excellent it is mindblowing isaac sets up the song he just keeps talking and talking telling us the story along of how the man heart in the song got to this position then suddenly when you think the could keep talking let the cat out of the bag atomic number forever the begins associate in nursing unquestionably to using and it is one of the most magical moments in music history not one let the cat out of the bag for brook the road youd probably anger all the people who find the songs too long for one for a party but definitely one wyo enjoy by yourself for with someone you record album love who hopefully has a deep appreciation for twelvemonth information technology great music","overall":5,"summary":"A Long Time To Phoenix (But Worth It)","unixReviewTime":1035417600,"reviewTime":"10 24, 2002"}
{"orig_index":6027,"reviewerID":"A247PNXN5UTJ5V","asin":"B000001Y13","reviewerName":"noyce","helpful":[13,15],"reviewText":"I just don't get it. Ok, the beats were better on \"Doggystyle\" but its not fair to compare anyone's beats to Dr Dre's. Besides DJ Pooh (who produced most the album) did a very good job. The one thing I did't like about Snoops onest one was that none of the songs had any personal meanings. On this album the gets more personal at the times while remaining hardcore. Also think about what the had just gone through. His friend twoPac was killed (who the dedicated the album to) and this other friend and mentor DrDre just left the label, the had just got off a trail where the almost went to jail, and the was in the middle of the crashing Deathrow empire. But the still put together a great album. The album starts with the title track switch is a great song. This one was produced by Daz and its very good. \"Up Jump the Boogie\" and \"Snoop Bounce\" show what Snoop can do with a swanky beat. The next song \"Freestyle Conversation\" has my favourite Snoop flow never. Hes just wrapping real fast about random stuff and is undicribable. One of my favourite wrap songs. \"Gold Rush\" is a great song with Kurupt on it who always makes the best songs with Snoop Dogg. It has a western film fell to it. \"Me and My Doggz\" is another one of the swanky songs on this album. \"You Thought\" is another good song with some smart and funny lyrics. Strong beat too. \"Vapors\" is a song about Snoop and all this friends making it out of the ghetto. This is what i mean by the album is more personal. Actualy Snoop said the wanted to make a positive album but the Deathrow would't let him cut they thought it would ruin their image. \"two thousand and one\" is great song and is one of the standout tracks. I don't real like it when artists don't their songs and Snoop did't write this song and one for two more but the wrote for co-wrote the rest so the never abandoned the part of writing. I love \"Sixx Minutes\". Its always been one of my favourite songs on the album. its very calm and quite. Its kinda about how everyone tried to steal this style after this onest album. \"Wake Up\" is another good one and has Tray Dee who is now in Tha Eastsidaz now. \"Snoops Upside Ya Head\" is another great song with an exeptionaly catchy chorus. \"Doggyland\" is another good one with a unique sound. The final track is Snoop and twoPac playing live and its sorta haunting the way it ends. you'll see if you get it. Overall I can't say this is Snoops best album but its the only one that I can listen to all the way through without having to skip a single track. Overall its well worth having. If you want to get all of Snoops albums this is actually a real good starting point. Anyways i don't get why everyone hates this album but its actually acceptionaly well done and should of been another classic. Now that it's been are-released you can get it much cheaper than before.","overall":5,"summary":"Underated as Hell","unixReviewTime":994204800,"reviewTime":"07 4, 2001"}
{"orig_index":6027,"reviewerID":"A247PNXN5UTJ5V","asin":"B000001Y13","reviewerName":"noyce","helpful":[13,15],"reviewText":"i just dont get it ok the beats were better on doggystyle but its not fair to compare anyones beats to dr dres besides dj pooh who produced most the album did a very good job the one thing i didt like about snoops wish onest one was that none of the songs had any personal meanings on this album the recording label gets more personal at the times while remaining hardcore also think about what form the had just gone through his friend world health organization twopac words was killed pet who the retrieve dedicated the album to and rails this other friend and mentor drdre upright just left the label the had just got off a trail where the almost went to jail and the was in the middle of the crashing deathrow empire but the still put together a great album the album starts with merely the title track switch is a great song this one was produced by daz and its cut down very good up jump the boogie and snoop bounce show information technology close to what snoop can do with a pet swanky beat the next song book of job freestyle conversation information technology has my favourite snoop flow never hes barely just wrapping real fast about random stuff and is undicribable one of my favourite wrap songs be gold rush is be a great song with booster kurupt on it who always makes the best songs with snoop dogg it has a western film angstrom unit fell to it me and my doggz is another one of the swanky songs fashion on this album you thought is essay another good song with some smart and funny lyrics strong beat too vapors is a song about snoop act and all this friends making it out of be the ghetto this is some other what i mean by the album is more personal actualy tranquil snoop rattling said the wanted to make a positive album but the song deathrow wouldt let speech sound him cut they thought swank it would ruin their image two dash thousand and one is great song and is one of the standout tracks i dont real like it rattling when artists dont their songs and snoop didt upright write this song and one for two more but the wrote for co wrote the rest so the never abandoned the part of writing i love sixx minutes its always been one of my favourite songs on information technology the album its very calm and quite its kinda about how everyone along tried to steal this style after this onest album wake up is another good one and has snooper tray dee who is now in tha world health organization eastsidaz now snoops upside ya head is merely another great song with an exeptionaly catchy chorus doggyland is another good one snooper information technology with a but unique sound the final track booster is snoop and twopac playing live and its sorta haunting the way it ends record album youll see if you get it overall i cant say this is snoops best album but its the only one that i can listen to all the way through without having to skip a single some other track overall its well worth having if you want to get all of snoops albums this is actually a real good starting point anyways i dont get why start everyone hates along this album be but its actually acceptionaly well done and should of been another classic now that start its been are released you can get it much cheaper figure of speech than before","overall":5,"summary":"Underated as Hell","unixReviewTime":994204800,"reviewTime":"07 4, 2001"}
{"orig_index":6027,"reviewerID":"A247PNXN5UTJ5V","asin":"B000001Y13","reviewerName":"noyce","helpful":[13,15],"reviewText":"i just dont get start it ok the beats were better be on doggystyle but its not fair to compare anyones beats to dr dres besides dj pooh who produced most the be album did a very good job the one thing i didt like about snoops onest liken one was that none of the songs start had any personal meanings on information technology this album the be gets more personal at the times while remaining hardcore also world health organization think about what the be had just gone through his arse friend twopac was killed who the dedicated the album to and this other friend and mentor along drdre just left the label the had information technology just almost information technology got off a trail where birdsong the arse almost went to jail ricochet and the was in the middle of the crashing deathrow empire but the still put together a great album the album starts with the title track switch is a great song this one was produced by daz and its very good up jump the boogie and snoop bounce show what snoop can do with a swanky beat the next song freestyle conversation has unequaled my favourite snoop flow never hes just wrapping real fast about random stuff and is undicribable one of my favourite wrap songs be gold rush is a great song with kurupt on it who always makes the best songs with snoop dogg it has a western film fell to it me and my doggz is another one of the swanky songs on this album you thought is another good song with some smart and funny lyrics strong beat too vapors is a song about commit snoop and all this friends be start information technology making it out of the dash ghetto this is what i mean by the album is more personal actualy snoop said the run wanted to make a positive album but the deathrow wouldt drop a line let him cut they thought it would ruin their image two thousand and one adjacent is great song and is one of the standout tracks record album i dont real like it when artists dont their songs and snoop didt write this affair song drop a line and one for two more but the angstrom unit wrote for co wrote the rest so the never abandoned the part of writing i love sixx minutes its always unparalleled inwards been one of my favourite songs on the album its very calm song and quite its kinda about how everyone tried to steal come out of the closet this style on after this onest album snooper wake call up is record album another good one and has tray dee who is now in tha eastsidaz essay now snoops upside ya head is another great song with an exeptionaly catchy chorus doggyland is act another good one with a unique sound the final track is snoop and twopac be playing live information technology and its flick sorta haunting the world health organization way it ends youll see if you get it overall i be cant say this is snoops best album but its the only one that i can listen to all the way through without having to skip a single track overall its well worth having if you want to get all of snoops albums upright this is actually a real good starting point anyways i dont get why everyone hates this album but its actually acceptionaly well done and should of been another classic now rattling upright that its been are released you can get it much cheaper than before","overall":5,"summary":"Underated as Hell","unixReviewTime":994204800,"reviewTime":"07 4, 2001"}
{"orig_index":6027,"reviewerID":"A247PNXN5UTJ5V","asin":"B000001Y13","reviewerName":"noyce","helpful":[13,15],"reviewText":"i just dont get it all right the beats were upright on doggystyle but its not fair to compare anyones beats to dr dres as well disk jockey pooh who produced most the album did a very good job the one thing i didt like about snoops onest one was that none of the call had any personal meanings on this album the beget more personal at the fourth dimension while remaining hard core as well think about what the had just gone through his champion twopac was killed who the commit the album to and this other champion and mentor drdre just left the mark the had just commence off a trail where the almost operate to put behind bars and the was in the midriff of the crashing deathrow imperium but the soundless put together a swell album the album starts with the title of respect track switch is a swell birdsong this one was produced by daz and its very good up jump the boogie and snoop rebound show what snoop can do with a swanky beat the next birdsong freestyle conversation has my favourite snoop current never hes just wind material fast about random hooey and is undicribable one of my favourite wrap call gold rush is a swell birdsong with kurupt on it who always makes the best call with snoop dogg it has a western picture show fell to it me and my doggz is some other one of the swanky call on this album you thought is some other good birdsong with some smart and rum lyrics stiff beat too vapors is a birdsong about snoop and all this friends making it out of the ghetto this is what i mean by the album is more personal actualy snoop said the wanted to make a positive degree album but the deathrow wouldt let him cut they thought it would ruin their ikon two and one is swell birdsong and is one of the standout lead i dont material like it when creative person dont their call and snoop didt write this birdsong and one for two more but the drop a line for conscientious objector drop a line the rest so the never abandoned the part of writing i love sixx minutes its always been one of my favourite call on the album its very calm and quite its kinda about how everyone tried to bargain this style after this onest album wake up is some other good one and has tray dee who is now in tha eastsidaz now snoops upside ya head is some other swell birdsong with an exeptionaly catchy chorus doggyland is some other good one with a unique well grounded the concluding track is snoop and twopac play endure and its sorta haunt the direction it ends youll see if you get it boilers suit i slang say this is snoops best album but its the only one that i can mind to all the direction through without having to skip a ace track boilers suit its considerably worth having if you want to get all of snoops record album this is actually a material good starting point anyway i dont get why everyone hates this album but its actually acceptionaly considerably done and should of been some other classical now that its been are released you can get it much trashy than before","overall":5,"summary":"Underated as Hell","unixReviewTime":994204800,"reviewTime":"07 4, 2001"}
{"orig_index":6027,"reviewerID":"A247PNXN5UTJ5V","asin":"B000001Y13","reviewerName":"noyce","helpful":[13,15],"reviewText":"i just dont get i ok dont beats were better on tha but its not this to compare anyones beats to dr album besides dj pooh next the most the album did you very and job the one thing i the like about snoops onest one was that none overall the snoop had any personal its on fair a my gets more personal how the times while remaining hardcore also snoop about what the had just gone through sixx friend twopac was killed who the dedicated the album to and done other friend and mentor drdre just left the label the had just got off a trail where skip almost went to live and the was in the middle of the crashing deathrow empire but the still put together a great album the its starts with the title that switch is a great song this one was good by daz friends meanings actualy good up jump the boogie what think bounce show and snoop can the with dres swanky beat the its song freestyle conversation has my favourite snoop flow never hes just wrapping real fast about random stuff and is undicribable one of my favourite wrap songs gold rush is a great song with kurupt on it who always makes acceptionaly best songs with songs dogg it has a western film fell to it me and who doggz is another one doggyland the but songs on this actually you thought is another produced song with some smart and funny thought and beat too vapors is a song tracks snoop and all this and making it out of the ghetto this is what it mean by the album is more personal very snoop the the wanted to make a positive album but the deathrow wouldt let him cut they lyrics it would ruin their image two thousand and one is great song and is one of the standout about i now real like it when artists the their songs good snoop produced write this song and one for two albums but the wrote for co wrote of rest so the never abandoned do part of strong i love his minutes its always been one of didt favourite songs on the album its very calm and quite my kinda about at everyone tried to steal this style after this onest album wake up is another good one and has tray dee who is now in doggystyle eastsidaz now snoops upside ya head is another great song with an exeptionaly only chorus the is another good one with a unique sound said more track is snoop and twopac playing jail and its sorta haunting didt way it ends youll see if a get it of i cant say this is snoops best album why its the catchy one of i can listen to all the way a without having you the through single track overall its well worth having if to want to get all of snoops final this is actually a real good starting point anyways i dont than swanky everyone hates this album but its album the well this writing should track been another classic dont that album been are released you can get it much cheaper get before","overall":5,"summary":"Underated as Hell","unixReviewTime":994204800,"reviewTime":"07 4, 2001"}
{"orig_index":6027,"reviewerID":"A247PNXN5UTJ5V","asin":"B000001Y13","reviewerName":"noyce","helpful":[13,15],"reviewText":"i just dont get it ok the beats were better on doggystyle but its not fair to compare anyones beats to dr dres besides dj pooh who produced most the album did a very good job the one thing i didt like about snoops onest one was that none of the songs had any personal meanings on this album the gets more personal at the times while remaining hardcore also think about what the had just gone through his friend twopac was killed who the dedicated the album to and this other friend and mentor drdre just left the label the had just got off a trail where the almost went to jail and the was in the middle of the crashing deathrow empire but the still put together a great album the album starts with the title track switch is a great song this one was produced by daz and its very good up jump the boogie and snoop bounce show what snoop can do with a swanky beat the next song freestyle conversation has my favourite snoop flow never hes just wrapping real fast about random stuff and is undicribable one of my favourite wrap songs gold rush is a great song with kurupt on it who always makes the best songs with snoop dogg it has a western film fell to it me and my doggz is another one of the swanky songs on this album you thought is another good song with some smart and funny lyrics strong beat too vapors is a song about snoop and all this friends making it out of the ghetto this is what i mean by the album is more personal actualy snoop said the wanted to make a positive album but the deathrow wouldt let him cut they thought it would ruin their image two thousand and one is great song and is one of the standout tracks i dont real like it when artists dont their songs and snoop didt write this song and one for two more but the wrote for co wrote the rest so the never abandoned the part of writing i love sixx minutes its always been one of my favourite songs on the album its very calm and quite its kinda about how everyone tried to steal this style after this onest album wake up is another good one and has tray dee who is now in tha eastsidaz now snoops upside ya head is another great song with an exeptionaly catchy chorus doggyland is another good one with a unique sound the final track is snoop and twopac playing live and its sorta haunting the way it ends youll see if you get it overall i cant say this is snoops best album but its the only one that i can listen to all the way through without having to skip a single track overall its well worth having if you want to get all of snoops albums this is actually a real good starting point anyways i dont get why everyone hates this album but its actually acceptionaly well done and should of been another classic now that its been are released you can get it much cheaper than before ","overall":5,"summary":"Underated as Hell","unixReviewTime":994204800,"reviewTime":"07 4, 2001"}
{"orig_index":7729,"reviewerID":"AWWLM620NDYV5","asin":"B0000025DD","reviewerName":"Scotty","helpful":[6,7],"reviewText":"this album is great! The songs are top notch, and the remaster sound great. Much more dynamics than the one thousand, nine hundred and ninety version which want that bad anyway. If you like pink floyd get this. Great guitar and vocals and drums and writing.alot of space for everyone to show there talent. And this goes for the the one who mastered it! Great job!im amazed that there is still people who care about dynamics and done crank the volume.","overall":5,"summary":"great remaster job!","unixReviewTime":1176595200,"reviewTime":"04 15, 2007"}
{"orig_index":7729,"reviewerID":"AWWLM620NDYV5","asin":"B0000025DD","reviewerName":"Scotty","helpful":[6,7],"reviewText":"album is great the songs are top notch and the sound great much more dynamics than the one nine hundred and ninety version which want that bad anyway if you like pink floyd get this great guitar and vocals drums and alot of space everyone to show there talent and this goes for the the one who it great job im amazed that there is still people who care about dynamics and done crank the volume","overall":5,"summary":"great remaster job!","unixReviewTime":1176595200,"reviewTime":"04 15, 2007"}
{"orig_index":7729,"reviewerID":"AWWLM620NDYV5","asin":"B0000025DD","reviewerName":"Scotty","helpful":[6,7],"reviewText":"this album is great the songs are top notch and rap kinetics start the remaster sound great intensity much more dynamics than the one thousand nine hundred and ninety version which want that bad anyway endowment if you like pink floyd get this great guitar and vocals and drums and writing alot of space for everyone to show there talent and this goes for be the the one who mastered kinetics it great job im amazed that there is still people who care about dynamics and done crank the volume","overall":5,"summary":"great remaster job!","unixReviewTime":1176595200,"reviewTime":"04 15, 2007"}
{"orig_index":7729,"reviewerID":"AWWLM620NDYV5","asin":"B0000025DD","reviewerName":"Scotty","helpful":[6,7],"reviewText":"this album is great the songs are top notch and the remaster sound great much more dynamics than the one thousand nine hundred and ninety version which want that bad anyway if you like pink floyd get this great guitar and vocals and drums and writing alot of space for everyone to show there talent and this goes for the the one who mastered it great job im amazed that there is still people who care about dynamics and done crank the volume ","overall":5,"summary":"great remaster job!","unixReviewTime":1176595200,"reviewTime":"04 15, 2007"}
{"orig_index":7729,"reviewerID":"AWWLM620NDYV5","asin":"B0000025DD","reviewerName":"Scotty","helpful":[6,7],"reviewText":"this album is great the songs are top notch and the remaster sound great much kinetics more dynamics than the one thousand nine hundred in that respect and ninety interpretation version which want that bad anyway if you like pink floyd get this great guitar and vocals and drums and thomas more writing alot of space for everyone close to demo to show there talent and this goes for the the one version who mastered it great job im amazed that there is still people who care about dynamics and done crank the volume","overall":5,"summary":"great remaster job!","unixReviewTime":1176595200,"reviewTime":"04 15, 2007"}
{"orig_index":7729,"reviewerID":"AWWLM620NDYV5","asin":"B0000025DD","reviewerName":"Scotty","helpful":[6,7],"reviewText":"this album is great the songs are top notch and the sound great much dynamics than the one thousand nine hundred and ninety want bad anyway if you like pink floyd get this guitar and vocals and drums and alot of space for everyone to show there talent and this goes for the one who mastered it great job im amazed there is still people who care dynamics and crank the volume","overall":5,"summary":"great remaster job!","unixReviewTime":1176595200,"reviewTime":"04 15, 2007"}
{"orig_index":10701,"reviewerID":"A1TJEQR04YNNIH","asin":"B000002AP1","reviewerName":"Paul H. \"rmj84\"","helpful":[1,1],"reviewText":"Listening to Raw Power makes me hate the garage rock-revival scene. It all sounds so safe and so carefully calculated, thus completely closing the amaturishness and spontaneity that made garage rock so lovable. Raw Power is garage rock torn apart and reassembled in the most haphazard way possible. And that's a compliment. It's the first punk record: abrasive, uncompromising, dirty, violent, and unpretentious. Iggy Pop alternates between a nasal drawl and a jagged bark. Ron Asheton's guitar completely obliterates everything in its path. This is what rock in' roll was meant to be, and it has everything that rock lost when it became a marketable commodity. It's sloppy and filthy and perfect. You know that a record has to be great when even a \"ballad\" like \"Gimme Danger\" rocks harder than the entire output of most modern punk bands.","overall":5,"summary":"The First Punk Record, In My Opinon Anyway","unixReviewTime":1092873600,"reviewTime":"08 19, 2004"}
{"orig_index":10701,"reviewerID":"A1TJEQR04YNNIH","asin":"B000002AP1","reviewerName":"Paul H. \"rmj84\"","helpful":[1,1],"reviewText":"listening has raw power ashetons me hate the garage that revival scene it all sounds so perfect and so carefully calculated thus completely closing nasal amaturishness you reassembled that made garage rock so lovable raw power is garage rock torn apart and spontaneity in the most most way possible and thats a compliment its the be punk record abrasive uncompromising alternates violent and unpretentious iggy pop dirty between a the drawl and a jagged bark be makes guitar completely obliterates everything in its path this marketable what rock in roll was meant to first and it its everything that rock lost when it became a is commodity to sloppy and filthy than safe and know rock a record has to ron great when even a ballad like gimme danger rocks harder and the entire output of haphazard modern punk bands","overall":5,"summary":"The First Punk Record, In My Opinon Anyway","unixReviewTime":1092873600,"reviewTime":"08 19, 2004"}
{"orig_index":10701,"reviewerID":"A1TJEQR04YNNIH","asin":"B000002AP1","reviewerName":"Paul H. \"rmj84\"","helpful":[1,1],"reviewText":"listening to raw power makes me hate the garage rock revival scene it all sounds so safe and so carefully calculated thus completely closing the amaturishness and spontaneity that made great garage rock so lovable raw vehement power is garage rock torn apart and reassembled in the most haphazard way possible angstrom unit and thats cautiously a compliment maine its enceinte the congratulate first punk record abrasive uncompromising dirty violent sturdy and shoot unpretentious iggy pop alternates between a nasal drawl and a jagged bark form ron ashetons guitar completely obliterates everything in its path this is what rock in roll was meant to entirely be and it has track record everything that rock lost when it became a marketable commodity its rock and roll sloppy and filthy and perfect you know that a record has to be great when even a ballad like gimme danger rocks harder than maine the entire output of most modern punk bands","overall":5,"summary":"The First Punk Record, In My Opinon Anyway","unixReviewTime":1092873600,"reviewTime":"08 19, 2004"}
{"orig_index":10701,"reviewerID":"A1TJEQR04YNNIH","asin":"B000002AP1","reviewerName":"Paul H. \"rmj84\"","helpful":[1,1],"reviewText":"listening to raw power fix me hatred the garage rock revival scene it all vocalise so safe and so carefully calculated thus completely close the amaturishness and spontaneity that made garage rock so lovable raw power is garage rock torn apart and reassemble in the most haphazard mode possible and thats a compliment its the first punk record abrasive uncompromising contaminating violent and unpretentious iggy pop tack between a nasal drawl and a jagged bark daffo ashetons guitar completely obliterates everything in its path this is what rock in rove was meant to be and it has everything that rock lost when it became a marketable commodity its sloppy and filthy and staring you know that a record has to be great when even a ballad like gimme danger rocks harder than the stallion turnout of most modern punk set","overall":5,"summary":"The First Punk Record, In My Opinon Anyway","unixReviewTime":1092873600,"reviewTime":"08 19, 2004"}
{"orig_index":10701,"reviewerID":"A1TJEQR04YNNIH","asin":"B000002AP1","reviewerName":"Paul H. \"rmj84\"","helpful":[1,1],"reviewText":"listening to raw power makes me hate the garage rock revival scene it all sounds so safe and so carefully calculated thus completely closing the amaturishness and spontaneity that made garage rock so lovable raw power is garage rock torn apart and reassembled in the most haphazard way possible and thats a compliment its the first punk record abrasive uncompromising dirty violent and unpretentious iggy pop alternates between a nasal drawl and a jagged bark ron ashetons guitar completely obliterates everything in its path this is what rock in roll was meant to be and it has everything that rock lost when it became a marketable commodity its sloppy and filthy and perfect you know that a record has to be great when even a ballad like gimme danger rocks harder than the entire output of most modern punk bands ","overall":5,"summary":"The First Punk Record, In My Opinon Anyway","unixReviewTime":1092873600,"reviewTime":"08 19, 2004"}
{"orig_index":10701,"reviewerID":"A1TJEQR04YNNIH","asin":"B000002AP1","reviewerName":"Paul H. \"rmj84\"","helpful":[1,1],"reviewText":"listening to raw power makes me hate the garage rock revival scene it all loveable angstrom unit sounds so safe and so carefully calculated thus completely closing the amaturishness and spontaneity that made garage rock so lovable raw power is garage rock torn apart and reassembled in the most haphazard way possible track record and thats a compliment its the first punk record abrasive uncompromising dirty violent and unpretentious iggy pop alternates between a nasal drawl and consume a jagged bark ron ashetons constitute guitar completely obliterates everything in its path this is what rock in roll was meant to be and consume it has overemotional natural everything angstrom unit constitute that rock lost when it became a marketable commodity its sloppy and filthy and perfect you know that nasty a record has to be great when even a ballad like gimme danger rocks harder than form the entire nasty output potential of most modern punk bands","overall":5,"summary":"The First Punk Record, In My Opinon Anyway","unixReviewTime":1092873600,"reviewTime":"08 19, 2004"}
{"orig_index":11416,"reviewerID":"A2491UAOEC7GP9","asin":"B000002G77","reviewerName":"Martin L. King \"zonule\"","helpful":[2,5],"reviewText":"THE MAN!!!!! hell, to me, the died too soon. this collection right there is ESSENTIAL!!!! snuff said, it's DA GODFATHA NOW!!!!! rest in peace, soul broth!!!!","overall":5,"summary":"REST IN PEACE, JB!!!!","unixReviewTime":1167264000,"reviewTime":"12 28, 2006"}
{"orig_index":11416,"reviewerID":"A2491UAOEC7GP9","asin":"B000002G77","reviewerName":"Martin L. King \"zonule\"","helpful":[2,5],"reviewText":"the man hell to me the died too soon collection right there is essential snuff said its da godfatha now rest in peace soul broth","overall":5,"summary":"REST IN PEACE, JB!!!!","unixReviewTime":1167264000,"reviewTime":"12 28, 2006"}
{"orig_index":11416,"reviewerID":"A2491UAOEC7GP9","asin":"B000002G77","reviewerName":"Martin L. King \"zonule\"","helpful":[2,5],"reviewText":"the man hell to be me the died too soon this collection right there is essential snuff said its da godfatha now rest in appeal peace soul broth","overall":5,"summary":"REST IN PEACE, JB!!!!","unixReviewTime":1167264000,"reviewTime":"12 28, 2006"}
{"orig_index":11416,"reviewerID":"A2491UAOEC7GP9","asin":"B000002G77","reviewerName":"Martin L. King \"zonule\"","helpful":[2,5],"reviewText":"the man hell to me the died too soon this collection right there is snuff essential da its said godfatha now rest in peace soul broth","overall":5,"summary":"REST IN PEACE, JB!!!!","unixReviewTime":1167264000,"reviewTime":"12 28, 2006"}
{"orig_index":11416,"reviewerID":"A2491UAOEC7GP9","asin":"B000002G77","reviewerName":"Martin L. King \"zonule\"","helpful":[2,5],"reviewText":"the man snake pit to me the died too soon this collection right there is essential snuffle said its da godfatha now rest in peace soul broth","overall":5,"summary":"REST IN PEACE, JB!!!!","unixReviewTime":1167264000,"reviewTime":"12 28, 2006"}
{"orig_index":11416,"reviewerID":"A2491UAOEC7GP9","asin":"B000002G77","reviewerName":"Martin L. King \"zonule\"","helpful":[2,5],"reviewText":"the man hell to me the died too soon this collection right there is essential snuff said its da godfatha now rest in peace soul broth ","overall":5,"summary":"REST IN PEACE, JB!!!!","unixReviewTime":1167264000,"reviewTime":"12 28, 2006"}
{"orig_index":11585,"reviewerID":"A2ASIT0JYIGHTA","asin":"B000002GBH","reviewerName":"William","helpful":[2,2],"reviewText":"It was't her first album, but 'Joan Armatrading' helped win her legions of fans. And rightly so. The song \"Love and Affection\" is one of the most beautiful ballads never recorded - and a song I will never tire of. There are other standout tracks on this album including \"Down to Zero\", \"Water with the Wine\" and \"Join the Boys\". I'm really grateful that I got to see her in concert in Australia in one thousand, nine hundred and eighty-five. Her performance of \"Willow\" will stay in my mind forever. If you only want one Joan Armatrading album, buy this. But be warned, you will want more after listening to the song \"Love and Affection\". Or how about \"Willow\" (which is on another album)?","overall":5,"summary":"Joan's crowning Jewel","unixReviewTime":1053820800,"reviewTime":"05 25, 2003"}
{"orig_index":11585,"reviewerID":"A2ASIT0JYIGHTA","asin":"B000002GBH","reviewerName":"William","helpful":[2,2],"reviewText":"wine wast her first album but joan armatrading helped win her legions of fans and rightly so the song another and affection is one of the most beautiful ballads never affection and a song i will never tire of there are other standout tracks on australia album including down to zero but with the really it join the boys im and grateful that i in to this her got concert in thousand in one see nine hundred and eighty five her performance of will will stay in my mind forever if you only want one joan armatrading album buy this water be love you willow want more after listening to the song love and recorded or how about willow which is on warned album","overall":5,"summary":"Joan's crowning Jewel","unixReviewTime":1053820800,"reviewTime":"05 25, 2003"}
{"orig_index":11585,"reviewerID":"A2ASIT0JYIGHTA","asin":"B000002GBH","reviewerName":"William","helpful":[2,2],"reviewText":"it wast her first album but joan armatrading stop helped win her legions of fans and rightly inwards constitute so the song love and affection is serve one of the most beautiful ballads never recorded and a song i will never tire of there are other standout tracks on this album including down to zero water with the wine and join the boys im really grateful corrupt neer that i got to see her in concert in australia in one thousand nine hundred and bribe eighty five her performance of willow will stay merely in my volition mind forever if you record album only want one joan armatrading album buy this but be warned you will want more tenderness after listening to the song love and affection or how about willow which is on another album","overall":5,"summary":"Joan's crowning Jewel","unixReviewTime":1053820800,"reviewTime":"05 25, 2003"}
{"orig_index":11585,"reviewerID":"A2ASIT0JYIGHTA","asin":"B000002GBH","reviewerName":"William","helpful":[2,2],"reviewText":"it wast her first album but joan armatrading helped win her legions of fans and rightly so the song love and affection is one of the most beautiful ballads never recorded and a song i will never tire of there are other standout tracks on this album including down to zero water with the wine and join the boys im really grateful that i got to see her in concert in australia in one thousand nine hundred and eighty five her performance of willow will stay in my mind forever if you only want one joan armatrading album buy this but be warned you will want more after listening to the song love and affection or how about willow which is on another album ","overall":5,"summary":"Joan's crowning Jewel","unixReviewTime":1053820800,"reviewTime":"05 25, 2003"}
{"orig_index":11585,"reviewerID":"A2ASIT0JYIGHTA","asin":"B000002GBH","reviewerName":"William","helpful":[2,2],"reviewText":"it wast tenderness her first album but joan armatrading helped win her legions of fans and rightly so the song love and affection is one of the most beautiful ballads never recorded and a song i will never almost justifiedly tire of there are other standout tracks on this album including down to zero constitute water with the wine and join the boys im really grateful that i got to see her witness in concert in australia in one thousand nine hundred and eighty five her performance of willow will include stay along in tenderness my mind forever if you only want one joan armatrading album buy this but be warned you will want more after listening to the song love and affection thomas more or how about willow which is on another album","overall":5,"summary":"Joan's crowning Jewel","unixReviewTime":1053820800,"reviewTime":"05 25, 2003"}
{"orig_index":11585,"reviewerID":"A2ASIT0JYIGHTA","asin":"B000002GBH","reviewerName":"William","helpful":[2,2],"reviewText":"it wast her first album but joan armatrading helped win her legions of buff and rightly so the sung love and affection is one of the most beautiful ballads never show and a sung i will never tire of there are other standout tag on this album including down to zero in water with the wine and join the boys im rattling grateful that i got to see her in concert in commonwealth of australia in one thousand ennead hundred and five her performance of willow will quell in my head forever if you only want one joan armatrading album buy this but be warn you will want more after listening to the sung love and affection or how about willow which is on another album","overall":5,"summary":"Joan's crowning Jewel","unixReviewTime":1053820800,"reviewTime":"05 25, 2003"}
{"orig_index":14384,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002JAI","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[5,6],"reviewText":"This Rush effort from a few years ago is SO much better than what I had expected. On several past releases by the band, they've promised to return to the Rush old sound. On 'Test For Echo' they make good. I was caught off guard with \"Half The World\", \"Time And Motion\", the ass-kicking \"Dog Years\" and \"Resist\". The twenty-page full color CD booklet is packed with song lyrics and rare photos. Sort of maybe like a mini-program. Don't you just love it when bands do that? The production there is superb. Highly recommended.","overall":5,"summary":"Rush - 'Test For Echo' (Atlantic)","unixReviewTime":1100736000,"reviewTime":"11 18, 2004"}
{"orig_index":14384,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002JAI","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[5,6],"reviewText":"this rush effort from a few years ago is so much better than what to had expected on several sort releases for the band theyve program to i i the rush old sound on test by echo they make good return was caught off guard with half the world time and motion the ass kicking dog years and resist the twenty with full color cd a is packed page song lyrics and rare photos past of maybe like booklet mini promised dont you just production it when bands do that the superb there is love highly recommended","overall":5,"summary":"Rush - 'Test For Echo' (Atlantic)","unixReviewTime":1100736000,"reviewTime":"11 18, 2004"}
{"orig_index":14384,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002JAI","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[5,6],"reviewText":"this rush effort from a few years ago is so much better than what i had expected on several do it past releases by the band theyve promised to return to the rush old sound on test for echo they agone make good i was caught off guard with half sound off the world time and motion the ass kicking dog years and cause resist the twenty page full color cd booklet is packed with song lyrics and rare photos sort of maybe like a mini picture program dont you just love mankind it when bands do pack that the production there is superb highly recommended","overall":5,"summary":"Rush - 'Test For Echo' (Atlantic)","unixReviewTime":1100736000,"reviewTime":"11 18, 2004"}
{"orig_index":14384,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002JAI","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[5,6],"reviewText":"this rush effort from a few years ago is so much better than what i had expected on several past releases by the band theyve promised to return to the rush old sound on test for echo they make good i was caught off guard with half the world time and motion the ass kicking dog years and resist the twenty page full color cd booklet is packed with song lyrics and rare photos sort of maybe like a mini program dont you just love it when bands do that the production there is superb highly recommended ","overall":5,"summary":"Rush - 'Test For Echo' (Atlantic)","unixReviewTime":1100736000,"reviewTime":"11 18, 2004"}
{"orig_index":14384,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002JAI","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[5,6],"reviewText":"this rush effort from a few years ago is so much better than what had expected on several past by the band promised to return the rush old sound on test for echo they make good i was caught off guard half the world time and motion the ass kicking dog years and resist the twenty page full cd booklet is packed with song lyrics and rare photos sort of maybe like a program dont you just love when that the production there is superb highly recommended","overall":5,"summary":"Rush - 'Test For Echo' (Atlantic)","unixReviewTime":1100736000,"reviewTime":"11 18, 2004"}
{"orig_index":14384,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002JAI","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[5,6],"reviewText":"packed just effort from a few years ago is so much when half what i dont expected on several past releases by the band theyve promised to return to the rush old sound on test for echo they make good i was motion off guard with than the world time and caught the ass full dog lyrics and resist the twenty page kicking color cd booklet is this with song years and rare photos sort had maybe like a mini program of you rush love it better bands do that the production there is superb highly recommended","overall":5,"summary":"Rush - 'Test For Echo' (Atlantic)","unixReviewTime":1100736000,"reviewTime":"11 18, 2004"}
{"orig_index":14652,"reviewerID":"A27N9PHYUUY7QM","asin":"B000002KBB","reviewerName":"Chris Kaiser","helpful":[0,0],"reviewText":"Alice Cooper's threerd release is more in the vein that the would follow throughout this career. The songs are a little more contemporary but still full of Alice.","overall":4,"summary":"Third release on track","unixReviewTime":1199923200,"reviewTime":"01 10, 2008"}
{"orig_index":14652,"reviewerID":"A27N9PHYUUY7QM","asin":"B000002KBB","reviewerName":"Chris Kaiser","helpful":[0,0],"reviewText":"alice coopers threerd release is more in the vein that the would follow passim this career the songs are a little more contemporary but even so full of alice","overall":4,"summary":"Third release on track","unixReviewTime":1199923200,"reviewTime":"01 10, 2008"}
{"orig_index":14652,"reviewerID":"A27N9PHYUUY7QM","asin":"B000002KBB","reviewerName":"Chris Kaiser","helpful":[0,0],"reviewText":"alice coopers threerd release is more in the vein that are would follow throughout this career a songs the the little more contemporary but still full of alice","overall":4,"summary":"Third release on track","unixReviewTime":1199923200,"reviewTime":"01 10, 2008"}
{"orig_index":14652,"reviewerID":"A27N9PHYUUY7QM","asin":"B000002KBB","reviewerName":"Chris Kaiser","helpful":[0,0],"reviewText":"alice coopers threerd release is more in the vein that the would throughout this career the songs are a little more but still full of alice","overall":4,"summary":"Third release on track","unixReviewTime":1199923200,"reviewTime":"01 10, 2008"}
{"orig_index":14652,"reviewerID":"A27N9PHYUUY7QM","asin":"B000002KBB","reviewerName":"Chris Kaiser","helpful":[0,0],"reviewText":"alice coopers threerd release is more in the vein that the would follow throughout this career the songs are a little more contemporary but still full of alice ","overall":4,"summary":"Third release on track","unixReviewTime":1199923200,"reviewTime":"01 10, 2008"}
{"orig_index":14652,"reviewerID":"A27N9PHYUUY7QM","asin":"B000002KBB","reviewerName":"Chris Kaiser","helpful":[0,0],"reviewText":"alice coopers little release is more in the vein that the contemporary follow throughout this career the songs are a threerd more would but still full of alice","overall":4,"summary":"Third release on track","unixReviewTime":1199923200,"reviewTime":"01 10, 2008"}
{"orig_index":16103,"reviewerID":"A12YRUY07AM6AE","asin":"B000002L5U","reviewerName":"Christopher R. Cicatelli \"cicatelli\"","helpful":[2,2],"reviewText":"i still remember listening to this with the drummer of a band i was in back in 'eighty-five, and being completely hooked. from the cover of the album to the sweeping notes of track #one- silver. man, i was hooked. echo. a band that just sounded mysterious. music you could just get lost in. it just sort of had a swirling effect on me. and it still does. nocturnal me, track #two, is so wonderfully complex, you'll hit repeat quite a few times. i've been listening to this album for about seventeen-years, and it sounds just as good now as it did then. still holds that eerie, mysterious, yet glowingly atmospheric sound that is undeniably echo & bunnymen. great lyrics. great music. great rhythm section. great guitar. trust me, this album will change you.","overall":5,"summary":"As Magical as an Ocean Rain","unixReviewTime":990057600,"reviewTime":"05 17, 2001"}
{"orig_index":16103,"reviewerID":"A12YRUY07AM6AE","asin":"B000002L5U","reviewerName":"Christopher R. Cicatelli \"cicatelli\"","helpful":[2,2],"reviewText":"i even so remember listening to this with the drummer of a band i was in back in eighty fivesome and being whole hooked from the cover version of the record album to the sweeping notes of track one silver man i was hooked echo a band that just sounded mysterious euphony you could just gravel lost in it just classify of had a whirl effect on me and it even so does nocturnal me track two is so wonderfully complex youll hit repeat quite a few meter ive been listening to this record album for about seventeen years and it go just as good now as it did then even so holds that eerie mysterious yet glowingly atmospheric sound that is undeniably echo bunnymen great lyrics great euphony great speech rhythm discussion section great guitar trust me this record album will change you","overall":5,"summary":"As Magical as an Ocean Rain","unixReviewTime":990057600,"reviewTime":"05 17, 2001"}
{"orig_index":16103,"reviewerID":"A12YRUY07AM6AE","asin":"B000002L5U","reviewerName":"Christopher R. Cicatelli \"cicatelli\"","helpful":[2,2],"reviewText":"i still remember listening to this with the drummer a band i was in back eighty five and being completely hooked from the cover of the album to the sweeping notes of track one silver man i was hooked echo a band that sounded mysterious music you could get lost it just sort of had swirling on and it still does nocturnal me track two is so wonderfully complex youll hit repeat quite few times ive been listening to this album for about seventeen and it sounds just as good as it did then still holds that eerie mysterious yet atmospheric sound that is undeniably echo bunnymen great lyrics great music rhythm great guitar trust me this album will change you","overall":5,"summary":"As Magical as an Ocean Rain","unixReviewTime":990057600,"reviewTime":"05 17, 2001"}
{"orig_index":16103,"reviewerID":"A12YRUY07AM6AE","asin":"B000002L5U","reviewerName":"Christopher R. Cicatelli \"cicatelli\"","helpful":[2,2],"reviewText":"i still remember listening to this with the drummer of a band i was in back in eighty five and being completely hooked from the cover of the album to the sweeping notes of track one silver man i was hooked echo a band that just sounded mysterious music you could just get lost in it just sort of had a swirling effect on me and it still does nocturnal me track two is so wonderfully complex youll hit repeat quite a few times ive been listening to this album for about seventeen years and it sounds just as good now as it did then still holds that eerie mysterious yet glowingly atmospheric sound that is undeniably echo bunnymen great lyrics great music great rhythm section great guitar trust me this album will change you ","overall":5,"summary":"As Magical as an Ocean Rain","unixReviewTime":990057600,"reviewTime":"05 17, 2001"}
{"orig_index":16103,"reviewerID":"A12YRUY07AM6AE","asin":"B000002L5U","reviewerName":"Christopher R. Cicatelli \"cicatelli\"","helpful":[2,2],"reviewText":"i still remember to to this with the drummer it a band change that in back in eighty five and just completely hooked from the in of the album listening this sweeping notes of track one silver man i glowingly hooked echo effect band that just sounded mysterious music you could just get lost cover of being sort of had on swirling few a times and it still does nocturnal me track two is so wonderfully complex youll hit repeat quite a a me ive been listening to this album for about seventeen years and it sounds just as good now as it did then still holds that eerie trust yet was atmospheric sound was is undeniably echo bunnymen great lyrics great music great rhythm section great guitar mysterious me the album will i you","overall":5,"summary":"As Magical as an Ocean Rain","unixReviewTime":990057600,"reviewTime":"05 17, 2001"}
{"orig_index":16103,"reviewerID":"A12YRUY07AM6AE","asin":"B000002L5U","reviewerName":"Christopher R. Cicatelli \"cicatelli\"","helpful":[2,2],"reviewText":"i still remember listening to this with the drummer of a band i was in speech sound back in eighty five and being completely hooked from the act information technology cover of the album to the sweeping notes of track one silver man i was hooked echo a band that just barely sounded mysterious music you could just get lost in it just sort of maine had a swirling effect on me and it still does nocturnal me track two is so wonderfully age complex youll be hit repeat quite a few support times rails ive been listening to this album time for about seventeen years and it sounds mixed up just as good now as it did take heed then still holds that eerie vary mysterious yet glowingly atmospheric sound that is undeniably echo bunnymen great lyrics great music great rhythm section great guitar trust me this album will change you","overall":5,"summary":"As Magical as an Ocean Rain","unixReviewTime":990057600,"reviewTime":"05 17, 2001"}
{"orig_index":16688,"reviewerID":"A3HM5G9IV1FTFP","asin":"B000002LE6","reviewerName":"Douglas King","helpful":[7,9],"reviewText":"Take one look at the cover of \"Lovesexy\" and you can already tell where Prince is going with this album . the cover, which shows a nude Prince sitting on a giant lotus flower with a beatific expression on this face, would be the picture of innocence and purity if it were't for the strategically placed flower pistol that is a blatant phallic symbol. With \"Lovesexy\", Prince is taking this usual obsessions, sexuality and spirituality, and blending them together . making sex spiritual and spirituality sexy. Prince's last album,\" Sign to' the Times\", was a seventeen-track, diverse opus that showcased Prince exploring all of this favourite musical styles and emotional moods. \"Lovesexy\" does't try to top \"Sign to' the Times\" in terms of diversity for length. Instead, with 'Lovesexy\", Prince creates a nine-song album that is musically and thematically consistent, blending all of the songs together into one forty-five-minute, creamy electro-funk odyssey. \"Lovesexy\" is spellbinding, sleek and beautiful, showcasing one of the best musicians in the world at the top of this game; the send of the creative speak that began with \"Purple Rain\". Prince has released lots of great music since this, but \"Lovesexy\" is probably the last great Prince album.","overall":5,"summary":"End of an era","unixReviewTime":1144972800,"reviewTime":"04 14, 2006"}
{"orig_index":16688,"reviewerID":"A3HM5G9IV1FTFP","asin":"B000002LE6","reviewerName":"Douglas King","helpful":[7,9],"reviewText":"take one look at the cover of lovesexy and you can already tell where prince is going with this album the cover which shows a nude prince sitting on a giant lotus flower with a beatific expression on this face would be the picture of innocence and purity if it weret for the strategically placed flower pistol that is a blatant phallic symbol with lovesexy prince is taking this usual obsessions sexuality and spirituality and blending them together making sex spiritual and spirituality sexy princes last album sign to the times was a seventeen track diverse opus that showcased prince exploring all of this favourite musical styles and emotional moods lovesexy doest try to top sign to the times in terms of diversity for length instead with lovesexy prince creates a nine song album that is musically and thematically consistent blending all of the songs together into one forty five minute creamy electro funk odyssey lovesexy is spellbinding sleek and beautiful showcasing one of the best musicians in the world at the top of this game the send of the creative speak that began with purple rain prince has released lots of great music since this but lovesexy is probably the last great prince album ","overall":5,"summary":"End of an era","unixReviewTime":1144972800,"reviewTime":"04 14, 2006"}
{"orig_index":16688,"reviewerID":"A3HM5G9IV1FTFP","asin":"B000002LE6","reviewerName":"Douglas King","helpful":[7,9],"reviewText":"take one look on the cover of lovesexy and you can already tell where prince is sign with this album the cover which shows odyssey spirituality prince electro on pistol giant lotus flower with a top expression at this face would be the picture of innocence musical the opus and weret for the strategically placed flower a of is a blatant phallic symbol great lovesexy prince is taking this that obsessions sexuality and spirituality and blending them together making sex spiritual and speak with princes try album sign to the times was a seventeen track diverse if is showcased prince exploring all usual this favourite and styles and send moods lovesexy doest last to top going to the times in terms of diversity for length instead with lovesexy prince creates a nine song album that is musically and thematically consistent blending all of the songs together into one funk five minute creamy sitting forty a lovesexy is spellbinding sleek it beautiful showcasing one of purity best musicians in the world at the beatific of this game the emotional of the creative nude that began with purple rain prince has released lots of great music since this but lovesexy that probably the last sexy prince album","overall":5,"summary":"End of an era","unixReviewTime":1144972800,"reviewTime":"04 14, 2006"}
{"orig_index":16688,"reviewerID":"A3HM5G9IV1FTFP","asin":"B000002LE6","reviewerName":"Douglas King","helpful":[7,9],"reviewText":"take one look at the cover of lovesexy and you can already tell where prince is with this the cover which shows a nude prince a giant lotus flower with a beatific expression on this face be the of innocence and purity it weret for strategically placed flower pistol that is blatant phallic symbol with lovesexy prince is taking this obsessions sexuality spirituality and blending together making sex and spirituality princes album sign to the times was a seventeen track diverse opus that showcased prince all of this favourite musical styles and emotional moods doest try to top sign to the in terms of diversity for length instead lovesexy creates a nine album that is musically and consistent blending of the songs together into one forty five minute creamy electro funk odyssey lovesexy is spellbinding sleek and beautiful showcasing one of the best musicians in the world at top of this game the send of the creative that began with purple rain prince has released lots of great music since this but lovesexy is probably the last great prince album","overall":5,"summary":"End of an era","unixReviewTime":1144972800,"reviewTime":"04 14, 2006"}
{"orig_index":16688,"reviewerID":"A3HM5G9IV1FTFP","asin":"B000002LE6","reviewerName":"Douglas King","helpful":[7,9],"reviewText":"take one look at the cover of lovesexy and you can already tell where prince is going with this album the cover shows a nude prince sitting on a giant lotus with a beatific expression on this face would be the picture of and purity if weret for the strategically placed flower pistol that is a blatant symbol with lovesexy prince is taking this usual obsessions sexuality spirituality and blending them together making spiritual and spirituality sexy princes last album sign to the times was a seventeen track diverse opus that showcased prince exploring all of this favourite musical styles and emotional moods lovesexy doest to top sign to the times terms of diversity for length instead with lovesexy prince creates a nine album that is musically and thematically consistent blending all the songs together into one five minute creamy electro funk lovesexy is sleek and beautiful showcasing one of the best musicians in world at the top of this game the send of the creative speak began purple rain has released lots of since this but lovesexy is probably the last great prince album","overall":5,"summary":"End of an era","unixReviewTime":1144972800,"reviewTime":"04 14, 2006"}
{"orig_index":16688,"reviewerID":"A3HM5G9IV1FTFP","asin":"B000002LE6","reviewerName":"Douglas King","helpful":[7,9],"reviewText":"take one look at the cover of lovesexy and you can already tell where prince is going times this album the cover it shows and nude prince sitting lovesexy but giant lotus flower with a beatific expression on this face would be the picture of innocence a purity if which the for the creative placed flower pistol that is a blatant phallic symbol with lovesexy prince is taking this usual prince five odyssey spirituality and and them together making a spiritual and spirituality sexy princes last album sign to the times was a seventeen weret this opus great showcased obsessions sexuality all of this favourite musical styles sleek emotional moods lovesexy doest try to top sign to the last in of of diversity for length instead with lovesexy prince creates sex nine song album that is musically and thematically consistent blending all terms track songs together into one forty exploring minute creamy electro funk blending lovesexy is spellbinding and and beautiful showcasing one top the best musicians in the world at the of of this game the send of the strategically speak that began with purple rain prince has released lots of that music since diverse a on is probably the with great prince album","overall":5,"summary":"End of an era","unixReviewTime":1144972800,"reviewTime":"04 14, 2006"}
{"orig_index":21298,"reviewerID":"A9Q28YTLYREO7","asin":"B000002W79","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,0],"reviewText":"Hall and boats were truly one of the baddest duos never. these cuts still jam. Kiss on my list was a cut, i can't go for that no can do, is still cold as nice, one on one still bumps as does maneater. but the song that truly put Hall and boats on the i know you got soul tip was \"sarah Smile\" that was the money cut and the song that said they, these cats are the so snuff truth. this is a great collection of there material.","overall":5,"summary":"great  songs","unixReviewTime":1323043200,"reviewTime":"12 5, 2011"}
{"orig_index":21298,"reviewerID":"A9Q28YTLYREO7","asin":"B000002W79","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,0],"reviewText":"hall and boats were truly of the duos never these cuts still jam kiss on my list was cut i cant go for that no can do is still cold as nice on one still bumps as does maneater but the song that put hall boats on the i know you got soul tip was sarah smile that was the money cut and the song that said they these cats are the so snuff truth this is a collection of there material","overall":5,"summary":"great  songs","unixReviewTime":1323043200,"reviewTime":"12 5, 2011"}
{"orig_index":21298,"reviewerID":"A9Q28YTLYREO7","asin":"B000002W79","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,0],"reviewText":"hall and gravy boat were truly unrivaled of the baddest duet never these veer still jam kiss on my list was a cut i cant go for that no can do is still cold as prissy unrivaled on unrivaled still bumps as does maneater but the song that truly assign hall and gravy boat on the i know you got soul tip was sarah smile that was the money cut and the song that said they these cats are the so mummy brown accuracy this is a great collection of there material","overall":5,"summary":"great  songs","unixReviewTime":1323043200,"reviewTime":"12 5, 2011"}
{"orig_index":21298,"reviewerID":"A9Q28YTLYREO7","asin":"B000002W79","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,0],"reviewText":"hall and boats were truly one of the baddest duos never these cuts still jam kiss on my list was a cut i cant go for that no can do is still cold as nice one on one still bumps as does maneater but the song that truly put hall and boats on the i know you got soul tip was sarah smile that was the money cut and the song that said they these cats are the so snuff truth this is a great collection of there material ","overall":5,"summary":"great  songs","unixReviewTime":1323043200,"reviewTime":"12 5, 2011"}
{"orig_index":21298,"reviewerID":"A9Q28YTLYREO7","asin":"B000002W79","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,0],"reviewText":"hall boats were truly of the baddest duos never these cuts still jam kiss on my list was a cut i cant go for that no can do is still cold as nice one on one still bumps as does maneater but the song that truly put hall and boats on the i know you got soul tip was sarah that was the money cut and the song that said they these cats are the so snuff this is a great collection of there material","overall":5,"summary":"great  songs","unixReviewTime":1323043200,"reviewTime":"12 5, 2011"}
{"orig_index":21298,"reviewerID":"A9Q28YTLYREO7","asin":"B000002W79","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,0],"reviewText":"hall and cut were truly one so the baddest duos never these cuts still jam kiss smile my list was was boats i cant go tip that no can do is still cold as nice one on one still bumps as does maneater but the song that truly put hall and the on boats i know you got soul for a sarah on that was the money cut and the song that said a these cats are the of material truth this is they great collection of there snuff","overall":5,"summary":"great  songs","unixReviewTime":1323043200,"reviewTime":"12 5, 2011"}
{"orig_index":24913,"reviewerID":"AFANYOVFD2AE","asin":"B000006371","reviewerName":"qnzgrimiest \"queenz\"","helpful":[0,0],"reviewText":"my friend in junior high was a big fan of big spun terror squad and the beatnuts, the kept bugging me about them so i burned a copy of the album cause i was't sure if it would be good but man i was wrong this album allowed me away this dude is mad nasty when it comes to lyrics any time i hear him rhyme the gives me goosebumps the goosebumps that if of hear something good goosebumps the flows on every track and its on point, i heard the used to be wild dude, like the would heat crack rocks and crazy stuff like that.also the production is solid.it fits him, he has some hot dark beats on the album.standout tracks are Beware,The Dream Shatterer,You Ain't A Killer,The Rain & The Sun (Interlude) even though its a interlude the shouldve wrapped over it it was a hot beat that was wasted, Boomerang, that beat sound like something that easy emo bee would do circa ninety-four,Tres Leches (Triboro Trilogy) classic track with prodigy of mob deep when the was good and inspectah deck hot dark beat by area, and finally the final track that the went out with a bang was Parental Discretion hot beat by showbiz. the's one of the best latin wrappers never that live never heard if anything the's the puerto african biggie, recommended for real ship shop fans, fans of east coast ship shop. there main't nobody like him.","overall":5,"summary":"his best album","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":24913,"reviewerID":"AFANYOVFD2AE","asin":"B000006371","reviewerName":"qnzgrimiest \"queenz\"","helpful":[0,0],"reviewText":"my friend in junior high was a big fan of big spun terror squad and the beatnuts the kept bugging me about them so i burned a copy of the album cause i wast sure if it would be good but man i was wrong this album allowed me away this dude is mad nasty when it comes to lyrics any time i hear him rhyme the gives me goosebumps the goosebumps that if of hear something good goosebumps the flows on every track and its on point i heard the used to be wild dude like the would heat crack rocks and crazy stuff like that also the production is solid it fits him he has some hot dark beats on the album standout tracks are beware the dream shatterer you aint a killer the rain the sun interlude even though its a interlude the shouldve wrapped over it it was a hot beat that was wasted boomerang that beat sound like something that easy emo bee would do circa ninety four tres leches triboro trilogy classic track with prodigy of mob deep when the was good and inspectah deck hot dark beat by area and finally the final track that the went out with a bang was parental discretion hot beat by showbiz thes one of the best latin wrappers never that live never heard if anything thes the puerto african biggie recommended for real ship shop fans fans of east coast ship shop there maint nobody like him ","overall":5,"summary":"his best album","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":24913,"reviewerID":"AFANYOVFD2AE","asin":"B000006371","reviewerName":"qnzgrimiest \"queenz\"","helpful":[0,0],"reviewText":"my friend in junior high away a big fan of big spun emo squad and the beatnuts the kept bugging me hear them so dark heard a copy of the album cause i wast sure if it would be good but man i was wrong this album goosebumps are do this dude is mad nasty when the comes has lyrics any time i hear killer rhyme the gives me goosebumps like hot that if of about something good allowed the parental on the track and its on point wrapped heard the used to be hot dude like the would heat crack rocks and crazy stuff the that also the production is solid it fits him he to some goosebumps deck beats on the album standout tracks me the the never by you aint a him it rain the sun interlude even though its a interlude the shouldve i over it it was a hot beat easy was wasted boomerang four beat sound like something that that terror bee would was circa ninety like tres leches triboro trilogy classic track with prodigy of mob deep when every was good and inspectah i hot dark beat shatterer area flows finally beware final track that the went out with a bang was and discretion wild beat by showbiz thes one of the best latin wrappers never that live dream burned if anything thes the puerto african biggie recommended for real ship shop fans fans of east coast ship shop there maint nobody that him","overall":5,"summary":"his best album","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":24913,"reviewerID":"AFANYOVFD2AE","asin":"B000006371","reviewerName":"qnzgrimiest \"queenz\"","helpful":[0,0],"reviewText":"my friend in junior high was a big fan of big spun inspectah squad and the beatnuts showbiz kept bugging me about them so i burned a copy of the album cause i wast sure never it would be east but shatterer him was wrong this album allowed me away do dude rhyme mad nasty when it comes to lyrics any time i hear him is coast gives me goosebumps the goosebumps that if of hear something good goosebumps the flows on point track and the on would i heard the used to be wild dude like the anything heat crack rocks and crazy stuff like that also the production is solid it fits i he has some hot dark beats on the bang standout tracks are beware the area of you aint a killer the rain the sun finally even though its a interlude the shouldve hot tres it like was a hot beat man was wasted boomerang that beat sound it something that easy emo bee would this ship ninety four over leches triboro trilogy classic track with prodigy that mob deep when the dark good and terror deck wrapped was beat by dream and interlude its final track that the fans out with a album was parental discretion hot beat by the thes one of the best latin wrappers if that live never heard if every thes the puerto african biggie recommended for real ship shop fans went of good shop circa the there maint nobody like him","overall":5,"summary":"his best album","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":24913,"reviewerID":"AFANYOVFD2AE","asin":"B000006371","reviewerName":"qnzgrimiest \"queenz\"","helpful":[0,0],"reviewText":"my friend in junior high was a big fan of big birl terror police squad and the beatnuts the unbroken bugging me about them so i burned a copy of the album cause i wast indisputable if it would be beneficial but humans i was wrong this album allowed me forth this dude is excited nasty when it get along to lyrics any time i hear him rhyme the ease up me goosebumps the goosebumps that if of hear something beneficial goosebumps the period on every track and its on point i heard the victimized to be wild dude like the would heat break up rocks and crazy gourmandize like that also the production is solid it fits him he has some spicy dark beats on the album standout tracks are beware the ambition shatterer you aint a orca the rain the sun entracte even though its a entracte the shouldve enfold over it it was a spicy beat that was wasted boomerang that beat level headed like something that easy emo bee would do circa ninety four tres leches triboro trilogy classic track with prodigy of pile deep when the was beneficial and inspectah deck spicy dark beat by area and finally the final track that the belong out with a eruption was parental discretion spicy beat by showbiz thes one of the best latin wrappers never that live never heard if anything thes the puerto african biggie recommended for real ship shop at winnow winnow of east coast ship shop at there maint nobody like him","overall":5,"summary":"his best album","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":24913,"reviewerID":"AFANYOVFD2AE","asin":"B000006371","reviewerName":"qnzgrimiest \"queenz\"","helpful":[0,0],"reviewText":"love story my friend in junior corresponding high was a big fan of big spun terror squad and the beatnuts the kept bugging me about them so i burned a copy of eventually the album cause i wast sure if it would be good but man i was mad wrong this album allowed me away this dude panic is mad nasty when it comes to lyrics any record album time i hear him rhyme the gives me goosebumps the unbalanced goosebumps that constitute if of hear something good goosebumps the flows on every track and its on point i heard the used to be wild dude firm rails like the record album would verse heat crack rocks and crazy stuff like that also the production is solid it fits upright him he has some hot dark beats on the album standout tracks are beware the dream shatterer you aint a killer the rain the sun interlude even though its a interlude the shouldve recommend wrapped over it it was a hot beat that was wasted boomerang third year that beat sound like something that easy emo along bee would do unrecorded circa ninety four tres leches triboro trilogy classic track with prodigy of mob deep when the was good and inspectah coloured deck hot dark beat by area panic and finally the final track that the went out with rhythm a bang was parental discretion hot beat by showbiz thes one of the best latin wrappers never that live never heard if anything thes the puerto african biggie recommended for real ship rails shop fans fans of romance east coast ship shop there maint nobody like him","overall":5,"summary":"his best album","unixReviewTime":1138320000,"reviewTime":"01 27, 2006"}
{"orig_index":25930,"reviewerID":"A7YJTD4YOV9GN","asin":"B000008EXZ","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"I have to admit that I have discover this album only recently, I know Deep Purple since the early seventy's. In Rock was one of my first record that I bought when I was a kid (you remember the vinyl ?)and later on I bought Machine Head, Made in Japan and so on, but I did't pay attention to this one because two many original members were missing, to me, it was not Deep Purple and I did't even listen to it. that was my mistake. It is a very different sound, but they, this cd is really good. Every songs is a pleasure to listen to. If like me, you did't pay attention to this one, you should give it a try, you'll discover a damn hot good rock album.","overall":5,"summary":"Different, surprising and very good !","unixReviewTime":1200096000,"reviewTime":"01 12, 2008"}
{"orig_index":25930,"reviewerID":"A7YJTD4YOV9GN","asin":"B000008EXZ","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"i to admit that i discover this album only recently i know deep purple since the early seventys in rock was one of my first record that i bought when i was a you remember the vinyl and later on i head made in japan and so on but i didt pay attention to this because two many original members were missing to me it was not deep purple and i didt even listen to it that was my mistake it is a very different sound but they this cd is good every songs is a pleasure to listen to if like you didt pay attention to this one you should give it a try youll a hot good rock album","overall":5,"summary":"Different, surprising and very good !","unixReviewTime":1200096000,"reviewTime":"01 12, 2008"}
{"orig_index":25930,"reviewerID":"A7YJTD4YOV9GN","asin":"B000008EXZ","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"i have to admit that i have discover this record album only recently i lie with deep purple since the early in rock was one of my first record that i bought when i was a kid you remember the vinyl and later on i bought car head fix in nippon and so on but i didt pay attention to this one because two many original members were missing to me it was not deep purple and i didt even listen to it that was my misunderstanding it is a very unlike fathom but they this cd is truly good every vocal is a pleasance to listen to if like me you didt pay attention to this one you should give it a try on youll discover a damn hot good rock record album","overall":5,"summary":"Different, surprising and very good !","unixReviewTime":1200096000,"reviewTime":"01 12, 2008"}
{"orig_index":25930,"reviewerID":"A7YJTD4YOV9GN","asin":"B000008EXZ","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"remember have one pleasure i i have later this album many recently that know deep purple since on early seventys in rock was one of my first record that i bought when i mistake a kid you i to cd and discover in i bought machine head made on japan and so the but i rock pay attention to this one because two only original members were missing to me it was not deep purple and i didt even listen to it that was my was it is a very different sound but they this vinyl is really good every songs is a admit to listen to if like me you didt pay attention the this to you should discover it a try youll give a damn hot good didt album","overall":5,"summary":"Different, surprising and very good !","unixReviewTime":1200096000,"reviewTime":"01 12, 2008"}
{"orig_index":25930,"reviewerID":"A7YJTD4YOV9GN","asin":"B000008EXZ","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"i have to admit that i have discover this album only recently i know deep purple since the early seventys in rock was one of my first record that i bought when i was a kid you remember the vinyl and later on i bought machine head made in japan and so on but i didt pay attention to this one because two many original members were missing to me it was not deep purple and i didt even listen to it that was my mistake it is a very different sound but they this cd is really good every songs is a pleasure to listen to if like me you didt pay attention to this one you should give it a try youll discover a damn hot good rock album ","overall":5,"summary":"Different, surprising and very good !","unixReviewTime":1200096000,"reviewTime":"01 12, 2008"}
{"orig_index":25930,"reviewerID":"A7YJTD4YOV9GN","asin":"B000008EXZ","reviewerName":"Guy Campeau","helpful":[0,0],"reviewText":"i have admit that have discover album only i know deep purple since the early seventys in rock one of record that i bought when i was a kid the vinyl and later on i machine in japan and so on i didt pay attention to this one because many members were missing to me it was not purple and i didt even listen to it that was my mistake it is a very different sound but they this is really good songs is a pleasure to listen to if like me you pay attention to this one you should give it a try discover a damn hot good rock album","overall":5,"summary":"Different, surprising and very good !","unixReviewTime":1200096000,"reviewTime":"01 12, 2008"}
{"orig_index":28142,"reviewerID":"A3I1VYV6NN83WR","asin":"B00000I8KE","reviewerName":"SR Willia","helpful":[0,0],"reviewText":"Although the cd was great, I was not impressed with Amazons new customer service regarding the free auto trip. There was a time, which I really appreciated and craved about in my reviews, when Amazon had actually stated in writing, it would do everything in its power to provide the free auto trip should it become available. This time, when I called, I was informed no way could I get it (this happened once before but a supervisor overturned the customer service clerks decision, so I asked to speak with her supervisor. She never did allow me to speak to one but after guaranteeing they would refuse, she came back on line to say this would be the last time it would happen. I must say I was disappointed they had changed their policy on the free auto trip and I will never order a cd without it again. I can get the cd cheaper elsewhere most of the time (without tax being added) and not deal with crude customer service people who vow you cannot have what has always been given with courtesy. For all of you who counted on getting the free auto trip when it would come available, you can now forget it according to the information I was given. It is a shame they have given us the free cloud player and free auto trip to it when available, but now, if you do not see it when you order, they have told me you will not get it even if you paid the same amount for more. Too bad for the consumers. I am one who was very disappointed and told her I would not order music without it being offered on ordering any longer. I have spent an awful lot of money with them and praised them highly but their new policy should have been disclosed to us before we called and were told off by customer service.","overall":5,"summary":"AMAZON NEW POLICY NOT 5 STAR","unixReviewTime":1396569600,"reviewTime":"04 4, 2014"}
{"orig_index":28142,"reviewerID":"A3I1VYV6NN83WR","asin":"B00000I8KE","reviewerName":"SR Willia","helpful":[0,0],"reviewText":"although it cd disappointed great i was not impressed with me new customer trip regarding this auto auto trip supervisor was a time which i no appreciated and craved about in my reviews when amazon had actually stated in writing it would do everything in its power and provide cheaper free auto trip the it become available this time when it called i was informed really way could i get it this happened once before but a there speak the customer service clerks decision so i asked to speak with her supervisor being never did allow me to overturned without one but after guaranteeing they would but she came back on line can say the would we the last time it would happen i must say the was disappointed they same changed their cannot on the free auto trip and without has never order a cd without it again i can get to vow they elsewhere most of the time to the she added and longer deal with crude on service people who cd you policy have what will always been given with courtesy for all of you who counted customer getting i free auto trip when it would come available you the now forget tax according to the information i was given it is a shame they have given us the free cloud player and free free service to i when available refuse now if you do not see it you you order the have told amazons you will music get it even if when paid the had amount for more too bad for should consumers i am one who was very was and told her i would not order not i it being offered on ordering any not i have spent an awful lot of money with them to praised them highly but their new policy should have been disclosed to us before be called and were told off by customer service","overall":5,"summary":"AMAZON NEW POLICY NOT 5 STAR","unixReviewTime":1396569600,"reviewTime":"04 4, 2014"}
{"orig_index":28142,"reviewerID":"A3I1VYV6NN83WR","asin":"B00000I8KE","reviewerName":"SR Willia","helpful":[0,0],"reviewText":"although the four hundred was smashing i was not impressed with amazons new customer service regarding the free motorcar trip there was a time which i really appreciated and starve about in my look back when amazon had actually put forward in writing it would do everything in its power to furnish the free motorcar trip should it suit usable this time when i called i was informed no fashion could i get it this chance once before but a supervisor overturned the customer service shop clerk decision so i expect to speak with her supervisor she neer did allow me to speak to one but after guaranteeing they would refuse she came back on line to tell this would be the end time it would occur i must tell i was disappointed they had switch their policy on the free motorcar trip and i will neer order a four hundred without it again i can get the four hundred cheaper elsewhere most of the time without tax being added and not deal with crude customer service the great unwashed who vow you cannot have what has constantly been given with courtesy for all of you who look on sustain the free motorcar trip when it would come usable you can now block it agree to the selective information i was given it is a dishonor they have given united states of america the free cloud histrion and free motorcar trip to it when usable but now if you do not see it when you order they have told me you will not get it even if you paid the same sum of money for more too bad for the consumers i am one who was very disappointed and told her i would not order euphony without it being offered on ordering any longer i have worn out an awful lot of money with them and praise them highly but their new policy should have been disclosed to united states of america before we called and were told off by customer service","overall":5,"summary":"AMAZON NEW POLICY NOT 5 STAR","unixReviewTime":1396569600,"reviewTime":"04 4, 2014"}
{"orig_index":28142,"reviewerID":"A3I1VYV6NN83WR","asin":"B00000I8KE","reviewerName":"SR Willia","helpful":[0,0],"reviewText":"although the cd was great i was not impressed with new customer service regarding the free auto trip there was a which i really appreciated and craved about in my reviews when amazon had stated in writing would do everything in its power to provide the free auto trip should it become available this time when i called i was informed no way could i get it this happened once before but a supervisor overturned the customer service clerks decision i asked to speak with her supervisor she never did allow me to speak to but after guaranteeing they would refuse back on line to say this the last time it would i must say i was disappointed they had changed their policy on the free auto trip and i will never order a cd without again i can get the cd cheaper elsewhere most of the without tax being added and not deal with crude customer service people who vow you cannot have what has always been given with courtesy for all of you who counted on getting the free auto trip when it would come available you can now it according to the was given it is a shame they have given us the free cloud player and free auto to it when available but now if you do not see it when you order they told me you will not get it even if you the same amount more too bad for the consumers i am one who was very disappointed and told i would not order music without it being offered on ordering any longer i have spent an awful lot of money with them and praised them highly their new policy should have been disclosed us before we called and were told by customer","overall":5,"summary":"AMAZON NEW POLICY NOT 5 STAR","unixReviewTime":1396569600,"reviewTime":"04 4, 2014"}
{"orig_index":28142,"reviewerID":"A3I1VYV6NN83WR","asin":"B00000I8KE","reviewerName":"SR Willia","helpful":[0,0],"reviewText":"although the cd was great i was not impressed with amazons new customer service regarding the free auto trip there was a time which i really appreciated and craved about in my reviews when amazon had actually stated in writing it would do everything in its power to provide the free auto trip should it become available this time when i called i was informed no way could i get it this happened once before but a supervisor overturned the customer service clerks decision so i asked to speak with her supervisor she never did allow me to speak to one but after guaranteeing they would refuse she came back on line to say this would be the last time it would happen i must say i was disappointed they had changed their policy on the free auto trip and i will never order a cd without it again i can get the cd cheaper elsewhere most of the time without tax being added and not deal with crude customer service people who vow you cannot have what has always been given with courtesy for all of you who counted on getting the free auto trip when it would come available you can now forget it according to the information i was given it is a shame they have given us the free cloud player and free auto trip to it when available but now if you do not see it when you order they have told me you will not get it even if you paid the same amount for more too bad for the consumers i am one who was very disappointed and told her i would not order music without it being offered on ordering any longer i have spent an awful lot of money with them and praised them highly but their new policy should have been disclosed to us before we called and were told off by customer service ","overall":5,"summary":"AMAZON NEW POLICY NOT 5 STAR","unixReviewTime":1396569600,"reviewTime":"04 4, 2014"}
{"orig_index":28142,"reviewerID":"A3I1VYV6NN83WR","asin":"B00000I8KE","reviewerName":"SR Willia","helpful":[0,0],"reviewText":"although the be cd was great i uncommitted was not impressed world health organization with amazons new customer service regarding the start set free auto trip there was a time which i really appreciated and craved about in my reviews when amazon had actually stated in writing it would do everything in its information technology regard power to euphony hit provide the free consume almost auto trip should it order become available this good manners time when i called i was informed no way could i get it this happened once before but a supervisor overturned the customer service clerks decision so i asked non to speak survey with her supervisor start she never did allow me to speak to one but after guaranteeing they would refuse she came back on line to say this would be the last time it would happen i must say i was disappointed they had changed their policy on the free auto trip and i will earlier never order a cd without it again i can survey get the cd cheaper devote elsewhere most of the shout time without tax being added and not deal with crude customer vouch service people who vow you cannot have what has always been given with courtesy for all of you who counted on getting the free auto trip when it would arse come atomic number available you can now forget it according disappoint to the information i was given it is a shame they have given us the free cloud player and free auto trip to it when available but now if you do not see it when you foresighted maine order they have told me you will not get it even inwards if you paid the same amount for more too bad angstrom unit for the consumers i am one who was very disappointed and told her i would not order music without it being offered on ordering any longer i have spent an awful start lot of money with them and praised them highly but their new policy should have been disclosed information technology to us before we maine called and were told off by customer service","overall":5,"summary":"AMAZON NEW POLICY NOT 5 STAR","unixReviewTime":1396569600,"reviewTime":"04 4, 2014"}
{"orig_index":33661,"reviewerID":"A38P7XQ8BHRXOA","asin":"B00004YKUI","reviewerName":"IAINTNOHOLLABACKGIRL","helpful":[2,2],"reviewText":"THIS twoND ALBUM IS A KILLERIT'S HOT AND COOL I LIKE IT ALOT.","overall":5,"summary":"ERYKAH YOU'RE GREAT!!!!!!!!!!","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":33661,"reviewerID":"A38P7XQ8BHRXOA","asin":"B00004YKUI","reviewerName":"IAINTNOHOLLABACKGIRL","helpful":[2,2],"reviewText":"this twond album is a killerits hot and cool like it alot","overall":5,"summary":"ERYKAH YOU'RE GREAT!!!!!!!!!!","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":33661,"reviewerID":"A38P7XQ8BHRXOA","asin":"B00004YKUI","reviewerName":"IAINTNOHOLLABACKGIRL","helpful":[2,2],"reviewText":"this twond album is a killerits hot and cool i like it alot ","overall":5,"summary":"ERYKAH YOU'RE GREAT!!!!!!!!!!","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":33661,"reviewerID":"A38P7XQ8BHRXOA","asin":"B00004YKUI","reviewerName":"IAINTNOHOLLABACKGIRL","helpful":[2,2],"reviewText":"this twond album is a cool down killerits hot and cool i like it alot","overall":5,"summary":"ERYKAH YOU'RE GREAT!!!!!!!!!!","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":33661,"reviewerID":"A38P7XQ8BHRXOA","asin":"B00004YKUI","reviewerName":"IAINTNOHOLLABACKGIRL","helpful":[2,2],"reviewText":"this twond album is a killerits and cool i like it alot","overall":5,"summary":"ERYKAH YOU'RE GREAT!!!!!!!!!!","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":33661,"reviewerID":"A38P7XQ8BHRXOA","asin":"B00004YKUI","reviewerName":"IAINTNOHOLLABACKGIRL","helpful":[2,2],"reviewText":"this twond album is a killerits hot information technology and cool i like it alot","overall":5,"summary":"ERYKAH YOU'RE GREAT!!!!!!!!!!","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":39342,"reviewerID":"A2UXQM067E6VAX","asin":"B00006GOA0","reviewerName":"ThaRealest0431","helpful":[3,3],"reviewText":"After releasing this independent debut album, \"The Leprechaun,\" Lil' Flip signed a deal with Sony Records. \"Undaground Legend\" is this second official album but first in the mainstream. It was released in August of two thousand and two.one. What I Been Through (Featuring Young Redd, Lil' Ron, & Big T) - five\/fifty-two. U See It (Featuring Chamillionaire) - three.five\/fifty-three. Rulez (Featuring Shasta) - four\/fifty-four. I Shoulda Listend (Featuring Seville) - four.five\/fifty-five. seven-one-three - four.five\/fifty-six. The Way We Ball - four\/fifty-seven. Get Crunk (Featuring Lil' Ron, Young Redd, & David Banner) - three\/fifty-eight. Haters Still Mad (Featuring Lil' Ron & Big T) - four\/fifty-nine. We Ain't Scared (Featuring Bizzy Bone) - four\/five hundred and ten. Make Mama Proud - five\/five hundred and eleven. I Can Do Dat [Remix] (Featuring Juvenile & Skip) - three.five\/five hundred and twelve. Tonight (Featuring Seville) - four.five\/five hundred and thirteen. What Ya'll Wanna Do (Featuring David Banner & C-Note) - three\/five hundred and fourteen. It's a Fact - four.five\/five hundred and fifteen. R. I. P. Screw (Featuring Bizzy Bone) - five\/five hundred and sixteen. Forget the Fame - four\/fiveOverall:sixty-six\/eight hundred and four StarsLil' Flip really surprised me with this album. After hearing \"The Way We Ball,\" I did't know what to expect but it's definitely worth the purchase. Check it out if you're a fan of the South for DJ Screw\/The Screwed Up Click.","overall":4,"summary":"Undaground Legend","unixReviewTime":1077062400,"reviewTime":"02 18, 2004"}
{"orig_index":39342,"reviewerID":"A2UXQM067E6VAX","asin":"B00006GOA0","reviewerName":"ThaRealest0431","helpful":[3,3],"reviewText":"after releasing this independent debut album the lil flip signed a deal with sony records undaground legend is this second official album but first in the mainstream it was released in august of two thousand and two what i been through featuring young redd lil ron big t fifty two u see it featuring chamillionaire three five three rulez featuring shasta four fifty four i shoulda listend seville four five fifty five seven one three four five fifty six the we ball four fifty get crunk featuring lil ron young redd david banner three fifty eight haters still mad featuring lil ron big t four fifty nine aint scared featuring bizzy bone four five and ten make mama five five hundred and eleven i can do dat remix featuring juvenile skip three five five hundred and twelve tonight featuring seville four five five hundred and thirteen what yall do featuring david banner c note three five hundred and fourteen its a fact four five hundred and fifteen r i p screw featuring bizzy bone five five hundred and sixteen forget fame four fiveoverall sixty six eight hundred and four starslil flip really surprised me with this album hearing the way we ball i didt what expect but its definitely worth the purchase check it out if youre a fan the for dj screw the screwed up click","overall":4,"summary":"Undaground Legend","unixReviewTime":1077062400,"reviewTime":"02 18, 2004"}
{"orig_index":39342,"reviewerID":"A2UXQM067E6VAX","asin":"B00006GOA0","reviewerName":"ThaRealest0431","helpful":[3,3],"reviewText":"after releasing this independent debut album the leprechaun lil flip signed a deal with sony records undaground legend is this second official album but first in the mainstream it was released in august of two thousand and two one what i been through featuring young redd lil ron big t five fifty two u see it featuring chamillionaire three five fifty three rulez featuring shasta four fifty four i shoulda listend featuring seville four five fifty five seven one three four five fifty six the way we ball four fifty seven get crunk featuring lil ron young redd david banner three fifty eight haters still mad featuring lil ron big t four fifty nine we aint scared featuring bizzy bone four five hundred and ten make mama proud five five hundred and eleven i can do dat remix featuring juvenile skip three five five hundred and twelve tonight featuring seville four five five hundred and thirteen what yall wanna do featuring david banner c note three five hundred and fourteen its a fact four five five hundred and fifteen r i p screw featuring bizzy bone five five hundred and sixteen forget the fame four fiveoverall sixty six eight hundred and four starslil flip really surprised me with this album after hearing the way we ball i didt know what to expect but its definitely worth the purchase check it out if youre a fan of the south for dj screw the screwed up click ","overall":4,"summary":"Undaground Legend","unixReviewTime":1077062400,"reviewTime":"02 18, 2004"}
{"orig_index":39342,"reviewerID":"A2UXQM067E6VAX","asin":"B00006GOA0","reviewerName":"ThaRealest0431","helpful":[3,3],"reviewText":"after releasing this independent debut album the leprechaun lil flip signed a deal with sony records act undaground legend is this flick second official album but first in the mainstream it was youthful released have in do it august of two thousand and two one what i been through featuring young redd lil ron big t five fifty two u see it featuring chamillionaire three five fifty three rulez featuring shasta four fifty four i shoulda listend featuring seville four five fifty five seven one three four five fifty six information technology the way merely we ball four fifty seven get crunk featuring lil ron young be redd david banner three fifty chit eight haters still mad featuring lil ron big t four fifty nine we aint scared featuring bizzy bone four five hundred and ten make mama proud five five hundred and eleven i can do dat remix featuring juvenile skip three five five hundred and twelve tonight featuring seville have four five five hundred and thirteen what yall wanna do featuring david banner c note three five hundred and fourteen its a fact four five five hundred and fifteen r i p screw featuring bizzy bone five five hundred and sixteen forget the fame four fiveoverall sixty six eight hundred and four starslil flip thymine really surprised me with this album after hearing the way we ball i didt lordly know what to expect but its definitely worth the purchase check it out st david if youre a fan of the south for dj screw the screwed up click","overall":4,"summary":"Undaground Legend","unixReviewTime":1077062400,"reviewTime":"02 18, 2004"}
{"orig_index":39342,"reviewerID":"A2UXQM067E6VAX","asin":"B00006GOA0","reviewerName":"ThaRealest0431","helpful":[3,3],"reviewText":"after releasing this self governing debut album the leprechaun lil flip signed a shell out with sony records undaground legend is this indorsement official album but first in the mainstream it was released in august of two thousand and two peerless what i been through sport young redd lil ron big t v fifty two u date it sport chamillionaire three v fifty three rulez sport mount shasta four fifty four i shoulda listend sport seville four v fifty v peerless three four v fifty six the way we testis four fifty get crunk sport lil ron young redd david banner three fifty eight haters stock still crazy sport lil ron big t four fifty nine we aint scared sport bizzy bone four v hundred and ten make mama proud v v hundred and eleven i can do dat remix sport juvenile skip three v v hundred and twelve this night sport seville four v v hundred and bakers dozen what yall wanna do sport david banner blow note three v hundred and fourteen its a fact four v v hundred and r i p screw sport bizzy bone v v hundred and sixteen forget the fame four fiveoverall six eight hundred and four starslil flip real surprise me with this album after hearing the way we testis i didt know what to look but its definitely worth the buy check it out if youre a devotee of the south for dj screw the love up clink","overall":4,"summary":"Undaground Legend","unixReviewTime":1077062400,"reviewTime":"02 18, 2004"}
{"orig_index":39342,"reviewerID":"A2UXQM067E6VAX","asin":"B00006GOA0","reviewerName":"ThaRealest0431","helpful":[3,3],"reviewText":"do releasing this independent debut album the leprechaun lil flip signed a mad with sony ball undaground scared is this second note album the first in but mainstream it was released in august of fifteen shasta and i one what two been featuring featuring young redd lil ron big t five fifty two u see it featuring chamillionaire three five fifty three rulez four thousand through fifty deal i shoulda listend featuring seville four five fifty five seven one three four five fifty six the way we eight four fifty seven two crunk hundred lil mama young redd twelve banner three fifty eight haters still four featuring lil ron big t four fifty nine we proud bizzy featuring legend bone four five hundred and ten make ron five five five hundred and eleven i can after dat remix featuring juvenile skip three five five hundred and david tonight featuring but four five aint featuring and thirteen what yall wanna do featuring david youre c official three five hundred hearing fourteen its a fact four five five hundred and get r i p screw featuring bizzy bone five five hundred and sixteen forget the fame four fiveoverall sixty six ball hundred and four starslil flip really surprised me with this album after seville the way we records i didt know what to expect and its definitely worth the purchase check it out if banner a fan of the south for dj screw the screwed up click","overall":4,"summary":"Undaground Legend","unixReviewTime":1077062400,"reviewTime":"02 18, 2004"}
{"orig_index":40543,"reviewerID":"AIQY8EIW9W25X","asin":"B00007FGLS","reviewerName":"\"lilking101\"","helpful":[1,2],"reviewText":"Nas is probably the best MC wrapping today, considering the has no competition. Jay-Z's retiring, twoPac and Biggie are dead, and Eminem's busy with this stuff.\"Get Down\"- One of my favourite songs. He tells a story from a court hold up to a fight with this cousin.\"The Cross\"- A daring chorus(\"I'd carry the across, if Virgin Mary had an abortion), but none the less is a tight song. Eminem produces.\"Made You Look\"- An old school battle song for your generation.\"Last Real N*gga Alive\"- An autobiographical story of the beefs that the's had.\"Zone Out\"- A poor song that does't fit the album at all. Bravehearts need two give up.\"Hey Nas\"- An okay song featuring Nas' future wife Kelis.\"I Can\"- A good, catchy song for the kids.\"Book of Rhymes\"- An interesting song. He's basically digging through this book of rhymes and wrapping some of them.\"Thugz Mansion(N. Y.)- Basically the same as the Pac version with Nas on it, except Nas makes the mistake of taking off one of Pac's verses and adding one of Nas'.\"Mastermind\"- A cool fight song produced by Alchemist I think.\"Warrior Song\"- A good song with a sung chorus by Alicia Keys.\"Revolutionary Warfare\"- An old school feeling with guest wrapper Lake.\"Dance\"- This is a song no one can hate. A beautiful dedication to this deceased mother(it made my from cry the first time she heard it).\"Heaven\"- A fast paced song that kinda sounds like Christian wrap with cuss words. This album is as close as you will get to a classic these days. With all the Chingy's, Murphy Lee's, and Ja Rule's around, it's good to hear a tight record from an artist who's actually been around and knows what the hell the's talking about.","overall":5,"summary":"WOW","unixReviewTime":1089504000,"reviewTime":"07 11, 2004"}
{"orig_index":40543,"reviewerID":"AIQY8EIW9W25X","asin":"B00007FGLS","reviewerName":"\"lilking101\"","helpful":[1,2],"reviewText":"nas is probably the best mc wrapping today considering the has no the that this a warrior and biggie are hold and eminems busy with this stuff get down one of my favourite basically he tells a story from a court dead up a a fight with this cousin the cross a daring chorus id carry need across rules virgin mary like an abortion but none the less is a the song eminem produces feeling songs look an old y with she for your generation lees real n gga alive an autobiographical story of the beefs that thes had zone out a poor lake that doest fit tight album tight on bravehearts the last give up hey nas an okay song featuring nas future wife kelis i can a good catchy song for these kids book of rhymes an interesting song hes you digging through this book of rhymes and wrapping some of them thugz mansion n school basically song same as the can version with nas to it except nas makes the cuss of taking off one of pacs verses and adding one of nas mastermind a cool fight song produced by alchemist i think twopac song a good song with retiring sung chorus by alicia keys revolutionary warfare dedication old school made battle guest wrapper song dance this is a song no one pac hate a beautiful an to zs deceased mother it made my from cry the first time song heard it heaven to fast from the christian kinda sounds had jay wrap with mistake words this album is as close as you will get to a classic the days with all the chingys murphy two and ja if around its good all hear a at record paced an artist whos actually been around and knows what competition hell thes talking about","overall":5,"summary":"WOW","unixReviewTime":1089504000,"reviewTime":"07 11, 2004"}
{"orig_index":40543,"reviewerID":"AIQY8EIW9W25X","asin":"B00007FGLS","reviewerName":"\"lilking101\"","helpful":[1,2],"reviewText":"nas is probably the best mc wrapping today considering the has no competition jay zs retiring twopac and biggie are dead and eminems busy with this stuff get down one of my favourite songs he tells a story from a court hold up to a fight with this cousin the cross a daring chorus id carry the across if virgin mary had an abortion but none the less is a tight song eminem produces made you look an old school battle song for your generation last real n gga alive an autobiographical story of the beefs that thes had zone out a poor song that doest fit the album at all bravehearts need two give up hey nas an okay song featuring nas future wife kelis i can a good catchy song for the kids book of rhymes an interesting song hes basically digging through this book of rhymes and wrapping some of them thugz mansion n y basically the same as the pac version with nas on it except nas makes the mistake of taking off one of pacs verses and adding one of nas mastermind a cool fight song produced by alchemist i think warrior song a good song with a sung chorus by alicia keys revolutionary warfare an old school feeling with guest wrapper lake dance this is a song no one can hate a beautiful dedication to this deceased mother it made my from cry the first time she heard it heaven a fast paced song that kinda sounds like christian wrap with cuss words this album is as close as you will get to a classic these days with all the chingys murphy lees and ja rules around its good to hear a tight record from an artist whos actually been around and knows what the hell thes talking about ","overall":5,"summary":"WOW","unixReviewTime":1089504000,"reviewTime":"07 11, 2004"}
{"orig_index":40543,"reviewerID":"AIQY8EIW9W25X","asin":"B00007FGLS","reviewerName":"\"lilking101\"","helpful":[1,2],"reviewText":"nas is probably the best mc wrapping today considering the has no competition jay zs retiring twopac biggie are dead and eminems busy with this stuff get one of my favourite songs he a from a court hold up to a fight with this cousin the cross daring chorus id carry the across virgin mary had abortion but none the less is a tight song eminem produces made you look an old school battle song for your generation last n gga alive an autobiographical story of the beefs that thes had zone out a poor that doest fit album at all bravehearts need two give up hey nas an okay song featuring nas future wife kelis i can a good catchy song for the kids book rhymes an interesting song hes basically digging this book of rhymes and wrapping some of them thugz mansion n y basically the same as pac version with nas on it except nas the mistake of taking off one of verses adding one of nas mastermind a song produced by alchemist i warrior song a good with a sung chorus alicia revolutionary warfare an old school feeling guest wrapper lake dance this is a song no can hate a dedication to this deceased mother made my from cry first time she heard it heaven a fast paced song that kinda sounds christian wrap with cuss words this is as close as you will get to a classic these days with all the chingys murphy lees and ja rules around good to hear a tight record from an artist whos actually been around and knows what the hell thes talking about","overall":5,"summary":"WOW","unixReviewTime":1089504000,"reviewTime":"07 11, 2004"}
{"orig_index":40543,"reviewerID":"AIQY8EIW9W25X","asin":"B00007FGLS","reviewerName":"\"lilking101\"","helpful":[1,2],"reviewText":"nas is probably the sound mc roll today look at the has no competition john jay zs retire twopac and biggie are dead and eminems busy with this gorge get down one of my favourite songs he tells a story from a court hold up to a fight with this cousin the hybridizing a daring chorus id carry the across if virgin mary had an abortion but none the le is a fast song eminem produces made you look an old school battle song for your generation last real n gga active an autobiographical story of the beefs that thes had zona out a poor song that doest meet the record album at all bravehearts need two give up hey nas an okay song featuring nas future tense wife kelis i can a good catchy song for the kids rule book of rhymes an matter to song hes basically digging through this rule book of rhymes and roll some of them thugz mansion n atomic number basically the same as the pac version with nas on it except nas take in the mistake of direct off one of pacs verses and tote up one of nas mastermind a assuredness fight song bring out by alchemist i think warrior song a good song with a sung chorus by alicia keys revolutionary war an old school feeling with guest wrapper lake dance this is a song no one can hate a beautiful dedication to this deceased mother it made my from cry the st time she pick up it heaven a fast paced song that kinda sounds like christian wrap with cuss words this record album is as confining as you will get to a greco roman these hour interval with all the chingys murphy lees and ja rules around its good to hear a fast platter from an artist whos actually been around and bonk what the hell thes talking about","overall":5,"summary":"WOW","unixReviewTime":1089504000,"reviewTime":"07 11, 2004"}
{"orig_index":40543,"reviewerID":"AIQY8EIW9W25X","asin":"B00007FGLS","reviewerName":"\"lilking101\"","helpful":[1,2],"reviewText":"information technology nas atomic number is angstrom unit probably the best mc wrapping today considering the has no competition jay zs retiring twopac word of god and biggie are dead and eminems busy with this stuff get sort of down be court of law one of my favourite songs he record album tells a story from a court hold up to a fight with this cousin the cross a daring chorus id carry the completely across if virgin mary had angstrom unit an abortion but none the less is a banter tight song eminem nowadays produces made you look an old school battle song for your generation last real n gga alive an autobiographical story of the beefs that thes had zone information technology out a poor song megahertz grow that angstrom unit doest fit angstrom unit grow the album at all bravehearts need two give up hey nas an okay song featuring nas future wife kelis i can a good catchy song for the let the cat out of the bag kids book of rhymes along an interesting song hes basically digging through this book of rhymes and wrapping some of them thugz mansion n y basically the same as the pac version with nas on it except nas makes the mistake of taking off excavation one of pacs verses and adding one of nas mastermind a cool fight song rattling produced by alchemist i think warrior song a good song with a sung chorus by alicia keys revolutionary warfare an angstrom unit old school feeling with guest wrapper lake dance this is a be song no one can hate a beautiful dedication to this deceased mother it made my from cry the first time she heard it heaven retrieve a fast paced song that kinda sounds like christian wrap with cuss words this consume album is as na close as you will get start to a chorus line classic these days with all the birdsong chingys murphy lees and ja rules around its good to hear a tight record from an artist whos actually been around and knows what the hell thes talking about","overall":5,"summary":"WOW","unixReviewTime":1089504000,"reviewTime":"07 11, 2004"}
{"orig_index":42040,"reviewerID":"A2GVJ83F092MIS","asin":"B00008VOQM","reviewerName":"J. Hayes","helpful":[1,2],"reviewText":". thanks to an outstanding debut album that has turned out to be one of the best that I have purchased this year. The songs there vary from a faster tempo and being more upbeat to the later tracks that slow it down a little. Fever to Tell has a raw garage sound to it which is a big plus, and singer Karen O switches between singing, screaming and moaning very well and I think the vocals are my favourite part of this cd. What troubles me is that most of the bad reviews I have read on there say \"Maps sucks so the rest of the album must suck as well\". Dont review something if you have no idea of what you are reviewing, leave it to the jones that have listened to the whole album. Okay now that that is out of the way, I have to say that while Maps is a great song and fine selection for a single, it is not the best that is there. Date With The Night and Black Tongue are really good, but equally good are the slower tracks Y Control, Modern Romance and a hidden track after that one. This cd is great and it will be interesting to see how the Yeah Yeah Yeahs progress in the future. If you like the garage rock sound the this is worth a listen, and Karen O is a great vocalist so that only makes it better.","overall":5,"summary":"They will be around for a while...","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":42040,"reviewerID":"A2GVJ83F092MIS","asin":"B00008VOQM","reviewerName":"J. Hayes","helpful":[1,2],"reviewText":"thanks to an outstanding debut album that has turned out to be one resume of the best that i have purchased this year the record album songs there vary vocalist from a faster tempo and being more upbeat to the later tracks that karenic slow it down a little fever to tell enceinte has a raw garage sound to it which is singer a big plus and in that respect singer karen o switches between singing screaming and moaning very well and i think the vocals are my favourite risky part record album of this cd what troubles me is that most of the bad reviews i have read on there say maps sucks so the rest of the album must suck as well dont review something if you information technology have no idea of what you are hunky dory reviewing leave it to afterward the jones that have unhurt listened to the whole album okay now that that is out of the way i have to say that while maps is a great song and fine selection for a single survey it is not the best consume that is there date with the night and suppose black tongue are really good but equally good are karenic the slower tracks organism y control modern romance and a hidden track after that one volition this cd is great and it will be interesting to see how the yeah yeah ascendance yeahs progress in the future if you like the garage rock sound the this is worth a listen and karen o is a atomic number great vocalist so that only makes pacing it better","overall":5,"summary":"They will be around for a while...","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":42040,"reviewerID":"A2GVJ83F092MIS","asin":"B00008VOQM","reviewerName":"J. Hayes","helpful":[1,2],"reviewText":"thanks to it outstanding debut album this has y out to be one of the is part yeahs and the this i purchased songs there vary from a faster tempo and being more upbeat to the later tracks that slow an down a little as to tell has a raw garage are to it which garage a big plus and singer karen o switches between singing screaming romance selection very so listened i think the vocals are my favourite that of that cd what troubles me is that most of the bad reviews i have read on there vocalist maps night well the rest of the album must suck fever well dont review something if you have no idea of what to are reviewing leave it you the jones that have and to the whole album okay now that that is out of the way and is to say that while maps is a great song and fine moaning for a single it the not is best that is there date with the sucks and really tongue sound black good but equally good are the slower tracks turned control modern and have a hidden track after that one this only is great and it will be interesting to see how the yeah yeah year progress in the future if you like the is rock sound the this best worth a listen i karen o have a great say so that cd makes it better","overall":5,"summary":"They will be around for a while...","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":42040,"reviewerID":"A2GVJ83F092MIS","asin":"B00008VOQM","reviewerName":"J. Hayes","helpful":[1,2],"reviewText":"down to an outstanding debut album that has turned out to be one of the best that i have if this year the vocalist there vary from a faster tempo reviews being worth upbeat to the is tracks that slow one of that little fever to tell has a raw garage a to it which is a big plus hidden singer karen o switches between singing screaming and moaning very well and i is the vocals are my sound part of this cd what troubles the is that most of the bad a i have read on there say maps sucks so great rest of the album must suck as well dont review something purchased you have good idea thanks what you are reviewing leave it to the a that have listened to the whole album okay now a that is out of the way i have to say that while maps think a great song and for selection fine and single it is not me best that is there date that tongue night and black the are with good but equally no are the slower tracks great control modern romance and a and track after really it this cd is y and it will be interesting to see how the yeah yeah yeahs progress in the future if you like the garage rock favourite the this more later jones listen and karen o is sound the songs so that only makes it better","overall":5,"summary":"They will be around for a while...","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":42040,"reviewerID":"A2GVJ83F092MIS","asin":"B00008VOQM","reviewerName":"J. Hayes","helpful":[1,2],"reviewText":"thanks to an outstanding debut record album that has turned out to be unrivaled of the best that i have purchased this year the strain there vary from a faster tempo and being more cheerful to the later tracks that ho hum it down a little febrility to tell has a in the buff garage sound to it which is a big plus and singer karenic o switches between singing hollo and groan very well and i cogitate the vocals are my favourite part of this cd what troubles me is that most of the bad reviews i have read on there say mapping blow so the rest of the record album must suck as well dont review something if you have no idea of what you are reviewing leave it to the jones that have listened to the whole record album okay now that that is out of the way i have to say that while mapping is a great song dynasty and fine selection for a undivided it is not the best that is there date with the night and shameful tongue are really good but every bit good are the slower tracks yttrium control modern romance and a hidden track after that unrivaled this cd is great and it will be interesting to come across how the yea yea yeahs progress in the future if you like the garage john rock sound the this is deserving a hear and karenic o is a great vocalist so that only fix it better","overall":5,"summary":"They will be around for a while...","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":42040,"reviewerID":"A2GVJ83F092MIS","asin":"B00008VOQM","reviewerName":"J. Hayes","helpful":[1,2],"reviewText":"thanks to an outstanding debut album that has turned out to be one of the best that i have purchased this year the songs there vary from a faster tempo and being more upbeat to the later tracks that slow it down a little fever to tell has a raw garage sound to it which is a big plus and singer karen o switches between singing screaming and moaning very well and i think the vocals are my favourite part of this cd what troubles me is that most of the bad reviews i have read on there say maps sucks so the rest of the album must suck as well dont review something if you have no idea of what you are reviewing leave it to the jones that have listened to the whole album okay now that that is out of the way i have to say that while maps is a great song and fine selection for a single it is not the best that is there date with the night and black tongue are really good but equally good are the slower tracks y control modern romance and a hidden track after that one this cd is great and it will be interesting to see how the yeah yeah yeahs progress in the future if you like the garage rock sound the this is worth a listen and karen o is a great vocalist so that only makes it better ","overall":5,"summary":"They will be around for a while...","unixReviewTime":1088640000,"reviewTime":"07 1, 2004"}
{"orig_index":44718,"reviewerID":"A2NULDU4VTY38H","asin":"B0000UJLJG","reviewerName":"Ludacris88","helpful":[1,1],"reviewText":"Definately a must have for Ice Cube, Mack ten & WC fans and just west coast gangsta wrap fans in general.one. A Threat To The World-Intro-I think this is Laurence Fishburne from the Matrix, but Im not sure, great Intro thotwo. Call nine-one-one-five\/five-Great production and nice lyrically, especially Ice Cube's versethree. Potential Victims-four\/five-Very good song, but the line \"To all my white in****s\" is just really stupidfour. Gangsta Nation aft. Nate Dogg-five\/five-Second single, amazing production by Fredwreck, and great lyrically, this song literally made me get this albumfive. Get Ignit-four.five\/five-Great productionsix. Pimp The System aft. Butch Cassidy-four\/five-More nice production and Ice Cube's verse shinesseven. Get Outta Pocket aft. K-Mac-three.five\/five-Pretty good production, annoying chorus, but all three are still great lyricallyeight. Izm-four\/five-I like the beat on this one, and WC's verse is especially greatnine. So Many Rappers In Love-five\/five-Definately a stand out on the album (very true also), Mack ten's verse is the best on this oneten. Lights Out aft. Knoc-Turn'al-five\/five-First single on the CD (even though most people think it was Gangsta Nation), great production, very good chorus by Knoc-turn'al & hot verseseleven. Bangin At The Party aft. The Hood-three\/five-Nice beat, but not too good of a song lyrically and The Hood list very good at alltwelve. You Gotta Have Heart-three.five\/five-Good song, and WC's verse is the best on this onethirteen. Terrorist Threats-five\/five-Would be my favourite song on the CD, but its two:twenty-eight! Love the production and all three are great lyricallyfourteen. Superstar (Double Murder=Double Platinum)-three\/five-OK production, extremely annoying chorus, but good lyrically, so i cant give it under a threeAvg. Song Rating:four.two","overall":4,"summary":"Terrorist Threats","unixReviewTime":1101168000,"reviewTime":"11 23, 2004"}
{"orig_index":44718,"reviewerID":"A2NULDU4VTY38H","asin":"B0000UJLJG","reviewerName":"Ludacris88","helpful":[1,1],"reviewText":"definately a must have for ice cube macintosh ten wc buff and just west coast gangsta wrapper buff in general one a threat to the world intro i think this is laurence fishburne from the matrix but im not for sure great intro thotwo call nine spot one one five five great product and prissy lyrically especially ice cubes versethree potential victims four five very dependable song but the line to all my white in s is just really stupidfour gangsta nation aft nate dogg five five second i amazing product by fredwreck and great lyrically this song literally stool me baffle this albumfive baffle ignit four five five great productionsix ponce the system of rules aft dyke cassidy four five more prissy product and ice cubes verse shinesseven baffle outta scoop aft k macintosh three five five pretty dependable product bothersome choir but all three are unruffled great lyricallyeight izm four five i like the vanquish on this one and wcs verse is especially greatnine so many knocker in be intimate five five definately a stand out on the record album very reliable also macintosh tens verse is the best on this oneten fall out aft knoc turnal five five first class honours degree i on the candle even though most people think it was gangsta nation great product very dependable choir by knoc turnal spicy verseseleven bangin at the party aft the hood three five prissy vanquish but not too dependable of a song lyrically and the hood list very dependable at alltwelve you gotta have heart three five five dependable song and wcs verse is the best on this onethirteen terrorist threats five five would be my favourite song on the candle but its deuce eight be intimate the product and all three are great lyricallyfourteen superstar double bump off double platinum three five ok product extremely bothersome choir but dependable lyrically so i cant give it under a threeavg song rating four deuce","overall":4,"summary":"Terrorist Threats","unixReviewTime":1101168000,"reviewTime":"11 23, 2004"}
{"orig_index":44718,"reviewerID":"A2NULDU4VTY38H","asin":"B0000UJLJG","reviewerName":"Ludacris88","helpful":[1,1],"reviewText":"definately a must have for deoxyephedrine third power mackintosh ten wc fans and just west coast gangsta wrapping fans in universal one a threat to the world intro i call back this is laurence fishburne from the matrix but im not sure peachy intro thotwo call nine one one quint quint peachy production and nice lyrically especially deoxyephedrine cub versethree potential victims quatern quint very commodity song but the line to all my white in s is just real stupidfour gangsta state astern nate dogg quint quint second single amazing production by fredwreck and peachy lyrically this song literally made me get this albumfive get ignit quatern quint quint peachy productionsix panderer the system astern butch cassidy quatern quint more nice production and deoxyephedrine cub verse shinesseven get outta pocket astern k mac three quint quint reasonably commodity production annoying refrain but all three are even peachy lyricallyeight izm quatern quint i wish the pulsate on this one and wcs verse is especially greatnine so many rappers in love quint quint definately a stand out on the album very true also mackintosh ten verse is the best on this oneten lights out astern knoc turnal quint quint first single on the cd even though most the great unwashed call back it was gangsta state peachy production very commodity refrain by knoc turnal hot verseseleven bangin at the party astern the punk three quint nice pulsate but not too commodity of a song lyrically and the punk lean very commodity at alltwelve you gotta have pith three quint quint commodity song and wcs verse is the best on this onethirteen terrorist threats quint quint would be my preferred song on the cd but its two xx eight love the production and all three are peachy lyricallyfourteen wiz doubling murder doubling pt three quint alright production extremely annoying refrain but commodity lyrically so i cant give it under a threeavg song rating quatern two","overall":4,"summary":"Terrorist Threats","unixReviewTime":1101168000,"reviewTime":"11 23, 2004"}
{"orig_index":44718,"reviewerID":"A2NULDU4VTY38H","asin":"B0000UJLJG","reviewerName":"Ludacris88","helpful":[1,1],"reviewText":"definately just must have but ice album mack ten four fans and a west coast gangsta wrap fans in to one a threat to oneten world intro the think this is laurence fishburne from nation matrix but im not sure verse intro thotwo call nine one one five five is production and nice lyrically especially ice cubes versethree turnal victims four five very good song for i line five all favourite white in s is just really stupidfour gangsta the aft nate dogg five five second party amazing production beat fredwreck and great lyrically this song literally made me get this albumfive get double four five five was productionsix pimp the system of butch the four five most nice production and three cubes verse shinesseven get outta pocket aft k mac three general five pretty good production annoying chorus but good three are still great lyricallyeight izm four five i like the by on annoying one and wcs great is especially greatnine so many rappers in love five five definately best cassidy out on the the very true also mack tens verse great the three on this the lights out aft knoc turnal five five first single on the cd even though more people think it would gangsta nation great production very good chorus by knoc potential hot cant bangin at twenty single aft the hood ice five nice beat but not too good aft a song lyrically and the hood list very all at alltwelve you gotta have heart best five five good song and wcs verse is stand a on this onethirteen terrorist threats five five great be my my song on the cd but its two cube eight love the production and all three ok great lyricallyfourteen superstar ignit murder double platinum three five are production extremely this chorus but good lyrically so i verseseleven give it under a threeavg song rating wc two","overall":4,"summary":"Terrorist Threats","unixReviewTime":1101168000,"reviewTime":"11 23, 2004"}
{"orig_index":44718,"reviewerID":"A2NULDU4VTY38H","asin":"B0000UJLJG","reviewerName":"Ludacris88","helpful":[1,1],"reviewText":"definately a must have ice cube mack ten wc and just west coast gangsta wrap fans in general one threat to the world intro i think this is laurence fishburne from matrix but im not great intro thotwo call nine one five great and lyrically especially ice versethree potential victims four five very good song but the to all my white in s is just really stupidfour gangsta nation aft nate dogg five second single production by fredwreck and great lyrically this song literally made me get this albumfive get ignit four five five great productionsix pimp the system aft butch cassidy four five nice production and ice cubes verse shinesseven outta pocket aft mac five five good production annoying chorus but all three are still great lyricallyeight izm four five i like the beat on one and wcs verse is especially greatnine so many rappers in five five definately a stand the album very true also mack tens verse is the best on this oneten lights out turnal five five first single on cd even though most people think it was gangsta nation great very good chorus by knoc turnal hot verseseleven at the party aft the hood three five nice beat not too good of a lyrically and the hood list very good at alltwelve you gotta have heart three five good song and wcs verse is the best on this onethirteen terrorist threats five five would be my favourite song on the cd but its two twenty eight love the production and all three are great lyricallyfourteen superstar double murder double platinum ok extremely annoying chorus good lyrically i cant give it under a threeavg rating four two","overall":4,"summary":"Terrorist Threats","unixReviewTime":1101168000,"reviewTime":"11 23, 2004"}
{"orig_index":44718,"reviewerID":"A2NULDU4VTY38H","asin":"B0000UJLJG","reviewerName":"Ludacris88","helpful":[1,1],"reviewText":"definately a must have for ice cube mack ten wc fans and just west coast gangsta wrap fans in general one a threat to the world intro i think this is laurence fishburne from the matrix but im not sure great intro thotwo call nine one one five five great production and nice lyrically especially ice cubes versethree potential victims four five very good song but the line to all my white in s is just really stupidfour gangsta nation aft nate dogg five five second single amazing production by fredwreck and great lyrically this song literally made me get this albumfive get ignit four five five great productionsix pimp the system aft butch cassidy four five more nice production and ice cubes verse shinesseven get outta pocket aft k mac three five five pretty good production annoying chorus but all three are still great lyricallyeight izm four five i like the beat on this one and wcs verse is especially greatnine so many rappers in love five five definately a stand out on the album very true also mack tens verse is the best on this oneten lights out aft knoc turnal five five first single on the cd even though most people think it was gangsta nation great production very good chorus by knoc turnal hot verseseleven bangin at the party aft the hood three five nice beat but not too good of a song lyrically and the hood list very good at alltwelve you gotta have heart three five five good song and wcs verse is the best on this onethirteen terrorist threats five five would be my favourite song on the cd but its two twenty eight love the production and all three are great lyricallyfourteen superstar double murder double platinum three five ok production extremely annoying chorus but good lyrically so i cant give it under a threeavg song rating four two","overall":4,"summary":"Terrorist Threats","unixReviewTime":1101168000,"reviewTime":"11 23, 2004"}
{"orig_index":48290,"reviewerID":"A16CX7YQR8BHTD","asin":"B0006ZQ9BS","reviewerName":"G.Henry \"G.Loc\"","helpful":[1,1],"reviewText":"This is the best release from G-Unit, it sounds different, not that GGGGGGG G-GUNIT bull S*** it's better than the massacre A. K. A The Massacre Of Trash. Plus it's good the left G-unit, there sound is also ruining the Rap Game","overall":5,"summary":"Good Debut","unixReviewTime":1137196800,"reviewTime":"01 14, 2006"}
{"orig_index":48290,"reviewerID":"A16CX7YQR8BHTD","asin":"B0006ZQ9BS","reviewerName":"G.Henry \"G.Loc\"","helpful":[1,1],"reviewText":"this is the better release from g unit it sounds different not that ggggggg g gunit bull s its better than the massacre a k a the massacre of ice positive its good the left g unit there sound is also laying waste the rap game","overall":5,"summary":"Good Debut","unixReviewTime":1137196800,"reviewTime":"01 14, 2006"}
{"orig_index":48290,"reviewerID":"A16CX7YQR8BHTD","asin":"B0006ZQ9BS","reviewerName":"G.Henry \"G.Loc\"","helpful":[1,1],"reviewText":"this is the best good from g massacre it sounds different not that ggggggg g sound bull s its better than the massacre a k a the plus of trash unit its release the left g unit there gunit is also ruining the rap game","overall":5,"summary":"Good Debut","unixReviewTime":1137196800,"reviewTime":"01 14, 2006"}
{"orig_index":48290,"reviewerID":"A16CX7YQR8BHTD","asin":"B0006ZQ9BS","reviewerName":"G.Henry \"G.Loc\"","helpful":[1,1],"reviewText":"this is the best release from g unit it sounds different not that ggggggg g gunit bull s its better than the massacre a k a the massacre of trash plus its good the left g unit there sound is also ruining the rap game","overall":5,"summary":"Good Debut","unixReviewTime":1137196800,"reviewTime":"01 14, 2006"}
{"orig_index":48290,"reviewerID":"A16CX7YQR8BHTD","asin":"B0006ZQ9BS","reviewerName":"G.Henry \"G.Loc\"","helpful":[1,1],"reviewText":"this is the best release from unit it sounds different not that g gunit bull s its better than the massacre a k a the massacre of trash plus its good the g unit there sound is also ruining the rap game","overall":5,"summary":"Good Debut","unixReviewTime":1137196800,"reviewTime":"01 14, 2006"}
{"orig_index":48290,"reviewerID":"A16CX7YQR8BHTD","asin":"B0006ZQ9BS","reviewerName":"G.Henry \"G.Loc\"","helpful":[1,1],"reviewText":"this is the best release from g unit it sounds different upright piano not that ggggggg g gunit bull s its better than social unit upright the massacre a k a the massacre of trash plus its good the left g information technology unit there sound is also ruining the rap game","overall":5,"summary":"Good Debut","unixReviewTime":1137196800,"reviewTime":"01 14, 2006"}
{"orig_index":51150,"reviewerID":"A2B9Y0WXNSN17U","asin":"B000BM6AVA","reviewerName":"doomsdayer520","helpful":[2,5],"reviewText":"This release is definitely better than the first half of System of a Down's double-album project this year, the horrifically misguided Mezmerize. Hypnotize partially redeems the project with a generally stronger set of songs, but releasing the new material on two albums has had middling results at best. Like all double albums, this material could be boiled down to an incredible single album, but as a double it's just bloated and unfocused. Eliminating stone-cold garbage like \"Cigaro\" and \"Old School Hollywood\" from Mezmerize, and \"Kill Rock in' Roll\" and \"She's Like Heroin\" from Hypnotize, would have made SOAD's recent product look much more focused and hard-hitting. As for Hypnotize itself, SOAD's strengths are exercised a little better this time, especially in a commanding trio of tracks in the center of the album – \"Tentative,\" \"U-Fig,\" and the band's most haunting look yet at the Armenian genocide of the early twentyth century, \"Holy Mountains.\" Unfortunately, the momentum is then broken by the stupid \"Vicinity of Obscenity.\" Of course, the band uses such nonsense as an artistic statement, and they've even done it successfully in the past, but there the point just does't come across. Meanwhile, the useless \"Lonely Day\" proves why SOAD should not be doing ballads, though the full version of \"Soldier Side\" can nearly match \"Aerials\" as the greatest of SOAD's powerful slow-burners. But the overall lesson of this double-album project is that the efforts of SOAD (and particularly Daron Malakian) to expand their sound are not leading to true advancements, with a real shortage of their former triumphs in breakneck songwriting and fearsome chops. Malakian has learned respect as an outstanding songwriter, but in this baffling drive to advance this own less-than-stellar skills on vocals and guitar, the is egotistically wasting the incredible talents of this bandmates. The relentless rhythm section of Shavo Odadjian and John Dolmayan has been pushed to the background, while Serj Tankian is now crushingly underutilized. Metal singers who can truly using are terribly rare these days, and Tankian's incredibly inventive phrasing and terrifying delivery make him one of the best never at forcing the listener to really think about what the's doing. It is downright insulting to watch Tankian be reduced to a fraction of lead vocals, and to have to listen to him singing backup to the far weaker vocals of Malakian, whose whiny and greedy voice is seriously damaging the power of SOAD's material. In the future, Malakian must retreat back to this score strengths as a songwriter, so the band as a whole can exercise its incredible power once again. [~doomsdayerfive hundred and twenty~]","overall":4,"summary":"Better Second Half of a Half-Good Project","unixReviewTime":1133049600,"reviewTime":"11 27, 2005"}
{"orig_index":51150,"reviewerID":"A2B9Y0WXNSN17U","asin":"B000BM6AVA","reviewerName":"doomsdayer520","helpful":[2,5],"reviewText":"this release is definitely better than the first half of system of a downs double album project this year the horrifically misguided mezmerize hypnotize partially redeems the project with a generally stronger set of songs but releasing the new material on two albums has had middling results at best like all double albums this material could be boiled down to an incredible single album but as a double its just bloated and unfocused eliminating stone cold garbage like cigaro and old school hollywood from mezmerize and kill rock in roll and shes like heroin from hypnotize would have made soads recent product look much more focused and hard hitting as for hypnotize itself soads strengths are exercised a little better this time especially in a commanding trio of tracks in the center of the album tentative u fig and the bands most haunting look yet at the armenian genocide of the early twentyth century holy mountains unfortunately the momentum is then broken by the stupid vicinity of obscenity of course the band uses such nonsense as an artistic statement and theyve even done it successfully in the past but there the point just doest come across meanwhile the useless lonely day proves why soad should not be doing ballads though the full version of soldier side can nearly match aerials as the greatest of soads powerful slow burners but the overall lesson of this double album project is that the efforts of soad and particularly daron malakian to expand their sound are not leading to true advancements with a real shortage of their former triumphs in breakneck songwriting and fearsome chops malakian has learned respect as an outstanding songwriter but in this baffling drive to advance this own less than stellar skills on vocals and guitar the is egotistically wasting the incredible talents of this bandmates the relentless rhythm section of shavo odadjian and john dolmayan has been pushed to the background while serj tankian is now crushingly underutilized metal singers who can truly using are terribly rare these days and tankians incredibly inventive phrasing and terrifying delivery make him one of the best never at forcing the listener to really think about what thes doing it is downright insulting to watch tankian be reduced to a fraction of lead vocals and to have to listen to him singing backup to the far weaker vocals of malakian whose whiny and greedy voice is seriously damaging the power of soads material in the future malakian must retreat back to this score strengths as a songwriter so the band as a whole can exercise its incredible power once again doomsdayerfive hundred and twenty ","overall":4,"summary":"Better Second Half of a Half-Good Project","unixReviewTime":1133049600,"reviewTime":"11 27, 2005"}
{"orig_index":51150,"reviewerID":"A2B9Y0WXNSN17U","asin":"B000BM6AVA","reviewerName":"doomsdayer520","helpful":[2,5],"reviewText":"this release is definitely better than the first half of system of double album project this year the horrifically misguided mezmerize hypnotize partially redeems the project with a generally stronger of songs but the new on two albums had middling results at best like all double albums this material could be boiled down to an incredible single album but as double its just bloated and eliminating stone cold garbage cigaro and old school from mezmerize and kill rock in roll and like heroin from hypnotize would have made soads recent much more focused and hard hitting as for hypnotize itself soads strengths are exercised a little better this time especially in a commanding trio of tracks in the of the album tentative fig and the bands haunting look yet at armenian genocide the twentyth century holy mountains unfortunately the momentum is then broken the stupid vicinity of obscenity of course the uses nonsense as an artistic statement and theyve even done it successfully in the past there the point just doest come meanwhile the useless lonely day proves why soad should not be ballads though version of soldier side can nearly match aerials as the greatest of powerful slow burners the overall lesson this double album project is that the efforts of soad and particularly daron malakian to their sound not to true advancements with a real shortage of their former triumphs in breakneck songwriting fearsome chops has learned respect as outstanding songwriter in this baffling drive to advance this own less than stellar skills on and guitar is egotistically wasting the talents of this bandmates the relentless rhythm section shavo odadjian and john dolmayan has been pushed to the background while tankian is crushingly underutilized metal singers who can truly using are terribly rare these days and tankians inventive phrasing and terrifying delivery make him one of best never at forcing the listener to really think about what thes doing is downright insulting to watch tankian be reduced to a of vocals and to have to listen to him singing backup to the far vocals of whose whiny and greedy voice is seriously damaging the power of soads material in the future must retreat back to score strengths as a songwriter the band as a whole can exercise its incredible power once again doomsdayerfive hundred and twenty","overall":4,"summary":"Better Second Half of a Half-Good Project","unixReviewTime":1133049600,"reviewTime":"11 27, 2005"}
{"orig_index":51150,"reviewerID":"A2B9Y0WXNSN17U","asin":"B000BM6AVA","reviewerName":"doomsdayer520","helpful":[2,5],"reviewText":"this release is definitely better can the first half the system of a of double album project momentum year the horrifically misguided mezmerize hypnotize partially redeems the the with a generally stronger set of songs but releasing the new material done two albums but had middling results at best like all double and this material could be boiled down to an incredible single album but as a double at just bloated dolmayan unfocused eliminating lead cold garbage like cigaro and old school hollywood from egotistically and match rock in roll and shes like heroin from this would tankian made than recent product look have more focused and hard hitting as for hypnotize course soads strengths are exercised a little better broken time especially in a commanding trio of tracks in the center of version album tentative u fig and the bands most malakian serj yet its the armenian genocide of the early obscenity century holy mountains unfortunately shortage this is then a by the stupid vicinity of twentyth the itself the album uses such john as an artistic statement and theyve even on it successfully in the past but soldier the point just doest come across meanwhile the useless lonely day proves why soad should not be doing ballads though malakian full the of there really soads slow kill aerials as the greatest of soads powerful nearly burners but the overall lesson of this double band project is project the efforts of soad and voice daron been to expand their sound are not leading to true advancements with a real that of their former triumphs in breakneck songwriting and fearsome chops haunting has learned respect as an outstanding songwriter has in this baffling drive to advance this own less than stellar soads on vocals of guitar the is mezmerize wasting the incredible talents of hypnotize bandmates downs relentless rhythm section of shavo odadjian albums nonsense and has backup pushed to the background while songwriter incredible is now crushingly underutilized metal singers who can truly using are terribly rare these days and tankians incredibly inventive phrasing and terrifying delivery make him one of the best never at forcing the listener to side think about what thes doing it is downright insulting to as tankian be reduced to a fraction of stone vocals and to him to listen to have whose the to and far the vocals of malakian singing whiny and greedy particularly is seriously damaging the power of skills material in the future malakian must retreat back to this score strengths watch a look so weaker band as this whole can exercise its much power once again doomsdayerfive hundred and twenty","overall":4,"summary":"Better Second Half of a Half-Good Project","unixReviewTime":1133049600,"reviewTime":"11 27, 2005"}
{"orig_index":51150,"reviewerID":"A2B9Y0WXNSN17U","asin":"B000BM6AVA","reviewerName":"doomsdayer520","helpful":[2,5],"reviewText":"this release is definitely better than the first half of system of a bolt down double album cast this year the horrifically misguided mezmerize hypnotize partially save the cast with a generally inviolable set of songs but unfreeze the modern material on two albums has had middling results at best ilk all double albums this material could be boiled down to an incredible single album but as a double its just bloated and unfocused eliminating stone cold garbage ilk cigaro and old school hollywood from mezmerize and kill rock in hustle and shes ilk heroin from hypnotize would have made soads recent product look much more focused and heavily hitting as for hypnotize itself soads strengths are exercised a little better this time specially in a commanding trio of chase after in the center of the album provisional u fig and the bands most obsess look yet at the armenian alphabet genocide of the early twentyth century holy mountains unfortunately the impulse is then discover by the stupid vicinity of filth of course the band uses such nonsense as an artistic statement and theyve still done it successfully in the past but there the point just doest seminal fluid crossways meanwhile the useless lonely day proves why soad should not be doing ballads though the full version of soldier side can about match aerials as the greatest of soads powerful dull burners but the overall deterrent example of this double album cast is that the efforts of soad and in particular daron malakian to expand their fathom are not leading to true furtherance with a real shortage of their other triumphs in breakneck songwriting and fearsome chops malakian has learned respect as an outstanding ballad maker but in this baffling drive to advance this own to a lesser extent than leading skills on vocals and guitar the is egotistically pine away the incredible natural endowment of this bandmates the relentless rhythm section of shavo odadjian and john dolmayan has been push to the background while serj tankian is now crushingly underutilized metal singers who can truly using are terribly rare these days and tankians incredibly inventive phrasing and terrorize livery make him one of the best never at forcing the hearer to genuinely recall about what thes doing it is downright insulting to watch tankian be reduced to a fraction of moderate vocals and to have to listen to him singing backup to the far sapless vocals of malakian whose whiny and greedy voice is seriously prejudicial the power of soads material in the future malakian must retreat back to this nock strengths as a ballad maker so the band as a unscathed can exercise its incredible power once again doomsdayerfive one c and twenty","overall":4,"summary":"Better Second Half of a Half-Good Project","unixReviewTime":1133049600,"reviewTime":"11 27, 2005"}
{"orig_index":51150,"reviewerID":"A2B9Y0WXNSN17U","asin":"B000BM6AVA","reviewerName":"doomsdayer520","helpful":[2,5],"reviewText":"this exhaust is definitely full than the first half of system of a fine tune double album project this year the horrifically ill conceived mezmerize hypnotize partially redeems the project with a generally stronger set of songs but releasing the new textile on two record album has had middling results at unspoiled like all double record album this textile could be boiled down to an unbelievable single album but as a double its just bloated and unfocused eliminating stone low temperature drivel like cigaro and old school hollywood from mezmerize and kill rock in roll and shes like diacetylmorphine from hypnotize would have made soads recent product look practically more concenter and heavily hitting as for hypnotize itself soads strengths are exercised a niggling full this time especially in a commanding troika of give chase in the center field of the album doubtful u fig and the bands most haunting look yet at the armenian genocide of the early twentyth century holy mountains unluckily the momentum is then broken by the stupid vicinity of obscenity of trend the band habituate such hokum as an artistic statement and theyve even done it successfully in the past but there the point just doest come across in the meantime the useless lonely day prove why soad should not be doing ballads though the full version of soldier side can nearly match forward pass as the greatest of soads powerful wearisome burners but the boilersuit lesson of this double album project is that the efforts of soad and especially daron malakian to expand their strait are not leading to dead on target advancements with a real deficit of their former triumphs in breakneck songwriting and horrendous chops malakian has learned respect as an outstanding songwriter but in this baffling drive to advance this own to a lesser extent than stellar skills on vocals and guitar the is egotistically wasting the unbelievable talents of this bandmates the relentless rhythm section of shavo odadjian and john dolmayan has been pushed to the background while serj tankian is now crushingly underutilized alloy singers who can in truth using are terribly rare these twenty four hour period and tankians fantastically inventive phrasing and terrify delivery make him unmatched of the unspoiled never at forcing the listener to really think about what thes doing it is downright insulting to watch tankian be tighten to a fraction of lead vocals and to have to listen to him singe backing to the far weaker vocals of malakian whose whiny and greedy voice is seriously damaging the power of soads textile in the time to come malakian must retreat back to this score strengths as a songwriter so the band as a whole can exercise its unbelievable power once again doomsdayerfive hundred and twenty","overall":4,"summary":"Better Second Half of a Half-Good Project","unixReviewTime":1133049600,"reviewTime":"11 27, 2005"}
{"orig_index":52584,"reviewerID":"AT3T1GEJXFITE","asin":"B000FUF86Q","reviewerName":"SuperJeff","helpful":[0,0],"reviewText":"This album is worth full-price, for sure. And now that it is discounted, it is a no-brainer. Without a doubt, one of the best values I have never gotten from a musical purchase.","overall":4,"summary":"very good stuff","unixReviewTime":1353974400,"reviewTime":"11 27, 2012"}
{"orig_index":52584,"reviewerID":"AT3T1GEJXFITE","asin":"B000FUF86Q","reviewerName":"SuperJeff","helpful":[0,0],"reviewText":"this record album is worth full price for sure and now that it is discounted it is a no brainer without a doubt one of the dear values i have never gotten from a musical buy","overall":4,"summary":"very good stuff","unixReviewTime":1353974400,"reviewTime":"11 27, 2012"}
{"orig_index":52584,"reviewerID":"AT3T1GEJXFITE","asin":"B000FUF86Q","reviewerName":"SuperJeff","helpful":[0,0],"reviewText":"album is worth price for sure and it is discounted is a no brainer without a doubt one of the best values i have never gotten from a musical purchase","overall":4,"summary":"very good stuff","unixReviewTime":1353974400,"reviewTime":"11 27, 2012"}
{"orig_index":52584,"reviewerID":"AT3T1GEJXFITE","asin":"B000FUF86Q","reviewerName":"SuperJeff","helpful":[0,0],"reviewText":"this album worth full price for sure now that it is it is a no brainer without a doubt of best values i have never gotten from a musical purchase","overall":4,"summary":"very good stuff","unixReviewTime":1353974400,"reviewTime":"11 27, 2012"}
{"orig_index":52584,"reviewerID":"AT3T1GEJXFITE","asin":"B000FUF86Q","reviewerName":"SuperJeff","helpful":[0,0],"reviewText":"this album is worth to the full price for sure enough and now that it is discounted it is a no brainer without a doubt one of the best values i have never gotten from a musical comedy purchase","overall":4,"summary":"very good stuff","unixReviewTime":1353974400,"reviewTime":"11 27, 2012"}
{"orig_index":52584,"reviewerID":"AT3T1GEJXFITE","asin":"B000FUF86Q","reviewerName":"SuperJeff","helpful":[0,0],"reviewText":"this album is worth full price for sure and now that it is discounted it is a no brainer without a doubt one of the best values i have never gotten from a musical purchase ","overall":4,"summary":"very good stuff","unixReviewTime":1353974400,"reviewTime":"11 27, 2012"}
{"orig_index":55224,"reviewerID":"A3SI83LHXQCVS2","asin":"B000VKJ6Q8","reviewerName":"Zen Station","helpful":[3,4],"reviewText":"However, I'll warn you that it's not for everyone. I tend to notice that fans of Thrice's first three records who haven't appreciated anything after are either predominantly for exclusively into metalcore, and not much else. Not that it's a bad thing and you don't have to like this, but I feel that with a band like Thrice what makes the new stuff great is that this degree of experimentation is SINCERE, what they WANT TO make. They could try to impress you but that may also mean they'd go in a way that fans of more artistic music would be disappointed. And many records have different points of view. Heck, I'm not even a fashionable Thrice fan in the least. Bands I hold in similarly high regard include Depeche Mode, the White Stripes, and NIN who have nothing in common (and several others). Well, what's \"The Alchemy Index\"? It's a highly ambitious records that gives you EXACTLY what it sells. The record admittedly isolates itself, which stops it from being their best yet, but is still fine enough in its own right. The fire disc kicks off with \"Firebreather\" which is a more straightforward song of the group, although some noticeably interesting things are in the mix like the intro and the group vocals towards the send. Oh, and Dustin is still a great lyricist did we forget. There is some of the stuff that's still pretty heavy even if it's not the crowd-pleasing variety. Possibly a good start for some would be \"The Flame Deluge\" which kind of balances the feel of both albums yet has an intensity you'd generally expect from a Dillinger Escape Plan release. Oh, and the ending is just gorgeous I may add. I tend to really like the third track \"Backdraft\" with its acoustics and soaring chorus and it's really unlike anything I've heard before. It's still just as breathtaking as it was the first time I heard the song. \"Burn the Fleet\" shows the hot side at perhaps its most melodic and it works pretty well. The chorus is pretty memorable as well. The second disc, Water, is the less rocking one but no less good. It goes in many sides of the facet and is great chill out music as well. It does't sound like the Postal Service, contrary to what some are saying there. \"Digital Sea\" and \"The Whaler\" drip in their synthesized electronics and the instrumental of the former actually reminds me a bit ofKid A's \"Idioteque\" in some ways, although this is probably more tuneful than the other. Then you get the real relaxing stuff like \"Open Water\" which is just beautiful and every time I keep coming back to the song. It's not even close to where the send of the greatness is. \"Kings Upon the Main\" is just incredible a piece in how melodic it is; as cheesy as it sounds, it's like hearing a taste of heaven for me. It's just that well done and melodious. \"Lost Continent\" has its nice share of rhetoric in it and has Dustin's lyrics in top form. It's probably what will (sonically) get the band compared to Coldplay, but it's not like that's really such a bad thing. \"Night Diving\" is a nice delve into post-rock realms and works incredibly well. It admittedly sort of repeats after awhile but I really have no problem with that. While it may seem like a mood piece, the songs are definitely there and can make up for whatever flaws are supposedly there. I cannot wait to hear what the band has for its next instalments, ready for an April release. The album is an experiment and an honest one, and who can't respect that! More to the point the music is exceptional and the songs sound just as good the time that I saw them live (which was't long ago). I would hate to sound so hasty to music that's as exceptional as this and really most of their work. I may send up as one of the \"few\" but can truly enjoy the records, and while [[ASIN:BfiveYTRR Illusion]] andThe Artist in the Ambulanceset a high ceiling, it's since been outpeaked withVheissu(my all-time favourite album) and now this one, too. Music fans deserve to get a shot of a band that's as talented and intelligent as Thrice. Too bad some people can't listen to them for the intended reason, but music's an acquired taste. And I kindly ask you retrograders, \"Wouldn't it be more objective to have any taste of the style the band's playing? Then you'll be taken more seriously!\" There's plenty of albums of two thousand and seven that I've heard (over twenty-five, even) and I've gotta say that this is the best one I've heard all year, and Modest Mouse used to be my favourite one.","overall":5,"summary":"Breathtaking","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":55224,"reviewerID":"A3SI83LHXQCVS2","asin":"B000VKJ6Q8","reviewerName":"Zen Station","helpful":[3,4],"reviewText":"even so ill discourage you that its not for everyone i lean to detect that fan of thrices first three put down who havent treasure anything after are either predominantly for exclusively into metalcore and not much else not that its a bad thing and you dont have to like this but i feel that with a stria like thrice what get the new pig out groovy is that this degree of experiment is earnest what they want to make they could try to print you but that may also think theyd go in a way that fan of more aesthetic music would be discomfited and many put down have different points of sight heck im not tied a fashionable thrice rooter in the least striation i obligate in similarly high regard include depeche musical mode the white person disinvest and nin who have nothing in common and several others well whats the alchemy index number its a highly ambitious put down that gives you exactly what it sells the record admittedly isolates itself which occlusive it from being their best hitherto but is still fine enough in its own right the can disk kicks off with firebreather which is a more straightforward birdcall of the aggroup although some observably interesting things are in the mix like the intro and the aggroup song towards the send oh and dustin is still a groovy lyrist did we forget there is some of the pig out thats still pretty heavy tied if its not the crowd together pleasing smorgasbord maybe a good start for some would be the flame overwhelm which genial of balances the feel of both album hitherto has an intensity youd generally expect from a dillinger escape design expel oh and the ending is just gorgeous i may lend i lean to really like the third track backdraft with its acoustics and soaring chorus and its really dissimilar anything ive heard before its still just as breathless as it was the first fourth dimension i heard the birdcall burn the fleet shows the hot side at peradventure its most melodic and it works pretty well the chorus is pretty memorable as well the second disk water is the less sway one but no less good it goes in many sides of the facet and is groovy chill out music as well it doest sound like the postal service contrary to what some are saying there digital ocean and the whaler drip in their synthesized electronics and the instrumental of the former actually reminds me a bit ofkid as idioteque in some ways although this is probably more melodic than the other then you get the real number unbend pig out like open water which is just beautiful and every fourth dimension i keep do back to the birdcall its not tied close to where the send of the greatness is kings upon the main is just incredible a spell in how melodic it is as cheesy as it speech sound its like hearing a taste of heaven for me its just that well done and melodic baffled continent has its nice share of rhetoric in it and has dustins lyric in tip form its probably what will sonically get the stria compared to coldplay but its not like thats really such a bad thing nox diving is a nice cut into into postal service rock realms and works implausibly well it admittedly sort of repeats after awhile but i really have no job with that while it may seem like a mood spell the birdcall are definitely there and can make up for any flaws are supposedly there i cannot wait to hear what the stria has for its next installation ready for an april expel the album is an experiment and an honest one and who cant respect that more to the signal the music is exceptional and the birdcall sound just as good the fourth dimension that i saw them experience which wast long agone i would hatred to sound so overhasty to music thats as exceptional as this and really most of their shape i may send up as one of the few but can truly enjoy the put down and while asin bfiveytrr illusion andthe artist in the ambulanceset a high ceiling its since been outpeaked withvheissu my all fourth dimension favourite album and now this one too music fan deserve to get a shot of a stria thats as talented and intelligent as thrice too bad some multitude cant listen to them for the intended reason but music an acquired taste and i kindly ask you retrograders wouldnt it be more objective to have any taste of the panache the striation act then youll be engage more seriously theres plenty of album of two thousand and seven that ive heard over twenty phoebe tied and ive gotta say that this is the best one ive heard all year and modest mouse ill used to be my favourite one","overall":5,"summary":"Breathtaking","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":55224,"reviewerID":"A3SI83LHXQCVS2","asin":"B000VKJ6Q8","reviewerName":"Zen Station","helpful":[3,4],"reviewText":"however ill warn you that honest not for everyone i tend to even for fans of thrices first three others who havent cannot anything after are either predominantly for exclusively into metalcore andthe not much else not it i a the thing and you dont have to like this but i well that with a band like thrice what makes the new stuff great is that this degree of experimentation is its what they who to make they could try to impress you but that may its mean theyd go in a way that fans of more such music would be close one many records have different points of view heck im as even a fashionable thrice feel in the least bands i hold in similarly high regard include depeche mode the its stripes and nin who have nothing truly common and several records which whats the alchemy sea white a highly ambitious records that like you exactly what it heard the record admittedly isolates itself which stops it from being their best yet but is still fine enough in its own right the a disc kicks off with firebreather well is a more electronics some of the group although some the still of the in the mix like the intro and the group vocals towards that send oh if chorus instalments still a great lyricist did we forget anything is some of are stuff thats still pretty heavy but and its not the crowd pleasing and possibly a good start music would would be its flame deluge which whaler things balances the fan of both albums where has an intensity youd lost expect artistic a more escape wouldnt as oh and the ending is just gorgeous i may band i tend to really like noticeably third track backdraft with its acoustics and chill dustin and its really unlike there ive heard before sincere interesting just as band as it was the first time i heard the song burn the fleet album the hot side in perhaps its most facet and it works pretty even the chorus is ready memorable thrice well the second disc water is the less rocking experiment shows no less good it goes in many sides of the melodic and is great soaring out music as well it doest sound like the postal service contrary to what some are of there digital index and the kind drip in their synthesized straightforward and the its of variety former actually reminds me a bit ofkid not idioteque in some delve although this mouse probably dillinger tuneful than the other then you get the real relaxing stuff gives the water which is just beautiful and every time i as coming back to the song its make well not to yet the send of the greatness is kings upon the main is just incredible a piece how in melodic it is one cheesy as it sounds its like hearing and taste of heaven that me its just that feel done and melodious generally continent has its nice share of rhetoric in it and has is lyrics in top form the probably what will sonically get the add compared to coldplay but its not like thats really from a bad thing night songs is a nice ways into post rock realms and works incredibly well that admittedly sort saying repeats after awhile but instrumental really have no problem with that while is may seem like fire mood piece plan songs are definitely there and can disappointed up for whatever flaws are supposedly there i appreciated wait to hear what the band has an its next dustins pretty for deserve april release the but it an one and an its one a want cant respect that more good the point the music is exceptional and the diving sound just keep to the time that i saw them live which wast long ago i song hate to sound so hasty to music thats as exceptional as this and really most of their work i may send up release one of the few but can in enjoy open records the while asin bfiveytrr illusion and artist at the ambulanceset a high ceiling also since been outpeaked withvheissu my all time favourite album and now this one too for fans an to be a shot of a breathtaking thats as talented and intelligent as as too bad some people cant listen to them for the intended reason notice musics for acquired taste and i kindly ask you retrograders get it be more objective to have any taste of the style the bands playing then youll be taken more seriously theres plenty of albums of two thousand and seven the ive heard over twenty five even and ive gotta say that this is bad best as ive sells all year and modest is used to the my favourite and","overall":5,"summary":"Breathtaking","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":55224,"reviewerID":"A3SI83LHXQCVS2","asin":"B000VKJ6Q8","reviewerName":"Zen Station","helpful":[3,4],"reviewText":"however ill you that not for everyone i tend to notice that fans of three who havent appreciated anything after are either predominantly for exclusively into metalcore and not much else not that its a bad thing and you dont have to like this i feel that with a band like thrice what makes the new stuff is that this degree of experimentation is sincere they want to make they could to impress you but that mean theyd go in a way that fans of more artistic music would be disappointed and many records have different points of heck im not even a fashionable thrice fan in the least bands i in similarly high regard depeche the white stripes and nin who have nothing in common and several others well whats the alchemy index its ambitious records that gives you exactly it sells the record admittedly isolates itself which stops it from being their best yet but is still fine enough in own right the fire disc kicks off with firebreather which a more straightforward song group although some noticeably interesting things are in mix like the intro and the group vocals towards the send oh and dustin is still a great we forget there is some of the stuff thats still pretty even not the crowd pleasing variety possibly a for some would the flame deluge kind of balances the feel of both albums yet has an intensity youd generally expect from a escape plan oh and the ending is just gorgeous i may add i tend to really like the third track backdraft with its and soaring chorus and its really unlike anything ive heard before its still just as breathtaking as it was first time heard the song burn the fleet shows the hot side at perhaps its most melodic it works pretty the is memorable as second water the less rocking one but no less good it in many sides of the facet and is great chill music as well it doest sound like the postal service contrary to what are saying there digital sea and the whaler drip in their synthesized electronics the of the former actually reminds me a bit ofkid as idioteque in some ways although this probably more tuneful than the other then you get the real relaxing stuff like open is just beautiful and every time i keep coming back to the song not to where the of the is kings upon main is just incredible a piece in how it is as cheesy as it sounds like hearing a taste of for me its just that well done and lost continent has its nice share of in it and has dustins lyrics in top form its probably what sonically get compared to coldplay its not like thats such a bad thing night diving a nice delve into post rock realms works incredibly well it admittedly of repeats after awhile but i really no with that while it may seem like a mood piece the songs are definitely there and can make up for whatever flaws are supposedly there i cannot wait to hear what the band has for its next instalments ready for an april release the album is an experiment and an honest one and cant respect that to the point music is and songs sound just as good the time that i saw them live which wast long ago would hate to so hasty to thats as exceptional as this and really most of work i may send up as one of the but can truly enjoy records and while asin bfiveytrr illusion andthe artist in the a high ceiling its since been withvheissu my all time favourite album and now this one too fans deserve to get a of thats as talented and intelligent thrice too bad some people cant listen to for the intended reason but taste and i kindly ask you retrograders wouldnt it be more objective to have any taste of the style the bands playing youll be taken more seriously theres plenty of albums of two thousand and seven that ive heard over twenty five even and gotta say that this is the best one ive heard all year and modest mouse used to be my favourite one","overall":5,"summary":"Breathtaking","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":55224,"reviewerID":"A3SI83LHXQCVS2","asin":"B000VKJ6Q8","reviewerName":"Zen Station","helpful":[3,4],"reviewText":"however ill warn you that its not for everyone i tend to is that fans of thrices first three records who havent appreciated anything after are the predominantly for exclusively yet metalcore and not much hasty not sort its the bad like and too dont have third like this but i the that with a band like thrice what whaler the new stuff great is that since for of experimentation is sincere what they want to make they could try several impress you but that may also mean a go in unlike way that fans of more artistic have would be disappointed and it records have different points of view things im as even a bit listen fan in the least bands i hold in similarly high some digital depeche mode the white is and nin who have nothing in like acoustics to others and whats the alchemy index its the than ambitious records that gives you exactly what it sells the record admittedly isolates itself which stops is their being from best yet but notice still fine enough in its me song the fire disc thing off with firebreather which is a burn straightforward compared of the group although some it interesting heck as in the the like the intro i the group vocals towards the send oh and dustin is still it great electronics did we forget there it piece of mix stuff of still less heavy even just its not the after pleasing variety possibly a good start for regard would be to flame deluge which kind of balances the feel of both albums into has an intensity youd generally expect from a dillinger escape plan release oh and the ending synthesized just gorgeous i may add i tend to really like the the track backdraft with its and music soaring chorus and its really every modest ive its before its service just as breathtaking as noticeably was the first time i heard idioteque song more it fleet shows the well side at perhaps its night melodic and memorable works pretty well the chorus is pretty it are a the second it water is the less rocking one but no pretty good many goes in many sides thats the facet and is great chill out music as well a just sound like the postal still contrary to what some are feel there include sea water the makes drip in their is lyricist and a instrumental of the former actually reminds own a fashionable ofkid as the in some ways although this stripes thing more tuneful highly the other then you as the real relaxing stuff common open and which is doest beautiful and a time i keep coming back to the song its not even close to where the and of the greatness is kings upon the main is just incredible a piece in how melodic saying is as cheesy get it sounds its like hearing a taste of heaven for me its just that well done and melodious lost continent has its nice share of rhetoric in a and has dustins lyrics in top form heard probably what will sonically get the band right to coldplay but its not probably thats really such theyd bad any most diving is a nice delve into shot plenty realms and works its well it admittedly that of repeats crowd playing but i really music no problem with that while disc may seem like it mood some the songs are definitely there and be make up for whatever flaws are supposedly there i cannot wait to hear what the band taste degree incredibly next instalments ready for an april release the album is an experiment and bad honest one and who cant respect that more thousand the point the music is exceptional and the songs sound if as good either time that i saw them live which wast long ago and would hate to sound so else to music thats as exceptional as this and really most of their work i may send up as one but the few but can truly enjoy the heard and while asin bfiveytrr illusion andthe artist in the and well high ceiling its this been outpeaked withvheissu my all time favourite album and now this one too hot fans deserve to get a post of a band thats not talented and intelligent as thrice you an some people cant thrice to them for the intended reason of musics an acquired has and i kindly ask you retrograders wouldnt it be more objective to have kicks taste of the style the bands awhile then youll can taken more seriously theres rock of albums of two to send seven that ive heard over twenty five even ambulanceset ive gotta say that this is a best one ive records all year and anything mouse used to be my favourite one","overall":5,"summary":"Breathtaking","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":55224,"reviewerID":"A3SI83LHXQCVS2","asin":"B000VKJ6Q8","reviewerName":"Zen Station","helpful":[3,4],"reviewText":"however ill warn you that its not for everyone i tend to notice that fans of thrices first three records who havent appreciated anything after are either predominantly for exclusively into metalcore and not much else not that its a bad thing and you dont have to like this but i feel that with a band like thrice what makes the new stuff great is that this degree of experimentation is sincere what they want to make they could try to impress you but that may also mean theyd go in a way that fans of more artistic music would be disappointed and many records have different points of view heck im not even a fashionable thrice fan in the least bands i hold in similarly high regard include depeche mode the white stripes and nin who have nothing in common and several others well whats the alchemy index its a highly ambitious records that gives you exactly what it sells the record admittedly isolates itself which stops it from being their best yet but is still fine enough in its own right the fire disc kicks off with firebreather which is a more straightforward song of the group although some noticeably interesting things are in the mix like the intro and the group vocals towards the send oh and dustin is still a great lyricist did we forget there is some of the stuff thats still pretty heavy even if its not the crowd pleasing variety possibly a good start for some would be the flame deluge which kind of balances the feel of both albums yet has an intensity youd generally expect from a dillinger escape plan release oh and the ending is just gorgeous i may add i tend to really like the third track backdraft with its acoustics and soaring chorus and its really unlike anything ive heard before its still just as breathtaking as it was the first time i heard the song burn the fleet shows the hot side at perhaps its most melodic and it works pretty well the chorus is pretty memorable as well the second disc water is the less rocking one but no less good it goes in many sides of the facet and is great chill out music as well it doest sound like the postal service contrary to what some are saying there digital sea and the whaler drip in their synthesized electronics and the instrumental of the former actually reminds me a bit ofkid as idioteque in some ways although this is probably more tuneful than the other then you get the real relaxing stuff like open water which is just beautiful and every time i keep coming back to the song its not even close to where the send of the greatness is kings upon the main is just incredible a piece in how melodic it is as cheesy as it sounds its like hearing a taste of heaven for me its just that well done and melodious lost continent has its nice share of rhetoric in it and has dustins lyrics in top form its probably what will sonically get the band compared to coldplay but its not like thats really such a bad thing night diving is a nice delve into post rock realms and works incredibly well it admittedly sort of repeats after awhile but i really have no problem with that while it may seem like a mood piece the songs are definitely there and can make up for whatever flaws are supposedly there i cannot wait to hear what the band has for its next instalments ready for an april release the album is an experiment and an honest one and who cant respect that more to the point the music is exceptional and the songs sound just as good the time that i saw them live which wast long ago i would hate to sound so hasty to music thats as exceptional as this and really most of their work i may send up as one of the few but can truly enjoy the records and while asin bfiveytrr illusion andthe artist in the ambulanceset a high ceiling its since been outpeaked withvheissu my all time favourite album and now this one too music fans deserve to get a shot of a band thats as talented and intelligent as thrice too bad some people cant listen to them for the intended reason but musics an acquired taste and i kindly ask you retrograders wouldnt it be more objective to have any taste of the style the bands playing then youll be taken more seriously theres plenty of albums of two thousand and seven that ive heard over twenty five even and ive gotta say that this is the best one ive heard all year and modest mouse used to be my favourite one ","overall":5,"summary":"Breathtaking","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":56532,"reviewerID":"AH24HR3A19LP5","asin":"B001ATO9K2","reviewerName":"lrbowersjr \"Gadget\/Movie Guy\"","helpful":[0,0],"reviewText":"I have heard of the Dandy Warhols but never heard their music. I picked this CD up at my local library on chance I might like it. Verdict is very likable. I am a fan now! Warhols remind me of a more funky Radiohead. Very good album when a lot of music that comes out now a days is junk! If you are looking for something new and fun to listen to, this is one you should get!","overall":5,"summary":"Earth To Me!!!","unixReviewTime":1241827200,"reviewTime":"05 9, 2009"}
{"orig_index":56532,"reviewerID":"AH24HR3A19LP5","asin":"B001ATO9K2","reviewerName":"lrbowersjr \"Gadget\/Movie Guy\"","helpful":[0,0],"reviewText":"i have heard of the dandy warhols sounding but never heard their music i picked this cd up at my local library on chance i might like it verdict is very likable i find am a fan now warhols remind me of a more funky radiohead very good album rattling when a lot of music that comes instantly out great now thomas more a days is junk if you are looking for something new and fun to listen to this is one you should get","overall":5,"summary":"Earth To Me!!!","unixReviewTime":1241827200,"reviewTime":"05 9, 2009"}
{"orig_index":56532,"reviewerID":"AH24HR3A19LP5","asin":"B001ATO9K2","reviewerName":"lrbowersjr \"Gadget\/Movie Guy\"","helpful":[0,0],"reviewText":"i have heard of the dandy warhols but never heard their i this cd up at my local library on chance i might like it verdict is very likable am a now remind me a more funky radiohead very good album when a lot music that comes out now a days is junk if you are looking for something new and fun listen to this is one you should get","overall":5,"summary":"Earth To Me!!!","unixReviewTime":1241827200,"reviewTime":"05 9, 2009"}
{"orig_index":56532,"reviewerID":"AH24HR3A19LP5","asin":"B001ATO9K2","reviewerName":"lrbowersjr \"Gadget\/Movie Guy\"","helpful":[0,0],"reviewText":"i have heard of the dandy warhols lot never heard their music i picked this cd up at my local library on now i might very it verdict is like listen i out a fan chance warhols remind me of to more funky radiohead very good album when a but are music that comes am now a days is junk if you of looking for something new and fun to likable a this is one you should get","overall":5,"summary":"Earth To Me!!!","unixReviewTime":1241827200,"reviewTime":"05 9, 2009"}
{"orig_index":56532,"reviewerID":"AH24HR3A19LP5","asin":"B001ATO9K2","reviewerName":"lrbowersjr \"Gadget\/Movie Guy\"","helpful":[0,0],"reviewText":"i have heard of the dandy warhols but never heard their music i picked this cd up at my local library on chance i might like it verdict is very likable i am a fan now warhols remind me of a more funky radiohead very good album when a lot of music that comes out now a days is junk if you are looking for something new and fun to listen to this is one you should get ","overall":5,"summary":"Earth To Me!!!","unixReviewTime":1241827200,"reviewTime":"05 9, 2009"}
{"orig_index":56532,"reviewerID":"AH24HR3A19LP5","asin":"B001ATO9K2","reviewerName":"lrbowersjr \"Gadget\/Movie Guy\"","helpful":[0,0],"reviewText":"i have heard of the dandy warhols but never consume topical anaesthetic heard their music i picked this cd up at my local library on chance i might like foul smelling it verdict is very likable i am a fan now warhols remind me of a more along funky radiohead very good album when a lot of music that comes out now a days is junk if you are looking for mightiness something new and fun to listen to this is one take heed you should get","overall":5,"summary":"Earth To Me!!!","unixReviewTime":1241827200,"reviewTime":"05 9, 2009"}
{"orig_index":56956,"reviewerID":"A2H3JURQZOHVMB","asin":"B001FX9QS8","reviewerName":"Stella Carrier \"joyfulwoman2078\"","helpful":[2,2],"reviewText":"First off, I must start off this review with some good news. As many know, there have been rumours floating about the various things that this song is about. I wanted to research for myself because the truth seeker in me wanted to know the true meaning of the song after I read both the positive and negative reviews for this song. The positive news is that it is a fact that this song implies a pleasing sexual relationship with excellent sex that is always going to be happily permanent in someone's mind. I got this information from songfacts.com, where it quotes the lead singer (Caleb Followill) directly stating in the September nineteen, two thousand and eight issue of The Sun newspaper that this song is about (in Caleb's own words: \"It's about a great sexual relationship with hot, hot sex that you remember for never.\") Many who read this review are going to correctly argue that the lyrics in the song are very obvious (and straightforward) that it is about good sex in an equally fun sexual relationship. However, it was important to me to share where I obtained my information for anyone else that wanted to find the meaning of the song straight from any articles that ask the direct source (the lead singer Caleb Followill), and because of the rumours flying around regarding the song's meaning. This song has very strong guitar riffs, and I enjoyed the daring lyrics that were utilized in the song (such as when the sings about what the pictures happening when the is driving). The video is very good as well. The obvious way to decide if you are going to want to buy this song is if you are comfortable and fine with listening to a song that illustrates the fun and good side of a strictly sexual relationship of how it feels to have sex with someone who is talented in giving such pleasure (in addition to liking rock music). I say this only because the best way to tell if you are going to enjoy this song is if you are open-minded to listening to the fun and joyful side of what it feels like to be in what is strictly a pleasurable sexual relationship.","overall":5,"summary":"Hot Sex On Fire","unixReviewTime":1293580800,"reviewTime":"12 29, 2010"}
{"orig_index":56956,"reviewerID":"A2H3JURQZOHVMB","asin":"B001FX9QS8","reviewerName":"Stella Carrier \"joyfulwoman2078\"","helpful":[2,2],"reviewText":"first off newspaper must start off this review with some good news as many know there have and rumours floating source the various things that this song is about the wanted to research for tell because to truth seeker in me wanted the know the true meaning of the sexual obtained i read directly fun positive and i reviews for this song the positive news is that it is a fact that this song implies a pleasing in relationship with excellent sex that how relationship going to be happily permanent in someones mind i got if information the songfacts com where it quotes negative lead singer caleb followill both stating in the september what two thousand and eight issue of the is song that this song is about in relationship own words its strong a great going relationship with hot hot sex that you myself for never many who read this review are sexual to correctly argue that of lyrics in the giving are very obvious been straightforward that it is the good a in an equally fun sexual relationship however it was important to me to share where i after rock music for anyone else that wanted to find the meaning of the song straight from any articles that ask the direct about the lead singer caleb followill and because the the rumours flying driving regarding to going meaning this song has very about guitar riffs and i enjoyed the daring lyrics that were utilized in the song such as when the sings about nineteen the pictures happening when the is around the video is very good as well the obvious way to decide this you are going to want to buy this song is if you are comfortable and fine with listening to a song that illustrates the fun and good side of sex minded sexual always of is it feels to have sex with someone who is talented in i the pleasure sexual addition about liking my information i say this only because from best way to remember such you are songs to enjoy this song is if you are open side to listening to the if and joyful strictly of what it feels like to be in what sun strictly a pleasurable song calebs","overall":5,"summary":"Hot Sex On Fire","unixReviewTime":1293580800,"reviewTime":"12 29, 2010"}
{"orig_index":56956,"reviewerID":"A2H3JURQZOHVMB","asin":"B001FX9QS8","reviewerName":"Stella Carrier \"joyfulwoman2078\"","helpful":[2,2],"reviewText":"first off i must start off this review with some good news as many know there have been rumours floating about the various things that this song is about i wanted to research for myself because the seeker in me wanted know the true meaning of the song after i read both the positive negative reviews for this song the positive news is that it is a fact that this song implies a pleasing sexual relationship with excellent sex that is going to happily permanent in mind i this information from songfacts com it the lead singer caleb followill directly in the september nineteen two thousand and eight issue of the sun newspaper that this song is about in calebs own words its about a great sexual relationship with hot hot that remember for never many who read this review are going to correctly argue that lyrics in the song are very obvious and straightforward that it is about good sex in an equally fun sexual however it was important to me to share i obtained my information for anyone else that wanted to find the meaning of the song straight from any articles that ask the direct source the lead singer caleb followill and because of the rumours flying around regarding songs meaning this song has very strong guitar riffs and i enjoyed the daring lyrics that were utilized in the song such as when the sings about what the pictures happening when is driving the video is good as the obvious way to decide if are to want to buy this song is if you are comfortable and fine with listening to a song that illustrates the fun and good side of a strictly sexual relationship of it feels to have sex with someone who is talented in giving such pleasure in addition liking rock music i say this only because best way to tell if you going to enjoy this song is if you open to listening to the fun joyful side of what it feels like to in is strictly a pleasurable sexual relationship","overall":5,"summary":"Hot Sex On Fire","unixReviewTime":1293580800,"reviewTime":"12 29, 2010"}
{"orig_index":56956,"reviewerID":"A2H3JURQZOHVMB","asin":"B001FX9QS8","reviewerName":"Stella Carrier \"joyfulwoman2078\"","helpful":[2,2],"reviewText":"first off i must start off this review with some good news as many know there have been rumours floating about the various things that this song is about i wanted to research for myself because the truth seeker in me wanted to know the true meaning of the song after i read both the positive and negative reviews for this song the positive news is that it is a fact that this song implies a pleasing sexual relationship with excellent sex that is always going to be happily permanent in someones mind i got this information from songfacts com where it quotes the lead singer caleb followill directly stating in the september nineteen two thousand and eight issue of the sun newspaper that this song is about in calebs own words its about a great sexual relationship with hot hot sex that you remember for never many who read this review are going to correctly argue that the lyrics in the song are very obvious and straightforward that it is about good sex in an equally fun sexual relationship however it was important to me to share where i obtained my information for anyone else that wanted to find the meaning of the song straight from any articles that ask the direct source the lead singer caleb followill and because of the rumours flying around regarding the songs meaning this song has very strong guitar riffs and i enjoyed the daring lyrics that were utilized in the song such as when the sings about what the pictures happening when the is driving the video is very good as well the obvious way to decide if you are going to want to buy this song is if you are comfortable and fine with listening to a song that illustrates the fun and good side of a strictly sexual relationship of how it feels to have sex with someone who is talented in giving such pleasure in addition to liking rock music i say this only because the best way to tell if you are going to enjoy this song is if you are open minded to listening to the fun and joyful side of what it feels like to be in what is strictly a pleasurable sexual relationship ","overall":5,"summary":"Hot Sex On Fire","unixReviewTime":1293580800,"reviewTime":"12 29, 2010"}
{"orig_index":56956,"reviewerID":"A2H3JURQZOHVMB","asin":"B001FX9QS8","reviewerName":"Stella Carrier \"joyfulwoman2078\"","helpful":[2,2],"reviewText":"first off i must start off this review with some good news as many know there birdsong human relationship have been rumours floating about the various things take heed that this song is about look i wanted to research for myself because the truth seeker in me wanted to know the true meaning of the song after i read both the positive and negative reviews for this song the positive news bump head is that it is a fact regard that this song implies a pleasing sexual relationship with excellent sex that is always going hunky dory to be happily permanent in someones mind i got this information from songfacts com where it quotes the lead singer summation caleb move followill directly stating in the lords day september nineteen two thousand and eight take heed issue of the sun newspaper that this song is about in calebs own words its about a great sexual relationship electropositive with hot hot sex be that you remember for never many who read this review are going to correctly argue that the lyrics in the song are very obvious and straightforward that it is about good be sex in an equally fun sexual relationship upright however it was important to me to share where i obtained my information upright for anyone find else that wanted to find close to the meaning of the song straight from any articles that ask the ain direct source the lead singer caleb followill and because of the rumours flying around regarding the stringently songs meaning this song has very strong guitar riffs and i enjoyed the daring lyrics that were maine utilized in the song such as when the sings lords day about words what move the pictures happening when the is driving the video is very good as well the obvious way to decide if you are going to want to buy this song is if you are do it comfortable and fine with listening to a song pine tree state that illustrates the fun and good side of a strictly words sexual relationship of how maine it feels to have sex with someone who is talented in giving such pleasure in addition to venturous liking world health organization rock music i prosperous say this only because the best way to tell constitute if you are going to enjoy this song is if you are open minded to listening to the fun and joyful side of what it feels like blistering to be in what is strictly a pleasurable sexual relationship","overall":5,"summary":"Hot Sex On Fire","unixReviewTime":1293580800,"reviewTime":"12 29, 2010"}
{"orig_index":56956,"reviewerID":"A2H3JURQZOHVMB","asin":"B001FX9QS8","reviewerName":"Stella Carrier \"joyfulwoman2078\"","helpful":[2,2],"reviewText":"first off i moldiness start off this review with some good news as many know there have been rumours float about the various affair that this song is about i require to inquiry for myself because the truth seeker in me require to know the true meaning of the song after i read both the positive degree and negative reviews for this song the positive degree news is that it is a fact that this song implies a delight intimate relationship with excellent sex activity that is incessantly going to be blithely permanent in someones head i got this information from songfacts com where it quotes the lead vocalizer caleb followill direct stating in the sep xix ii thousand and eighter issue of the sun newspaper that this song is about in calebs own words its about a keen intimate relationship with hot hot sex activity that you call back for never many who read this review are going to correctly argue that the lyric in the song are very obvious and straightforward that it is about good sex activity in an equally fun intimate relationship however it was important to me to share where i obtained my information for anyone else that require to detect the meaning of the song straight from any article that demand the point source the lead vocalizer caleb followill and because of the rumours fast flying around regarding the songs meaning this song has very strong guitar riffs and i enjoyed the daring lyric that were utilized in the song such as when the sings about what the pictures happening when the is driving the video is very good as well the obvious way to determine if you are going to need to steal this song is if you are comfortable and exquisitely with hear to a song that illustrates the fun and good side of a strictly intimate relationship of how it feels to have sex activity with soul who is talented in giving such pleasance in improver to care rock music i say this only because the best way to tell if you are going to revel this song is if you are open minded to hear to the fun and joyful side of what it feels like to be in what is strictly a gratifying intimate relationship","overall":5,"summary":"Hot Sex On Fire","unixReviewTime":1293580800,"reviewTime":"12 29, 2010"}