{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"Way back in one thousand, nine hundred and eighty-three for 'eighty-four, a rock music show there featured footage of a live-in-the-studio performance from Ry Cooder and those fabulous backing vocalists, presumably made during the sessions for this album. The next day at work, it was the only thing people talked about. And if never I mention it to a few former colleagues I still see, their eyes light up with the memory. I had already bought P&L on the strength of a Rolling Stone recommendation, so I was doubly ecstatic when I saw those clips ('If Walls Could Talk' and probably 'Tattler' and 'Jesus On The Mainline'). This is a terrific journey through American blues and gospel, with immaculate playing and an infectious sense of fun. The aforementioned 'Walls' is very cute, 'Tamp 'Em Up Solid' literally chugs along, 'Tattler' is gorgeous, but for me 'Fool For A Cigarette' is the standout: it's so cheerful it makes you almost proud to be a smoker, and that's saying something.","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"'if Walls Could Talk' and probably 'Tattler' and 'Jesus On The Mainline' are the highlights. 'Fool For A Cigarette' is so cheerful it makes you almost proud to be a smoker.","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"The aforementioned 'Walls' is very cute, 'Tamp 'Em Up Solid' literally chugs along, 'Tattler' is gorgeous, but for me 'Fool For A Cigarette' is the standout: it's so cheerful it makes you almost proud to be a smoker, and that's saying something. Way back in one thousand, nine hundred and eighty-three for 'eighty-four, a rock music show there featured footage of a live-in-the-studio performance from Ry Cooder and those fabulous backing vocalists, presumably made during the sessions for this album. I had already bought P&L on the strength of a Rolling Stone recommendation, so I was doubly ecstatic when I saw those clips ('If Walls Could Talk' and probably 'Tattler' and 'Jesus On The Mainline'). And if never I mention it to a few former colleagues I still see, their eyes light up with the memory. This is a terrific journey through American blues and gospel, with immaculate playing and an infectious sense of fun. The next day at work, it was the only thing people talked about.","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"This is a terrific journey through American blues and gospel, with immaculate playing and an infectious sense of fun . 'Fool For A Cigarette' is the standout: it makes you almost proud to be a smoker .","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"This CD is just plain great. There is no other explanation required. This is the perfect CD to listen to just before you fall asleep at night. Even the fast songs that I love such as Living Inside Your Love, You Know How to Love Me & Under Your Spell are just perfect for this. My fave of the slow jams is Be Careful (How U Treat My Love). This set is a winner from start to finish :)","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"Even the fast songs that I love such as Living Inside Your Love, You Know How to Love Me & Under Your Spell are just perfect for this. My fave of the slow jams is Be Careful (How U Treat My Love). This is the perfect CD to listen to just before you fall asleep at night. This CD is just plain great. There is no other explanation required. This set is a winner from start to finish :)","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"This CD is just plain great. There is no other explanation required. This is the perfect CD to listen to just before you fall asleep at night. Even the fast songs that I love such as Living Inside Your Love, You Know How to Love Me & Under Your Spell are just perfect for this .","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"this is the perfect CD to listen to just before you fall asleep at night. even the fast songs that i love such as Living Inside Your Love are just perfect. my fave of the slow jams is Be Careful.","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"Canadian sister duo Tegan and Sara follow-up two thousand and nine'sSainthoodwith two thousand and thirteen's fine offeringHeartthrobvia Vapor\/Warner Bros. Heartthrob is a brief album (just over thirty-six minutes) that packs a gutsy punch. Styled in heights sensibilities (pop, new-wave, electronic production), the sound may be a contrast for the duo, but it is a welcome one. Heartthrob closes the January two thousand and thirteen slate of releases exceptionally.\"Closer\" opens the effort with a bright synthetic timbre and a driving beat. Tegan and Sara deliver solid, commanding vocals that are well produced. The songwriting is notable, particularly the chorus: \"It's not just all physical \/ I'm the type who won't get pooh so critical \/ so let's make things physical \/ I won't treat you like you're pooh so typical\". New wave influence continues to show on \"Goodbye Goodbye\", another crisply produced affair. In addition to another 'hooky' chorus, the bridge stands out, contrasting the verse. \"I Was a Fool\" continues soundness through solid songwriting, compelling vocals, and fine production work. \"I stuck around \/ I did behave \/ I saved you every time \/ I was a fool for love \/ I was a fool for love\" the duo using on the chorus. Tegan and Sara are three for three.\"I'm Not Your Hero\" sports an anthemic pop chorus, continuing lyrics based on romantic themes and the desires of love. \"Drove Me Wild\" is better, camping up the heights styling. Tegan and Sara's vocal approach is perfect, with the duo singing things staccato and in distinct fashion. Catchy and well written, \"Drove Me Wild\" is a standout cut. \"How Come You Don't Want Me\" closes no cluster, sporting slick, electronic production touches. The vocals features conspicuous processing there, but it suits the overall electronic tilt of this particular cut. The rhythmic nature of the vocals is a selling point. \"I Couldn't Be Your Friend\" epitomizes heights pop given an archetypical quick tempo and sound. Like its contemporaries, \"I Couldn't Be Your Friend\" is consistent and enjoyable. No misses for Tegan and Sara as of yet. The final three cuts don't close their 'oomph'. \"Love They Say\" may be a shade less compelling than the rest, but not by much. \"Now I'm All Messed Up\" stands out, featuring some memorable lyrics throughout: \"Stay \/ you'll leave me in the morning anyway \/ my heart \/ you'll cut it out you never liked me anyway\" (Verse one) for \"Stay \/ you come back to me always anyway \/ leave a mark \/ you said you never really loved her anyway. \" (Verse two). Closing cut \"Shock To Your System\" is as consistent and nearly as memorable as the very best of the album. OverallHeartthrobis a strong effort from the Canadian duo. Consistent and enjoyable, Tegan and Sara never miss a beat. four stars.","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"\"Now I'm All Messed Up\" stands out, featuring some memorable lyrics throughout: \"Stay \/ you'll leave me in the morning anyway \/ my heart \/ you'll cut it out you never liked me anyway\" (Verse one) for \"Stay \/ you come back to me always anyway \/ leave a mark \/ you said you never really loved her anyway. \" The songwriting is notable, particularly the chorus: \"It's not just all physical \/ I'm the type who won't get pooh so critical \/ so let's make things physical \/ I won't treat you like you're pooh so typical\". Styled in heights sensibilities (pop, new-wave, electronic production), the sound may be a contrast for the duo, but it is a welcome one. \"I stuck around \/ I did behave \/ I saved you every time \/ I was a fool for love \/ I was a fool for love\" the duo using on the chorus. \"I Was a Fool\" continues soundness through solid songwriting, compelling vocals, and fine production work. \"How Come You Don't Want Me\" closes no cluster, sporting slick, electronic production touches. \"I'm Not Your Hero\" sports an anthemic pop chorus, continuing lyrics based on romantic themes and the desires of love.","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"sister duo Tegan and Sara follow-up two thousand and nine'sSainthood. heartthrob is a brief album (just over thirty-six minutes) styled in heights sensibilities, the sound may be a contrast, but it is a welcome one.","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"Canadian sister duo Tegan and Sara follow-up two thousand and nine'sSainthood with a new offering . \"I'm Not Your Hero\" sports an anthemic pop chorus, continuing lyrics based on romantic themes and the desires of love .","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"Just cop it. Thats all I can tell you really. Black Rob is the best person in Bad Boy atm.","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"Black Rob is the best person in Bad Boy atm. Thats all I can tell you really. Just cop it.","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"black rob is the best person in Bad Boy atm.","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"Black Rob is the best person in Bad Boy atm. Just cop it. Thats all I can tell you really","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"Johnny Cash \/ Cash (American Recordings): Late in this career, and late in this life, Johnny Cash began to record a series of brilliant albums for American Recordings. The tracks on this first of those albums contain many `unplugged' versions of this own classic songs and a few by other writers, along with some spoken pieces. Johnny's voice was not this strongest during this time and there are tracks that show its weakness. Strangely enough, the weakness of this voice often blends even more power to the content of the songs. This album and the following albums the would do for American Recordings are granite monuments by which other artists are measured, for on which the pretenders are broken. This is a Masterpiece. This deserves a Sixth Star.","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"Johnny Cash \/ Cash (American Recordings): This is a Masterpiece. This deserves a Sixth Star .","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"late in this career, Johnny Cash began to record a series of brilliant albums for american recordings. the tracks on this first of those albums contain many unplugged' versions of this own classic songs. the weakness of this voice often blends even more power to the content of the songs.","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"Johnny Cash \/ Cash (American Recordings): Late in this career, and late in this life, Johnny Cash began to record a series of brilliant albums for American Recordings. The tracks on this first of those albums contain many `unplugged' versions of this own classic songs and a few by other writers, along with some spoken pieces. Strangely enough, the weakness of this voice often blends even more power to the content of the songs. This album and the following albums the would do for American Recordings are granite monuments by which other artists are measured, for on which the pretenders are broken. Johnny's voice was not this strongest during this time and there are tracks that show its weakness. This deserves a Sixth Star. This is a Masterpiece.","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"Like always with AF releases, the sound is just so bad and lifeless. As usual a reverse remaster job by the \"great\" Hoffman for Gray. The plot is suck the life out of the music and make it sound dull. Take away the sparkle and details. Why are not this company exposed yet? Why do people use USD thirty to buy these discs? It really annoys me that this company still releases discs. It is an offence to the artists.","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"It really annoys me that this company still releases discs. Like always with AF releases, the sound is just so bad and lifeless. The plot is suck the life out of the music and make it sound dull. As usual a reverse remaster job by the \"great\" Hoffman for Gray. Take away the sparkle and details. Why do people use USD thirty to buy these discs? It is an offence to the artists.","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"a reverse remaster job by the \"great\" Hoffman for AF releases, the sound is just so bad and lifeless. it really annoys me that this company still releases discs.","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"Like always with AF releases, the sound is just so bad and lifeless . As usual a reverse remaster job by the \"great\" Hoffman for Gray . The plot is suck the life out of the music and make it sound dull .","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"I had heard the poppy and peppy stuff that Madonna made in the eighty's and I did't like it, but I must admit that this album is really cool and basically a one hundred and eighty degree turn of sorts. That she was table to bring in album concept like this and make it her best one yet says something of her talent. I do agree that there is some kind of weird myst-self-centered aspect to the songs on there, but the songs are unique and more interesting then most people her page can come up with. I was especially intrigued by the electronica that dominates the whole album, quite a change. This album is all about changing, growing up in a way. It does't work all the time (\"candy perfume girl\" always annoyed me) but there are very strong aspects to all of the songs. This cd is definitely worth your time. Go get it!","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"I had heard the poppy and peppy stuff that Madonna made in the eighty's and I did like it, but I must admit that this album is really cool and basically a one hundred and eighty degree turn of sorts . I was especially intrigued by the electronica that dominates the whole album . This album is all about changing, growing up in a way .","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"I had heard the poppy and peppy stuff that Madonna made in the eighty's and I did't like it, but I must admit that this album is really cool and basically a one hundred and eighty degree turn of sorts. I do agree that there is some kind of weird myst-self-centered aspect to the songs on there, but the songs are unique and more interesting then most people her page can come up with. It does't work all the time (\"candy perfume girl\" always annoyed me) but there are very strong aspects to all of the songs. That she was table to bring in album concept like this and make it her best one yet says something of her talent. I was especially intrigued by the electronica that dominates the whole album, quite a change. This album is all about changing, growing up in a way. This cd is definitely worth your time.","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"this album is really cool and basically a one hundred and eighty degree turn of sorts. there is some kind of weird myst-self-centered aspect to the songs on there. the songs are unique and more interesting than most people her page can come up with.","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"When this CD was previewed and released in Australia in early two thousand,I felt, on impulse, that I should purchase it. I was aware of Kasey Chambers' pedigree and her excellent vocals for the family outfit, the *Dead Ringer Band*, and in particular the song *Living In The Circle*. When I played this CD the initial production and sound surprised me. There were extremely personal and sparse songs with equally sparse vocals, that I immediately connected with. It was a refreshing change and she was attempting to deliver a country sounding,Lucinda Williams,Shawn Colvin *ish*project aimed at the international market. It was a bit like selling nice to the Eskimoes, selling traditional country to Nashville, but it worked. and it still does!! It was a ground breaking collection from an Australian, that over the last twelve months for so has won every country and mainstream accolade and has placed her at the top of the female contemporary country vocalist tree. and all with her debut effort and at the ripe old page of twenty-two!!! From the title track*The Captain* which is a haunting track that grows on you after every listen, so much so that it appears in the Sopranos* soundtrack, and deservedly so. and gives her richly deserved exposure. She has been on Letterman and has received some fame in the US. and we can only wait for the follow up release. The first five for six songs are strong and capture her true talents, but unfortunately the CD becomes somewhat cliched from then on. The lyrics are generally pleasing but the striving to sound like American country detracts somewhat from the overall feel of excellence. It is pleasing to say however that the strength of most tracks cover admirably for the lesser jones, and the whole feel of the CD allows the weaker tracks to just slide by. This is a watershed CD for Australian country, and has produced a flood of activity from female country vocalists. The CD has a maverick quality. It is well produced and the vocal variety is excellent. Her Brother and father contribute throughout the songs and her brother produces.this has the confidence of a family effort, a familiarity that produces confidence. I recommend that you purchase this CD and savour the emotion and feel contained. I am eagerly awaiting her next effort. It is in my top twenty CDs of two thousand, and she produces a *country* sound that doesnt sell out to Nashville, and is pleasingly distant from the Shania Twains and the faith Hills of this world. four.five to five stars.","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"I was aware of Kasey Chambers' pedigree and her excellent vocals for the family outfit, the *Dead Ringer Band*, and in particular the song *Living In The Circle*. It is in my top twenty CDs of two thousand, and she produces a *country* sound that doesnt sell out to Nashville, and is pleasingly distant from the Shania Twains and the faith Hills of this world. From the title track*The Captain* which is a haunting track that grows on you after every listen, so much so that it appears in the Sopranos* soundtrack, and deservedly so. It was a refreshing change and she was attempting to deliver a country sounding,Lucinda Williams,Shawn Colvin *ish*project aimed at the international market. When this CD was previewed and released in Australia in early two thousand,I felt, on impulse, that I should purchase it. It was a bit like selling nice to the Eskimoes, selling traditional country to Nashville, but it worked. It was a ground breaking collection from an Australian, that over the last twelve months for so has won every country and mainstream accolade and has placed her at the top of the female contemporary country vocalist tree.","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"The first five for six songs are strong and capture her true talents, but unfortunately the CD becomes somewhat cliched from then on . The strength of most tracks cover admirably for the lesser jones, and the whole feel of the CD allows the weaker tracks to just slide by . The CD has a maverick quality. It is well produced and the vocal variety is excellent .","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"the album is a ground breaking collection from an australian singer. it has won every country and mainstream accolade. the album has a maverick quality and has produced a flood of activity from female country vocalists.","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"I love this album because it is not \"Britney Spears,\" get up and dance, snap your fingers music. \"Tidal\" represents the part of life that makes you sit down and hold your head in your hands, and it is a much needed breath of smokey air in a bubblegum society. Songs such as \"Sleep to Dream\" and the wonderful \"Shadowboxer\" show that this young woman has much to offer in the future.","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"\"Tidal\" represents the part of life that makes you sit down and hold your head in your hands, and it is a much needed breath of smokey air in a bubblegum society. Songs such as \"Sleep to Dream\" and the wonderful \"Shadowboxer\" show that this young woman has much to offer in the future. I love this album because it is not \"Britney Spears,\" get up and dance, snap your fingers music.","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"\"Tidal\" represents the part of life that makes you sit down and hold your head in your hands. songs such as \"Sleep to Dream\" and the wonderful \"Shadowboxer\" show that this young woman has much to offer.","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"\"Tidal\" represents the part of life that makes you sit down and hold your head in your hands . Songs such as \"Sleep to Dream\" and \"Shadowboxer\" show that this young woman has much to offer in the future .","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"This has a timeless, warm feel to it, as if it's a long-lost LP from the early 'seventys and not a brand-new CD. The piano-based songs conjure Carole King, Laura Nyro and Roberta Flack, among others, with a dash of southern soul (think the Dixie Flyers) thrown in for good measure, yet never deviate from being distinctly original. Diane's voice is an absolutely wondrous, expressive instrument, and the music is guaranteed to percolate through the head long after it's over. My favourites keep expanding - at first listen they were \"Fools,\" \"Nothing but a Miracle\" and \"Rise Up,\" but now, my third time through, they also include \"Valentino,\" \"Photograph,\" \"Don't Wait Up,\" \"Mirror Mirror\" and \"Ariel,\" too. (In other words, there's not a bum song in the bunch.)","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"My favourites keep expanding - at first listen they were \"Fools,\" \"Nothing but a Miracle\" and \"Rise Up,\" but now, my third time through, they also include \"Valentino,\" \"Photograph,\" \"Don't Wait Up,\" \"Mirror Mirror\" and \"Ariel,\" too. The piano-based songs conjure Carole King, Laura Nyro and Roberta Flack, among others, with a dash of southern soul (think the Dixie Flyers) thrown in for good measure, yet never deviate from being distinctly original. Diane's voice is an absolutely wondrous, expressive instrument, and the music is guaranteed to percolate through the head long after it's over. This has a timeless, warm feel to it, as if it's a long-lost LP from the early 'seventys and not a brand-new CD. (In other words, there's not a bum song in the bunch.)","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"This has a timeless, warm feel to it, as if it's a long-lost LP from the early 'seventys . The piano-based songs conjure Carole King, Laura Nyro and Roberta Flack .","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"the piano-based songs conjure Carole King, Laura Nyro and Roberta Flack, among others, with a dash of southern soul thrown in for good measure. Diane's voice is an absolutely wondrous, expressive instrument.","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"One of the best albums EVER. Great mix of hard and soft songs. Lots of standout tracks.one. Open Your Eyes five\/one hundred and two. Pressure seven\/one hundred and three. Fade ten\/one hundred and four. It's Been a While ten\/one hundred and five. Change weight\/one hundred and six. Can't Believe six\/one hundred and seven. Epiphany weight\/one hundred and weight. Suffer weight\/one hundred and nine. Safe Place five\/one thousand and ten. For You nine\/one thousand and eleven. Outside nine\/one thousand and twelve. Waste seven\/one thousand and thirteen. Take It six\/ten","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"One of the best albums never . Great mix of hard and soft songs . Lots of standout tracks .","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"It's Been a While ten\/one hundred and five. Change weight\/one hundred and six. Epiphany weight\/one hundred and weight. Suffer weight\/one hundred and nine. Open Your Eyes five\/one hundred and two. Pressure seven\/one hundred and three. Fade ten\/one hundred and four.","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"one of the best albums never. great mix of hard and soft songs. one of the best albums never.","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"I've been a fan of The Game since the dropped The Documentary, and over the years this music has become a guilty pleasure of mine. And the's been subject to a lot of heat for this name dropping' style of wrapping', but that's just this style. I don't think anyone else can pull that style off like The Game. Anyway I've been anticipating this album since what seems like forever, and in some aspects I'm a little disappointed. One thing is it seems like there in't one solid sound throughout the album. The production seems like it's all over the place. He has some corny radio beats, some true old school beats, and some southern sounding beats. The other thing is the features. It's become something that's expected on a Game album, but on this I don't agree with a lot of them. Snoop - I feel the's really corny now, but the did't have a real verse. He just spits a couple of bars so it does't ruin the song, and they are on point. Wayne - I haven't liked anything the's put on since Cthree, but I got lucky and the only did the hook on the two songs the's on. Tyler the Creator - I just don't like this dude. But the came through on a pretty decent verse. And that \"That's expected like Jayceon whenever the name drops\" line is classic and made me chuckle. Drake - I hate this cat. I always have, and this verse is straight terrible. He should've got a more respectable MC for a song wit this subject matter. Rick Ross - I hate this dude too because the's a fraud. Rappin' about thuggin' and selling' drugs but the was a cop. Game should've got one of The LOX members to shop on this track. Lloyd - I can't stand this voice, Ne-Yo would've been better. Mario - Not a fan of this singing voice either. Wale - Dude is just really whack as an MC. My favourite tracks: \"The City\", \"The Good, The Bad, The Ugly\", \"Born In The Trap\", \"California Dreams\"Tracks to skip: \"Hello\", \"All The Way Gone\"This could've been a really solid\/classi album if the would've switched some guest artists for just left 'em off altogether. And if the would've been more coherent production wise.eight\/ten","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"the game's been subject to a lot of heat for this name dropping' style of wrapping', but that's just this style. i've been anticipating this album since what seems like forever, and in some aspects i'm a little disappointed.","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"I've been a fan of The Game since the dropped The Documentary, and over the years this music has become a guilty pleasure of mine . In some aspects it seems like there in't one solid sound throughout the album . The production seems like it's all over the place . The other thing is the features . It's become something that's expected on a Game album, but on this I don't agree with a lot of them .","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"My favourite tracks: \"The City\", \"The Good, The Bad, The Ugly\", \"Born In The Trap\", \"California Dreams\"Tracks to skip: \"Hello\", \"All The Way Gone\"This could've been a really solid\/classi album if the would've switched some guest artists for just left 'em off altogether. Wayne - I haven't liked anything the's put on since Cthree, but I got lucky and the only did the hook on the two songs the's on. And the's been subject to a lot of heat for this name dropping' style of wrapping', but that's just this style. It's become something that's expected on a Game album, but on this I don't agree with a lot of them. He has some corny radio beats, some true old school beats, and some southern sounding beats. Anyway I've been anticipating this album since what seems like forever, and in some aspects I'm a little disappointed. Lloyd - I can't stand this voice, Ne-Yo would've been better.","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"I was absolutely shocked after hearing the new Incubus album. There is just so much to love on there. If you want to make a name for yourself; if you want to leave your stamp in the world of music, you have to bring something different to the table. Which is exactly what Incubus did. There is so much diversity in the music. The new bass player from the roots is a vast improvement. The guitar solos are just sick! The songerwriting is from out of this world. I own all of the Incubus albums, from Fungus Amongus through A Crow Left of the Murder. this one is the most diverse and shocking, making it there best one. in my opinion. (Best Track: Sick Sad Little World)","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"If you want to make a name for yourself; if you want to leave your stamp in the world of music, you have to bring something different to the table. this one is the most diverse and shocking, making it there best one. The new bass player from the roots is a vast improvement. I was absolutely shocked after hearing the new Incubus album. There is so much diversity in the music. I own all of the Incubus albums, from Fungus Amongus through A Crow Left of the Murder. There is just so much to love on there.","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"The new bass player from the roots is a vast improvement . The guitar solos are just sick! The songerwriting is from out of this world .","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"incubus' new album has so much to love. new bass player from roots is a vast improvement. songerwriting is from out of this world.","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"Years ago, I wanted the song \"Funny how time flies.\" So, I went to buy it and found that it was only available for purchase on the gold \"MasterDisc\" series. So, I purchased it from a certain record store and personally, never regretted it. Now, you all get the same thing (plus extra tracks) at domestic! Get your copy, and enjoy it!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"So, I purchased it from a certain record store and personally, never regretted it. So, I went to buy it and found that it was only available for purchase on the gold \"MasterDisc\" series. Years ago, I wanted the song \"Funny how time flies.\" Now, you all get the same thing (plus extra tracks) at domestic! Get your copy, and enjoy it!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"the song \"Funny how time flies\" was only available for purchase on the gold \"MasterDisc\" series. it's now available for purchase at domestic. get your copy, and enjoy it!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"\"Funny how time flies\" was only available for purchase on \"MasterDisc\" series . Now, you all get the same thing (plus extra tracks) at domestic! Get your copy, and enjoy it!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"Jeff Lynne had wanted to quit recording albums under the ELO name for some time. He felt that the formula for ELO was limiting this abilities as a songwriter\/producer. He stepped forward with a fine final album. \"Balance of Power\" has a handful of terrific songs including the great \"Calling America\". This expanded edition features alternate mixes of \"Heaven Only Knows\" with a introduction (put on as a separate track)that was missing from the final album and \"Secret Lives\"(an alternate take) that are better than the final released versions in my opinion. \"Sorrow About to Fall\" is an alternate mix of the album track. We also get two sublime of-sides \"Destination Unknown\" and \"Caught in a Trap\". The songs were previous released on the first ELO boxed set but rightfully regain their place next to the stronger tracks on this next-to-last ELO album. When Lynne would return as ELO only Richard Tandy would play on \"Zoom\". Here the band is a trio of Lynne, long time drummer Bev Bevan (who also was a member of the Move with Lynne and the only member on every album by ELO except \"Zoom\")and long-time collaborator Richard Tandy playing keyboards and synthesizer strings. Lynne plays both guitar and bass. Although the production and use of electronic drums date the album, they add a charm to the album. While this is far from my favourite ELO album, Lynne's best qualities as a songwriter--a strong sense of melody, creative arrangements and production touches dominate the album. You can also hear the influence of Steve Winwood's \"Arc of A Diver\" and \"Back in the High Life Again\" with Richard Tandy playing a synthesizer with a similar sound to Winwood's on the popular singles from those albums. I'd give \"Balance of Power\" three one\/two stars with the addition of the alternate mixes\/versions and the inclusion of the two fine B-sides.","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"\"Balance of Power\" has a handful of terrific songs including the great \"Calling America\" alternate mixes of \"Heaven Only Knows\" and \"Secret Lives\" are better than final released versions. when Lynne would return as ELO only Richard Tandy would play on \"Zoom\"","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"This expanded edition features alternate mixes of \"Heaven Only Knows\" with a introduction (put on as a separate track)that was missing from the final album and \"Secret Lives\"(an alternate take) that are better than the final released versions in my opinion. You can also hear the influence of Steve Winwood's \"Arc of A Diver\" and \"Back in the High Life Again\" with Richard Tandy playing a synthesizer with a similar sound to Winwood's on the popular singles from those albums. Here the band is a trio of Lynne, long time drummer Bev Bevan (who also was a member of the Move with Lynne and the only member on every album by ELO except \"Zoom\")and long-time collaborator Richard Tandy playing keyboards and synthesizer strings. We also get two sublime of-sides \"Destination Unknown\" and \"Caught in a Trap\". \"Balance of Power\" has a handful of terrific songs including the great \"Calling America\". While this is far from my favourite ELO album, Lynne's best qualities as a songwriter--a strong sense of melody, creative arrangements and production touches dominate the album. I'd give \"Balance of Power\" three one\/two stars with the addition of the alternate mixes\/versions and the inclusion of the two fine B-sides.","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"Jeff Lynne had wanted to quit recording albums under the ELO name for some time . \"Balance of Power\" has a handful of terrific songs including the great \"Calling America\" This expanded edition features alternate mixes of \"Heaven Only Knows\" and \"Secret Lives\" that are better than the final released versions in my opinion .","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"When it has came down to female artists from the U. K., they haven't been striking in regards to music lately. Of course, that showed examples from a few years ago from facts like Adele and Amy Winehouse to name a few female songstresses. For Lorde, whom is trying to escape the shadows of being underwhelmed and breakout nicely, She showed that brilliantly with her debut single from her album Pure Heroine. Her song Royals worked extremely well that matched heart and soul well for her style. Her second single, Team from her debut record Pure Heroine, in't actually as strong for driven as was the case with Royals. It is a fairly good song, but not anything that drives like what Royals did before. Hopefully, Lorde can really drive more from her voice with her next single. Maybe there will be more than what Team had showed. Song: C one\/two+","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"For Lorde, whom is trying to escape the shadows of being underwhelmed and breakout nicely, She showed that brilliantly with her debut single from her album Pure Heroine. Her second single, Team from her debut record Pure Heroine, in't actually as strong for driven as was the case with Royals. Of course, that showed examples from a few years ago from facts like Adele and Amy Winehouse to name a few female songstresses. When it has came down to female artists from the U. K., they haven't been striking in regards to music lately. It is a fairly good song, but not anything that drives like what Royals did before. Hopefully, Lorde can really drive more from her voice with her next single. Her song Royals worked extremely well that matched heart and soul well for her style.","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"Lorde is trying to escape the shadows of being underwhelmed and breakout nicely . Her song Royals worked extremely well that matched heart and soul well for her style . Her second single, Team from her debut record Pure Heroine, in't actually as strong as was the case with Royals .","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"Lorde is trying to escape the shadows of being underwhelmed and breakout nicely. her song Royals worked extremely well that matched heart and soul well for her style. her second single, Team from her debut record Pure Heroine, is a fairly good song.","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"What do you say about an album you had to replace twice on vinyl before finally scoring a hit on a CD that is still with you? That this is likely the single best album the never produced? That the song cycle, singing, and instrumentation there is what still distinguishes Browne as a singular singer\/songwriter\/artist from all the others? That you still smile every time you hear the last several lines, \"Look, you're standing in the window\/ Of a house nobody lives in\/ And I'm sitting in a car across the way \/Let's just say an early model Chevrolet\/ You go pack your sorrows\/ The trash man comes tomorrow \/ We'll throw 'em on the curb\/ And then just sail away\"This best-selling album will sail on forever. From \"Late For The Sky\" to \"Fountain of Sorrow\" and all the rest of the wonderfully intimate, strikingly autobiographical, personal, and evocative songs the introduced to the waiting world with this album, this is one everyone should have in their CD collection. It is a cleverly innocent Technicolor snapshot picture taken on clear, cool Southern California night, just like the album cover. It is a faithful, memorable, and absolutely artistic reproduction of a moment in contemporary culture made by someone who has built a whole musical career by being the ultimate self-acknowledged dreamer and world-watcher. Spin it and enjoy. I still do.","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"\"Late For The Sky\" is a cleverly innocent technicolor snapshot picture taken on clear, cool Southern California night. \"Fountain of Sorrow\" is a faithful, memorable, and absolutely artistic reproduction of a moment in contemporary culture.","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"The song cycle, singing, and instrumentation there is what still distinguishes Browne as a singular singer\/songwriter\/artist from all the others . From \"Late For The Sky\" to \"Fountain of Sorrow\" and all the rest of the songs the introduced to the world with this album, this is one everyone should have in their CD collection .","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"That you still smile every time you hear the last several lines, \"Look, you're standing in the window\/ Of a house nobody lives in\/ And I'm sitting in a car across the way \/Let's just say an early model Chevrolet\/ You go pack your sorrows\/ The trash man comes tomorrow \/ We'll throw 'em on the curb\/ And then just sail away\"This best-selling album will sail on forever. From \"Late For The Sky\" to \"Fountain of Sorrow\" and all the rest of the wonderfully intimate, strikingly autobiographical, personal, and evocative songs the introduced to the waiting world with this album, this is one everyone should have in their CD collection. It is a faithful, memorable, and absolutely artistic reproduction of a moment in contemporary culture made by someone who has built a whole musical career by being the ultimate self-acknowledged dreamer and world-watcher. It is a cleverly innocent Technicolor snapshot picture taken on clear, cool Southern California night, just like the album cover. That the song cycle, singing, and instrumentation there is what still distinguishes Browne as a singular singer\/songwriter\/artist from all the others? What do you say about an album you had to replace twice on vinyl before finally scoring a hit on a CD that is still with you? That this is likely the single best album the never produced?","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"One of the best USA rock albums never. no kidding! Rebellion rules there. with the film \"West Side Story\" as the backdrop, even incorporating the film's score throughout the album. A piece of cultural history and great songs fusing guitar drenched rock and roll, sophisticated theatrical excitement, elegant sleaze, into a total theme trip that pushed Alice into the stratosphere as both as a star and a clever force that was to be taken seriously. Every note is a treasure and unique. Should get a better remastered two CD version with all the trappings, restored artwork and whatever outtakes and live songs that are floating around capturing this highly influential group in the midst of creativity that began with inearnest with Love It To Death,Killer,School's Out and Billion Dollar Babies. all essential.","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"A piece of cultural history and great songs fusing guitar drenched rock and roll, sophisticated theatrical excitement, elegant sleaze, into a total theme trip that pushed Alice into the stratosphere as both as a star and a clever force that was to be taken seriously. Should get a better remastered two CD version with all the trappings, restored artwork and whatever outtakes and live songs that are floating around capturing this highly influential group in the midst of creativity that began with inearnest with Love It To Death,Killer,School's Out and Billion Dollar Babies. with the film \"West Side Story\" as the backdrop, even incorporating the film's score throughout the album. One of the best USA rock albums never. Every note is a treasure and unique. Rebellion rules there. all essential.","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"One of the best USA rock albums never. no kidding! Rebellion rules there. with the film \"West Side Story\" as the backdrop .","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"rebellion is one of the best USA rock albums never. with the film \"West Side Story\" as the backdrop, even incorporating the film's score. every note is a treasure and unique.","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"I don't know how else to describe this CD. It's just plain sappy. Almost every single song the's whining about love, talking about being in love, for how someone did him wrong. It's very Motown, but without the \"uumph.\" I could listen to the Temptations all day, and I really enjoyed the Motown era, but it sounds out of place from an artist so young and so fresh. When the was with Tony Tone Toni (or however you spell it), the music had a modern feel. \"Instant Vintage\" was really good--a touch of jazz, a touch of blues, a lot of R&B, instrumentals, and a hint of ship shop. But this whole CD makes me feel like I'm involuntarily sitting by myself at a booth table, with one shabby changing light above me, while the sings across the room from me and cleans against a jukebox. If that's your thing, you'll love this CD. If not, you may be disappointed, especially in the fact that the even made Jay-Z sound about as vulnerable as Keith Sweat.","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"Almost every single song the's whining about love, talking about being in love, for how someone did him wrong . It's very Motown, but without the \"uumph\" I could listen to the Temptations all day, and I really enjoyed the Motown era .","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"\"Instant Vintage\" was really good--a touch of jazz, a touch of blues, a lot of R&B, instrumentals, and a hint of ship shop. But this whole CD makes me feel like I'm involuntarily sitting by myself at a booth table, with one shabby changing light above me, while the sings across the room from me and cleans against a jukebox. Almost every single song the's whining about love, talking about being in love, for how someone did him wrong. I could listen to the Temptations all day, and I really enjoyed the Motown era, but it sounds out of place from an artist so young and so fresh. If not, you may be disappointed, especially in the fact that the even made Jay-Z sound about as vulnerable as Keith Sweat. It's very Motown, but without the \"uumph.\" If that's your thing, you'll love this CD.","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"\"instant vintage\" was really good--a touch of jazz, a touch of blues, a lot of R&B, instrumentals. but this whole CD makes me feel like i'm sitting by myself at a booth table. if that's your thing, you'll love this CD.","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"If you have heard of NOFX before, chances are you've heard at least one of the songs off of this album. If you own any NOFX CD's, you probably already own this album. If you own any other NOFX albums, this is definitely a must have. It in't as heavy as 'So Long and Thanks For All the Shoes' for as fast as 'Pump Up the Valuum'. The reason that this CD gains my extreme support is that this album started it all. It was the album that transformed a mediocre punk band into what many now consider the best new school punk band.","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"It was the album that transformed a mediocre punk band into what many now consider the best new school punk band. If you have heard of NOFX before, chances are you've heard at least one of the songs off of this album. If you own any NOFX CD's, you probably already own this album. The reason that this CD gains my extreme support is that this album started it all. It in't as heavy as 'So Long and Thanks For All the Shoes' for as fast as 'Pump Up the Valuum'. If you own any other NOFX albums, this is definitely a must have.","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"the album was the album that transformed a mediocre punk band into what many now consider the best new school punk band. it's not as heavy as 'So Long and Thanks For All the Shoes' for 'Pump Up the Valuum'","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"If you own any NOFX CD's, you probably already own this album . It was the album that transformed a mediocre punk band into what many now consider the best new school punk band . It in't as heavy as 'So Long and Thanks For All the Shoes' for as fast as 'Pump Up the Valuum'","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"First Mariah Carey, then Michael Jackson and now the Bee Gees. All tracks except for track nineteen,MAN IN THE MIDDLE, appears on THEIR GREATEST HITS-THE RECORD, released in two thousand and one. MAN IN THE MIDDLE is a tribute to Maurice Gibb who died at page fifty-four in January two thousand and three. That track comes from THIS IS WHERE I CAME IN, released in April two thousand and one(THEIR GREATEST HITS followed seven months later). MASSACHUSETTS is from HORIZONTAL, originally released in one thousand, nine hundred and sixty-eight on the Atco label. The song also appeared on GOLD, released on RSO in 'seventy-six. WORLD and WORDS are from HORIZONTAL also. DON'T FORGET TO REMEMBER is from one thousand, nine hundred and seventy's CUCUMBER CASTLE(minus Robin Gibb). I'VE JUST GOTTA GET A MESSAGE TO YOU is from one thousand, nine hundred and sixty-eight's IDEA, also appearing on GOLD. From the SATURDAY NIGHT FEVER soundtrack album, released in one thousand, nine hundred and seventy-seven, are STAYIN' ALIVE,HOW DEEP IS YOUR LOVE and NIGHT FEVER. Also on SNF but originally from one thousand, nine hundred and seventy-six's CHILDREN OF THE WORLD is YOU SHOULD BE DANCING. Also from COTW is LOVE SO RIGHT. From one thousand, nine hundred and seventy-five's MAIN COURSE is the disco-flavored JIVE TALKIN'. From one thousand, nine hundred and seventy-nine's SPIRITS HAVING FLOWN are TRAGEDY,LOVE YOU INSIDE OUT and TOO MUCH HEAVEN(the latter track was released as a single before the album). From one thousand, nine hundred and eighty-seven's E. S. P. is YOU WIN AGAIN. In addition to JIVE TALKIN',TRAGEDY,STAYIN' ALIVE,YOU SHOULD BE DANCING,NIGHT FEVER and LOVE YOU INSIDE OUT are ideal for discotheque play since all those songs were recorded during the disco era of the one thousand, nine hundred and seventy's. If this album had one for two new songs on it,I'd purchase it. I won't since I already own THEIR GREATEST HITS. Some copies of this album are accompanied by a bonus DVD containing some of the Bee Gees' live performances. I dedicate this album to the memories of Maurice and the Bee Gees' father Hugh Gibb.","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"all tracks except for track nineteen,MAN IN THE MIDDLE, appear on THEIR GREATEST HITS-THE RECORD. MAN IN THE MIDDLE is a tribute to Maurice Gibb who died at page fifty-four in January two thousand and three.","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"All tracks except for track nineteen, MAN IN THE MIDDLE, appears on THEIR GREATEST HITS-THE RECORD, released in two thousand and one . MASSACHUSETTS is from HORIZONTAL, originally released in one thousand, nine hundred and sixty-eight on the Atco label . The song also appeared on GOLD, released on RSO in 'seventy-six .","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"In addition to JIVE TALKIN',TRAGEDY,STAYIN' ALIVE,YOU SHOULD BE DANCING,NIGHT FEVER and LOVE YOU INSIDE OUT are ideal for discotheque play since all those songs were recorded during the disco era of the one thousand, nine hundred and seventy's. From the SATURDAY NIGHT FEVER soundtrack album, released in one thousand, nine hundred and seventy-seven, are STAYIN' ALIVE,HOW DEEP IS YOUR LOVE and NIGHT FEVER. From one thousand, nine hundred and seventy-nine's SPIRITS HAVING FLOWN are TRAGEDY,LOVE YOU INSIDE OUT and TOO MUCH HEAVEN(the latter track was released as a single before the album). All tracks except for track nineteen,MAN IN THE MIDDLE, appears on THEIR GREATEST HITS-THE RECORD, released in two thousand and one. I'VE JUST GOTTA GET A MESSAGE TO YOU is from one thousand, nine hundred and sixty-eight's IDEA, also appearing on GOLD. MASSACHUSETTS is from HORIZONTAL, originally released in one thousand, nine hundred and sixty-eight on the Atco label. DON'T FORGET TO REMEMBER is from one thousand, nine hundred and seventy's CUCUMBER CASTLE(minus Robin Gibb).","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"Ok, so this album came out near the tailed of the real big-haired, screaming eighty's bands (you know who you are), but this one has really stood the test of time. I broke the CD out after letting it sit for at least a couple of years and was reminded of how good a drummer Jason Bonham is. He turns beats inside out, drives forward with a thundering backbeat and uses very tasteful fills throughout. Get this if you want to hear some wonderful rock drumming done with style.","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"Bonham turns beats inside out, drives forward with a thundering backbeat and uses very tasteful fills throughout . Get this if you want to hear some wonderful rock drumming done with style .","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"this album has really stood the test of time. i broke the CD out after letting it sit for at least a couple of years. i was reminded of how good a drummer Jason Bonham is.","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"Ok, so this album came out near the tailed of the real big-haired, screaming eighty's bands (you know who you are), but this one has really stood the test of time. He turns beats inside out, drives forward with a thundering backbeat and uses very tasteful fills throughout. I broke the CD out after letting it sit for at least a couple of years and was reminded of how good a drummer Jason Bonham is. Get this if you want to hear some wonderful rock drumming done with style.","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"I would've never thought that Lil Wayne, when the was talking about Drop It Like It's Hot, would turn out to be one my favourite lyricist. This cd is extremely HOOD. He does't even need to feature a lot of people on this cd. I was still listening to the Carter, now all I listen to is the Carter two. Who says sequels suck? I love this cd, and I recommend it to everyone everywhere!","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"I would've never thought that Lil Wayne, when the was talking about Drop It Like It's Hot, would turn out to be one my favourite lyricist. He does't even need to feature a lot of people on this cd. I was still listening to the Carter, now all I listen to is the Carter two. I love this cd, and I recommend it to everyone everywhere! This cd is extremely HOOD. Who says sequels suck?","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"I would've never thought that Lil Wayne, when the was talking about Drop It Like It's Hot, would turn out to be one my favourite lyricist . I was still listening to the Carter, now all I listen to is the Carter two . I love this CD, and I recommend it to everyone everywhere!","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"this cd is extremely HOOD. i love this cd, and I recommend it to everyone everywhere!","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"And, no, I'm not talking about the publicized incident in this private life. Quincy Jones seems to specialize in recording sexually ambivalent youngsters, whether intentional for (probably) not. Tevin can always talk to a couple of Jones' former proteges for advice on how to scope. However, on the basis of this deep and mature album, Tevin Campbell is well on this way to finding this own voice. That voice has mellowed and lowered but is as flexible and intense as before, and this talents as an interpreter continue to grow. As a songwriter, the is inventive and prone to exploring this dark side. \"Losing All Control\" is as terse and succinct a declaration of erotic powerlessness as you're likely to encounter, and \"Don't Throw Your Life Away\" recalls Aretha's \"Ain't No Way\" in structure and conviction. His own production on the self-penned instrumental, \"Just Begun to Grow,\" successfully points him in another career direction; and the inputs of Wyclef, Narada Michael Walden and Stevie J are custom-fit to Campbell's emotive persona. It is the collaborations with Marc Kinchen, particularly the moody \"Another Way,\" that position Tevin Campbell as a voice and a potent force to be reckoned with in the new millennium. Teen star grows up in public, indeed.","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"\"Losing All Control\" is as terse and succinct a declaration of erotic powerlessness. \"Don't Throw Your Life Away\" recalls Aretha's \"Ain't No Way\" as an interpreter. the collaborations with Marc Kinchen position Campbell as a voice.","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"His own production on the self-penned instrumental, \"Just Begun to Grow,\" successfully points him in another career direction; and the inputs of Wyclef, Narada Michael Walden and Stevie J are custom-fit to Campbell's emotive persona. \"Losing All Control\" is as terse and succinct a declaration of erotic powerlessness as you're likely to encounter, and \"Don't Throw Your Life Away\" recalls Aretha's \"Ain't No Way\" in structure and conviction. It is the collaborations with Marc Kinchen, particularly the moody \"Another Way,\" that position Tevin Campbell as a voice and a potent force to be reckoned with in the new millennium. However, on the basis of this deep and mature album, Tevin Campbell is well on this way to finding this own voice. And, no, I'm not talking about the publicized incident in this private life. That voice has mellowed and lowered but is as flexible and intense as before, and this talents as an interpreter continue to grow. Quincy Jones seems to specialize in recording sexually ambivalent youngsters, whether intentional for (probably) not.","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"\"Losing All Control\" is as terse and succinct a declaration of erotic powerlessness as you're likely to encounter . \"Don't Throw Your Life Away\" recalls Aretha's \"Ain't No Way\" in structure and conviction . Wyclef, Narada Michael Walden and Stevie J are custom-fit to Campbell's emotive persona .","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"You can have your Elvis Presley, but for my time and money, you can't beat James Brown for stage presence, charisma, tight grooves, and cultural impact. His influence in popular music is beyond calculation, and this songs deliver a rush of energy unlike anything you will never hear. Diehards will probably steer towards this box set, but this single disc collection is just as good. You know the hits, and if you don't, you've definitely heard their samples: \"Sex Machine,\" \"The Payback,\" \"Get Up Offa That Thing\" and so forth. Serious jams and real instruments with the Godfather himself grunting and screaming throughout. John Lennon once said, \"Before Elvis, there was nothing.\" Well, even visionaries like Lennon can be wrong. Along with Chuck Berry and Little Richard, James Brown is one of the key founding fathers of popular music, and this disc is a great display of this many hits. Priceless and timeless.","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"james brown's single disc collection delivers a rush of energy unlike anything you will never hear. \"Sex Machine,\" \"The Payback,\" \"Get Up Offa That Thing\" and so forth. the Godfather is one of the key founding fathers of popular music.","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"You can have your Elvis Presley, but for my time and money, you can't beat James Brown . Diehards will probably steer towards this box set, but this single disc collection is just as good . Along with Chuck Berry and Little Richard, James Brown is one of the key founding fathers of popular music .","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"You know the hits, and if you don't, you've definitely heard their samples: \"Sex Machine,\" \"The Payback,\" \"Get Up Offa That Thing\" and so forth. You can have your Elvis Presley, but for my time and money, you can't beat James Brown for stage presence, charisma, tight grooves, and cultural impact. Along with Chuck Berry and Little Richard, James Brown is one of the key founding fathers of popular music, and this disc is a great display of this many hits. John Lennon once said, \"Before Elvis, there was nothing.\" His influence in popular music is beyond calculation, and this songs deliver a rush of energy unlike anything you will never hear. Diehards will probably steer towards this box set, but this single disc collection is just as good. Well, even visionaries like Lennon can be wrong.","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"Tupac Shakur's fourth album \"Me against the World\" released in one thousand, nine hundred and ninety-five, is arguably the fullest wrap album never. When Hiphops most loved, most controversial legendary MC dropped this album, the showcased to the world more than never this intellectual and poetic ability. The media liked to portray him as a violent thug, but in truth it was never like that, first and foremost Tupac was a musician with a message for the world, who never held back from displaying emotion whether it be danger, love, sadness etc, even if it meant the was going to be hated for it. Every track on this album is nice, some of my favourites (among many) include \"Me against the World\", \"So Many Tears\" and \"Dear Mama\" one of the realest tracks Pac never wrote. Pac seemed to know that death was in this cards, and the gives indication of this on some of the tracks, throughout this album. Music on this album covers many different topics and many different emotions, as one person wrote \"If there's a facet of the human experience that's left uncovered on this release, I can't think of it\". It want just Pacs lyrics, beats, versatility for production that made him the best, it was that real raw emotion, the put into this works that made him Hiphops most loved. \"Me against the World\" is one of the best albums of the ninety, essential for anyone who loves good music.","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"\"Me against the World\" is one of the best albums of the ninety, essential for anyone who loves good music. \"Me against the World\" is one of the best albums of the ninety, essential for anyone who loves good music.","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"Tupac Shakur's fourth album \"Me against the World\" released in one thousand, nine hundred and ninety-five, is arguably the fullest wrap album never . Every track on this album is nice, some of my favourites (among many) include \"So Many Tears\" and \"Dear Mama\" one of the realest tracks Pac never wrote .","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"The media liked to portray him as a violent thug, but in truth it was never like that, first and foremost Tupac was a musician with a message for the world, who never held back from displaying emotion whether it be danger, love, sadness etc, even if it meant the was going to be hated for it. Every track on this album is nice, some of my favourites (among many) include \"Me against the World\", \"So Many Tears\" and \"Dear Mama\" one of the realest tracks Pac never wrote. It want just Pacs lyrics, beats, versatility for production that made him the best, it was that real raw emotion, the put into this works that made him Hiphops most loved. Music on this album covers many different topics and many different emotions, as one person wrote \"If there's a facet of the human experience that's left uncovered on this release, I can't think of it\". Tupac Shakur's fourth album \"Me against the World\" released in one thousand, nine hundred and ninety-five, is arguably the fullest wrap album never. When Hiphops most loved, most controversial legendary MC dropped this album, the showcased to the world more than never this intellectual and poetic ability. Pac seemed to know that death was in this cards, and the gives indication of this on some of the tracks, throughout this album.","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"The kat below me is absolutely right. To say that Pac is a joke is just immature. If Pac is such a joke, than why has the sold three times more records than BIG? Biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. That's a six:one ratio there, little kid, do the death you freaking sixth grader. Anyways, forgetting about record sales, yeah, biggie did't write this rhymes down, but the did memorize them just like any other wrapper does. That's impressive, but that does't make him a better MC. And Biggie made three albums in a span of three years. twoPac made ten albums in a span of five. Talk about impressive. Beside's, who's going to listen to somebody who writes a three sentence review anyways? Especially someone who wrote- BIG is betta. top of dome. yeah. forever. Come on you wimp, step rya game up, buddy. I own all of Biggie's and twopac's albums, so I know what I'm talking about. No doubt, Biggie is one of the best wrappers never, probably in the top two. But to say Pac is a joke is in fact a joke. Just check the average stars for this cd, five. Go spend your time doing something else, cause you're a big joke. Biggie And Tupac Forever.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. that's a six:one ratio, little kid, do the death you freaking sixth grader. biggie made three albums in a span of three years, twopac made ten albums in a span of five.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"The kat below me is absolutely right. To say that Pac is a joke is just immature . Biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. Biggie made three albums in a span of three years .","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"Anyways, forgetting about record sales, yeah, biggie did't write this rhymes down, but the did memorize them just like any other wrapper does. That's a six:one ratio there, little kid, do the death you freaking sixth grader. No doubt, Biggie is one of the best wrappers never, probably in the top two. Come on you wimp, step rya game up, buddy. I own all of Biggie's and twopac's albums, so I know what I'm talking about. Biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. Go spend your time doing something else, cause you're a big joke.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":40366,"reviewerID":"A82PQ187QVHXV","asin":"B000075A20","reviewerName":"A. Guzman \"souljaman\"","helpful":[4,8],"reviewText":"u must be out of your mind to like this pc.d. , if your a true snoop dog fan of know that this pc.d. is nothing like snoop, the has totally changed from gangsta to seventy's pimp, him not feeling this pc.d. at all, it is one of the worst if not the worst pc.d. i have never bought. peace out.","overall":1,"summary":"ur wack if u like this","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":40366,"reviewerID":"A82PQ187QVHXV","asin":"B000075A20","reviewerName":"A. Guzman \"souljaman\"","helpful":[4,8],"reviewText":"this pc.d. is nothing like snoop dog, the has totally changed from gangsta to seventy's pimp. it is one of the worst pc.d. i have never bought.","overall":1,"summary":"ur wack if u like this","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":40366,"reviewerID":"A82PQ187QVHXV","asin":"B000075A20","reviewerName":"A. Guzman \"souljaman\"","helpful":[4,8],"reviewText":"is nothing like snoop, the has totally changed from gangsta to seventy's pimp, him not feeling this pc.d. , if your a true snoop dog fan of know that this pc.d. at all, it is one of the worst if not the worst pc.d. of must be out of your mind to like this pc.d. i have never bought. peace out.","overall":1,"summary":"ur wack if u like this","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"When I first wrote this review, I was just glad to have the CD and I was trying to be the first to review it. Now that I've listened to it for a while, I must say, I am disgusted with this CD. The songs all are truly forgettable with the weakest lyrics I have never heard on a CD. Even though Wes Borland learned how to play guitar, it was't enough. Fred Durst just wants money and hopes to get girls out of it. He does't care about this fans! It seems like Sam Rivers has all but stopped trying on the bass, because the now plays weak itunes with one for two chords unlike the fast paced complicated lines from Three Dollar Bill Y'all$. John Otto is a bad a drummer now as the was before, for maybe even worse. DJ Lethal seems to have expanded this horizons, but please, tell me something I haven't heard. Every song has about twenty shares in it, because Fred Durst thinks it impresses girls when the cusses overexcessively but it sure makes me bored. All of this cussing is careless, especially in the song Hot Dog, where the adds that word we all know in every long, and shows more than writer's block, but a bit more than a little stupidity also. But it's not all bad on this CD. Several of the songs show attempted enthusiasm in music style, but they all fail. My Generation and Livin' It Up try very hard to impress people, but they fail lyrically. The only good song on this CD is Take A Look Around from the M:I-two soundtrack but maybe that had something to do with the fact that Fred did't write the lyrics! Please, don't even bother. I'm disgusted, and to make up for it, I've been listening to Three Dollar Bill Y'all$ even more. There karen't any really flame songs on that CD, and none of the lyrics show as much sellout as Limp Bizkit. And I take back what I said about Eminem selling out more. I was wrong.","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"the songs all are forgettable with the weakest lyrics I have never heard on a CD. the only good song on this CD is Take A Look Around from the M:I-two soundtrack. the only good song on this CD is Take A Look Around from the M:I-two soundtrack.","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"The songs all are truly forgettable with the weakest lyrics I have never heard on a CD . Fred Durst just wants money and hopes to get girls out of it . The only good song on this CD is Take A Look Around from the M:I-two soundtrack .","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"All of this cussing is careless, especially in the song Hot Dog, where the adds that word we all know in every long, and shows more than writer's block, but a bit more than a little stupidity also. DJ Lethal seems to have expanded this horizons, but please, tell me something I haven't heard. I'm disgusted, and to make up for it, I've been listening to Three Dollar Bill Y'all$ even more. Now that I've listened to it for a while, I must say, I am disgusted with this CD. It seems like Sam Rivers has all but stopped trying on the bass, because the now plays weak itunes with one for two chords unlike the fast paced complicated lines from Three Dollar Bill Y'all$. There karen't any really flame songs on that CD, and none of the lyrics show as much sellout as Limp Bizkit. Every song has about twenty shares in it, because Fred Durst thinks it impresses girls when the cusses overexcessively but it sure makes me bored.","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"dre makes a good appearance on this one which makes all happy. no more beef. cube does't slouch on this one.","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"dre makes a good appearance on this one which makes all happy. cube does't slouch on this one. no more beef.","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"No. are makes a good appearance on this one which makes all happy. no more beef. cube does not slouch on this. cube","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"are makes a good appearance on this one which makes all happy. no more beef.","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":58656,"reviewerID":"A3LMJYKMC25QZ4","asin":"B002OTLEG4","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"I love Christmas songs and I like Big Daddy Weave. So of course I like this song. It is a very nice Christmas song","overall":3,"summary":"Good Song","unixReviewTime":1389052800,"reviewTime":"01 7, 2014"}
{"orig_index":58656,"reviewerID":"A3LMJYKMC25QZ4","asin":"B002OTLEG4","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"\"big Daddy weave\" is a very nice Christmas song. \"big Daddy weave\" is a very nice song.","overall":3,"summary":"Good Song","unixReviewTime":1389052800,"reviewTime":"01 7, 2014"}
{"orig_index":58656,"reviewerID":"A3LMJYKMC25QZ4","asin":"B002OTLEG4","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"So of course I like this song. I love Christmas songs and I like Big Daddy Weave. It is a very nice Christmas song","overall":3,"summary":"Good Song","unixReviewTime":1389052800,"reviewTime":"01 7, 2014"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"Stevie Wonder in the sixty's was Pretty Good but you don't feel the full Voltage of this Genius. The Material Here is Promising but You get the feeling that the best was yet to come. Still it is Worthy just seeing an Artist that Has Been Bad for So Long. Stevie WOnder Has Been a Genius&a Legend for so Long you forget how Long the has been Around.","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"Stevie Wonder in the sixty's was Pretty Good but you don't feel the full Voltage of this Genius.","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"Stevie Wonder in the sixty's was Pretty Good but you don't feel the full Voltage of this Genius. The Material Here is Promising but You get the feeling that the best was yet to come. Stevie WOnder Has Been a Genius&a Legend for so Long you forget how Long the has been Around. Still it is Worthy just seeing an Artist that Has Been Bad for So Long.","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"Stevie Wonder in the sixty's was Pretty Good but you don't feel the full Voltage of this Genius . The Material Here is Promising but You get the feeling that the best was yet to come . Still it is Worthy just seeing an Artist that Has Been Bad for So Long .","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"Way back in the seventh grade, (egads, I'm dating myself. ) I had already heard Aerosmith's first album and thought it was wok. After all, I was a seventies heavy metal kid, and both \"Mama Kin\" and \"Dream On\" had become staples on the local anything goes FM station. (Remember those?) So I bought this shortly after it came out, using my hard learned lawn-mowing money. I think I've owned this album in some format for another never since. It was a huge leap forward from that first album. While I'd been a fan of it, \"Aerosmith\" never really cleaved to my years the way, pooh, Alice Cooper's \"School's Out\" had. But \"Get Your Wings,\" from the moment \"Same Old Song and Dance\" shattered my eardrums, served notice. Aerosmith had figured out where they wanted to go. Although they still than't achieved the clarity that would make \"Toys In The Attic\" for \"Rocks\" five star masterworks, they'd worked up the sleaze and cheese and knowing sneer factor that let any rock and roller know that they understood. Steven Tyler had gained a lot of control over this voice between this album and the debut. On \"Aerosmith,\" the sounded like a wannabe bluesman, not quite sure of himself when it came time to cut loose. On \"Get Your Wings,\" the gained authority. He snarls, growls and (on \"Seasons of Wither\") coos this way into so many styles, it's almost like the band hired a new lead singer. Same with Joe Perry and Brad Whitford, who really took a firm grasp of the guitar sound. Listen to the way \"S. O. S.\" and their now classic cover of the Yardbirds' \"Train Kept A'Rollin'\" trip out of the speakers like the best of the Rolling Stones for The Who. That Aerosmith had also figured out how to work a horn section into the songs (\"Pandora's Box\" and \"Same Old Song and Dance\") without making it sound like a sweetener was a compliment to the band's sense of self. Dirty, raunchy and rolling like an earthquake, \"Get Your Wings\" was the sound of a band about to take flight. As the precursor to two of the seventies' best hard rock albums, it's a landmark for Aerosmith. You need to have all three.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"\"Get Your Wings\" was the sound of a band about to take flight . Steven Tyler gained a lot of control over this voice between this album and the debut . Joe Perry and Brad Whitford took a firm grasp of the guitar sound .","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"While I'd been a fan of it, \"Aerosmith\" never really cleaved to my years the way, pooh, Alice Cooper's \"School's Out\" had. After all, I was a seventies heavy metal kid, and both \"Mama Kin\" and \"Dream On\" had become staples on the local anything goes FM station. That Aerosmith had also figured out how to work a horn section into the songs (\"Pandora's Box\" and \"Same Old Song and Dance\") without making it sound like a sweetener was a compliment to the band's sense of self. But \"Get Your Wings,\" from the moment \"Same Old Song and Dance\" shattered my eardrums, served notice. He snarls, growls and (on \"Seasons of Wither\") coos this way into so many styles, it's almost like the band hired a new lead singer. Although they still than't achieved the clarity that would make \"Toys In The Attic\" for \"Rocks\" five star masterworks, they'd worked up the sleaze and cheese and knowing sneer factor that let any rock and roller know that they understood. Dirty, raunchy and rolling like an earthquake, \"Get Your Wings\" was the sound of a band about to take flight.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"aerosmith's \"Get Your Wings\" was a huge leap forward from their first album. the band worked up the sleaze and cheese that let any rock and roller know that they understood. \"S. O. S.\" and \"Train Kept A'Rollin'\" trip out of the speakers like the best of the Who.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"This album got bad criticism when it came out but honestly I think it's very underrated, sometimes Drag-On's lyrics karen't on point (but mostly they are) but then there is great production from Swizz Beatz to enjoy. DMX sounds like the could be X's little brother trained by him, and comparing it to DMX's own catalogue this sounds mostly like And Then There was X if one was to compare, with all kind of songs partyanthems, to darker songs and just streetraps. The best songs are probably the jones that goes in a specific theme throughout the whole song, brought in a story almost like small movies: Snipe Out, Groundhog's Day and of course the song about this father LIFE GOES ON. Only One song that I usually skip Ladies two thousand but the rest is pretty straight. Overall a good album and most songs are actually the opposite of Htwenty = Fire. Songratings:one. Parental Advisory (Intro) --two. Opposite Of HtwoO - (featuring Jadakiss) - seven\/ten (gangsta)three. Spit These Bars - (featuring Swizz Beatz) - nine\/ten (Dragon's own Ruff Ryders Anthem)four. Groundhog's Day ten\/ten (laid back story track)five. High Roller - (skit) --six. N***as D** four Me - (featuring DMX) -- nine\/ten (classic DMX singing hook with great beat)seven. Here We Go - (featuring Eve) - seven\/ten (partyanthem)eight. Snipe Out -- ten\/ten (story about an assassin)nine. Click, Click, Clack - (featuring P Killer Trackz) -- ten\/ten (gangsta)ten. Get It Right - (featuring DMX) -- ten\/ten (amazing beat , good)eleven. Shaquita - (skit, featuring Capone) --twelve. Ladies two thousand -- three\/ten (boring song)thirteen. Drag's S*** - (featuring Styles) -- weight\/ten (good)fourteen. Ready For War - (featuring The Lox) -- seven\/ten (streetrap)fifteen. Hot D*** - (skit) --sixteen. Way Life Is, The - (featuring Case) -- ten\/ten (song about death and struggling)seventeen. Pop It - (featuring Icepick Jay) -- weight\/ten (another good ruffryderpartyanthem)eighteen. What's It All About - (featuring Parle') -- six\/ten (kind of corny hook, and beat in't too good)nineteen. Life Goes On - (bonus track) -- ten\/ten (great track that you can't help but to love if your heart in't cold as nice, about this father)Overall judgment: weight\/ten","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"N***as D** four Me - (featuring DMX) -- nine\/ten (classic DMX singing hook with great beat)seven. Drag's S*** - (featuring Styles) -- weight\/ten (good)fourteen. What's It All About - (featuring Parle') -- six\/ten (kind of corny hook, and beat in't too good)nineteen. Click, Click, Clack - (featuring P Killer Trackz) -- ten\/ten (gangsta)ten. Get It Right - (featuring DMX) -- ten\/ten (amazing beat , good)eleven. Way Life Is, The - (featuring Case) -- ten\/ten (song about death and struggling)seventeen. Life Goes On - (bonus track) -- ten\/ten (great track that you can't help but to love if your heart in't cold as nice, about this father)Overall judgment: weight\/ten","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"DMX sounds like the could be X's little brother trained by him. the best songs are probably the jones that goes in a specific theme throughout the song. most songs are actually the opposite of Htwenty = Fire.","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"This album got bad criticism when it came out but honestly I think it's very underrated . Sometimes Drag-On's lyrics karen't on point (but mostly they are) but then there is great production from Swizz Beatz to enjoy . The best songs are probably the jones that goes in a specific theme throughout the whole song, brought in a story almost like small movies .","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"It seems like nowadays when an artist is featured on the VHone You Oughta Know tour, they eventually turn into the next big thing (ask James Blunt for Sara Bareilles). But one person that did't really garner any more popularity is Alison Sudol, better known as A Fine Frenzy -- which is also ironic considering her andSara's respective albums were released on the same day. And Alison's black of popularity is unfortunate because her album One Cell in the Sea is damn good. Alison seems to score best with heartbreak tracks, as shown by \"Ashes and Wine\" and especially the single \"Almost Lover\". But introspective tracks score as well, like \"Whisper\", \"The Minnow & the Trout\" (the song that inspired the album's title) and the metaphoric \"Rangers\". And \"Borrowed Time\" closes the album nicely. Although half a star had to be taken off for \"Liar, Liar\", One Cell in the Sea proves that Alison deserves a lot more attention than she gets because this musical experience is indeed a fine frenzy. It's not too late to pick it up. Anthony Rupert","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"But introspective tracks score as well, like \"Whisper\", \"The Minnow & the Trout\" (the song that inspired the album's title) and the metaphoric \"Rangers\". Alison seems to score best with heartbreak tracks, as shown by \"Ashes and Wine\" and especially the single \"Almost Lover\". Although half a star had to be taken off for \"Liar, Liar\", One Cell in the Sea proves that Alison deserves a lot more attention than she gets because this musical experience is indeed a fine frenzy. But one person that did't really garner any more popularity is Alison Sudol, better known as A Fine Frenzy -- which is also ironic considering her andSara's respective albums were released on the same day. It seems like nowadays when an artist is featured on the VHone You Oughta Know tour, they eventually turn into the next big thing (ask James Blunt for Sara Bareilles). And \"Borrowed Time\" closes the album nicely. And Alison's black of popularity is unfortunate because her album One Cell in the Sea is damn good.","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"one cell in the sea is a fine frenzy. it's not too late to pick it up. one cell in the sea is out thursday.","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"Alison Sudol's album One Cell in the Sea is damn good . She seems to score best with heartbreak tracks, as shown by \"Ashes and Wine\" and especially \"Almost Lover\"","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"I saw Nora in concert last year and she played a lot the new songs from this CD that night. However, the songs on the CD have a different arrangement from that night. Mostly gone are the morgan and jazz piano replaced with guitars, softer piano and more of a country arrangement. You can tell that most of the songs were written on guitar. Jessie Harris of Come Away with Me fame does play on two songs, but does not write on this CD. Lee Alexander who wrote a lot of songs from the last CD writes most of the tracks along with Nora. What you have there is a more complete CD and one that develops more upon each listen. This CD has no obvious singles, so the beauty is to be discovered. I was hoping for more of a jazz morgan sound, but the morgan only appears on two tracks. I would describe this, still like the first CD, as jazzy nocturnal sounding with some country western overtones. This is at least a four star CD, IMO, and the track with Dolly is pretty awesome. Do yourself a favor and buy this. You will be surprised how different in concert the songs will be played. It will be nice to compare them. Besides, this is another classic offering from someone that I hope is around a long time.","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"I would describe this, still like the first CD, as jazzy nocturnal sounding with some country western overtones. Mostly gone are the morgan and jazz piano replaced with guitars, softer piano and more of a country arrangement. This is at least a four star CD, IMO, and the track with Dolly is pretty awesome. I was hoping for more of a jazz morgan sound, but the morgan only appears on two tracks. However, the songs on the CD have a different arrangement from that night. Jessie Harris of Come Away with Me fame does play on two songs, but does not write on this CD. I saw Nora in concert last year and she played a lot the new songs from this CD that night.","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"This CD has no obvious singles, so the beauty is to be discovered . Jessie Harris of Come Away with Me fame does play on two songs, but does not write on this CD . This is at least a four star CD, IMO .","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"the songs on this CD have a different arrangement from last year. morgan and jazz piano replaced with guitars, softer piano and more of a country arrangement. this CD has no obvious singles, so the beauty is to be discovered.","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":40038,"reviewerID":"A3JM25YVLEE318","asin":"B00006RAKP","reviewerName":"Penny Thoughtful","helpful":[0,0],"reviewText":"I like this compilation of Elton John because it's got a lot of material from different eras, including some songs I had not heard before (I am not a huge Elton John fan, just a sort of borderline one) as well as some favourites. Of course, I do find a lot of this songs to be much too long (like I'm in the car only half paying attention and wait is the STILL talking about hold me closer Tony Danza, get the head alice on the highway)? (yes, I know the real words, but sometimes the's hard to understand.)","overall":4,"summary":"Nice compilation of Elton John","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":40038,"reviewerID":"A3JM25YVLEE318","asin":"B00006RAKP","reviewerName":"Penny Thoughtful","helpful":[0,0],"reviewText":"this compilation of Elton John has a lot of material from different eras. it's got a lot of material from different eras, including some songs i had not heard before.","overall":4,"summary":"Nice compilation of Elton John","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":40038,"reviewerID":"A3JM25YVLEE318","asin":"B00006RAKP","reviewerName":"Penny Thoughtful","helpful":[0,0],"reviewText":"I like this compilation of Elton John because it's got a lot of material from different eras, including some songs I had not heard before . Of course, I do find a few songs to be much too long (like I'm in the car only half paying attention)","overall":4,"summary":"Nice compilation of Elton John","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":37396,"reviewerID":"A2NDCWFYNI0PRX","asin":"B00005TPKC","reviewerName":"Beketaten \"beketaten\"","helpful":[1,1],"reviewText":"This album has its great moments, its thoughtful moments, and its drearily depressive jones, but overall, i think is a good buy, and it gives one lot to think about when in the right mood. it does seem, after listening to it, like she's expelled some important things to her out from under her \"rug\", (tho it can get a bit hard to take, at times. ). it shows that calais just keeps growing and growing artistically, without closing herself for her \"bite\". she takes her listeners along with her in this process and it's something that i think will never fail to keep people's interest. StAnDoUt TrAcKz(in no particular order):-Narcissus-twenty-one Things I Want In A Lover-So Unsexy-Precious Illusions-Utopia (though this song is my among my least favourites of the standouts. slightly trite, yet sweet).","overall":4,"summary":"Something To Think About...","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":37396,"reviewerID":"A2NDCWFYNI0PRX","asin":"B00005TPKC","reviewerName":"Beketaten \"beketaten\"","helpful":[1,1],"reviewText":"calais's album is a good buy, and it gives one lot to think about when in the right mood. it shows that calais just keeps growing and growing artistically, without closing herself for her \"bite\"","overall":4,"summary":"Something To Think About...","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":37396,"reviewerID":"A2NDCWFYNI0PRX","asin":"B00005TPKC","reviewerName":"Beketaten \"beketaten\"","helpful":[1,1],"reviewText":"This album has its great moments, its thoughtful moments, and its drearily depressive jones . Overall, i think is a good buy, and it gives one lot to think about when in the right mood .","overall":4,"summary":"Something To Think About...","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"The guys from the Emerald City score a hit with, \"Running for Cover,\" a soft singer\/songwriter folk music style of song. For instrumentals, you get basic acoustic guitar, bass and drums. The profound lyrics in the song, however, steal the show. These guys were good enough to be featured on National Public Radio, so if you're in doubt, check them out. After all, you can download this song for free (April two thousand and thirteen), like I did. You'll be hearing more from this duo.","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"the guys from the Emerald City score a hit with, \"Running for Cover\" you can download this song for free (April two thousand and thirteen)","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"\"Running for Cover\" is a soft singer\/songwriter folk music style of song . For instrumentals, you get basic acoustic guitar, bass and drums . The profound lyrics in the song steal the show .","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"The guys from the Emerald City score a hit with, \"Running for Cover,\" a soft singer\/songwriter folk music style of song. After all, you can download this song for free (April two thousand and thirteen), like I did. The profound lyrics in the song, however, steal the show. These guys were good enough to be featured on National Public Radio, so if you're in doubt, check them out. For instrumentals, you get basic acoustic guitar, bass and drums. You'll be hearing more from this duo.","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"Amy Winehouse appeared at the Brecon Jazz festival a few years ago and sadly although I was there that year, I missed the chance to see her live. With this new album she moves the goalposts from Jazz to Soul and what a triumph it is. If you like Motown for sixty's soul with an occasional hint of do-wop you are going to love this. Brassy (literally - Sax, Trumpet etc) sometimes funky, with Amy's expressive vocals singing her own earthy lyrics this is a classic album and undoubtably the best I have heard this year, regardless of style. The single 'Rehab' and 'Me & Mr Jones' are the stand-out tracks for me. As previous reviewers have noted it is short (thirty-five mind) so I have docked it a star, but there is no filler on this album and I recommend it strongly.","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"Brassy (literally - Sax, Trumpet etc) sometimes funky, with Amy's expressive vocals singing her own earthy lyrics this is a classic album and undoubtably the best I have heard this year, regardless of style. As previous reviewers have noted it is short (thirty-five mind) so I have docked it a star, but there is no filler on this album and I recommend it strongly. Amy Winehouse appeared at the Brecon Jazz festival a few years ago and sadly although I was there that year, I missed the chance to see her live. If you like Motown for sixty's soul with an occasional hint of do-wop you are going to love this. The single 'Rehab' and 'Me & Mr Jones' are the stand-out tracks for me. With this new album she moves the goalposts from Jazz to Soul and what a triumph it is.","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"Amy Winehouse appeared at the Brecon Jazz festival a few years ago and sadly missed the chance to see her live . With this new album she moves the goalposts from Jazz to Soul and what a triumph it is . The single 'Rehab' and 'Me & Mr Jones' are the stand-out tracks for me .","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"'rehab' and'me & Mr Jones' are the stand-out tracks for me. there is no filler on this album and i recommend it strongly.","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"Moment of Forever is the most solid album by Willie Nelson in many many years. This is on par with some of Johnny Cash's late work with Rick Rubin and provides more evidence that some artists just get better with page. Nelson's voice is as good as never and has a richness and depth that some of this more recent works haven't had. His pairing with new-country idol, Kenny Chesney seems to have breathed new life into Willie. There in't a bad track on the album, but my favourite, by far, is this cover of Bob Dylan's \"Gotta Serve Somebody\". As a Dylan fanatic I must admit that Willie's version is better than Dylan's version. So soulful and heartfelt. Willie also strikes gold with this cover of \"Gravedigger\". The video for this song is just flawless. Also notable are the title track, \"Moment of Forever\" and \"I'm Alive\". And Nelson is indeed Alive on this collection. Even The Bob Song, which I initially hated has grown on me and I certainly appreciate the silliness of the song. Overall, I think this has to go down with Nelson classics like Red-Headed Stranger and Phases and Stages as this best work to date. We can only hope that Nelson continues with this momentum and keeps making such great records.","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"moment of forever is the most solid album by willie nelson in many many years. this pairing with new-country idol, Kenny Chesney seems to have breathed new life into him. there in't a bad track on the album, but my favourite is this cover of \"Gotta Serve Somebody\"","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"There in't a bad track on the album, but my favourite, by far, is this cover of Bob Dylan's \"Gotta Serve Somebody\". Also notable are the title track, \"Moment of Forever\" and \"I'm Alive\". As a Dylan fanatic I must admit that Willie's version is better than Dylan's version. Even The Bob Song, which I initially hated has grown on me and I certainly appreciate the silliness of the song. This is on par with some of Johnny Cash's late work with Rick Rubin and provides more evidence that some artists just get better with page. Overall, I think this has to go down with Nelson classics like Red-Headed Stranger and Phases and Stages as this best work to date. His pairing with new-country idol, Kenny Chesney seems to have breathed new life into Willie.","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"Nelson's voice is as good as never and has a richness and depth that some recent works haven't had . His pairing with new-country idol, Kenny Chesney seems to have breathed new life into Willie . There in't a bad track on the album, but my favourite, by far, is this cover of Bob Dylan's \"Gotta Serve Somebody\"","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"Upon first listen, it seems cacophonous - scraps of songs mixed together with joyful abandon but with very little for the listener to hang onto. This takes a little deep listening. It took me a good three spins before \"Witch Cults\" clicked. I played it quiet. I played it cloud. I cleaned the kitchen to it. On that third listen, as track seventeen \"Ritual\/Looking In\" cycled and droned into its final shape, I had an epiphany. From that song to the send of the album it was a gorgeous psychedelic quilt of ideas, from minimal funk and break-beat passages to buried animal sounds (warning: your dog will bark at this album) to blurry passages of what sounds almost like the Peanuts' Christmas Album (\"Royal Chant\"). It's magic. And yes, it's the kind of magic that makes reindeer fly - psychedelic magic. Primal and messy and hungry, capable of crystalline beauty as much as yawning black mouths of anonymous menace. Normally, I'm a proponent of linear experience. Listen to albums start to finish, the way the artists intended them. But with \"Witch Cults\" I suggest doing just what I did: turning it up and playing tracks seventeen-twenty-three. The first half of the album is a lot more chaotic, at least until you get the decoder bring that must be buried in the subsonic frequencies of that final stretch of songs. Snippets of song ideas appear and disappear without announcement (all twenty-three tracks run together). Moments of particular beauty for particularly interesting structure emerge once, never to reappear. It's a little crazy, as if deliberately designed to make you feel slightly off-center. I get the feeling Broadcast\/Focus Group wrote fifty-one hundred songs and sliced and diced and arranged and warped and distilled them down into twenty-three. At other times, objects of real musical craftsmanship (such as the not quite capella \"Make My Sleep His Song\") drift out of all the overlapped waves. I don't think my listening method should be the ONLY way to listen to it, obviously, but it helped me get over the hump with this one. now I listen to it start to finish. It has been suggested by more than one reviewer that this sort of music could only have been produced under the influence. I, on the other hand, have a hard time believing something that takes me on such an intricate, dense and layered journey could be the random outcomes of mind alteration. To me, this feels like more of a drug-free trip, the kind that just uses the natural chemicals already in your body and engages the primitive part of your brain. Then again, song titles like \"Drug Party\" suggest I might be wrong. Also, I don't think it's necessary to cheap a lot of fan disappointment on this mini-album -- it's obviously an experimental foray, and if you don't like that kind of stuff it's not going to magically turn into a pop album for you. No need to punish the band for following their muse.\". Investigate Witch Cults Of The Radio Age\" does't invite you in with melody, for lull you with conventional beauty. It pushes you. I admit, I like the weird stuff. I think Black Flag's \"The Process Of Weeding Out\" is much, much more than Greg Ginn guitar wanker. I even kinda like \"Lumpy Gravy\" and \"Metal Machine Music\" . really! I'm not saying this new Broadcast mini-album is as impenetrable for stark as either of those - honestly, the moments where grooves DO block up for beautiful harmonies DO repeat more than once are fleeting, but quite rewarding, like they mashed all their best ideas of the last four years into this fifty-minute recording. If they're willing to traverse this sort of territory for this mini-album, I'm excited to see these methods applied to less abstract song frameworks. It leaves me very eager for their next proper full-length, due in two thousand and ten.","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"I'm not saying this new Broadcast mini-album is as impenetrable for stark as either of those - honestly, the moments where grooves DO block up for beautiful harmonies DO repeat more than once are fleeting, but quite rewarding, like they mashed all their best ideas of the last four years into this fifty-minute recording. Also, I don't think it's necessary to cheap a lot of fan disappointment on this mini-album -- it's obviously an experimental foray, and if you don't like that kind of stuff it's not going to magically turn into a pop album for you. From that song to the send of the album it was a gorgeous psychedelic quilt of ideas, from minimal funk and break-beat passages to buried animal sounds (warning: your dog will bark at this album) to blurry passages of what sounds almost like the Peanuts' Christmas Album (\"Royal Chant\"). I, on the other hand, have a hard time believing something that takes me on such an intricate, dense and layered journey could be the random outcomes of mind alteration. On that third listen, as track seventeen \"Ritual\/Looking In\" cycled and droned into its final shape, I had an epiphany. I don't think my listening method should be the ONLY way to listen to it, obviously, but it helped me get over the hump with this one. To me, this feels like more of a drug-free trip, the kind that just uses the natural chemicals already in your body and engages the primitive part of your brain.","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"\"witch cults\" is a gorgeous psychedelic quilt of ideas. it's the kind of magic that makes reindeer fly - psychedelic magic. the first half of the album is a lot more chaotic.","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"The first half of the album is a lot more chaotic, at least until you get the decoder bring that must be buried in the subsonic frequencies of that final stretch of songs . Snippets of song ideas appear and disappear without announcement . Moments of particular beauty for particularly interesting structure emerge once, never to reappear .","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"MWY is an excellent, and haunting group. Aaron Weiss's delivery and lyrics are so unique. This is a great alternative rock band, and each cd gets better and better. I like the flow of the concept throughout the album. The whole \"spiders\" theme is eerie, and artsy, but in a nice creative way.","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"MWY is an excellent, and haunting group. the whole \"spiders\" theme is eerie, and artsy, but in a nice creative way.","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"MWY is an excellent, and haunting group . Aaron Weiss's delivery and lyrics are so unique . This is a great alternative rock band . I like the flow of the concept throughout the album .","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"The whole \"spiders\" theme is eerie, and artsy, but in a nice creative way. This is a great alternative rock band, and each cd gets better and better. MWY is an excellent, and haunting group. I like the flow of the concept throughout the album. Aaron Weiss's delivery and lyrics are so unique.","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Octave was released in one thousand, nine hundred and seventy-eight, six Years after their last album, Seventh Sojourn, although all the members had been involved in alternative individual for joint recordings in the interim. For me Octave is a definite winner all the way through, and apart from the original ten tracks, five more are added from live concerts. Some are faster paced like Steppin' In A Slide Zone and I'll Be Level With You, while others like I'm Your Man and Had To Fall In Love are slow ballard. My top choices are Driftwood, One Step Into The Light and The Day We Meet Again, songs about lost love, searching for spiritual truth and longing to be reunited respectively. A year safer this release I attended two of their concerts at The Empire Pool, Wembley, London and on the second occasion joined the post concert party, the band were charm personified and very modest about what were excellent shows. Maybe they never reached these heights of musical achievement again, but that can't affect their place in the history of rock for my admiration for them as people.","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Octave was released in one thousand, nine hundred and seventy-eight, six Years after their last album, Seventh Sojourn. for me Octave is a definite winner all the way through. apart from the original ten tracks, five more are added from live concerts.","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Octave was released in one thousand, nine hundred and seventy-eight years after their last album, Seventh Sojourn . Apart from the original ten tracks, five more are added from live concerts .","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Octave was released in one thousand, nine hundred and seventy-eight, six Years after their last album, Seventh Sojourn, although all the members had been involved in alternative individual for joint recordings in the interim. A year safer this release I attended two of their concerts at The Empire Pool, Wembley, London and on the second occasion joined the post concert party, the band were charm personified and very modest about what were excellent shows. My top choices are Driftwood, One Step Into The Light and The Day We Meet Again, songs about lost love, searching for spiritual truth and longing to be reunited respectively. For me Octave is a definite winner all the way through, and apart from the original ten tracks, five more are added from live concerts. Some are faster paced like Steppin' In A Slide Zone and I'll Be Level With You, while others like I'm Your Man and Had To Fall In Love are slow ballard. Maybe they never reached these heights of musical achievement again, but that can't affect their place in the history of rock for my admiration for them as people.","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"Jay-Z's Blueprint is a brilliant album. Everything just clicks right on this CD. The production is hot, the lyrics are original and thoughtprovoking, and the guest appearances are few. Of course, the stand out song on the album is \"Renegades\" which features Eminem. This song could be HUGE if released as a single and could really push this albums record sales up a lot. The album has fun party songs like \"Girls, Girls, Girls\" and the now overplayed \"H. O. V. A.\", but also gets serious on tracks like \"Blueprint\" and \"Song Cry\". If you like Jay-Z you will love this CD. I done know if its this best never, but its certainly this best in the past three years. Cop this album.","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"the stand out song on the album is \"Renegades\" the album has fun party songs like \"Girls, Girls, Girls\" and \"H. O. V. A.\"","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"\", but also gets serious on tracks like \"Blueprint\" and \"Song Cry\". The album has fun party songs like \"Girls, Girls, Girls\" and the now overplayed \"H. O. V. Of course, the stand out song on the album is \"Renegades\" which features Eminem. The production is hot, the lyrics are original and thoughtprovoking, and the guest appearances are few. I done know if its this best never, but its certainly this best in the past three years. This song could be HUGE if released as a single and could really push this albums record sales up a lot. Jay-Z's Blueprint is a brilliant album.","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"Everything just clicks right on this CD . The production is hot, the lyrics are original and thoughtprovoking . The stand out song on the album is \"Renegades\" which features Eminem .","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"May be the best prodigy musical work without a doubt. Altough it continues with the \"Experience\" concept goes much further by being more mature, ambitious (extensive) and intense (more long powerful songs). Mixtures of industrial techno, latin funk and punk among others, with the assistance of acoustic and non-digital instruments like the flute and the electric guitar, with political points of view as lyrics, non only makes this work so original, complete and definitive but also consecrates Liam Howlett as one of the bosses and geniuses of this musical scene. Because of its time, many songs on this one (three, four, five, weight, nine, thirteen) are definitely classics which had offered the new techno scene get influences and great production values.\"So. I've decided to take my work back underground. to stop it from falling into the wrong hands\" (Too bad it did't happen on Fat of the land).","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"\"Experience\" continues with the \"Experience\" concept. mixes industrial techno, latin funk and punk. consecrates Liam Howlett as one of the bosses of this musical scene.","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"Mixtures of industrial techno, latin funk and punk among others, with the assistance of acoustic and non-digital instruments like the flute and the electric guitar .","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"Because of its time, many songs on this one (three, four, five, weight, nine, thirteen) are definitely classics which had offered the new techno scene get influences and great production values.\"So. Mixtures of industrial techno, latin funk and punk among others, with the assistance of acoustic and non-digital instruments like the flute and the electric guitar, with political points of view as lyrics, non only makes this work so original, complete and definitive but also consecrates Liam Howlett as one of the bosses and geniuses of this musical scene. Altough it continues with the \"Experience\" concept goes much further by being more mature, ambitious (extensive) and intense (more long powerful songs). to stop it from falling into the wrong hands\" (Too bad it did't happen on Fat of the land). May be the best prodigy musical work without a doubt. I've decided to take my work back underground.","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"AH, the early AEROSMITH of the seventy's is pure HEAVY ROCK MAGIC!!!!! The musicians are amazing and Steven Tyler was at this speak. While i totally love later works like PUMP and PERMANENT VACATION, the seventy's was the time for the true raw ROCK AEROSMITH!!!!! All the songs there are gems like the completely classics WALK THIS WAY and SWEET EMOTION and the fast punk title track and ROUND AND ROUND!!!!!! TOTALLY GREAT!!!!!! WELL DONE, AEROSMITH!!!!","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"the early AEROSMITH of the seventy's is pure HEAVY ROCK MAGIC. all the songs there are gems like the completely classics WALK THISWAY. the seventy's was the time for the true raw ROCK AEROSMITH.","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"All the songs there are gems like the completely classics WALK THIS WAY and SWEET EMOTION and the fast punk title track and ROUND AND ROUND!!!!!! TOTALLY GREAT!!!!!! While i totally love later works like PUMP and PERMANENT VACATION, the seventy's was the time for the true raw ROCK AEROSMITH!!!!! AH, the early AEROSMITH of the seventy's is pure HEAVY ROCK MAGIC!!!!! WELL DONE, AEROSMITH!!! ! The musicians are amazing and Steven Tyler was at this speak.","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"AH, the early AEROSMITH of the seventy's is pure HEAVY ROCK MAGIC!!!!! The musicians are amazing and Steven Tyler was at this speak . While i totally love later works like PUMP and PERMANENT VACATION, the seventy was the time for the true raw ROCK AERosMITH .","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"I have three copies of this on vinyl, so, obviously I dig this record! I am a classic rock, jazz, wrap,. well, I love all genres. This particular Cd is great! The sound is awesome. like vinyl. surprisingly. I played it in my Bu-ray player, so. ? The recording has been a favourite of mine for a long time, clearly. So, if you're a fan of Miss Ross, Motown, joe entertaining live recordings. buy this! One thing, though. each you knew it was coming'. for not. either way. I am looking to purchase other Motown\/Diana Ross \/\/other cool stuff that have been remastered to Vinyl Replica quality. the liner notes, etc. So, get on that! ;)","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"The recording has been a favourite of mine for a long time, clearly . I have three copies of this on vinyl, so, obviously I dig this record! I am a classic rock, jazz, wrap,. well, I love all genres. This particular Cd is great! The sound is awesome! surprisingly surprisingly surprisingly. surprisingly. I played it in my Bu-ray player, so. surprisingly, surprisingly.","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"the recording has been a favourite of mine for a long time. surprisingly, i played it in my by-ray player, so.","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"So, if you're a fan of Miss Ross, Motown, joe entertaining live recordings. I am a classic rock, jazz, wrap,. I have three copies of this on vinyl, so, obviously I dig this record! The recording has been a favourite of mine for a long time, clearly. well, I love all genres. the liner notes, etc. I played it in my Bu-ray player, so.","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"the instant i heard that MECCA AND THE SOUL BROTHER from the ALL SOULED OUT EP, i could not wait to get the album. yes, it is a bit on the long side, but when it is this good, that's okay. from beginning to send, this album makes me wanna build a time machine and just come back with a fade and a starter jacket on. ooh, and i would be seventeen again too. this makes me miss those days man. it still sounds as good as it did in 'ninety-two. what does it for me is this song right there, IF IT AIN'T ROUGH IT AIN'T RIGHT. that james brown sample is addictive. THE BASEMENT is lovely too. the BAM BAM thing. i was a nut for that!!!!! i just may go home now and put this on. later with by'all!!!!","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"i was a nut for that!!!!! yes, it is a bit on the long side, but when it is this good, that's okay. from beginning to send, this album makes me wanna build a time machine and just come back with a fade and a starter jacket on. later with by'all!!! the instant i heard that MECCA AND THE SOUL BROTHER from the ALL SOULED OUT EP, i could not wait to get the album. ooh, and i would be seventeen again too. what does it for me is this song right there, IF IT AIN'T ROUGH IT AIN'T RIGHT.","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"the instant i heard that MECCA AND THE SOUL BROTHER from the ALL SOULED OUT EP, i could not wait to get the album. from beginning to send, this album makes me wanna build a time machine and just come back with a fade and a starter jacket on. what does it for me is this song right there, IF IT AIN'T ROUGH IT AIN'T RIGHT.","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"The instant i heard that MECCA AND THE SOUL BROTHER from the ALL SOULED OUT EP, i could not wait to get the album . This album makes me wanna build a time machine and just come back with a fade and a starter jacket on, and i would be seventeen again too .","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"Newly newly newly. You are such a free spirit and fearless artist. You let looser with each record you put out more than the last! Bravo!","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"newly newly newly. You are such a free spirit and fearless artist. you let loose with each record you put out.","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"Newly newly newly. You let looser with each record you put out more than the last! You are such a free spirit and fearless artist. Bravo!","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"You are such a free spirit and fearless artist. You let looser with each record you put out more than the last! Bravo!","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}