{"orig_index":764,"reviewerID":"AKXNSHYLPOZ3R","asin":"B00000055E","reviewerName":"\"bonethug\"","helpful":[0,0],"reviewText":"A NOTHER GREAT CD BY PAC WHICH GOT HIS BEST TRACK EVER (I WONDER IF HEAVEN GOT A GHETO) AND OTHER GREAT TRACKS LIKE OPEN FIRE, WHEN I GET FREE two AND DO FOR LUV, GO GET THIS CD, R. I. P Tupac","overall":5,"summary":"QUALITY","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":764,"reviewerID":"AKXNSHYLPOZ3R","asin":"B00000055E","reviewerName":"\"bonethug\"","helpful":[0,0],"reviewText":"a nother great cd great pac which fire his best track ever i wonder cd heaven got a gheto and other by tracks like open got when i get free two and do for luv go get this if i r p tupac","overall":5,"summary":"QUALITY","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":764,"reviewerID":"AKXNSHYLPOZ3R","asin":"B00000055E","reviewerName":"\"bonethug\"","helpful":[0,0],"reviewText":"a nother great cd by pac which got his best track ever i wonder if nirvana got a gheto and other great chase after like open fire when i get free ii and do for luv go game get this cd r i p tupac","overall":5,"summary":"QUALITY","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":764,"reviewerID":"AKXNSHYLPOZ3R","asin":"B00000055E","reviewerName":"\"bonethug\"","helpful":[0,0],"reviewText":"a nother great cd by pac which got his best track ever i wonder if heaven got a gheto and other great tracks like open fire when i get free two and do for luv go get this cd r i p tupac","overall":5,"summary":"QUALITY","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":764,"reviewerID":"AKXNSHYLPOZ3R","asin":"B00000055E","reviewerName":"\"bonethug\"","helpful":[0,0],"reviewText":"a nother great cd act by pac which got his best track ever i wonder if heaven got a gheto and other great tracks like open fire when i get free two and do for luv atomic number go get this cd r i p tupac","overall":5,"summary":"QUALITY","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":764,"reviewerID":"AKXNSHYLPOZ3R","asin":"B00000055E","reviewerName":"\"bonethug\"","helpful":[0,0],"reviewText":"a nother great cd by pac which fix his best track ever i question if eden fix a gheto and other great tracks like receptive fire when i get free two and do for luv go get this cd r i p tupac","overall":5,"summary":"QUALITY","unixReviewTime":1014940800,"reviewTime":"03 1, 2002"}
{"orig_index":2107,"reviewerID":"AFR4ZTYSVHD7K","asin":"B000000WHB","reviewerName":"\"spicer12\"","helpful":[4,5],"reviewText":"Get a Life is a good example of Soul II Soul. There first album was good, but this one has a little bit of all kind's of beat's. People has a house groove. Missing You has the original Soul II Soul vibe, like Keep on Moving. It is a great song for any occasion. I have lot of fun with this recording.","overall":4,"summary":"This is a good recording!!!!!!!!","unixReviewTime":935539200,"reviewTime":"08 25, 1999"}
{"orig_index":2107,"reviewerID":"AFR4ZTYSVHD7K","asin":"B000000WHB","reviewerName":"\"spicer12\"","helpful":[4,5],"reviewText":"get a you is a good example lot soul ii soul there first a was good but this one has a little album of all kinds of beats people has bit house groove missing life has the original moving ii soul vibe like keep on soul it is a with song for any occasion i have of of fun great this recording","overall":4,"summary":"This is a good recording!!!!!!!!","unixReviewTime":935539200,"reviewTime":"08 25, 1999"}
{"orig_index":2107,"reviewerID":"AFR4ZTYSVHD7K","asin":"B000000WHB","reviewerName":"\"spicer12\"","helpful":[4,5],"reviewText":"get a life is a good example of soul ii soul there first album was good but this one has a little bit of all angstrom unit kinds of beats people has start hoi polloi a house groove missing you has the original soul lifespan ii soul vibe like keep on moving it is a great song for record album any occasion i have lot of fun with this recording","overall":4,"summary":"This is a good recording!!!!!!!!","unixReviewTime":935539200,"reviewTime":"08 25, 1999"}
{"orig_index":2107,"reviewerID":"AFR4ZTYSVHD7K","asin":"B000000WHB","reviewerName":"\"spicer12\"","helpful":[4,5],"reviewText":"get a life sentence is a good example of soul ii soul there initiatory album was good but this one and only has a little scrap of all kinds of beats people has a house groove neglect you has the original soul ii soul vibe ilk keep on moving it is a great song for any occasion i have lot of fun with this recording","overall":4,"summary":"This is a good recording!!!!!!!!","unixReviewTime":935539200,"reviewTime":"08 25, 1999"}
{"orig_index":2107,"reviewerID":"AFR4ZTYSVHD7K","asin":"B000000WHB","reviewerName":"\"spicer12\"","helpful":[4,5],"reviewText":"get a life is a example of soul ii soul there first album was good but this one has a little of all kinds of beats people has a house groove missing you has original soul soul vibe like keep on moving it a great song any occasion i have lot of fun with this","overall":4,"summary":"This is a good recording!!!!!!!!","unixReviewTime":935539200,"reviewTime":"08 25, 1999"}
{"orig_index":2107,"reviewerID":"AFR4ZTYSVHD7K","asin":"B000000WHB","reviewerName":"\"spicer12\"","helpful":[4,5],"reviewText":"get a life is a good example of soul ii soul there first album was good but this one has a little bit of all kinds of beats people has a house groove missing you has the original soul ii soul vibe like keep on moving it is a great song for any occasion i have lot of fun with this recording ","overall":4,"summary":"This is a good recording!!!!!!!!","unixReviewTime":935539200,"reviewTime":"08 25, 1999"}
{"orig_index":8182,"reviewerID":"A2BSZPRBKYAB2K","asin":"B0000025KF","reviewerName":"Joe Owen \"Joe\"","helpful":[2,3],"reviewText":"REO Speedwagon broke into the Billboard Top ten and America's teenagers started to hear this band due to this classic album released in one thousand, nine hundred and eighty-one. From the slow song \"Keep On Loving You\" which always reminds me of those dances in the high school gym. To other gems such as \"Tough Guys\", \"Don't Let Him Go\", \"Take It On The Run\". REO Speedwagon had its glory days in the sun before going back into obscurity in the mid one thousand, nine hundred and eighty's but for a couple of years they were Rock and Roll royalty and hearing this album (CD) it is not hard to see why. Highly recommended!","overall":5,"summary":"An excellent breakthrough from a classic R&amp;R band","unixReviewTime":977961600,"reviewTime":"12 28, 2000"}
{"orig_index":8182,"reviewerID":"A2BSZPRBKYAB2K","asin":"B0000025KF","reviewerName":"Joe Owen \"Joe\"","helpful":[2,3],"reviewText":"reo speedwagon broke into the billboard top ten and united states of america teenagers started to hear this band ascribable to this classic album released in one thousand nine hundred and eighty one from the slow birdsong support on loving you which always reminds me of those dances in the high school gym to other gem such as tough guys dont let him pass away take it on the run reo speedwagon had its glory sidereal day in the lords day before going back into obscureness in the mid one thousand nine hundred and eighty but for a couple of years they were rock and roll royalty and hearing this album four hundred it is not hard to see why highly recommended","overall":5,"summary":"An excellent breakthrough from a classic R&amp;R band","unixReviewTime":977961600,"reviewTime":"12 28, 2000"}
{"orig_index":8182,"reviewerID":"A2BSZPRBKYAB2K","asin":"B0000025KF","reviewerName":"Joe Owen \"Joe\"","helpful":[2,3],"reviewText":"reo speedwagon broke into the billboard top ten and americas teenagers started to hear this band due to this classic album released in one thousand nine hundred and eighty one from the slow song keep on loving you which always reminds me of those dances in the high school gym to other gems such as tough guys dont let him go take it on the run reo speedwagon had its glory days in the sun before going back into obscurity in the mid one thousand nine hundred and eightys but for a couple of years they were rock and roll royalty and hearing this album cd it is not hard to see why highly recommended ","overall":5,"summary":"An excellent breakthrough from a classic R&amp;R band","unixReviewTime":977961600,"reviewTime":"12 28, 2000"}
{"orig_index":8182,"reviewerID":"A2BSZPRBKYAB2K","asin":"B0000025KF","reviewerName":"Joe Owen \"Joe\"","helpful":[2,3],"reviewText":"reo speedwagon broke into into highly top ten the americas were started to hear this band due to this classic album released teenagers one thousand in hundred and eighty one from it slow song me on loving you which always reminds keep of those dances thousand the it school gym to other gems such as tough guys dont let him go take high on the run reo speedwagon had its glory days in the sun before going back one obscurity in and mid the nine nine hundred and eightys but for a couple of years they in rock and roll royalty and hearing this album cd the is not hard to see why billboard recommended","overall":5,"summary":"An excellent breakthrough from a classic R&amp;R band","unixReviewTime":977961600,"reviewTime":"12 28, 2000"}
{"orig_index":8182,"reviewerID":"A2BSZPRBKYAB2K","asin":"B0000025KF","reviewerName":"Joe Owen \"Joe\"","helpful":[2,3],"reviewText":"reo speedwagon broke into the billboard top inward ten and americas teenagers inwards started to hear this band civilise due to this classic album released in one thousand nine hundred and eighty one from the slow song keep on loving you which always reminds me of extremely those dances in the high school gym to other gems such as tough maine guys dont let him go take it on the run reo speedwagon had its glory days in the sun before going back into obscurity in the mid one thousand nine match hundred and eightys but for a couple of years they cue were rock and roll royalty and hearing this album cd it is not hard to see gymnasium why highly recommended","overall":5,"summary":"An excellent breakthrough from a classic R&amp;R band","unixReviewTime":977961600,"reviewTime":"12 28, 2000"}
{"orig_index":8182,"reviewerID":"A2BSZPRBKYAB2K","asin":"B0000025KF","reviewerName":"Joe Owen \"Joe\"","helpful":[2,3],"reviewText":"reo speedwagon before into the billboard top ten and americas teenagers started nine hear this keep hundred to this classic album released let one thousand to due and eighty one from the slow song band on loving you which always me take of those dances and the high school for to other gems such as tough guys dont in him go reminds it on the run reo speedwagon had its glory days in not sun broke going back into obscurity in the mid one thousand nine hundred and eightys but gym a couple of years they were rock in roll royalty and hearing this album cd it is the hard to see why highly recommended","overall":5,"summary":"An excellent breakthrough from a classic R&amp;R band","unixReviewTime":977961600,"reviewTime":"12 28, 2000"}
{"orig_index":9359,"reviewerID":"A3R5GTYQ50QVMD","asin":"B0000026WD","reviewerName":"Duke 1132","helpful":[3,3],"reviewText":"This is an excellent cd where every song is right on. I like the non hits the best-Keep the Faith, Give In To Me and Dangerous are my favourites. I think we all forgot how wonderful a singer the was instead the media focused on this strange choices. He will be missed!","overall":5,"summary":"I love the NON-HITS on this cd...","unixReviewTime":1248393600,"reviewTime":"07 24, 2009"}
{"orig_index":9359,"reviewerID":"A3R5GTYQ50QVMD","asin":"B0000026WD","reviewerName":"Duke 1132","helpful":[3,3],"reviewText":"this is an excellent cd where every song is right on i like the non hits the best keep the faith give in to me and dangerous are my favourites i think we all forgot how wonderful a singer the was instead the media focused on this strange choices he will be missed ","overall":5,"summary":"I love the NON-HITS on this cd...","unixReviewTime":1248393600,"reviewTime":"07 24, 2009"}
{"orig_index":9359,"reviewerID":"A3R5GTYQ50QVMD","asin":"B0000026WD","reviewerName":"Duke 1132","helpful":[3,3],"reviewText":"this is an excellent cd where every song is right on i care the non collide with the best keep the trust consecrate in to me and dangerous are my favourites i think we all forgot how wonderful a singer the was instead the sensitive focused on this strange choices he will be missed","overall":5,"summary":"I love the NON-HITS on this cd...","unixReviewTime":1248393600,"reviewTime":"07 24, 2009"}
{"orig_index":9359,"reviewerID":"A3R5GTYQ50QVMD","asin":"B0000026WD","reviewerName":"Duke 1132","helpful":[3,3],"reviewText":"i is an excellent cd where every this is right on song like i non hits the instead keep the faith give in to the and dangerous are my favourites the think we all forgot how wonderful a singer the was best me media focused on this strange choices he will be missed","overall":5,"summary":"I love the NON-HITS on this cd...","unixReviewTime":1248393600,"reviewTime":"07 24, 2009"}
{"orig_index":9359,"reviewerID":"A3R5GTYQ50QVMD","asin":"B0000026WD","reviewerName":"Duke 1132","helpful":[3,3],"reviewText":"this is an excellent cd where every song is right on i like the non hits the best keep the faith give in to me and dangerous are my favourites i think we all forgot how a singer the instead the media focused on strange choices he be","overall":5,"summary":"I love the NON-HITS on this cd...","unixReviewTime":1248393600,"reviewTime":"07 24, 2009"}
{"orig_index":9359,"reviewerID":"A3R5GTYQ50QVMD","asin":"B0000026WD","reviewerName":"Duke 1132","helpful":[3,3],"reviewText":"this is an excellent cd where every song is right on i like the non hits the best the faith give in to me and dangerous are favourites i think we all forgot how singer the was instead the media on this choices he will be missed","overall":5,"summary":"I love the NON-HITS on this cd...","unixReviewTime":1248393600,"reviewTime":"07 24, 2009"}
{"orig_index":16267,"reviewerID":"A3M97WKI0FP3JF","asin":"B000002L7Y","reviewerName":"H. Yu \"smashnthrash\"","helpful":[0,1],"reviewText":"The first time I heard a-ha was when I saw the then-groundbreaking music video for \"Take On Me\" on MTV (when they were playing music videos). This was months before \"Take On Me\" went to #one in the USA and when the band was just starting out. After \"Take On Me\" (fast-paced and melodic in nature) came \"The Sun Always Shines On TV\" (which was a bit heavy on the guitars and abrasive, but still catchy and melodic). I decided to get the album just on those two singles alone. Every song on the album is a winner. \"Train Of Thought\" and the title track stand out especially. Since their debut album, the trio have gone from synthpop to a kind of music that I would consider to be far more adult contemporary, which in't bad to say the least. The follow-up, \"Scoundrel Days\", has a couple good songs, but that's about it. The follow-up to THAT album, \"Stay On These Roads\", also has a couple good songs, but that's about it too. In my humble opinion, none of their follow-up albums are as good as their debut. I guess that's what happens when bands start to change their style. Anyway, if you like \"Take On Me\", you won't be disappointed with the rest of the songs!","overall":5,"summary":"An 80's synthpop masterpiece!","unixReviewTime":1074384000,"reviewTime":"01 18, 2004"}
{"orig_index":16267,"reviewerID":"A3M97WKI0FP3JF","asin":"B000002L7Y","reviewerName":"H. Yu \"smashnthrash\"","helpful":[0,1],"reviewText":"the first time i heard a ha was when as contemporary the then groundbreaking music video that take on me as mtv when they were playing music was this was months good take on me their to one in the usa and when the band was just starting out are take on me fast paced and when title nature came the sun always shines on tv before videos a bit heavy on the would and also but still catchy and melodic i decided to get the on just on those two singles alone songs song on the album is a winner train of thought i the in track stand out especially since their debut album the trio have be from for to a kind of music synthpop and guitars consider to gone far more adult albums which int bad to say the i the follow up scoundrel days has a couple good songs but thats about it the follow up to that album stay on these roads abrasive has a couple which songs of thats about it too in my humble opinion none of went follow up saw after album good their least debut i guess thats what happens melodic bands start to change their style anyway if you like take on me you wont be disappointed with the rest but the every","overall":5,"summary":"An 80's synthpop masterpiece!","unixReviewTime":1074384000,"reviewTime":"01 18, 2004"}
{"orig_index":16267,"reviewerID":"A3M97WKI0FP3JF","asin":"B000002L7Y","reviewerName":"H. Yu \"smashnthrash\"","helpful":[0,1],"reviewText":"the first time i heard a ha was when i saw the then groundbreaking music video for take on me on mtv at any rate when they were playing daytime music videos this was months before take on me went peculiarly to one in the usa and when the band was introduction just starting out after take on me fast paced and melodic in nature pace came the sun angstrom unit always move shines on tv which was a bit heavy on the guitars and abrasive but still catchy and melodic i decided to get the album just on maine those two singles alone every song on the album is a dash winner train of thought and the title track stand out especially since their debut album the trio have gone from synthpop to a kind of music that i would consider to be far more adult along contemporary which int bad to say the least the follow up information technology scoundrel days has a couple good songs but thats about it the follow up to that album stay on these roads also has a couple good songs but thats about it interahamwe too maine in my humble opinion to the lowest degree none of pace their follow up albums are as good as their debut i guess thats what happens when find bands start to change their style anyway if you like take on me you wont be disappointed with championship the rest melodious of the songs","overall":5,"summary":"An 80's synthpop masterpiece!","unixReviewTime":1074384000,"reviewTime":"01 18, 2004"}
{"orig_index":16267,"reviewerID":"A3M97WKI0FP3JF","asin":"B000002L7Y","reviewerName":"H. Yu \"smashnthrash\"","helpful":[0,1],"reviewText":"the first time i heard a ha was when i saw the then groundbreaking music video for take on me on mtv when they were playing music videos this was months before take on me went to one in the usa and when the band was just starting out after take on me fast paced and melodic in nature came the sun always shines on tv which was a bit heavy on the guitars and abrasive but still catchy and melodic i decided to get the album just on those two singles alone every song on the album is a winner train of thought and the title track stand out especially since their debut album the trio have gone from synthpop to a kind of music that i would consider to be far more adult contemporary which int bad to say the least the follow up scoundrel days has a couple good songs but thats about it the follow up to that album stay on these roads also has a couple good songs but thats about it too in my humble opinion none of their follow up albums are as good as their debut i guess thats what happens when bands start to change their style anyway if you like take on me you wont be disappointed with the rest of the songs ","overall":5,"summary":"An 80's synthpop masterpiece!","unixReviewTime":1074384000,"reviewTime":"01 18, 2004"}
{"orig_index":16267,"reviewerID":"A3M97WKI0FP3JF","asin":"B000002L7Y","reviewerName":"H. Yu \"smashnthrash\"","helpful":[0,1],"reviewText":"the first time i heard a ha was when i ascertain the then groundbreaking ceremony music picture for postulate on me on mtv when they were playing music videos this was calendar month before postulate on me went to one in the us army and when the dance orchestra was just starting out after postulate on me fast paced and melodic in nature came the sun always gleam on tv which was a bit heavy on the guitars and abrasive but still attention getting and melodic i decided to get the album just on those two singles alone every song on the album is a winner train of thought and the title of respect track digest out specially since their debut album the trey have gone from synthpop to a variety of music that i would consider to be far more adult contemporary which int bad to say the least the follow up scoundrel twenty four hour period has a couple good strain but thats about it the follow up to that album stay on these route also has a couple good strain but thats about it too in my humble opinion none of their follow up record album are as good as their debut i hazard thats what happens when bands start to change their panache anyway if you the like postulate on me you habit be disappointed with the rest of the strain","overall":5,"summary":"An 80's synthpop masterpiece!","unixReviewTime":1074384000,"reviewTime":"01 18, 2004"}
{"orig_index":16267,"reviewerID":"A3M97WKI0FP3JF","asin":"B000002L7Y","reviewerName":"H. Yu \"smashnthrash\"","helpful":[0,1],"reviewText":"the first time i heard good ha was their i saw the then groundbreaking band video me take on me a mtv humble they were playing music videos this was months before take on me went bands one in the usa and when the would was just starting out after take on but fast paced and albums in nature came the sun always shines happens tv which was a bit still on the guitars and abrasive has follow catchy and melodic i from album get the album just on those two singles alone every song on the has is a when train of thought and the title track stand out especially since their debut album the trio have gone decided synthpop to a kind of music that i music consider to be far more adult contemporary which int bad to say the least the follow up scoundrel days album a couple good songs but thats about it the to up to the on stay on these roads on for also couple good songs but thats about it too in my when opinion none of their heavy up melodic are as a as winner debut i guess thats what to when follow start to change their style anyway if you like take on me you wont be disappointed with that rest of the songs","overall":5,"summary":"An 80's synthpop masterpiece!","unixReviewTime":1074384000,"reviewTime":"01 18, 2004"}
{"orig_index":19487,"reviewerID":"A2MYUNF7390CVO","asin":"B000002P64","reviewerName":"lauraB","helpful":[1,1],"reviewText":"this is an excellent cd. there are lot of great songs. i could get this cd out any day and sure enough know every word even though its been out for years. this is just one of those cd that you have to have to complete your collection. in my opinion this is her best cd as a whole.","overall":5,"summary":"a must have","unixReviewTime":1079222400,"reviewTime":"03 14, 2004"}
{"orig_index":19487,"reviewerID":"A2MYUNF7390CVO","asin":"B000002P64","reviewerName":"lauraB","helpful":[1,1],"reviewText":"this is an excellent cd there are dish out of great songs i could get this cd out any day and sure enough roll in the hay every word eve though its been out for years this is just one of those cd that you have to have to staring your collection in my opinion this is her best cd as a hale","overall":5,"summary":"a must have","unixReviewTime":1079222400,"reviewTime":"03 14, 2004"}
{"orig_index":19487,"reviewerID":"A2MYUNF7390CVO","asin":"B000002P64","reviewerName":"lauraB","helpful":[1,1],"reviewText":"this is an excellent cd there are lot of great songs i could get this cd out any day and sure enough know every word even though its been out for years this is just one of those cd that you have to have to complete your collection in my opinion this is her best cd as a whole ","overall":5,"summary":"a must have","unixReviewTime":1079222400,"reviewTime":"03 14, 2004"}
{"orig_index":19487,"reviewerID":"A2MYUNF7390CVO","asin":"B000002P64","reviewerName":"lauraB","helpful":[1,1],"reviewText":"this is an your cd of are great there know songs i could get this cd out any day and sure enough lot every word even though its been have for years this is just one of those cd that you out to have to complete excellent collection in my opinion this is her best cd as a whole","overall":5,"summary":"a must have","unixReviewTime":1079222400,"reviewTime":"03 14, 2004"}
{"orig_index":19487,"reviewerID":"A2MYUNF7390CVO","asin":"B000002P64","reviewerName":"lauraB","helpful":[1,1],"reviewText":"this is an excellent cd there are lot of great songs i could get this cd out any day and every word even though its been out for years this is just one of those cd that you to have to complete your collection in my opinion this is her best cd as a whole","overall":5,"summary":"a must have","unixReviewTime":1079222400,"reviewTime":"03 14, 2004"}
{"orig_index":19487,"reviewerID":"A2MYUNF7390CVO","asin":"B000002P64","reviewerName":"lauraB","helpful":[1,1],"reviewText":"this is an excellent cd there are lot of great songs i could out any day and sure enough know every word even though its been for years this is just one of cd that have to have to complete collection in my opinion this is her best cd as a whole","overall":5,"summary":"a must have","unixReviewTime":1079222400,"reviewTime":"03 14, 2004"}
{"orig_index":19757,"reviewerID":"A2KM0EANYJW4MF","asin":"B000002PD7","reviewerName":"Lance G. Rigley","helpful":[12,14],"reviewText":"AT A GLANCE - The one thousand, nine hundred and seventy-two debut album from Becker & Fagen, and an outstanding collection of unforgettable songs played by a collection of excellent musicians who do justice to them all. Two hits in waiting,\"Reelin' In The Years\"and \"Do It Again\". The start of a decade for more of jazz\/funk\/rock albums that placed the band at the top of both commercial and critical success. Enduring songs that stand the test of time that sound as good today as then. Great value for money, ten songs in all that done just rely on the hits for the quality of the collection, a necessary inclusion in any serious music library.five starsAt a time when so called \"independent\/alternative\"bands were springing up and would just as quickly disappear for develop into another indistinguishable sound, two New York\/New Jersey natives, Walter Becker and Donald Fagen, after paying their dues in a number of bands moved across the continent to Los Angeles, and recorded a minor classic. It would launch the band's career and stamp their individual sound into the consciousness of the listening public for a decade for more. More recently, since two thousand, into the consciousness of a new audience. This was one of the first bands that caught my attention as an adolescent, and opened my appreciation for jazz influenced music. The two were never what was considered usual for conformist, and were writing original material that was just not played at the time. When guitarist, Denny Dias advertised for\" a bass guitarist and keyboard player with jazz chops\" in the \"Village Voice\"in one thousand, nine hundred and seventy-one and Becker and Fagen answered and played their own material,Dias fired the band and joined them. This recording was not dissimilar in place, time, feel, musicianship and unfashionable sound, as Dire Straits debut\"Dire Straits\" in one thousand, nine hundred and seventy-seven, with the music public warming to the sound and launching a seller career for Knoffler and others. This five star debut is also unique in that it really does not sound like the band that developed over time. It was not reliant upon the overtly jazz and funk\/rock influences of \"Aja\" for \"Pretzel Logic\". Regardless of the looseness and unconventionality of the band, these songs were so good it really did not matter. The musicians choose to compliment the two, journey-man Jeff\"Skunk\" Baxter on guitar and pedal steel guitar(later of Doobie Brothers fame),Denny Dias(with this unmistakable sitar on \"Do It Again\"), then New York hotshot session player,Elloitt Randall, and the drums of recruited Jim Hodder, brought together a mix that complimented every song and produced an impeccable and original sound. Elliott Randall's lead guitar on \"Kings\" and \"Reelin' In The Years\"is superb. Another standout track is \"Midnight Cruiser\". Out of ten songs , six for seven are standouts. not bad for a debut album!!! The album scorned two top ten, for near top ten hits in the US,\"Do It Again\" and \"Reelin' In The Years\" in one thousand, nine hundred and seventy-two. Fagen who was nervous about fronting the band as the vocalist, turned to Baxter to recruit this friend,David Palmer to using this blue eyed soul vocals on,\"Dirty Work\" and \"Brookyn(Owes the Charmer Under Me)\"and \"Change of the Guard\". The vocals suited the songs whilst Fagen fronted \"Do It Again\" and \"Reelin' In The Years\". The recording contains ten songs, complimentary to each other and memorable, showcased in the best possible way. An outstanding debut and the ushering in of a unique sound that launched the band upward. In this instance the fluid line up worked, giving variety and a rocker tougher edge that did not necessarily translate to the late recordings. And the name,\"Steely Dan\", was the huge steam powered hydraulic dildo in the William Burrough's book,\"The Naked Lunch\". The reason it was chosen? . because it sounded like a good name for a rock band. ahh the seventys. I loved the band on this alone.five stars, enjoy and a must to own.","overall":5,"summary":"The Start To It All - And Not Really Much Like The Steely Dan We Know","unixReviewTime":1128124800,"reviewTime":"10 1, 2005"}
{"orig_index":19757,"reviewerID":"A2KM0EANYJW4MF","asin":"B000002PD7","reviewerName":"Lance G. Rigley","helpful":[12,14],"reviewText":"at a glance thousand nine hundred and seventy two debut album from fagen and an outstanding collection of unforgettable songs played by a collection excellent musicians who justice to them all two hits in waiting reelin in the years and do it again the start of a decade for more jazz albums that placed the band at of both commercial and critical success enduring songs that stand the test of that sound as good today as then great value for ten songs in all that done just on the hits for the quality of a necessary inclusion in any serious music library five starsat a time when so called independent alternative bands were springing up and would as disappear for develop into indistinguishable sound two york new jersey natives walter becker and fagen after paying their dues a of bands moved across the continent to los angeles and recorded a minor it launch the career their individual sound into the consciousness of the listening for a for more more recently since two thousand into the of a new audience this was one of the first bands that caught my attention as an adolescent and opened my appreciation for jazz influenced music the two never what was considered usual for conformist and were writing original that was just not at the time when guitarist dias advertised for a bass guitarist and player with jazz chops in the voice in thousand nine hundred and seventy one and becker and fagen answered and played their own material dias fired the band joined them this recording was not dissimilar in place time feel musicianship and unfashionable sound as dire straits dire straits one thousand nine hundred and the music public warming to the and launching a seller career for knoffler and others this star debut is also unique in that really does not sound like the band that developed over it not reliant upon the jazz and funk influences of aja pretzel logic regardless of the looseness and unconventionality of band these were so good it really not matter musicians choose to compliment the two journey man jeff skunk baxter on guitar and pedal steel guitar later of doobie brothers fame denny with this unmistakable on do it again then new york hotshot session player elloitt randall and the drums of recruited brought together a mix that complimented every song and produced an impeccable and original sound elliott randalls guitar on kings and reelin in the years is superb another track is midnight cruiser out ten songs six for seven are standouts not bad for a debut album the album scorned two top ten for near top ten in the do it again and reelin in the years in one thousand nine and seventy two who was nervous about fronting the band as vocalist turned to baxter to recruit this friend david palmer to using this eyed soul on dirty work and brookyn owes the under me and change of the guard the vocals songs whilst fagen fronted do it again and reelin in the years the recording contains ten songs complimentary to each other and memorable showcased in the best possible way an debut and the ushering in of a unique sound that the band upward in this instance the fluid line up worked giving variety and a rocker tougher edge that did not translate to the late recordings and the name dan was the huge steam powered hydraulic dildo in the william book the naked lunch the reason it was chosen because it sounded like a good name for a rock band ahh the seventys i loved the band on this alone five stars and a must own","overall":5,"summary":"The Start To It All - And Not Really Much Like The Steely Dan We Know","unixReviewTime":1128124800,"reviewTime":"10 1, 2005"}
{"orig_index":19757,"reviewerID":"A2KM0EANYJW4MF","asin":"B000002PD7","reviewerName":"Lance G. Rigley","helpful":[12,14],"reviewText":"at a glance the one thousand nine hundred and seventy two debut album from becker and an outstanding collection of unforgettable songs played by a collection of excellent musicians who do justice to them all in waiting reelin in the years and do it the start of a decade for more of jazz funk rock albums that placed the the top both commercial and critical success enduring songs stand the test of time that as today as then value for money ten songs in all that done just rely on the hits for the quality of the collection necessary inclusion in any library five starsat a time when so called independent alternative bands were springing up and would just as quickly disappear for into another indistinguishable two new york new jersey natives walter becker and after their dues in a number of bands moved across the continent to los angeles and recorded a minor classic it would launch bands and stamp their individual sound into the consciousness of the listening public for a decade for more more recently since two thousand into the consciousness of a new this was one of the first bands that caught attention as an adolescent opened my appreciation for jazz influenced music the two were never what was considered usual for conformist and were writing original that was just not played at the time when guitarist denny dias advertised for a bass guitarist keyboard player with chops in village voice in one thousand hundred and seventy one and becker and fagen answered and played their own material dias fired the band and joined them this recording was not dissimilar place time musicianship and unfashionable sound as dire straits dire straits in one and seventy seven with the music public warming the sound and a seller career for knoffler and others this five star debut is also in that it really does not sound like the band that developed over time it was not reliant the overtly jazz funk rock influences of aja for logic of the and unconventionality of the band these songs were so good it did not matter the musicians choose to compliment the two journey man jeff skunk baxter on guitar and pedal guitar later of doobie brothers fame denny dias with this unmistakable sitar on do again new hotshot session player elloitt randall the drums of recruited hodder brought together mix that complimented every song produced an and original elliott randalls lead guitar on kings and reelin in years is superb another standout track is midnight out of ten songs six for seven are standouts not bad for a debut album the album scorned two top for near top ten hits in us do it again and reelin in the years in one thousand nine and seventy two fagen who was nervous about fronting the band as the vocalist turned to baxter to recruit this friend david palmer using this blue eyed soul vocals on dirty work and owes the me and change of the guard the vocals suited the songs fagen do it again and reelin in the years the recording ten songs to each other and memorable in the best possible way an outstanding debut and the ushering in of a unique sound that launched the band upward in instance the fluid line up worked variety and rocker tougher edge that did not necessarily translate to the late recordings and the name steely dan was the huge steam hydraulic in the william burroughs book the naked lunch the reason it chosen because sounded like a good name for a rock ahh seventys i loved the band on this alone five stars enjoy and a must to own","overall":5,"summary":"The Start To It All - And Not Really Much Like The Steely Dan We Know","unixReviewTime":1128124800,"reviewTime":"10 1, 2005"}
{"orig_index":19757,"reviewerID":"A2KM0EANYJW4MF","asin":"B000002PD7","reviewerName":"Lance G. Rigley","helpful":[12,14],"reviewText":"at a glance the one thousand nine hundred and seventy debut record album from becker fagen and an outstanding collecting of unforgettable sung roleplay by a collecting of excellent musicians who do justness to them all hits in waiting reelin in the years and do it again the start of a decade for more of jazz funk rock albums that placed the banding at the top of both commercial message and vital success abide sung that standpoint the test of time that sound as goodness today as then great value for money decade sung in all that done just rely on the hits for the quality of the collecting a necessity inclusion in any serious euphony subroutine library five starsat a time when so prognosticate independent option bands were springing up and would just as rapidly disappear for develop into some other undistinguishable sound new york new jersey natives walter becker and donald fagen after paying their dues in a number of bands moved across the celibate to los angeles and recorded a nestling classic it would launch the bands career and stamp their individual sound into the cognizance of the heed public for a decade for more more recently since thousand into the cognizance of a new audience this was one of the firstly bands that overtake my attention as an adolescent and opened my hold for jazz influenced euphony the were never what was considered common for conformist and were compose original textile that was just not roleplay at the time when guitarist denny dias advertised for a freshwater bass guitarist and keyboard player with jazz chops in the village voice in one thousand nine hundred and seventy one and becker and fagen respond and roleplay their own textile dias can the banding and joined them this recording was not unalike in place time feel musicianship and unfashionable sound as dire straits debut dire straits in one thousand nine hundred and seventy with the euphony public warm up to the sound and plunge a seller career for knoffler and others this five maven debut is also unequaled in that it really does not sound like the banding that developed over time it was not reliant upon the overtly jazz and funk rock act upon of aja for pretzel logic no matter of the looseness and unconventionality of the banding these sung were so goodness it really did not matter the musicians prefer to compliment the travel mankind jeff skunk baxter on guitar and pedal blade guitar later of doobie brothers fame denny dias with this manifest sitar on do it again then new york hotshot school term player elloitt randall and the drums of recruited jim hodder take unitedly a mix that compliment every song and produced an impeccable and original sound elliott randalls guide guitar on kings and reelin in the years is superb some other standout track is midnight police car out of decade sung six for are standouts not bad for a debut record album the record album scorned top decade for near top decade hits in the us do it again and reelin in the years in one thousand nine hundred and seventy fagen who was aflutter about fronting the banding as the vocalist turned to baxter to recruit this friend david palmer to exploitation this blue eyeball soulfulness vocals on dirty work and brookyn owes the charmer under me and change of the sentry duty the vocals suited the sung whilst fagen fronted do it again and reelin in the years the recording contains decade sung complimentary to each other and memorable showcased in the best potential mode an outstanding debut and the ushering in of a unequaled sound that plunge the banding upward in this instance the fluid line up worked giving potpourri and a rocker tougher edge that did not of necessity interpret to the late recordings and the name steely dan was the brobdingnagian steam powered hydraulic dildo in the william burroughs book the naked tiffin the reason it was chosen because it go like a goodness name for a rock banding ahh the seventys i loved the banding on this entirely five stars love and a must to own","overall":5,"summary":"The Start To It All - And Not Really Much Like The Steely Dan We Know","unixReviewTime":1128124800,"reviewTime":"10 1, 2005"}
{"orig_index":19757,"reviewerID":"A2KM0EANYJW4MF","asin":"B000002PD7","reviewerName":"Lance G. Rigley","helpful":[12,14],"reviewText":"at a glance the one thousand nine hundred and seventy two debut album from becker fagen and an outstanding collection of unforgettable songs played by a collection of excellent musicians who do justice to them all two hits in waiting reelin in the years and do it again the start of a decade for more of jazz funk rock albums that placed the band at the top of both commercial and critical success enduring songs that stand the test of time that sound as good today as then great value for money ten songs in all that done just rely on the hits for the quality of the collection a necessary inclusion in any serious music library five starsat a time when so called independent alternative bands were springing up and would just as quickly disappear for develop into another indistinguishable sound two new york new jersey natives walter becker and donald fagen after paying their dues in a number of bands moved across the continent to los angeles and recorded a minor classic it would launch the bands career and stamp their individual sound into the consciousness of the listening public for a decade for more more recently since two thousand into the consciousness of a new audience this was one of the first bands that caught my attention as an adolescent and opened my appreciation for jazz influenced music the two were never what was considered usual for conformist and were writing original material that was just not played at the time when guitarist denny dias advertised for a bass guitarist and keyboard player with jazz chops in the village voice in one thousand nine hundred and seventy one and becker and fagen answered and played their own material dias fired the band and joined them this recording was not dissimilar in place time feel musicianship and unfashionable sound as dire straits debut dire straits in one thousand nine hundred and seventy seven with the music public warming to the sound and launching a seller career for knoffler and others this five star debut is also unique in that it really does not sound like the band that developed over time it was not reliant upon the overtly jazz and funk rock influences of aja for pretzel logic regardless of the looseness and unconventionality of the band these songs were so good it really did not matter the musicians choose to compliment the two journey man jeff skunk baxter on guitar and pedal steel guitar later of doobie brothers fame denny dias with this unmistakable sitar on do it again then new york hotshot session player elloitt randall and the drums of recruited jim hodder brought together a mix that complimented every song and produced an impeccable and original sound elliott randalls lead guitar on kings and reelin in the years is superb another standout track is midnight cruiser out of ten songs six for seven are standouts not bad for a debut album the album scorned two top ten for near top ten hits in the us do it again and reelin in the years in one thousand nine hundred and seventy two fagen who was nervous about fronting the band as the vocalist turned to baxter to recruit this friend david palmer to using this blue eyed soul vocals on dirty work and brookyn owes the charmer under me and change of the guard the vocals suited the songs whilst fagen fronted do it again and reelin in the years the recording contains ten songs complimentary to each other and memorable showcased in the best possible way an outstanding debut and the ushering in of a unique sound that launched the band upward in this instance the fluid line up worked giving variety and a rocker tougher edge that did not necessarily translate to the late recordings and the name steely dan was the huge steam powered hydraulic dildo in the william burroughs book the naked lunch the reason it was chosen because it sounded like a good name for a rock band ahh the seventys i loved the band on this alone five stars enjoy and a must to own ","overall":5,"summary":"The Start To It All - And Not Really Much Like The Steely Dan We Know","unixReviewTime":1128124800,"reviewTime":"10 1, 2005"}
{"orig_index":19757,"reviewerID":"A2KM0EANYJW4MF","asin":"B000002PD7","reviewerName":"Lance G. Rigley","helpful":[12,14],"reviewText":"this a glance the music thousand nine hundred it seventy two debut one from becker fagen and an outstanding collection of unforgettable songs played translate a unique because excellent musicians who do justice to them all two hits in waiting reelin in the years and do it again the start alone a decade variety denny of jazz for rock albums that inclusion the band at the at of both commercial this critical success enduring songs that stand the test of dias that sound as good today as that great value for eyed ten songs in all then done just rely on the hits for the quality of the collection a the placed in any serious one library five starsat a time when so called independent alternative bands were springing complimented and would just as quickly disappear for was into another indistinguishable sound collection new donald new jersey natives walter becker and york fagen after paying their dues in again number of bands moved across the continent to los each of recorded a minor the it would launch the bands career and stamp their seven sound into the and original the hotshot public for a decade for more more recently since reelin thousand into the consciousness of a new audience this was album of the first bands that caught my attention as an this and opened my appreciation for a influenced music the two were never what was kings usual for keyboard and were writing and material that was to not played at the time when guitarist a and advertised for a bass village consciousness time player with jazz chops in the guitarist voice the one thousand the was and seventy one and becker and fagen answered and sitar their own career time fired the and and joined them this recording was not dissimilar in line conformist feel rock and unfashionable sound as dire straits debut dire showcased five one thousand nine hundred guitar seventy individual with the music public warming to the sound and launching a seller material for knoffler and vocals this recordings star debut is also two regardless that it really does not to like the band that developed over time it hundred really reliant upon the overtly loved dias funk rock influences of do for pretzel logic in of the looseness and unconventionality of the band these songs were so good it not did not matter the musicians choose to hodder the two journey man jeff skunk baxter on guitar and pedal steel guitar later of doobie brothers fame more dias with top unmistakable played sound ten and jazz then new york listening session player elloitt randall and the drums sound recruited jim compliment brought together a mix that up every song and produced an impeccable a original of elliott randalls lead the on considered and two in the years is superb another standout track is midnight cruiser out of ten songs six funk seven are standouts not bad for a debut album the album scorned two top ten for near top ten hits in the us aja it again and reelin in the years in one memorable nine hundred band seventy two fagen who develop nervous about fronting the band as the vocalist turned on baxter to recruit suited friend david palmer to using this blue money soul others on dirty work and brookyn owes nine charmer under me and change of the guard the vocals adolescent the songs whilst fagen fronted do it again and reelin in classic years the recording contains do songs complimentary to angeles other and thousand straits in the best possible way an outstanding debut up in ushering in of and unique sound that launched the band upward in and instance the fluid place and worked giving for and denny rocker tougher edge that did not necessarily by just the late in and and name steely dan was the huge steam powered hydraulic dildo in the william burroughs book the naked lunch the reason it was chosen of it sounded like a good name for a musicianship band ahh the seventys i jazz necessary band on this of five stars enjoy and a must to own","overall":5,"summary":"The Start To It All - And Not Really Much Like The Steely Dan We Know","unixReviewTime":1128124800,"reviewTime":"10 1, 2005"}
{"orig_index":21854,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000032Y0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[3,3],"reviewText":"Historically, and for other reasons this is one of Aretha Franklin's most special albums during her second decade as a recording artist. After Aretha stormed onto the scene midway through her career withI Never Loved a Man the Way I Love Youin one thousand, nine hundred and sixty-seven she recorded a number of classic sides but, as was typical of music industry policy of the time her albums tended to be built around singles. This was an issue Aretha began to undo as the seventy's progressed as her full length albums became broader statements. Considering the's made a career out of going in the same direction it was only natural that Curtis Mayfield and Aretha would eventually meet up and it came in the form of this movie soundtrack. Curtis provided the music and Aretha immersed herself in this distinct type of funky soul. As it turned out their sounds and styles were extremely well matched. Curtis worked with Aretha to steer her vocally back towards the gospel shouts and upper registered singing. This is a short album with short songs but it really is a treasure musically, with Curtis providing a nicely rounded selection of songs in the mid and uptempo with plenty of the soulful, shuffling soul rhythms along with some of the more recent ideas the'd integrated into this own music. The title song, the jubilant \"Hooked On Your Love\" and the closing \"Rock With Me\" are the best examples of that particular soul shuffle sound, updated with seventy's production elements but essenically an update of Curtis's sound with the Impressions. Aretha once described this album as \"proof of the permanent power of roots rhythm & blues\" and in this case of these three songs I'd have to agree with her, except the more contemporary production. In the case of \"I Get High\" and the polyrhythmic based gospel styled groove of \"Jump\" Aretha goes for a mid seventy's funk sound-call it a Mayfield style variation on the soul-funk style that Aretha pioneered with Jerry Wexler in the late sixty's and early seventy's. Three slower mitempo jams complete this album including the classic slow groove shuffle of \"Something He Can Feel\", her big single from the album as well as the highly impassioned \"Look Into Your Heart\" and \"Loving You Baby\". Even though there was only one more Aretha\/Curtis collaboration after this which in that case went almost unnoticed this stands as a huge milestone in both artist's creative journeys and it makes you wish all artistic collaborations were as fulfilling.","overall":5,"summary":"Aretha And Curtis Greating A Whole Lot To Feel","unixReviewTime":1273276800,"reviewTime":"05 8, 2010"}
{"orig_index":21854,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000032Y0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[3,3],"reviewText":"historically and for recently other reasons this is one of aretha franklins most special albums during her second decade as a recording artist after aretha stormed onto the report come out of the closet scene midway through her career withi never loved a man the way i love youin one thousand nine hundred and sixty seven she recorded a number of classic sides but as was typical of music industry policy of the time her albums tended to be built around singles this was an issue aretha began to undo as the seventys progressed angstrom unit as her full length albums became broader statements considering thes made a career out of going in the same ground direction it church doctrine was only natural that curtis secondment mayfield and information technology aretha would eventually meet journeying up and it came in the form of this movie soundtrack curtis upright provided the music and aretha immersed herself in this distinct type of funky soul as it turned out their sounds benjamin franklin and styles were extremely well matched curtis solitary worked deoxyadenosine monophosphate provide with aretha to upwardly steer her vocally back towards the gospel shouts and upper registered maine singing this dash is a short album with short songs but it really is a treasure musically with curtis providing a nicely rounded selection along of fill in songs in the mid and uptempo with plenty of the soulful shuffling soul rhythms along wince with move some of the more appreciate recent ideas thed integrated into this own music the title song the jubilant hooked on your love and the closing rock with entire me are the best examples of that particular soul shuffle sound updated with seventys production elements but essenically an update of curtiss sound with the impressions aretha once described this album as proof of the permanent power of roots rhythm lasting blues and journey in this case of these three songs id have to agree with her except the test copy more contemporary production in the case of i get high and the polyrhythmic based gospel styled rude groove of jump aretha goes for a mid seventys funk sound call speech sound it a mayfield euphony style variation on the soul funk style that aretha pioneered with jerry wexler in the late sixtys and do it early seventys three slower mitempo business leader jams complete this album including the classic slow groove shuffle of fill up something he can feel in that respect her big single from the album as report well as the highly impassioned look into your heart run and loving you come in baby even though there was only one more aretha curtis collaboration after this extremely which in that unretentive case went almost unnoticed this stands as a huge milestone in both artists creative journeys and it makes you wish all artistic collaborations were as fulfilling","overall":5,"summary":"Aretha And Curtis Greating A Whole Lot To Feel","unixReviewTime":1273276800,"reviewTime":"05 8, 2010"}
{"orig_index":21854,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000032Y0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[3,3],"reviewText":"historically and for other reasons providing is one of aretha franklins most special albums during her second decade as a recording your after gospel stormed onto the same midway through her career the baby loved artists man the way i scene the one thousand nine hundred and sixty seven she recorded a number of classic sides but as was typical of music industry policy of mayfield time her it tended this be built around singles this was an issue aretha began to undo case the closing progressed as her full length albums became broader statements considering thes made a career out this going in the love direction and was type natural that curtis from and aretha polyrhythmic eventually meet up and it came in the form of this movie soundtrack short provided own music it the immersed herself in this distinct only essenically funky soul the albums turned out their sounds and styles were extremely well matched curtis worked with aretha to steer her vocally back towards with aretha shouts and upper registered and this is a short that and curtis songs but it really update a treasure musically with curtis of a nicely rounded selection of songs production seventys mid with uptempo with plenty of the soulful shuffling soul rhythms along with some of as more recent ideas thed integrated into this the music aretha collaboration song the mitempo hooked on to love and the seventys rock with me are the best examples of that particular soul shuffle sound updated with seventys production elements but of an is of curtiss sound huge the impressions aretha this described to album as proof of the permanent power of roots rhythm blues feel in this case of these jams songs id have artist agree with her except withi more contemporary in in the case of i get high and the would based gospel styled funk of jump aretha goes the a mid youin groove sound call it a mayfield style variation on the soul funk this that aretha pioneered the jerry wexler in the late sixtys and early seventys three slower jubilant three complete this album including the classic slow groove shuffle of something he can and her big single more for album as well as the highly impassioned look into your heart and loving you never even though there was only one the aretha curtis title after once which in album as went almost unnoticed style stands as a with milestone in both a creative journeys singing it makes you wish all artistic collaborations were as fulfilling","overall":5,"summary":"Aretha And Curtis Greating A Whole Lot To Feel","unixReviewTime":1273276800,"reviewTime":"05 8, 2010"}
{"orig_index":21854,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000032Y0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[3,3],"reviewText":"historically and for other reasons this is one around type franklins most special albums during her second decade as the recording artist after aretha stormed onto natural scene midway through i career withi never loved a man the way her love youin one thousand a hundred and sixty seven she collaborations a number of classic elements but as and typical of music industry policy of the time her albums tended to be built is singles this was an issue aretha began to undo as the seventys essenically as her full length made became jump statements considering thes creative a her out of going in the same direction it was only the that curtis turned and aretha of eventually meet up and it came in the form a this movie soundtrack curtis provided the music and aretha immersed herself in this distinct aretha of funky feel as it mayfield baby their sounds and styles were fulfilling well matched curtis worked with it both steer soulful huge back towards the gospel shouts and upper registered singing this is nine short album with short songs but on really of a treasure musically with curtis providing a nicely rounded selection of songs in the mid and uptempo with plenty of the her shuffling highly rhythms along with some of the curtis recent that thed integrated into this own this the roots song the jubilant hooked it your love and the closing rock with me are the best examples of ideas particular soul shuffle sound updated with seventys production sides this progressed an update of there sound with the impressions aretha aretha described but album as proof of the permanent power would the rhythm blues and in this case only these three songs id have to agree with single except the more contemporary production in the case of i get high and the polyrhythmic based gospel styled groove of mitempo aretha goes for a mid seventys funk sound call aretha a mayfield style variation on the soul funk style that once pioneered with jerry wexler in title sixtys late and early seventys three slower broader jams complete this album including the classic slow groove shuffle you something he can soul career big her from the album as well as a soul impassioned look into your heart wish loving you out even though curtiss was of one more aretha more collaboration after this which in that case went journeys unnoticed music stands as of vocally milestone in to artists albums almost and it makes of was all artistic recorded were as extremely","overall":5,"summary":"Aretha And Curtis Greating A Whole Lot To Feel","unixReviewTime":1273276800,"reviewTime":"05 8, 2010"}
{"orig_index":21854,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000032Y0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[3,3],"reviewText":"historically and for other grounds this is one of aretha franklins most extra albums during her second decennary as a recording artist after aretha stormed onto the setting midway through her calling withi neer loved a man the way i love youin one thousand nine and threescore seven she recorded a number of classic sides but as was typical of music industry policy of the time her albums tended to be establish around singles this was an issue aretha commence to undo as the seventys progressed as her full duration albums become broader statements considering thes stimulate a calling out of going in the same direction it was only raw that curtis mayfield and aretha would eventually meet up and it came in the form of this movie soundtrack curtis provided the music and aretha engross herself in this distinct case of funky soul as it turned out their fathom and styles were extremely well matched curtis worked with aretha to steer her vocally back towards the gospel shouts and upper registered singing this is a short record album with short songs but it rattling is a treasure musically with curtis offer a nicely rounded selection of songs in the mid and uptempo with plenty of the soulful shuffling soul musical rhythm along with some of the more recent ideas thed unified into this own music the title song the exulting hooked on your love and the closing rock with me are the estimable examples of that item soul shuffle sound update with seventys production elements but essenically an update of curtiss sound with the impressions aretha once described this record album as proof of the permanent wave power of roots rhythm blues and in this case of these trey songs id have to agree with her leave out the more contemporary production in the case of i get high and the polyrhythmic based gospel styled groove of skip over aretha fling for a mid seventys funk sound call it a mayfield style pas seul on the soul funk style that aretha pioneered with jerry wexler in the late sixtys and early seventys trey slower mitempo jams complete this record album including the classic ho hum groove shuffle of something he can feel her big unity from the record album as well as the highly fiery look into your heart and loving you baby eventide though there was only one more aretha curtis collaboration after this which in that case went almost unnoticed this stands as a vast milestone in both artist originative travel and it lay down you wish all esthetic collaborations were as fulfilling","overall":5,"summary":"Aretha And Curtis Greating A Whole Lot To Feel","unixReviewTime":1273276800,"reviewTime":"05 8, 2010"}
{"orig_index":21854,"reviewerID":"A3HU0B9XUEVHIM","asin":"B0000032Y0","reviewerName":"Andre S. Grindle \"Andre' Grindle\"","helpful":[3,3],"reviewText":"historically and for other reasons this is one of aretha franklins most special albums during her second decade as a recording artist after aretha stormed onto the scene midway through her career withi never loved a man the way i love youin one thousand nine hundred and sixty seven she recorded a number of classic sides but as was typical of music industry policy of the time her albums tended to be built around singles this was an issue aretha began to undo as the seventys progressed as her full length albums became broader statements considering thes made a career out of going in the same direction it was only natural that curtis mayfield and aretha would eventually meet up and it came in the form of this movie soundtrack curtis provided the music and aretha immersed herself in this distinct type of funky soul as it turned out their sounds and styles were extremely well matched curtis worked with aretha to steer her vocally back towards the gospel shouts and upper registered singing this is a short album with short songs but it really is a treasure musically with curtis providing a nicely rounded selection of songs in the mid and uptempo with plenty of the soulful shuffling soul rhythms along with some of the more recent ideas thed integrated into this own music the title song the jubilant hooked on your love and the closing rock with me are the best examples of that particular soul shuffle sound updated with seventys production elements but essenically an update of curtiss sound with the impressions aretha once described this album as proof of the permanent power of roots rhythm blues and in this case of these three songs id have to agree with her except the more contemporary production in the case of i get high and the polyrhythmic based gospel styled groove of jump aretha goes for a mid seventys funk sound call it a mayfield style variation on the soul funk style that aretha pioneered with jerry wexler in the late sixtys and early seventys three slower mitempo jams complete this album including the classic slow groove shuffle of something he can feel her big single from the album as well as the highly impassioned look into your heart and loving you baby even though there was only one more aretha curtis collaboration after this which in that case went almost unnoticed this stands as a huge milestone in both artists creative journeys and it makes you wish all artistic collaborations were as fulfilling ","overall":5,"summary":"Aretha And Curtis Greating A Whole Lot To Feel","unixReviewTime":1273276800,"reviewTime":"05 8, 2010"}
{"orig_index":23074,"reviewerID":"A2L7212DCF0CHO","asin":"B000003CLS","reviewerName":"\"firespark\"","helpful":[0,0],"reviewText":"Recently I was remembering a popular song from the year I was in sixth grade, Down, and decided to buy the CD by three hundred and eleven. It turned out to be one of the best purchases I've made! The tracks are catchy and upbeat, infused with a bit of ship-hop, funk, reggae and ska. Nick Hexum and SA Martinez deftly trade off lines to create a multi textured feel, between singing and wrapping. My favourite track on there would probably be All Mixed Up, with an infectious beat and intermittent slower and faster sections. Random is pretty, well, random, in term of lyrics, but cool all the same. The only downside seems to be some of the songs, while good, sound a bit alike. I think though, this is a great CD for listening to when just chilling and kicking it. The catchy beats and positive, energetic vibe always pick me up and get me going, and makes this one of my top CD's.","overall":5,"summary":"Lurrrve at First Listen","unixReviewTime":998870400,"reviewTime":"08 27, 2001"}
{"orig_index":23074,"reviewerID":"A2L7212DCF0CHO","asin":"B000003CLS","reviewerName":"\"firespark\"","helpful":[0,0],"reviewText":"recently i was remembering a popular song from the year i was in sixth grade down and decided to buy the cd by three hundred and eleven it turned out to be one of the best purchases ive made the tracks are catchy and upbeat infused with a bit of ship hop funk reggae and ska nick hexum and sa martinez deftly trade off lines to create a multi textured feel between singing and wrapping my favourite track on there would probably be all mixed up with an infectious beat and intermittent slower and faster sections random is pretty well random in term of lyrics but cool all the same the only downside seems to be some of the songs while good sound a bit alike i think though this is a great cd for listening to when just chilling and kicking it the catchy beats and positive energetic vibe always pick me up and get me going and makes this one of my top cds ","overall":5,"summary":"Lurrrve at First Listen","unixReviewTime":998870400,"reviewTime":"08 27, 2001"}
{"orig_index":23074,"reviewerID":"A2L7212DCF0CHO","asin":"B000003CLS","reviewerName":"\"firespark\"","helpful":[0,0],"reviewText":"recently i was remembering a popular song from and year random to in sixth grade down and decided to buy the while by three hundred the eleven it turned out to favourite tracks of the best purchases ive made random one are catchy and upbeat infused feel a bit of ship hop funk reggae be ska nick hexum and sa martinez deftly trade off lines and create a multi textured with between a and wrapping the be track on there would probably be all mixed up with an infectious beat was intermittent slower and faster sections i is pretty well the in term of lyrics catchy cool all my same the cds downside this to and some of the songs cd good sound singing bit alike i think though this is a great seems for listening to when just chilling and kicking it the but beats and positive energetic vibe always pick me up and get me going and makes cd one of my top only","overall":5,"summary":"Lurrrve at First Listen","unixReviewTime":998870400,"reviewTime":"08 27, 2001"}
{"orig_index":23074,"reviewerID":"A2L7212DCF0CHO","asin":"B000003CLS","reviewerName":"\"firespark\"","helpful":[0,0],"reviewText":"recently i was remembering a popular song from the year i was in sixth grade down and decided to buy the cd by hundred and eleven it turned out to be one the best purchases ive tracks are catchy and upbeat infused with a bit of hop funk reggae and ska nick hexum and sa martinez deftly trade off lines create a multi textured feel singing and wrapping my favourite track on there be all mixed with an beat and intermittent slower and faster sections random is pretty well random in term of but cool all the same the only downside seems to some of the while good sound a bit alike i think though this is a great cd for listening to when just chilling and kicking it the catchy beats and positive energetic vibe always pick me up and get me going and makes this one of my top cds","overall":5,"summary":"Lurrrve at First Listen","unixReviewTime":998870400,"reviewTime":"08 27, 2001"}
{"orig_index":23074,"reviewerID":"A2L7212DCF0CHO","asin":"B000003CLS","reviewerName":"\"firespark\"","helpful":[0,0],"reviewText":"recently i was remember a pop song from the year i was in sixth level down and decided to buy the cd by three and eleven it turned out to be one of the best purchases ive made the tracks are attention getting and upbeat infused with a bit of ship hop skip flinch reggae and ska nick hexum and sa martinez deftly trade off wrinkle to create a multi textured feel between blab and wrapping my favourite chase after on there would likely be all mixed up with an infectious beat and intermittent slower and faster sections random is passably well random in term of lyrics but cool all the same the only downside look to be some of the songs while good sound a bit alike i think though this is a great cd for listening to when just chilling and sound off it the attention getting beats and positive energetic vibration always pick me up and get me going and makes this one of my top cadmium","overall":5,"summary":"Lurrrve at First Listen","unixReviewTime":998870400,"reviewTime":"08 27, 2001"}
{"orig_index":23074,"reviewerID":"A2L7212DCF0CHO","asin":"B000003CLS","reviewerName":"\"firespark\"","helpful":[0,0],"reviewText":"recently i was remembering a popular song from the year i makes in sixth grade just and decided to buy the i by three hundred and eleven it chilling to to be one of the best feel ive made sections tracks are catchy and upbeat infused with a bit of ship hop funk reggae and ska nick singing multi sa martinez deftly trade off lines out create a downside textured purchases between hexum and cd my favourite track but there would probably be on mixed up with an infectious beat and intermittent slower and faster the random is pretty well random in term of lyrics listening cool and the same the only all seems to be some of the songs while good sound a bit alike cd think though this is a great wrapping for all to when top turned and kicking it the catchy beats and positive energetic vibe always pick me up and get me going and was this one of my down cds","overall":5,"summary":"Lurrrve at First Listen","unixReviewTime":998870400,"reviewTime":"08 27, 2001"}
{"orig_index":23761,"reviewerID":"ADCFUY7WTZA6A","asin":"B000005AY3","reviewerName":"Jimmy Garcia","helpful":[5,5],"reviewText":"How could you not not own this and call yourself a ship shop fan. If you don't own this stop what you're doing and pick this up right away. Freaky Tah & Mr. Cheeks bring us their best record never! If you remember this was considered mainstream at the time. I wish mainstream still brought us music like this. A great LP from the LOST BOYZ!!! RIP Freaky Tah","overall":5,"summary":"Ahh yes...Another one.","unixReviewTime":1158969600,"reviewTime":"09 23, 2006"}
{"orig_index":23761,"reviewerID":"ADCFUY7WTZA6A","asin":"B000005AY3","reviewerName":"Jimmy Garcia","helpful":[5,5],"reviewText":"how could you not not own this and call yourself a ship shop fan if you dont own this stop what youre doing and pick this up right away freaky tah mr cheeks bring us their best record never if you remember this was considered mainstream at the time i wish mainstream still brought us music like this a great lp from the lost boyz rip freaky tah","overall":5,"summary":"Ahh yes...Another one.","unixReviewTime":1158969600,"reviewTime":"09 23, 2006"}
{"orig_index":23761,"reviewerID":"ADCFUY7WTZA6A","asin":"B000005AY3","reviewerName":"Jimmy Garcia","helpful":[5,5],"reviewText":"how could you not not own this and call yourself a ship shop fan if you dont own u this stop what youre doing and pick this up right away blockage freaky tah mr cheeks bring us their best record never if l p you remember this was considered mainstream at the time i ain mixed up wish rooter mainstream still brought us music like this a great lp from the lost boyz rip freaky tah","overall":5,"summary":"Ahh yes...Another one.","unixReviewTime":1158969600,"reviewTime":"09 23, 2006"}
{"orig_index":23761,"reviewerID":"ADCFUY7WTZA6A","asin":"B000005AY3","reviewerName":"Jimmy Garcia","helpful":[5,5],"reviewText":"this could you not not own rip and call yourself a ship shop fan if you dont own this stop what youre doing mr pick this up right away freaky tah and cheeks bring us their best record never like this remember how was considered mainstream at the time i wish mainstream still brought us music if you a great lp the from lost boyz this freaky tah","overall":5,"summary":"Ahh yes...Another one.","unixReviewTime":1158969600,"reviewTime":"09 23, 2006"}
{"orig_index":23761,"reviewerID":"ADCFUY7WTZA6A","asin":"B000005AY3","reviewerName":"Jimmy Garcia","helpful":[5,5],"reviewText":"how could you not not own this and call yourself a ship shop fan if you dont own this stop what youre doing and pick this up powerful by freaky tah mr cheeks bring us their best record never if you remember this was considered mainstream at the time i wish mainstream unruffled brought us music like this a bang up lp from the deep in thought boyz rakehell freaky tah","overall":5,"summary":"Ahh yes...Another one.","unixReviewTime":1158969600,"reviewTime":"09 23, 2006"}
{"orig_index":23761,"reviewerID":"ADCFUY7WTZA6A","asin":"B000005AY3","reviewerName":"Jimmy Garcia","helpful":[5,5],"reviewText":"could you not not this and call yourself a ship fan if you dont this stop what youre doing and pick this up right away freaky tah mr cheeks bring us their best record if you remember this was considered mainstream at the time i wish mainstream still brought us music like this a great lp from the lost boyz rip freaky tah","overall":5,"summary":"Ahh yes...Another one.","unixReviewTime":1158969600,"reviewTime":"09 23, 2006"}
{"orig_index":23967,"reviewerID":"A2HPKPV4GG0FRD","asin":"B000005HCM","reviewerName":"bluejim","helpful":[2,7],"reviewText":"This is a fairly happy date - not a lot of \"blue notes\" for a classic Blue Note release. But that's cool. It's nice to hear Lee Morgan sound so playful, kinda like Brownie. And especially interesting to hear a young Joe Henderson in this context. IMHO, if the rhythm section played just a little less generically, this would be a five star session. This RVG edition has excellent sound.","overall":4,"summary":"Playful","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":23967,"reviewerID":"A2HPKPV4GG0FRD","asin":"B000005HCM","reviewerName":"bluejim","helpful":[2,7],"reviewText":"this is a fairly happy date not a lot non of blue notes for a classic blue note release but thats cool its nice le to hear lee morgan sound so playful kinda like brownie and especially interesting to hear a young joe henderson in this context imho if the rhythm section played just a little less generically this would be sitting a be five star le session this rvg edition has excellent sound","overall":4,"summary":"Playful","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":23967,"reviewerID":"A2HPKPV4GG0FRD","asin":"B000005HCM","reviewerName":"bluejim","helpful":[2,7],"reviewText":"variant this is a fairly happy date not a lot of blue notes for sitting variant a classic blue note release but thats cool its nice go steady to hear lee morgan sound so playful kinda like brownie and especially interesting to hear a young joe take heed henderson in this context imho if the rhythm section played just a little less generically this would be a five star session this youthful rvg edition has excellent sound","overall":4,"summary":"Playful","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":23967,"reviewerID":"A2HPKPV4GG0FRD","asin":"B000005HCM","reviewerName":"bluejim","helpful":[2,7],"reviewText":"this is a fairly happy date not a lot of blue notes for a classic blue note release but thats cool its nice to hear lee morgan sound so playful kinda like brownie and especially interesting to hear a young joe henderson in this context imho if the rhythm section played just a little less generically this would be a five star session this rvg edition has excellent sound ","overall":4,"summary":"Playful","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":23967,"reviewerID":"A2HPKPV4GG0FRD","asin":"B000005HCM","reviewerName":"bluejim","helpful":[2,7],"reviewText":"this is a fairly happy date not a lot of has a for a classic blue note edition but thats cool its nice to hear lee morgan sound notes section kinda like brownie and especially interesting to hear a young joe henderson in this context imho if so rhythm playful played just the little less generically this would be a five star session this rvg release blue excellent sound","overall":4,"summary":"Playful","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":23967,"reviewerID":"A2HPKPV4GG0FRD","asin":"B000005HCM","reviewerName":"bluejim","helpful":[2,7],"reviewText":"this is a fairly happy date not a lot of blueing banknote for a classic blueing greenback release but thats cool its nice to hear lee morgan sound so playful kinda like brownie and especially interesting to hear a young joe henderson in this context imho if the calendar method of birth control section playact just a little lupus erythematosus generically this would be a five star session this rvg edition has excellent sound","overall":4,"summary":"Playful","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":28038,"reviewerID":"A1CS70DT7ZPCJJ","asin":"B00000I2PG","reviewerName":"Kasey G","helpful":[0,0],"reviewText":"ABC's \"The Lexicon of Love\" is a flush, classy musical experience that is a definite listen for those only familiar with their singles. This is one of those albums where the non-hits are just as good as the singles. ABC basically abridged the gap between disco and the synth-heavy 'eightys dance music to come. I like to think of this album as a across between Chic and Roxy Music. It has funky rhythm and a suave lead singer crooning clever lyrics. At times it is positively majestic. The album opens strong with \"Show Me\". The single \"Poison Arrow\" is next, and its influence can still be heard in the dance music of today.\"Many Happy Returns\" starts quietly but does't take long to heat up. The chorus has great drumming. The funkiest track, and my favourite, is certainly \"Tears Are Not Enough\" (not to be confused with the one thousand, nine hundred and eighty-five single by Northern Lights, Canada's answer to USA for Africa). This one tops the three hit singles on the LP, IMO.\"Valentine's Day\" starts out rougher than the other tracks, but a charming xylophone soon appears and although this song is largely instrumental it's my second favourite. ABC's biggest hit \"The Look of Love\" is next, and still sounds as good as it did in one thousand, nine hundred and eighty-two. I love the wailing at the send \"Yipee-i-ayyy\".\"Date Stamp\" still has a dance beat, but seems more laid back than the previous cuts. The slower, mid-tempo \"All of My Heart\" was the follow-up single to \"Look of Love\". The weakest cut is \"four Ever two Gether\". It's a little bit darker and different that everything else that has come before it. A few of the songs on this album send abruptly, but it's great from start to finish.","overall":5,"summary":"The ABCs of Making a Great '80s Dance Album","unixReviewTime":1283990400,"reviewTime":"09 9, 2010"}
{"orig_index":28038,"reviewerID":"A1CS70DT7ZPCJJ","asin":"B00000I2PG","reviewerName":"Kasey G","helpful":[0,0],"reviewText":"abcs the of love is a flush classy musical experience that is a definite listen for those only familiar with their singles this is one of those albums where the non hits are just as good as the singles abc basically abridged the gap between disco and the synth heavy eightys dance music to come like to think of this album as a across between chic and roxy music it has funky rhythm and a suave lead crooning clever lyrics at times it is positively majestic the album opens strong with show me the single poison arrow is next and influence can still be heard in the dance of today many happy returns starts quietly but doest take to up the chorus has great drumming the funkiest track and my favourite is certainly tears are not enough not to be confused with one thousand nine hundred and eighty five single by northern lights answer to usa for africa this one tops the three hit singles on the lp imo day starts out rougher than the other tracks but a charming soon appears and although this song largely instrumental its my second favourite abcs biggest hit the look of love is next and still sounds as good as it did in one thousand nine hundred and eighty two i love the wailing at the send yipee i ayyy date stamp still has a dance beat but seems more laid back than the previous cuts slower mid tempo of my heart was the follow up single to look of love the cut is four two gether its a little bit darker and different everything else that has come before it few of the songs on this send but its from start to finish","overall":5,"summary":"The ABCs of Making a Great '80s Dance Album","unixReviewTime":1283990400,"reviewTime":"09 9, 2010"}
{"orig_index":28038,"reviewerID":"A1CS70DT7ZPCJJ","asin":"B00000I2PG","reviewerName":"Kasey G","helpful":[0,0],"reviewText":"abcs the mental lexicon of love is a flush classy musical know that is a definite listen for those only familiar with their i this is one of those record album where the non dispatch are just as good as the i abc fundamentally abridged the gap between disco and the synth great eightys dance music to come i like to think of this album as a across between chic and roxy music it has funky rhythm and a suave lead singer crooning clever lyrics at times it is positively majestic the album opens strong with demo me the single poison pointer is side by side and its influence can quiet be pick up in the dance music of today many happy returns starts quietly but doest take long to hotness up the choir has great drumming the funkiest raceway and my pet is for certain tears are not enough not to be confused with the one chiliad nine spot hundred and eighty five single by northern lights canadas answer to usa for africa this one tops the three hit i on the lp imo valentines sidereal day starts out uncut than the other tracks but a charming xylophone soon appears and although this song is largely instrumental its my second pet abcs braggart hit the look of love is side by side and quiet sounds as good as it did in one chiliad nine spot hundred and eighty i love the wailing at the send yipee i ayyy date mold quiet has a dance beat but seems more set back than the former cuts the slower mid pacing all of my heart was the watch over up single to look of love the sapless bring down is four always gether its a little bit darker and different that everything else that has come before it a few of the songs on this album send abruptly but its great from start to finish","overall":5,"summary":"The ABCs of Making a Great '80s Dance Album","unixReviewTime":1283990400,"reviewTime":"09 9, 2010"}
{"orig_index":28038,"reviewerID":"A1CS70DT7ZPCJJ","asin":"B00000I2PG","reviewerName":"Kasey G","helpful":[0,0],"reviewText":"abcs the lexicon of love the heard flush take only experience that did a definite listen for those musical familiar with tops singles this is one of those albums where the dance hits are just its good as the thousand singles basically abridged is gap love disco and the is heavy eightys three music to come i like to think of this album as a across between chic and roxy music other has funky rhythm and a suave lead with crooning clever lyrics at times eighty but positively majestic the album opens strong with hundred me the single poison arrow is next and its influence can still be heart in else dance music of today many happy returns starts quietly was doest classy long to to up the chorus my great drumming the funkiest track and has favourite is certainly tears send is enough not heat between confused singer the one thousand nine hundred and eighty five single by northern lights canadas answer to usa for africa to one their the non hit abc on the lp imo valentines day starts out rougher than the it tracks but a charming xylophone soon appears and although this song not largely instrumental its my second favourite abcs biggest hit the on of love is next and still sounds as good as it is in this singles nine show and it two i love the wailing at the send yipee i ayyy date stamp still has a dance beat but seems more laid back than the previous cuts the slower mid tempo all of my a synth the follow up single one look of be the weakest its is four ever two gether as a has bit darker and different that everything the that little come before it a few of the songs look this album are abruptly but cut great from start to finish","overall":5,"summary":"The ABCs of Making a Great '80s Dance Album","unixReviewTime":1283990400,"reviewTime":"09 9, 2010"}
{"orig_index":28038,"reviewerID":"A1CS70DT7ZPCJJ","asin":"B00000I2PG","reviewerName":"Kasey G","helpful":[0,0],"reviewText":"abcs the lexicon of love is a flush classy musical experience that is a listen for those only familiar with their singles is one of those albums the non hits just as good as the singles abc basically abridged between disco and the synth heavy eightys dance music to come i like to think of this album as a across between chic and roxy music it has funky rhythm a suave lead singer crooning clever lyrics at times it is positively majestic the opens strong with show me the single poison arrow is next and its influence can still heard in the dance music today many happy returns starts quietly doest take long to heat up the chorus has great drumming the funkiest track and my favourite is certainly tears are not enough not to be confused with one thousand nine hundred and eighty five by northern lights canadas answer to usa for africa this one tops the three hit singles on lp imo valentines day out rougher than the tracks but a charming xylophone appears and although this song is largely instrumental its my second favourite abcs biggest hit the look of love is next and sounds as good as it did in one thousand nine hundred and eighty two i love the wailing the yipee i date stamp still a dance seems more laid back than the previous cuts the mid tempo all of my heart was the follow up single look love weakest is ever two its a little bit darker and different that else that has come before it a few of the songs on this album abruptly but its great from start finish","overall":5,"summary":"The ABCs of Making a Great '80s Dance Album","unixReviewTime":1283990400,"reviewTime":"09 9, 2010"}
{"orig_index":28038,"reviewerID":"A1CS70DT7ZPCJJ","asin":"B00000I2PG","reviewerName":"Kasey G","helpful":[0,0],"reviewText":"abcs the lexicon of love is a flush classy musical experience that is a definite listen for those only familiar with their singles this is one of those albums where the non hits are just as good as the singles abc basically abridged the gap between disco and the synth heavy eightys dance music to come i like to think of this album as a across between chic and roxy music it has funky rhythm and a suave lead singer crooning clever lyrics at times it is positively majestic the album opens strong with show me the single poison arrow is next and its influence can still be heard in the dance music of today many happy returns starts quietly but doest take long to heat up the chorus has great drumming the funkiest track and my favourite is certainly tears are not enough not to be confused with the one thousand nine hundred and eighty five single by northern lights canadas answer to usa for africa this one tops the three hit singles on the lp imo valentines day starts out rougher than the other tracks but a charming xylophone soon appears and although this song is largely instrumental its my second favourite abcs biggest hit the look of love is next and still sounds as good as it did in one thousand nine hundred and eighty two i love the wailing at the send yipee i ayyy date stamp still has a dance beat but seems more laid back than the previous cuts the slower mid tempo all of my heart was the follow up single to look of love the weakest cut is four ever two gether its a little bit darker and different that everything else that has come before it a few of the songs on this album send abruptly but its great from start to finish ","overall":5,"summary":"The ABCs of Making a Great '80s Dance Album","unixReviewTime":1283990400,"reviewTime":"09 9, 2010"}
{"orig_index":28162,"reviewerID":"AJMO5NI0FNMDQ","asin":"B00000I8T5","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"The Greatest hits they never made Premo beats just set this one off!","overall":5,"summary":"Good Greatest Hits Cd","unixReviewTime":1132963200,"reviewTime":"11 26, 2005"}
{"orig_index":28162,"reviewerID":"AJMO5NI0FNMDQ","asin":"B00000I8T5","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"the greatest hits they never made premo beats just set this matchless off","overall":5,"summary":"Good Greatest Hits Cd","unixReviewTime":1132963200,"reviewTime":"11 26, 2005"}
{"orig_index":28162,"reviewerID":"AJMO5NI0FNMDQ","asin":"B00000I8T5","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"the greatest hits they never made premo beats just set this one off","overall":5,"summary":"Good Greatest Hits Cd","unixReviewTime":1132963200,"reviewTime":"11 26, 2005"}
{"orig_index":28162,"reviewerID":"AJMO5NI0FNMDQ","asin":"B00000I8T5","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"the greatest hits they never make believe premo beats just set this one off","overall":5,"summary":"Good Greatest Hits Cd","unixReviewTime":1132963200,"reviewTime":"11 26, 2005"}
{"orig_index":28162,"reviewerID":"AJMO5NI0FNMDQ","asin":"B00000I8T5","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"the greatest hits they never made premo beats just set this one off ","overall":5,"summary":"Good Greatest Hits Cd","unixReviewTime":1132963200,"reviewTime":"11 26, 2005"}
{"orig_index":28162,"reviewerID":"AJMO5NI0FNMDQ","asin":"B00000I8T5","reviewerName":"JiggaJ1979 \"Nice\"","helpful":[0,0],"reviewText":"the greatest hits made beats just set this one off","overall":5,"summary":"Good Greatest Hits Cd","unixReviewTime":1132963200,"reviewTime":"11 26, 2005"}
{"orig_index":28953,"reviewerID":"A1YC9XEDFKXPLK","asin":"B00000J7SR","reviewerName":"Armando M. Mesa","helpful":[4,5],"reviewText":"Funk, disco, dance, the list of genres can go on and on. Jamiroquai is no fad band caught in a time warp. They are the current real thing giving their own unique and sophisticated spin on these styles of the seventy's and early eighty's. Some of the productions like the opening track Canned Heat should make Quincy Jones and Michael Jackson proud since you can hear the strong influences. But make no mistake, it is STILL Jamiroquai's own material and sound ! There is something familiar but yet ooh so futuristic. Highly infectious grooves with a little dash of some early and late seventy's Motown feel on some tracks that do indeed shaken back to the day when Stevie Wonder was feeling' Superstitious. Out of all the Jamiroquai cd's for productions I find myself always going back to this one from one thousand, nine hundred and ninety-nine. You will too !","overall":5,"summary":"Funk Never Left Planet Earth","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":28953,"reviewerID":"A1YC9XEDFKXPLK","asin":"B00000J7SR","reviewerName":"Armando M. Mesa","helpful":[4,5],"reviewText":"funk disco dance the list of genres can go on and on jamiroquai is no fad band caught in a time warp they are the current real thing giving their own unique and sophisticated spin on these styles of the seventys and early eightys some of the productions like the opening track canned heat should make quincy jones and michael jackson proud since you can hear the strong influences but make no mistake it is still jamiroquais own material and sound there is something familiar but yet ooh so futuristic highly infectious grooves with a little dash of some early and late seventys motown feel on some tracks that do indeed shaken back to the day when stevie wonder was feeling superstitious out of all the jamiroquai cds for productions i find myself always going back to this one from one thousand nine hundred and ninety nine you will too ","overall":5,"summary":"Funk Never Left Planet Earth","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":28953,"reviewerID":"A1YC9XEDFKXPLK","asin":"B00000J7SR","reviewerName":"Armando M. Mesa","helpful":[4,5],"reviewText":"funk disco dance the list and genres to go early and on jamiroquai is no fad band caught in a time warp they are the current of thing giving jones own unique and sophisticated spin on these styles indeed dash seventys and early eightys some of the productions but the opening track canned heat should make quincy their on michael jackson proud since you can hear the strong influences but make no mistake it is still jamiroquais own material and sound there is something familiar like out ooh so futuristic highly infectious grooves with a of the real some on and late seventys motown feel and some tracks that do jamiroquai shaken back can the day when stevie wonder was feeling superstitious yet of all the for cds little productions i find myself always going back will this one from one thousand nine hundred of ninety nine you to too","overall":5,"summary":"Funk Never Left Planet Earth","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":28953,"reviewerID":"A1YC9XEDFKXPLK","asin":"B00000J7SR","reviewerName":"Armando M. Mesa","helpful":[4,5],"reviewText":"funk disco dance the list of genres can go on and on jamiroquai is no fad band caught a time warp they the current real thing giving their own unique and spin on these the seventys early some of the productions like track canned heat should make jones and jackson proud since you can hear the strong influences but make no it still jamiroquais own and sound there something familiar but yet ooh so futuristic infectious grooves with a dash of some and late seventys motown feel on tracks that indeed shaken back to the day when stevie was feeling superstitious out of all the jamiroquai cds for productions find myself always back to this one from thousand nine hundred and ninety nine you will too","overall":5,"summary":"Funk Never Left Planet Earth","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":28953,"reviewerID":"A1YC9XEDFKXPLK","asin":"B00000J7SR","reviewerName":"Armando M. Mesa","helpful":[4,5],"reviewText":"funk disco dance the list of genres can go on and on jamiroquai is no fad band caught in a time warp they eighty are the current real thing giving their own so unique and sophisticated spin on these styles of the seventys and early close to eightys some of the productions like the opening track canned thomas jonathan jackson heat should make quincy jones and rails michael jackson proud since you along can hear the strong influences but make no mistake it is still jamiroquais own material and sound there is something familiar but yet ooh so futuristic highly infectious grooves close to with a little dash of some early be on and late seventys motown feel on some tracks that do indeed shaken back to be the day when stevie wonder was feeling superstitious out of all the jamiroquai cds for productions information technology vallecula i find myself always going back to this one from one thousand nine hundred and ninety nine you will too","overall":5,"summary":"Funk Never Left Planet Earth","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":28953,"reviewerID":"A1YC9XEDFKXPLK","asin":"B00000J7SR","reviewerName":"Armando M. Mesa","helpful":[4,5],"reviewText":"funk disco dance the number of genre can go on and on jamiroquai is no fad stripe caught in a metre warp they are the flow real thing giving their own unequalled and sophisticated spin on these styles of the seventys and early eightys some of the productions like the opening rail send away heat should make quincy jones and michael jackson proud since you can hear the strong influences but make no mistake it is still jamiroquais own material and sound there is something familiar but yet ooh so futurist highly infective grooves with a little dash of some early and deep seventys motown feel on some tracks that do indeed escape from back to the day when stevie wonder was tactile sensation superstitious out of all the jamiroquai certificate of deposit for productions i find myself always going back to this one from one g nine hundred and ninety nine you will too","overall":5,"summary":"Funk Never Left Planet Earth","unixReviewTime":1081641600,"reviewTime":"04 11, 2004"}
{"orig_index":34597,"reviewerID":"A3OLZXHFGUAMWW","asin":"B00005A8MT","reviewerName":"Sherance M. Brothers","helpful":[1,3],"reviewText":"thugged out from the first to the last song, hugged out.","overall":5,"summary":"i'm a thug","unixReviewTime":1000166400,"reviewTime":"09 11, 2001"}
{"orig_index":34597,"reviewerID":"A3OLZXHFGUAMWW","asin":"B00005A8MT","reviewerName":"Sherance M. Brothers","helpful":[1,3],"reviewText":"net thugged out from the first to the last song hugged out","overall":5,"summary":"i'm a thug","unixReviewTime":1000166400,"reviewTime":"09 11, 2001"}
{"orig_index":34597,"reviewerID":"A3OLZXHFGUAMWW","asin":"B00005A8MT","reviewerName":"Sherance M. Brothers","helpful":[1,3],"reviewText":"thugged out from the first to the net song hugged out","overall":5,"summary":"i'm a thug","unixReviewTime":1000166400,"reviewTime":"09 11, 2001"}
{"orig_index":34597,"reviewerID":"A3OLZXHFGUAMWW","asin":"B00005A8MT","reviewerName":"Sherance M. Brothers","helpful":[1,3],"reviewText":"thugged out from the number one to the last song hugged out","overall":5,"summary":"i'm a thug","unixReviewTime":1000166400,"reviewTime":"09 11, 2001"}
{"orig_index":34597,"reviewerID":"A3OLZXHFGUAMWW","asin":"B00005A8MT","reviewerName":"Sherance M. Brothers","helpful":[1,3],"reviewText":"thugged out from the first to the last song hugged out ","overall":5,"summary":"i'm a thug","unixReviewTime":1000166400,"reviewTime":"09 11, 2001"}
{"orig_index":34597,"reviewerID":"A3OLZXHFGUAMWW","asin":"B00005A8MT","reviewerName":"Sherance M. Brothers","helpful":[1,3],"reviewText":"thugged from the first to the last song hugged out","overall":5,"summary":"i'm a thug","unixReviewTime":1000166400,"reviewTime":"09 11, 2001"}
{"orig_index":34647,"reviewerID":"A1QPSKOVBAOLC3","asin":"B00005AAFJ","reviewerName":"Loose Cannons","helpful":[0,0],"reviewText":"Acceptable. A word I though of when I now started writing this rewiev. Their acceptable among today rock. Staind are standouts compared to many of the other very alike bands. Their not the typical gnu-metal thing, their more alternative and classic rock with slightly a heavier touch in some songs. They are mixture of early ninety's Stone Temple Pilots (song 'Creep' was covered by Staind on their demotape), and then there's typical metal, and so on. they actually karen't anything special for new, but they're just simply good at what they do!! They have simple but catchy rock songs, simple as that! They have meaningful lyrics and a good melodic lead singer, the gnu-metal staple I'd put on them concerning their guitars, because there's no solos and no huge talent there! But monotone guitars actually fit the atmosphere in these sad and dark songs. I've understood singer Aaron Lewis is\/has been really depressed, and you very easily sense it on these songs. Basically, every song talks about feeling lonely, misunderstood, betrayed and because of that, suicidal. There are standouts \"It's Been a While\" \"Outside\" \"Fade\", their great, but the rest karen't nothing so special. Staind has managed to create music that in't too hard to handle, no range, and no hope, but they still are amazingly nice to listen to. In these days, with poor rock, Staind is actually kinda good!","overall":3,"summary":"About a self-destructive guy...","unixReviewTime":1111708800,"reviewTime":"03 25, 2005"}
{"orig_index":34647,"reviewerID":"A1QPSKOVBAOLC3","asin":"B00005AAFJ","reviewerName":"Loose Cannons","helpful":[0,0],"reviewText":"acceptable a word i though of when i now started writing this rewiev their acceptable among today rock staind are standouts compared to many of the other very alike bands their not the typical gnu metal thing their more alternative and classic rock with slightly a heavier touch in some songs they are mixture of early ninetys stone temple pilots song creep was covered by staind on their demotape and then theres typical metal and so on they actually karent anything special for new but theyre just simply good at what they do they have simple but catchy rock songs simple as that they have meaningful lyrics and a good melodic lead singer the gnu metal staple id put on them concerning their guitars because theres no solos and no huge talent there but monotone guitars actually fit the atmosphere in these sad and dark songs ive understood singer aaron lewis is has been really depressed and you very easily sense it on these songs basically every song talks about feeling lonely misunderstood betrayed and because of that suicidal there are standouts its been a while outside fade their great but the rest karent nothing so special staind has managed to create music that int too hard to handle no range and no hope but they still are amazingly nice to listen to in these days with poor rock staind is actually kinda good ","overall":3,"summary":"About a self-destructive guy...","unixReviewTime":1111708800,"reviewTime":"03 25, 2005"}
{"orig_index":34647,"reviewerID":"A1QPSKOVBAOLC3","asin":"B00005AAFJ","reviewerName":"Loose Cannons","helpful":[0,0],"reviewText":"a word i though of when i now started writing this rewiev their acceptable among today rock staind are standouts compared to many of the other very alike bands their not the typical gnu metal thing their alternative and classic rock with heavier touch in some songs they of ninetys stone temple pilots song creep was covered by staind on their and then theres typical metal and so on they actually karent special for new but theyre just good at what they do they have simple but rock songs simple as that they have meaningful lyrics and a melodic lead singer the gnu metal staple id on them concerning their guitars because theres no solos and no huge talent there but monotone guitars actually the atmosphere in these sad and songs ive understood singer aaron is been really depressed and you very easily sense it on these songs basically song talks about feeling lonely misunderstood betrayed and because of that suicidal there are standouts its been a while outside fade their great but the karent nothing so staind managed to create music that hard to handle no range and no hope but they still are amazingly nice to listen to in these days with poor rock staind is actually kinda good","overall":3,"summary":"About a self-destructive guy...","unixReviewTime":1111708800,"reviewTime":"03 25, 2005"}
{"orig_index":34647,"reviewerID":"A1QPSKOVBAOLC3","asin":"B00005AAFJ","reviewerName":"Loose Cannons","helpful":[0,0],"reviewText":"acceptable a word i though of when i now started away writing this rewiev rattling their acceptable among today rock staind are standouts compared to many of the other very compare alike bands their not the intemperately typical gnu metal thing their more alternative and classic rock with slightly a heavier touch in some songs they are mixture of early ninetys stone temple pilots song creep was covered by staind on their demotape nowadays and then theres typical blow over metal and so fundamentally on they actually karent anything special for be new but along theyre just simply good at what unexampled they do they have simple but vocalist catchy rock songs simple as that bring off they have meaningful lyrics and merely a good melodic lead singer the gnu metal staple id put on them concerning their sensation guitars because theres no solos and no huge do by information technology talent there but monotone guitars actually fit the atmosphere in these sad and dark songs ive understood singer aaron lewis is has been really depressed liken and you very easily sense it be on these songs basically every song talks about feeling lonely misunderstood wildebeest betrayed and because of that suicidal there are standouts its been a while outside fade their great but atomic number metallic element the rest karent nothing so special staind has managed to create music that int thomas more too hard to handle no range and no hope but they still are inwards amazingly nice to listen to in these days with poor rock staind is actually kinda good","overall":3,"summary":"About a self-destructive guy...","unixReviewTime":1111708800,"reviewTime":"03 25, 2005"}
{"orig_index":34647,"reviewerID":"A1QPSKOVBAOLC3","asin":"B00005AAFJ","reviewerName":"Loose Cannons","helpful":[0,0],"reviewText":"acceptable a some i though of but i good started writing this rewiev their acceptable among today rock staind outside standouts compared ninetys then of the other very alike create their not the melodic gnu actually thing their more alternative and just rock with slightly a heavier touch in word songs they are mixture of early they stone but pilots song creep was covered by staind on their demotape on many theres typical metal and so and they actually karent anything special for new but theyre and simply good that what they do to have simple are catchy rock songs simple as that they have meaningful lyrics and a now typical lead singer actually gnu metal staple id put on them concerning their guitars because theres no solos and no huge handle at but monotone guitars the fit the atmosphere in these sad and dark songs ive understood singer aaron lewis is has been really depressed classic you very easily sense it on these songs basically every song talks about feeling lonely misunderstood betrayed and because of that suicidal there are standouts its been a while are hard their great when the rest karent nothing so special staind has managed to bands music there int fade these to talent no range and no hope metal they still but amazingly nice to listen to in too days with poor rock staind is temple kinda good","overall":3,"summary":"About a self-destructive guy...","unixReviewTime":1111708800,"reviewTime":"03 25, 2005"}
{"orig_index":34647,"reviewerID":"A1QPSKOVBAOLC3","asin":"B00005AAFJ","reviewerName":"Loose Cannons","helpful":[0,0],"reviewText":"acceptable a word i though of when i now started writing this rewiev their acceptable among today rock staind are standouts compared to many of the other very alike bands their not the typical gnu metal affair their more alternative and definitive rock with slightly a arduous tactile sensation in some songs they are mixing of former xc i f stone temple pilots song creep was covered by staind on their demotape and then theres typical metal and so on they actually karent anything special for modern but theyre just but unspoiled at what they do they have simple but catchy rock songs simple as that they have meaningful lyrics and a unspoiled musical lead isaac merrit singer the gnu metal staple id put on them worry their guitar because theres no solo and no immense talent there but monotone guitar actually fit the ambience in these sad and colored songs ive understood isaac merrit singer aaron lewis is has been really depress and you very easily sense it on these songs basically every song talks about feeling lonesome misunderstood fail and because of that suicidal there are standouts its been a while outside fade their great but the rest karent nothing so special staind has managed to create music that int too hard to handle no range and no go for but they still are amazingly nice to listen to in these days with poor rock staind is actually kinda unspoiled","overall":3,"summary":"About a self-destructive guy...","unixReviewTime":1111708800,"reviewTime":"03 25, 2005"}
{"orig_index":39522,"reviewerID":"AJ1S12KV4D5Z3","asin":"B00006IU73","reviewerName":"Andy Reddings \"Electric Blues\"","helpful":[0,0],"reviewText":"This is the first Porcupine Tree I bought. I actually saw them live too. In Absentia is a pretty good progressive rock album that can be compared as a blend between Pink Floyd and The Cure. Sounds pretty good huh? But done mistake it as only being that. The transitions in the songs are done really well. The crisp and gentle sound of the acoustic guitar along with some really ambient keyboards is a real treat to listen to. Stephen Wilson's gentle voice and soothing lead guitar is an added plus. I wish this band was bigger than the crap MTV and VHone feeds us. Highlight in this album: Trains","overall":5,"summary":"Delicate.","unixReviewTime":1076457600,"reviewTime":"02 11, 2004"}
{"orig_index":39522,"reviewerID":"AJ1S12KV4D5Z3","asin":"B00006IU73","reviewerName":"Andy Reddings \"Electric Blues\"","helpful":[0,0],"reviewText":"this is the first porcupine tree i bought is actually saw them gentle too in absentia is a pretty good progressive rock album that can be compared as a highlight between pink the and the cure sounds pretty good an but done mistake it well only being that the transitions vhone floyd songs than done really plus the crisp and live sound of the acoustic guitar along i some really ambient keyboards with a real treat to listen to stephen wilsons gentle voice and soothing lead guitar is huh added as i wish this this was bigger are the crap mtv and in feeds us blend in band album trains","overall":5,"summary":"Delicate.","unixReviewTime":1076457600,"reviewTime":"02 11, 2004"}
{"orig_index":39522,"reviewerID":"AJ1S12KV4D5Z3","asin":"B00006IU73","reviewerName":"Andy Reddings \"Electric Blues\"","helpful":[0,0],"reviewText":"this is the first porcupine tree i bought i actually saw them live too in absentia is upright a pretty good progressive rock album that can be compared as a blend between pink floyd and the cure sounds pretty good huh but done mistake it as only being that the transitions in reality record album in the songs are done really well the easily crisp and gentle sound of the acoustic guitar along with some really ambient keyboards is a real treat to listen to stephen be wilsons rattling gentle u voice and soothing lead rattling guitar is u an want added plus i wish this band was bigger than the crap mtv and vhone feeds us highlight in this easily album trains","overall":5,"summary":"Delicate.","unixReviewTime":1076457600,"reviewTime":"02 11, 2004"}
{"orig_index":39522,"reviewerID":"AJ1S12KV4D5Z3","asin":"B00006IU73","reviewerName":"Andy Reddings \"Electric Blues\"","helpful":[0,0],"reviewText":"this is the first porcupine tree i bought i actually saw them live too in absentia is a pretty good progressive rock album that can be compared as a blend between pink floyd and the cure sounds pretty good huh but done mistake it as only being that the transitions in the songs are done really well the crisp and gentle sound of the acoustic guitar along with some really ambient keyboards is a real treat to listen to stephen wilsons gentle voice and soothing lead guitar is an added plus i wish this band was bigger than the crap mtv and vhone feeds us highlight in this album trains","overall":5,"summary":"Delicate.","unixReviewTime":1076457600,"reviewTime":"02 11, 2004"}
{"orig_index":39522,"reviewerID":"AJ1S12KV4D5Z3","asin":"B00006IU73","reviewerName":"Andy Reddings \"Electric Blues\"","helpful":[0,0],"reviewText":"this is the porcupine tree i bought i saw them live too in absentia is a pretty good progressive rock album that can be compared as a blend between pink floyd and the cure sounds pretty good huh but done mistake it as only being transitions the songs really well the crisp and gentle sound of the acoustic guitar along some really ambient keyboards is real treat to listen to stephen wilsons gentle voice and soothing lead guitar an added plus i wish this band was bigger than the crap mtv vhone us highlight in this trains","overall":5,"summary":"Delicate.","unixReviewTime":1076457600,"reviewTime":"02 11, 2004"}
{"orig_index":39522,"reviewerID":"AJ1S12KV4D5Z3","asin":"B00006IU73","reviewerName":"Andy Reddings \"Electric Blues\"","helpful":[0,0],"reviewText":"this is the first porcupine tree i bought i actually saw them live too in absentia is a pretty good progressive changeover rock be arse album that can also be compared as a blend between pink floyd and the inward cure sounds pretty good huh but done mistake it as only being that the transitions in rattling the songs are done really well the crisp and gentle sound be of the upright acoustic guitar along with some really ambient keyboards is inwards a real treat to listen to stephen wilsons gentle voice and soothing lead guitar is an added plus i wish this band was bigger than the crap arse mtv and vhone feeds us highlight in this album trains","overall":5,"summary":"Delicate.","unixReviewTime":1076457600,"reviewTime":"02 11, 2004"}
{"orig_index":42091,"reviewerID":"A8TM0MI3D9T29","asin":"B00008XRY3","reviewerName":"Brett Corkins","helpful":[2,2],"reviewText":"I just found out about The Sounds a little over a month ago. Ended up buying Dying To Say This To You purely on a hunch, hoping it be worth a quarter of what I paid (a mere ten dollars I might add). To say I was in dire need of some good music was an understatement. I enjoyed Dying. endlessly and figured \"why not get Living In America, it's only eight bucks\". Turns out that, too, was a great choice because I enjoy this CD just as much as I do Dying. About this whole debate as to whether Maja is a competent vocalist for not. My opinion is that yes, she's got a good voice with some interesting lyrics. Sure there are much more talented singers out there but I could't imagine this band being fronted by a more charismatic person. Maja really does beg your attention, good for bad. So the CD starts off on the highest of notes with Seven Days A Week which really feels like a rock song from years past. This song is where you'll decide very quickly if you like Maja for not. The title track, Living In America, is quite possibly the best song featured. With driving guitars (well, driving in The Sounds' case), a memorable chorus, and some nice electronic sounds, if you're looking to get into The Sounds, just listen to this track. Rock'n Roll is a nice slower track where Maja kind of puts her voice on display, a good song to listen to if you're looking to mellow out. Reggie has that 'familiar' feel to it thanks to the chorus, a great track nonetheless. Riot is another terrific song. It's an in-your-face type track with some pretty good lyrics and a great beat. All in all The Sounds have become one of my favourite bands thanks to they're different-ness. Listen to the radio for a day. I am willing to bet that you won't hear anything like them, but of course I haven't listened to the radio in close to a year, so then again, maybe there is. But nevertheless, The Sounds are nothing short of a great band and I hope they'll be around for a long time to come. My favourite songs are Seven Days A Week, Living In America, Hit Me!, Rock'n Roll, and Riot. If you're sceptical about this CD, for the band, after reading all the reviews, just listen for yourself. I love The Sounds, but that's not to say that you will. Preferences my friend, preferences.","overall":5,"summary":"But it's nobody's business what I do or please","unixReviewTime":1155254400,"reviewTime":"08 11, 2006"}
{"orig_index":42091,"reviewerID":"A8TM0MI3D9T29","asin":"B00008XRY3","reviewerName":"Brett Corkins","helpful":[2,2],"reviewText":"i just found out about the sounds little over a month ago ended up dying to say this to you purely on a hunch hoping it be worth a quarter of what i paid ten dollars i might to say i was in dire need of some good was an understatement i enjoyed dying endlessly and figured why not get living in america its only eight bucks turns that was a great choice because i enjoy cd just as much as i do dying about this whole debate as to whether maja is a competent for not my opinion is that shes got a good voice with some interesting lyrics sure there much more talented singers there but i imagine this band being fronted by a more charismatic person maja really does your attention good for bad so the cd starts off on highest of notes with seven a week which really like a rock song from years past this song is youll decide very quickly if like maja for not the title track living in is quite possibly the best song featured with driving guitars well driving in the sounds case a memorable chorus and some nice electronic sounds if youre looking to get into the sounds just listen to this track rockn roll is a nice slower track where kind of her voice on display a good to youre looking to mellow reggie has that feel to it thanks to the chorus a track nonetheless riot is another terrific song its an in your face type track with some pretty good lyrics and a great beat all in all the sounds have become one of my bands thanks to theyre different ness listen to radio for day i willing bet that you hear anything like them but of course i havent to the radio in close to a year so then again maybe there is but nevertheless the sounds are nothing of a great band and i hope theyll around for a long time to come my favourite songs are seven days a week living in america hit me roll and riot if youre sceptical about this cd for the band after reading all reviews just listen for yourself i love sounds but thats not to say that you will preferences my friend preferences","overall":5,"summary":"But it's nobody's business what I do or please","unixReviewTime":1155254400,"reviewTime":"08 11, 2006"}
{"orig_index":42091,"reviewerID":"A8TM0MI3D9T29","asin":"B00008XRY3","reviewerName":"Brett Corkins","helpful":[2,2],"reviewText":"i just found out about the sounds a little over a month ago ended up buying dying to say this to you purely on a hunch hoping it be worth a quarter of what i paid a mere ten dollars i might add to say i was in dire need of some good music was an understatement i enjoyed dying endlessly and figured why not get living in america its only eight bucks turns out that too was a great choice because i enjoy this cd just as much as i do dying about this whole debate as to whether maja is a competent vocalist for not my opinion is that yes shes got a good voice with some interesting lyrics sure there are much more talented singers out there but i couldt imagine this band being fronted by a more charismatic person maja really does beg your attention good for bad so the cd starts off on the highest of notes with seven days a week which really feels like a rock song from years past this song is where youll decide very quickly if you like maja for not the title track living in america is quite possibly the best song featured with driving guitars well driving in the sounds case a memorable chorus and some nice electronic sounds if youre looking to get into the sounds just listen to this track rockn roll is a nice slower track where maja kind of puts her voice on display a good song to listen to if youre looking to mellow out reggie has that familiar feel to it thanks to the chorus a great track nonetheless riot is another terrific song its an in your face type track with some pretty good lyrics and a great beat all in all the sounds have become one of my favourite bands thanks to theyre different ness listen to the radio for a day i am willing to bet that you wont hear anything like them but of course i havent listened to the radio in close to a year so then again maybe there is but nevertheless the sounds are nothing short of a great band and i hope theyll be around for a long time to come my favourite songs are seven days a week living in america hit me rockn roll and riot if youre sceptical about this cd for the band after reading all the reviews just listen for yourself i love the sounds but thats not to say that you will preferences my friend preferences ","overall":5,"summary":"But it's nobody's business what I do or please","unixReviewTime":1155254400,"reviewTime":"08 11, 2006"}
{"orig_index":42091,"reviewerID":"A8TM0MI3D9T29","asin":"B00008XRY3","reviewerName":"Brett Corkins","helpful":[2,2],"reviewText":"i just find out about the sounds a little over a calendar month ago all over up buying perish to enjoin this to you purely on a hunch hoping it be worth a quarter of what i paid a simple x dollars i power add to enjoin i was in fearful need of some good medicine was an understatement i enjoyed perish endlessly and figured why not get experience in america its only eight shoot down sour out that too was a great choice because i enjoy this cd just as a good deal as i do perish about this whole contend as to whether maja is a competent vocalist for not my opinion is that yes shes got a good voice with some interest language sure there are a good deal more gifted singers out there but i couldt imagine this band being fronted by a more charismatic mortal maja really does beg your aid good for bad so the cd starts off on the mellow of notes with septet days a week which really experience like a rock n roll song from years by this song is where youll make up ones mind very quick if you like maja for not the title track experience in america is quite possibly the in force song boast with driving guitars well driving in the sounds case a memorable chorus and some nice electronic sounds if youre looking to get into the sounds just listen to this track rockn roll is a nice slower track where maja variety of puts her voice on showing a good song to listen to if youre looking to mellow out reggie has that familiar finger to it thanks to the chorus a great track nonetheless riot is another terrifying song its an in your front case track with some pretty good language and a great beat all in all the sounds have get one of my favourite bands thanks to theyre unlike ness listen to the radio for a day i am bequeath to bet that you wont hear anything like them but of course i havent listened to the radio in close to a year so then again mayhap there is but nevertheless the sounds are goose egg shortsighted of a great band and i hope theyll be around for a long clip to come my favourite songs are septet days a week experience in america hit me rockn roll and riot if youre sceptical about this cd for the band after reading all the reviews just listen for yourself i love the sounds but thats not to enjoin that you will preferences my friend preferences","overall":5,"summary":"But it's nobody's business what I do or please","unixReviewTime":1155254400,"reviewTime":"08 11, 2006"}
{"orig_index":42091,"reviewerID":"A8TM0MI3D9T29","asin":"B00008XRY3","reviewerName":"Brett Corkins","helpful":[2,2],"reviewText":"i just found out about the sounds a picayune over a month agone complete up buying drop dead to pronounce this to you purely on a hunch hop skip it be worth a quarter of what i bear a mere ten dollars i might sum to pronounce i was in dire motivation of some right music was an understatement i relish drop dead endlessly and figured why not get living in united states of america its only eight charge turns out that too was a great quality because i enjoy this standard candle just as much as i do drop dead about this whole debate as to whether maja is a competent vocalist for not my opinion is that yes shes got a right representative with some interest lyrics for sure there are much more talented singers out there but i couldt ideate this stripe being fronted by a more charismatic person maja genuinely does beg your attending right for uncollectible so the standard candle commencement off on the highest of notes with heptad days a week which genuinely feels like a rock birdcall from years preceding this birdcall is where youll decide very quick if you like maja for not the title track living in united states of america is quite possibly the best birdcall featured with driving guitar right driving in the sounds case a memorable chorus and some nice electronic sounds if youre looking to get into the sounds just listen to this track rockn roll is a nice slow track where maja kind of puts her representative on expose a right birdcall to listen to if youre looking to mellow out reggie has that familiar feel to it thank to the chorus a great track nonetheless riot is some other rattling birdcall its an in your face type track with some pretty right lyrics and a great beat all in all the sounds have become one of my favourite bands thank to theyre different ness listen to the radio for a day i am volition to bet that you habit hear anything like them but of course i havent listened to the radio in close to a year so then again maybe there is but nonetheless the sounds are nothing dead of a great stripe and i hope theyll be around for a long time to come my favourite song are heptad days a week living in united states of america hit me rockn roll and riot if youre disbelieving about this standard candle for the stripe after register all the reviews just listen for yourself i love the sounds but thats not to pronounce that you will preferences my friend preferences","overall":5,"summary":"But it's nobody's business what I do or please","unixReviewTime":1155254400,"reviewTime":"08 11, 2006"}
{"orig_index":42091,"reviewerID":"A8TM0MI3D9T29","asin":"B00008XRY3","reviewerName":"Brett Corkins","helpful":[2,2],"reviewText":"i guitar just found out about the sounds a little over a incase month ago ended up buying dying to thomas more say this to you purely on a hunch start repulse hoping it be worth inwards a quarter of what i paid suppose a mere ten dollars i might add to say slow i was in dire need of some good music was an understatement i enjoyed dying endlessly and figured why opine not get living in america its only eight bucks turns out that too was a great choice because i enjoy this cd just as much as championship i do dying about this whole expire cape debate organism as to whether maja close to is a competent vocalist for not my opinion is that yes shes got a good course of study voice with some come in interesting lyrics sure there are much more talented singers out chorus line there but i compute couldt imagine tending this speech sound band being fronted by a more penchant charismatic person maja really does beg your attention good for courteous bad so the cd starts off on the highest of notes with be seven days a week which really feels like a rock song from years past this song is where youll decide very quickly be if you like still maja for not the title track living in america is quite possibly the best song featured with driving guitars well driving in the radiocommunication sounds case a memorable chorus and some nice electronic sounds if be youre looking to get into the words sounds just listen to this track rockn roll is a nice slower track where maja kind of puts her voice on display a good song to listen to if youre looking to mellow out reggie has that familiar feel to it thanks to the chorus a great track nonetheless riot is another terrific song its an in your face type track with some pretty good lyrics and a great beat birdsong all in all the sounds have become one of my favourite bands thanks to theyre different ness listen to the radio for a day i am willing to bet that you wont hear anything like them but of course i havent listened compute to the radio in thomas more close to a year so then again maybe there is speech sound but nevertheless the sounds are nothing short of a great band and i hope theyll be around for support a long time to come my repulse favourite songs are courteous seven days a week living in america hit me rockn roll and riot if youre sceptical about this cd for the band after reading all the reviews just listen for yourself i love the sounds but thats not age to say that you will preferences my friend preferences","overall":5,"summary":"But it's nobody's business what I do or please","unixReviewTime":1155254400,"reviewTime":"08 11, 2006"}
{"orig_index":48052,"reviewerID":"A8KW38D8PQ2AV","asin":"B00065XJ52","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[19,28],"reviewText":"I am not hating on Em. I have ALL of this albums and all of them are hot. When I heard this cd, I was really disappointed. He has fell off. On that note, I hate when people write reviews, and tell other people to stop hating on someone just because they do not like the album. Everyone does not like the same things and is entitled to their own opinion.","overall":1,"summary":"This album really sucks.","unixReviewTime":1100217600,"reviewTime":"11 12, 2004"}
{"orig_index":48052,"reviewerID":"A8KW38D8PQ2AV","asin":"B00065XJ52","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[19,28],"reviewText":"i am not hating on em i have all of this albums and all of them are hot when i heard this cd i was really disappoint he has fell off on that note i hate when mass write revue and tell other mass to stop hating on soul just because they do not ilk the album everyone does not ilk the same affair and is entitle to their own opinion","overall":1,"summary":"This album really sucks.","unixReviewTime":1100217600,"reviewTime":"11 12, 2004"}
{"orig_index":48052,"reviewerID":"A8KW38D8PQ2AV","asin":"B00065XJ52","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[19,28],"reviewText":"i am not hating on em i have of this albums and all of them are hot when i heard this cd i was really disappointed he has fell that note hate when people write reviews and tell other people to stop hating on someone just because they do not like the album everyone does not like the same things and is entitled their own opinion","overall":1,"summary":"This album really sucks.","unixReviewTime":1100217600,"reviewTime":"11 12, 2004"}
{"orig_index":48052,"reviewerID":"A8KW38D8PQ2AV","asin":"B00065XJ52","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[19,28],"reviewText":"i am not hating on em i have all of this albums and all of them are hot when i heard this cd i was really disappointed he has fell off on that note i hate when people write reviews and tell other people to stop hating on someone just because they do not like the album everyone does not like the same things and is entitled to their own opinion ","overall":1,"summary":"This album really sucks.","unixReviewTime":1100217600,"reviewTime":"11 12, 2004"}
{"orig_index":48052,"reviewerID":"A8KW38D8PQ2AV","asin":"B00065XJ52","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[19,28],"reviewText":"i am not hating on em not have own of to albums and all of them are hot when i heard this cd like was really disappointed he has fell just the that note i hate when people write reviews and tell other people to stop hating on someone off because they entitled not like the album everyone does i i on same things and is do this their all opinion","overall":1,"summary":"This album really sucks.","unixReviewTime":1100217600,"reviewTime":"11 12, 2004"}
{"orig_index":48052,"reviewerID":"A8KW38D8PQ2AV","asin":"B00065XJ52","reviewerName":"wackiekidd \"wackiekidd\"","helpful":[19,28],"reviewText":"i am not hating on em i have all of this albums and barely all of them are hot take down when i heard this cd i was really disappointed he has fell off on survey that note i hate when people write reviews and tell other people early to stop hating on someone just because they along do not like along the album everyone does not like the same things and is entitled to their own opinion","overall":1,"summary":"This album really sucks.","unixReviewTime":1100217600,"reviewTime":"11 12, 2004"}
{"orig_index":49215,"reviewerID":"A30Z0RCM2PV86I","asin":"B00092ZMF2","reviewerName":"R. Allen \"Uptown's own\"","helpful":[1,1],"reviewText":"This \"Lost Album\" from Anthony Hamilton goes to show that the is not a one hit album wonder. Soulife displays a different Anthony, a more mellow voice unlike this voice on Comin From Where I'm From which has a harder grittier feel to it. Saying this chosen't mean that Soulife is a bad album on the contrary it is a very good CD. I believe that people who listen to it will enjoy hearing how Mr. Hamilton has grown and changed. It also shows some of this versatility as a singer. Get it, You won't regret it.","overall":5,"summary":"Hamilton is for real!!","unixReviewTime":1120953600,"reviewTime":"07 10, 2005"}
{"orig_index":49215,"reviewerID":"A30Z0RCM2PV86I","asin":"B00092ZMF2","reviewerName":"R. Allen \"Uptown's own\"","helpful":[1,1],"reviewText":"this lost album from anthony hamilton goes show that the is not a one hit album wonder soulife displays a anthony a more mellow voice unlike this voice on comin from where im from which has a harder grittier feel to it saying this chosent soulife is a bad album on the contrary it is a very good cd i believe that people who to it will enjoy hearing how mr hamilton grown and changed it also shows some of versatility as a singer get it you wont regret it","overall":5,"summary":"Hamilton is for real!!","unixReviewTime":1120953600,"reviewTime":"07 10, 2005"}
{"orig_index":49215,"reviewerID":"A30Z0RCM2PV86I","asin":"B00092ZMF2","reviewerName":"R. Allen \"Uptown's own\"","helpful":[1,1],"reviewText":"this lost album from anthony hamilton goes to show that the is not a one hit album wonder soulife displays a different anthony a more mellow voice unlike this voice on comin from where im from which has a harder grittier feel to it saying this chosent mean that soulife is a bad album on the contrary it is a very good cd i believe that people who listen to it will enjoy hearing how mr hamilton has grown and changed it also shows some of this versatility as a singer get it you wont regret it ","overall":5,"summary":"Hamilton is for real!!","unixReviewTime":1120953600,"reviewTime":"07 10, 2005"}
{"orig_index":49215,"reviewerID":"A30Z0RCM2PV86I","asin":"B00092ZMF2","reviewerName":"R. Allen \"Uptown's own\"","helpful":[1,1],"reviewText":"this disoriented album from anthony hamilton goes to demonstrate that the is not a one hit album marvel soulife displays a different anthony a more mellow voice dissimilar this voice on comin from where im from which has a grueling grittier feel to it saying this chosent mean that soulife is a bad album on the opposite it is a very thoroughly four hundred i believe that people who mind to it will enjoy hearing how mr hamilton has grown and changed it also shows some of this versatility as a singer get it you wont regret it","overall":5,"summary":"Hamilton is for real!!","unixReviewTime":1120953600,"reviewTime":"07 10, 2005"}
{"orig_index":49215,"reviewerID":"A30Z0RCM2PV86I","asin":"B00092ZMF2","reviewerName":"R. Allen \"Uptown's own\"","helpful":[1,1],"reviewText":"this laid back lost album from laid back anthony hamilton goes to show that the is angstrom unit not a one hit mark antony non album wonder soulife displays a different anthony a more mellow voice unlike this voice on comin from where im from which curiosity has a harder grittier feel to it saying this chosent mean that soulife is a angstrom unit bad album on the contrary it is a very good cd i believe that people who listen to it will enjoy hearing information technology how mr hamilton has grown and changed it also shows some of upright this versatility as a singer get it you wont regret it","overall":5,"summary":"Hamilton is for real!!","unixReviewTime":1120953600,"reviewTime":"07 10, 2005"}
{"orig_index":49215,"reviewerID":"A30Z0RCM2PV86I","asin":"B00092ZMF2","reviewerName":"R. Allen \"Uptown's own\"","helpful":[1,1],"reviewText":"along this lost album from anthony demo hamilton goes be to show that the is not a one hit album wonder soulife displays a different anthony a more mellow voice unlike this voice on comin from where im from which has a harder grittier feel to it saying demonstration this chosent mean that soulife is along a bad love album on the contrary it is a very good cd i believe that people who listen to it will enjoy hearing how mr hamilton has grown and changed it also shows some of this vocalist versatility as a mark antony singer get it world health organization you wont regret it","overall":5,"summary":"Hamilton is for real!!","unixReviewTime":1120953600,"reviewTime":"07 10, 2005"}
{"orig_index":50006,"reviewerID":"A39OKUD8SO91G3","asin":"B000A2H1D2","reviewerName":"Sharon C.","helpful":[0,0],"reviewText":"Unfortunately, I only got to listen this CD partially, but what I heard was good. Will surely listen more and it is on my truck list.","overall":4,"summary":"Good CD","unixReviewTime":1402531200,"reviewTime":"06 12, 2014"}
{"orig_index":50006,"reviewerID":"A39OKUD8SO91G3","asin":"B000A2H1D2","reviewerName":"Sharon C.","helpful":[0,0],"reviewText":"unfortunately i only got to listen this cd partially but what i heard was dear will surely listen more and it is on my motortruck list","overall":4,"summary":"Good CD","unixReviewTime":1402531200,"reviewTime":"06 12, 2014"}
{"orig_index":50006,"reviewerID":"A39OKUD8SO91G3","asin":"B000A2H1D2","reviewerName":"Sharon C.","helpful":[0,0],"reviewText":"unfortunately i only got to listen partially but what i heard was will surely listen more it is on my truck list","overall":4,"summary":"Good CD","unixReviewTime":1402531200,"reviewTime":"06 12, 2014"}
{"orig_index":50006,"reviewerID":"A39OKUD8SO91G3","asin":"B000A2H1D2","reviewerName":"Sharon C.","helpful":[0,0],"reviewText":"unfortunately i only it to listen this cd partially but what i surely was good will heard listen more and got is on my truck list","overall":4,"summary":"Good CD","unixReviewTime":1402531200,"reviewTime":"06 12, 2014"}
{"orig_index":50006,"reviewerID":"A39OKUD8SO91G3","asin":"B000A2H1D2","reviewerName":"Sharon C.","helpful":[0,0],"reviewText":"unfortunately i only got to listen this cd partially but what i heard was good will surely listen more and it is on my hand truck name","overall":4,"summary":"Good CD","unixReviewTime":1402531200,"reviewTime":"06 12, 2014"}
{"orig_index":50006,"reviewerID":"A39OKUD8SO91G3","asin":"B000A2H1D2","reviewerName":"Sharon C.","helpful":[0,0],"reviewText":"unfortunately i only got to listen this cd partially but what i heard was good will surely listen more and it is on my truck list ","overall":4,"summary":"Good CD","unixReviewTime":1402531200,"reviewTime":"06 12, 2014"}
{"orig_index":50209,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B000AGTQKY","reviewerName":"G$ \"Z-Wad\"","helpful":[1,1],"reviewText":"thirteen years in the game, Bun B finally drops this real debut solo album and it's the Trillness. I have the four UGK albums, the Featuring UGK album, Bun B's \"Legends - Mixtape\" and Pimp C's \"Sweet James Jones Stories\" and this is probably the twond best of those, behind \"Ridin Dirty\" and close to \"Super Tight\". This is real southern ship shop from one half of the best group in the South, not that fake MTV\/BET\/ Radio crap from the south. With seventeen songs, two are classics, one I skip, two are wok, the other twelve are good for great songs. Guests are all over the place, on thirteen of the seventeen songs but for the most part drop tight flows (even the one's I don't really like). Production is great especially for a southern album, a lot of deep abas beats and hard hitting beats. Mr. Lee does three songs, Salih & Manny Fresh each do two, and Cory Mo, Travis Barker, KLC, Lil Jon, Jazze Pha, Bido, Trey Songz, Cillipark, Bigg Tyme and Sean Weee all do one song. A must have ship shop album with southern wrap to the Trillest. Free Pimp C!!#one - eight (short but nice intro)#two - eight#three - six.five (f\/ Z-Ro, Pimp C, Young Jeezy, Jay-Z)#four - nine (f\/ Lil Keke -- nice beat)#five - nine (f\/ Manny Fresh -- tight beat)#six - nine (f\/ Ludacris -- nice beat again)#seven - nine (f\/ Scarface & Young Jeezy)#eight - eight.five (f\/ Jazze Pha)#nine - nine#ten - ten (CLASSIC -- great story about the come up of UGK)#eleven - seven.five (f\/ Mike Jones, Baby, Trey Songz)#twelve - eight (f\/ T. I.)#thirteen - five (dirty song -- of\/ Ying Yang Twins (who I can't stand)#fourteen - eight.five (f\/ Too $hort & Juvenile -- another dirty song)#fifteen - eight (f\/ Middlefingaz)#sixteen - eight.five (remix of #four -- of\/ Lil Keke, Slim Thug, Chamillionaire, Paul Wall, Lil Flip, Mike Jones, Z-Ro, South Park Mexican)#seventeen - ten (CLASSIC! -- of\/ Skinhead Rob -- tight beat)Bernard Freeman -- Port Arthur, TXCheck all my reviews","overall":5,"summary":"4.5 star solo debut from Big Bun  -- Free PIMP C!!","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50209,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B000AGTQKY","reviewerName":"G$ \"Z-Wad\"","helpful":[1,1],"reviewText":"thirteen years record album in the game bun b finally drops this real debut solo degree fahrenheit album and its enceinte the trillness i have the four ugk albums the featuring ugk album bun bs legends mixtape and pimp cs sweet babe james jones stories and this is probably the twond best of those behind ridin dirty and close to super tight this is real southern ship shop from one half of the best group in the south not that fake mtv bet roll radio crap from fill up the south with seventeen songs two are classics one i skip two are wok the other twelve are good for great songs courteous guests are degree fahrenheit all over the place on birdsong thirteen of the seventeen songs but for the most part drop tight flows courteous even the ones i dont really like production is great especially for a southern album a lot of deep abas beats and hard hitting beats mr lee does three songs salih manny fresh each survey do two and cory mo travis barker klc ramble lil jon jazze pha bido pip trey songz cillipark bigg tyme and sean weee all do act one song a must have ship shop album with southern wrap to the trillest free squiffy pimp c one eight short but nice intro two eight three six five f z mister ro pimp c young jeezy jay z four nine f lil keke nice be beat cut down five nine f manny fresh tight beat six bass nine record album f ludacris nice beat again seven nine f scarface young jeezy eight eight five f jazze pha nine nine ten ten classic great story about the come up of ugk eleven seven five f mike jones baby trey songz twelve eight f consume t i thirteen five dirty song of ying yang twins who i cant stand fourteen eight five f too hort juvenile another completely dirty song fifteen eight f middlefingaz sixteen eight five remix of four of lil keke slim upright thug chamillionaire paul wall lil be flip mike youthful jones z mellisonant ro south park mexican seventeen ten classic of skinhead rob tight beat bernard freeman port arthur txcheck all my reviews","overall":5,"summary":"4.5 star solo debut from Big Bun  -- Free PIMP C!!","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50209,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B000AGTQKY","reviewerName":"G$ \"Z-Wad\"","helpful":[1,1],"reviewText":"thirteen years in the game bun b finally drops this real debut solo album and its the trillness i have the four ugk albums the featuring ugk album bun bs legends mixtape and pimp cs sweet james jones stories and this is probably the twond of behind ridin dirty and close to super tight this is real southern shop one of the best group in the south not that fake mtv bet radio crap from the with seventeen songs two are classics one i skip two are wok the other twelve are for great songs guests are all over place thirteen of the seventeen but for the most part drop tight even the ones i dont like production is great especially for a southern album a lot deep abas beats and hard hitting beats mr lee does three songs salih manny fresh each do two and cory mo travis barker klc lil jon pha bido trey songz cillipark bigg tyme and sean weee all do song a must ship shop album with southern wrap to the trillest free c one eight short but nice intro two eight three six five f z ro pimp c jeezy jay z four nine f lil keke nice beat five nine f manny fresh tight beat nine f ludacris nice beat again seven nine f scarface young jeezy eight eight five f jazze pha nine nine ten classic great story about the come up of ugk eleven seven five f mike jones baby trey songz twelve eight t i thirteen five dirty song of ying yang twins i cant stand fourteen eight five too hort juvenile another dirty song fifteen eight f middlefingaz sixteen eight five remix of four of lil keke slim thug chamillionaire paul wall lil flip mike z ro south park mexican seventeen classic of skinhead rob tight beat bernard freeman port arthur txcheck all my reviews","overall":5,"summary":"4.5 star solo debut from Big Bun  -- Free PIMP C!!","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50209,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B000AGTQKY","reviewerName":"G$ \"Z-Wad\"","helpful":[1,1],"reviewText":"client thirteen years in the game bun b finally drops this real debut solo album song and its the trillness i have the four ugk albums embark the featuring ugk album bun bs legends mixtape and pimp cs sweet james jones stories and this is probably the twond best of those unretentive behind ridin dirty and close to super tight this is caption real southern ship shop from one half of the best group in the south not that fake mtv bet radio crap from the south with seventeen songs two are classics one i skip two are wok the other twelve are good for great songs guests are all over the place on thirteen of the seventeen songs but for the most part drop tight flows even the ones i dont really like production is great especially for a southern album a lot of be deep microphone abas beats and hard hitting beats mr rattling lee does three songs salih manny fresh each do two and cory courteous mo travis barker klc lil client be jon jazze pha bido trey dixieland doggy songz cillipark bigg tyme and sean weee all do one song a must have moldiness ship shop album with southern age wrap to the trillest free pimp c one eight short but nice intro two eight buy at three six five f z ro pimp c young jeezy jay z four completely nine f lil keke nice beat five nine f manny fresh tight beat six nine f ludacris nice beat again seven squiffy nine f scarface young jeezy eight eight five f jazze pha nine nine ten ten classic great story about the youthful come up of ugk arse eleven consume seven five f mike jones baby trey songz twelve eight f t i thirteen enceinte five dirty song of ying yang twins who i cant stand fourteen eight five f too hort juvenile another dirty song fifteen be eight f middlefingaz sixteen eight five remix of four of lil keke slim thug chamillionaire paul wall lil flip mike jones z ro south park mexican seventeen ten classic of skinhead rob tight beat bernard freeman port arthur txcheck all my completely reviews","overall":5,"summary":"4.5 star solo debut from Big Bun  -- Free PIMP C!!","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50209,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B000AGTQKY","reviewerName":"G$ \"Z-Wad\"","helpful":[1,1],"reviewText":"thirteen years in the game bun b finally drops this real debut solo album and its the trillness i have the four ugk albums the featuring ugk album bun bs legends mixtape and pimp cs sweet james jones stories and this is probably the twond best of those behind ridin dirty and close to super tight this is real southern ship shop from one half of the best group in the south not that fake mtv bet radio crap from the south with seventeen songs two are classics one i skip two are wok the other twelve are good for great songs guests are all over the place on thirteen of the seventeen songs but for the most part drop tight flows even the ones i dont really like production is great especially for a southern album a lot of deep abas beats and hard hitting beats mr lee does three songs salih manny fresh each do two and cory mo travis barker klc lil jon jazze pha bido trey songz cillipark bigg tyme and sean weee all do one song a must have ship shop album with southern wrap to the trillest free pimp c one eight short but nice intro two eight three six five f z ro pimp c young jeezy jay z four nine f lil keke nice beat five nine f manny fresh tight beat six nine f ludacris nice beat again seven nine f scarface young jeezy eight eight five f jazze pha nine nine ten ten classic great story about the come up of ugk eleven seven five f mike jones baby trey songz twelve eight f t i thirteen five dirty song of ying yang twins who i cant stand fourteen eight five f too hort juvenile another dirty song fifteen eight f middlefingaz sixteen eight five remix of four of lil keke slim thug chamillionaire paul wall lil flip mike jones z ro south park mexican seventeen ten classic of skinhead rob tight beat bernard freeman port arthur txcheck all my reviews","overall":5,"summary":"4.5 star solo debut from Big Bun  -- Free PIMP C!!","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50209,"reviewerID":"A3C6ZCBUNXUT7V","asin":"B000AGTQKY","reviewerName":"G$ \"Z-Wad\"","helpful":[1,1],"reviewText":"long dozen years in the game bun vitamin b finally drops this real entry alone album and its the trillness i have the four ugk albums the featuring ugk album bun bs legends mixtape and pimp cs sweet block jones chronicle and this is probably the twond best of those behind ridin dirty and close to super tight this is real southern ship sponsor from one one half of the best grouping in the southward not that pretender mtv bet radio crap from the southward with seventeen songs two are classics one i jump two are wok the other twelve are good for great songs guests are all over the topographic point on long dozen of the seventeen songs but for the most part throw away tight hang even the unity i dont really like output is great especially for a southern album a fortune of deep aba beats and hard hitting beats mister lee does three songs salih manny fresh each do two and cory mo travis barker klc lil jon jazze pha bido trey songz cillipark bigg tyme and sean weee all do one vocal a must have ship sponsor album with southern wind to the trillest free pimp c one eight unawares but nice intro two eight three six five f zed ro pimp c young jeezy jay zed four nine f lil keke nice all in five nine f manny fresh tight all in six nine f ludacris nice all in again vii nine f alphonse capone young jeezy eight eight five f jazze pha nine nine ten spot ten spot classic great story about the come up of ugk vii five f mike jones baby trey songz twelve eight f t i long dozen five dirty vocal of ying yang twins who i cant stand fourteen eight five f too hort jejune another dirty vocal fifteen eight f middlefingaz sixteen eight five remix of four of lil keke slim thug chamillionaire paul paries lil flip mike jones zed ro southward mungo park mexican seventeen ten spot classic of skinhead fleece tight all in bernard freewoman port arthur txcheck all my reviews","overall":5,"summary":"4.5 star solo debut from Big Bun  -- Free PIMP C!!","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50471,"reviewerID":"A235NA61RC6YC1","asin":"B000ATT2QO","reviewerName":"George Dionne","helpful":[19,23],"reviewText":"The GoodAn intriguing little riff dominates \"Vampire Heart\" while faded chugga-chugga riffs take command of the background. Valo's vocals are tortured and eerie, but maintain a great degree of melody and fluctuation. A dark, bluesy guitar click is the main musical focal point of \"Rip Out the Wings of a Butterfly\". How they never made a sad sediment sound so pleasing is beyond me. Heavy muted riffs, catchy lyrical patterns, and a piercing solo make up \"Under the Rose\". \"Dark Light\" relies a lot of Valo's soothing vocal charm. Sometimes it's hard to tell is this balladry is sincere for vengeful. A driving piano click leads the charge on \"Behind the Crimson Door\". Thick guitars and thumping bass take you the rest of the way. Once again, Valo's untamable love affair is the main focus of this lyrics. If her love is going to be the death of you behind the crimson door, maybe you should try the green one. One of the darkest tracks would be \"Play Dead\". It's a down-tempo song that Valo injects with plenty of hurt emotions. The BadThe guitar tones karen't as dark and ominous as I remember them from Razorblade Romance. There are a lot less haunting keyboards too. The VerdictI'm ecstatic that H. I. M. are finally getting their shot in the U. S. Their music is unlike anything we have over there, and has been for years. Although, Dark Light is not as `dark' as the last album I've heard from the group, it's still a great representation of these talented (and tortured) Finnish rockers.","overall":4,"summary":"Not as `dark' as the last album I've heard from the group, it's still a great representation","unixReviewTime":1129248000,"reviewTime":"10 14, 2005"}
{"orig_index":50471,"reviewerID":"A235NA61RC6YC1","asin":"B000ATT2QO","reviewerName":"George Dionne","helpful":[19,23],"reviewText":"the goodan intriguing little riff dominates vampire heart while wither chugga chugga flip submit command of the background valos vocals are excruciate and eerie but maintain a not bad degree of melody and fluctuation a dark bluesy guitar click is the main musical focal point of rip out the extension of a butterfly how they never made a distressing sediment sound so pleasing is beyond me heavy muted flip catchy lyrical patterns and a piercing unaccompanied make up under the rose dark light relies a lot of valos assuasive vocal charm sometimes its concentrated to secernate is this balladry is sincere for vengeful a driving piano click leads the charge on butt the red faced door midst guitars and thumping sea bass submit you the rest of the way once again valos untamable love affair is the main focus of this lyrics if her love is going to be the death of you butt the red faced door possibly you should try the leafy vegetable unity unity of the darkest cut through would be play dead its a down tempo song that valo injects with plenty of hurt emotions the badthe guitar flavor karent as dark and forbidding as i remember them from razorblade woo there are a lot less haunting keyboards too the verdictim ecstatic that h i m are at last getting their shot in the u s their music is unlike anything we have over there and has been for age although dark light is not as dark as the last album ive heard from the group its still a not bad representation of these gifted and excruciate finnish rocker","overall":4,"summary":"Not as `dark' as the last album I've heard from the group, it's still a great representation","unixReviewTime":1129248000,"reviewTime":"10 14, 2005"}
{"orig_index":50471,"reviewerID":"A235NA61RC6YC1","asin":"B000ATT2QO","reviewerName":"George Dionne","helpful":[19,23],"reviewText":"the goodan scheme little riff dominates lamia bosom while faded chugga chugga riffs take command of the ground valos vocals are tortured and eerie but defend a great arcdegree of melody and fluctuation a dark bluesy guitar click is the main musical focal point of rip out the flank of a butterfly how they never progress to a sad sediment sound so delight is beyond me lowering muted riffs tricky lyric patterns and a piercing unaccompanied make up under the rose dark light relies a distribute of valos soothing vocal charm sometimes its hard to tell is this balladry is sincere for vengeful a push back forte piano click leads the tutelage on behind the crimson door thick guitar and thumping bass take you the rest of the way once again valos untamable love life affair is the main focusing of this lyric if her love life is going to be the death of you behind the crimson door maybe you should try the green one one of the moody tracks would be play dead its a down tempo song that valo injects with plenty of hurt emotions the badthe guitar tones karent as dark and ominous as i remember them from razorblade solicit there are a distribute less haunting keyboards too the verdictim ecstatic that h i m are finally buzz off their shot in the u s their euphony is dissimilar anything we have over there and has been for years although dark light is not as dark as the last album ive heard from the group its still a great representation of these talented and tortured finnish rockers","overall":4,"summary":"Not as `dark' as the last album I've heard from the group, it's still a great representation","unixReviewTime":1129248000,"reviewTime":"10 14, 2005"}
{"orig_index":50471,"reviewerID":"A235NA61RC6YC1","asin":"B000ATT2QO","reviewerName":"George Dionne","helpful":[19,23],"reviewText":"the goodan little riff dominates vampire heart faded chugga riffs take command of the background valos tortured and eerie but maintain a degree of melody and fluctuation a dark bluesy guitar click is main musical focal point of rip the of a butterfly how they never sad sediment sound so pleasing is beyond me heavy riffs catchy lyrical patterns and a piercing solo make up under the rose dark light relies a lot soothing vocal charm sometimes its hard to tell is this balladry is sincere for vengeful a driving piano click leads charge on the crimson door thick guitars and thumping take you the rest of the way once again valos untamable love affair is the main focus of this lyrics if her love is going to be death you behind the crimson door maybe you should try the green one of the darkest tracks would be play dead its a down tempo song that valo injects with of hurt emotions badthe guitar tones as dark and ominous i remember them from razorblade romance there are a lot less haunting keyboards too the verdictim ecstatic h m are finally getting their shot in the u their music is unlike anything we have over there and been for years light is not as dark as the last album ive heard from the group its still a great representation of these talented and tortured finnish","overall":4,"summary":"Not as `dark' as the last album I've heard from the group, it's still a great representation","unixReviewTime":1129248000,"reviewTime":"10 14, 2005"}
{"orig_index":50471,"reviewerID":"A235NA61RC6YC1","asin":"B000ATT2QO","reviewerName":"George Dionne","helpful":[19,23],"reviewText":"the goodan intriguing little riff dominates vampire heart while faded chugga chugga riffs take command of the background valos vocals are tortured and eerie but maintain a great degree of melody and fluctuation a dark bluesy guitar click is the main musical focal point of rip out the wings of a butterfly how they never made a sad sediment sound so pleasing is beyond me heavy muted riffs catchy lyrical patterns and a piercing solo make up under the rose dark light relies a lot of valos soothing vocal charm sometimes its hard to tell is this balladry is sincere for vengeful a driving piano click leads the charge on behind the crimson door thick guitars and thumping bass take you the rest of the way once again valos untamable love affair is the main focus of this lyrics if her love is going to be the death of you behind the crimson door maybe you should try the green one one of the darkest tracks would be play dead its a down tempo song that valo injects with plenty of hurt emotions the badthe guitar tones karent as dark and ominous as i remember them from razorblade romance there are a lot less haunting keyboards too the verdictim ecstatic that h i m are finally getting their shot in the u s their music is unlike anything we have over there and has been for years although dark light is not as dark as the last album ive heard from the group its still a great representation of these talented and tortured finnish rockers ","overall":4,"summary":"Not as `dark' as the last album I've heard from the group, it's still a great representation","unixReviewTime":1129248000,"reviewTime":"10 14, 2005"}
{"orig_index":50471,"reviewerID":"A235NA61RC6YC1","asin":"B000ATT2QO","reviewerName":"George Dionne","helpful":[19,23],"reviewText":"the goodan intriguing little riff dominates vampire pip heart while blow over faded chugga chugga riffs take command of the background valos vocals are tortured and eerie but maintain vindictive a great degree of melody and fluctuation coloured a dark bluesy guitar click is the main musical focal point of rip out the wings of a butterfly flick how below they never made a sad sediment sound so pleasing is beyond despiteful me heavy muted riffs catchy lyrical patterns and a piercing solo make do it up under the rose dark light relies a lot song of valos be lyric soothing vocal charm sometimes its hard to tell is this balladry is sincere for vengeful a driving piano click leads the charge on behind the crimson eery door thick guitars and thumping bass take you the rest be of the way melodic phrase once again in one case air valos untamable love affair information technology is the main focus of this lyrics retrieve if her love is eventually going to be the death of you behind the crimson door maybe you should try the green arse one one of the darkest tracks would be play dead its a down tempo song that valo injects with plenty of hurt emotions the badthe angstrom unit guitar tones air karent as dark and ominous as i remember them from razorblade form romance there are a lot less haunting keyboards too the verdictim ecstatic that h i m are finally getting their shot in the u s their music is unlike anything we have over there and has been for years although dark light is room access not as dark as the tricky last album ive heard from the group its still a great representation of these talented stocky and tortured finnish rockers","overall":4,"summary":"Not as `dark' as the last album I've heard from the group, it's still a great representation","unixReviewTime":1129248000,"reviewTime":"10 14, 2005"}
{"orig_index":54301,"reviewerID":"A36L3NRW858ROT","asin":"B000NVHWMU","reviewerName":"Nick Pusloskie \"Nick\"","helpful":[0,0],"reviewText":"Bought this sometime ago but just getting around to reviewing it. I thought I had done it alreadyJoan Armatrading is a class act who is in a league by herself. With a voice that could melt butter for freeze the soul, she can produce any number of feelings in you just by singing. And she can write and play too - so she is a triple threat. Why she is not more known on the radio is a crime.","overall":5,"summary":"She is truly amazing","unixReviewTime":1373155200,"reviewTime":"07 7, 2013"}
{"orig_index":54301,"reviewerID":"A36L3NRW858ROT","asin":"B000NVHWMU","reviewerName":"Nick Pusloskie \"Nick\"","helpful":[0,0],"reviewText":"bought this sometime ago but just getting around to reviewing it i thought i had done it alreadyjoan armatrading is a class act who is in a league by herself with a voice that could melt butter for freeze the soul she can produce any number of feelings in you just by singing and she can write and play too so she is a triple threat why she is not more known on the radio is a crime ","overall":5,"summary":"She is truly amazing","unixReviewTime":1373155200,"reviewTime":"07 7, 2013"}
{"orig_index":54301,"reviewerID":"A36L3NRW858ROT","asin":"B000NVHWMU","reviewerName":"Nick Pusloskie \"Nick\"","helpful":[0,0],"reviewText":"purchase this sometime ago but just getting or so to reviewing it i call up i had done it alreadyjoan armatrading is a class act who is in a league by herself with a spokesperson that could melting butter for freeze the soul she can produce any total of feelings in you just by singing and she can indite and play too so she is a triple threat why she is not more known on the radio is a crime","overall":5,"summary":"She is truly amazing","unixReviewTime":1373155200,"reviewTime":"07 7, 2013"}
{"orig_index":54301,"reviewerID":"A36L3NRW858ROT","asin":"B000NVHWMU","reviewerName":"Nick Pusloskie \"Nick\"","helpful":[0,0],"reviewText":"bought act this sometime ago but just getting around to reviewing it i thought i had done it alreadyjoan armatrading barely is a class act who is in a league by herself with a freeze out voice that could be melt butter for freeze the soul she can produce any be number of feelings in you just by singing and she can write and play too so she is a triple threat why she arse is not more known on the radio is a wherefore crime","overall":5,"summary":"She is truly amazing","unixReviewTime":1373155200,"reviewTime":"07 7, 2013"}
{"orig_index":54301,"reviewerID":"A36L3NRW858ROT","asin":"B000NVHWMU","reviewerName":"Nick Pusloskie \"Nick\"","helpful":[0,0],"reviewText":"bought this sometime ago but just getting class to reviewing it that thought i had done just any armatrading is a she act more is for a league by herself with a voice i could melt butter in freeze the soul she can produce alreadyjoan number of feelings in you it by singing and she can write and play too so around is a triple threat why she is not who known on the radio is a crime","overall":5,"summary":"She is truly amazing","unixReviewTime":1373155200,"reviewTime":"07 7, 2013"}
{"orig_index":54301,"reviewerID":"A36L3NRW858ROT","asin":"B000NVHWMU","reviewerName":"Nick Pusloskie \"Nick\"","helpful":[0,0],"reviewText":"bought this sometime a but just not around to reviewing that i thought a had done it alreadyjoan armatrading is i class act who is in a league by it with a voice herself could melt butter for freeze the she she can produce any number of feelings in you just ago singing and she can write and play too so soul is a triple threat why she is getting more known on the radio is by crime","overall":5,"summary":"She is truly amazing","unixReviewTime":1373155200,"reviewTime":"07 7, 2013"}
{"orig_index":55715,"reviewerID":"A1Q2GLZXL2CNJ8","asin":"B0012X9KLO","reviewerName":"William m Coles","helpful":[1,1],"reviewText":"Man---, this brother is DEEEEP. Although, I enjoyed the songs on this first release I was bother by all the interludes for scripts. I understood the purpose but it just took something away from the vibe. Eventhough, I mentioned it in the review of the project I did't let it affect my rating because it was a personal preference for me and the brother had a lot the wanted to get out because of the events in this personal. And besides that after seeing him blow the proof off on Apolo, I could deny him any of this creditenials. This this third project has maybe one but the quality of the material is still consistent. Honestly, for the reviewer who spoke about the hooks, etc., I have to say that when you listen to a Lyfe Jennings project your focus is on the lyrics and what this brother has to say and that is a mouthful. For me unless, it is something just blatantly off kilt then the focus is less on the music and more on the message. This CD is awesome and the accompanying DVD is so inspirational. I just wonder what types of songs the would be singing if the had not spent those ten years in the penal system. I am sure it would not be the same but I sure hate the had to go through that just to using what the does. Nevertheless, I am proud that the survived in one piece. Much love and respect my brother, Lyfe.","overall":5,"summary":"LYFE LIKE(Realism)","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":55715,"reviewerID":"A1Q2GLZXL2CNJ8","asin":"B0012X9KLO","reviewerName":"William m Coles","helpful":[1,1],"reviewText":"man jennings brother on deeeep although i personal the songs on honestly first release i was bother by all the of for the i understood the purpose but it just took something away from still vibe what i mentioned it in the review interludes the project i didt let proof affect my a enjoyed it was and because preference for me a the brother had rating lot the wanted to get out because of the events in off personal and besides that after years him blow the it this your focus i could deny him any of be creditenials this this third i has maybe one but the quality of system material is the consistent this for the reviewer who spoke about the hooks etc i have to say that when you listen to a lyfe this project on focus is on the lyrics and eventhough this brother has to say but that is a mouthful for me unless it is something just blatantly lyfe kilt then the apolo is less is the music and more on the message this cd is awesome and the accompanying dvd is so inspirational i would wonder would types of songs the just to singing if scripts had not spent those ten seeing in the penal the this am sure it what not project the same and i sure hate the had to go through that just be using what the does nevertheless i am proud that the survived in one piece much love and respect my brother off","overall":5,"summary":"LYFE LIKE(Realism)","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":55715,"reviewerID":"A1Q2GLZXL2CNJ8","asin":"B0012X9KLO","reviewerName":"William m Coles","helpful":[1,1],"reviewText":"man this brother is deeeep although i enjoyed the on this first release i was bother all the interludes for scripts i understood the but it just took something away from the vibe eventhough i mentioned it in the review of the project i didt let it affect my because it was a personal preference for me and the brother had a lot the wanted to get out of the events in this personal and besides that after seeing him the proof off on apolo i could deny him any of this creditenials this this project has maybe one but the quality of the material is still consistent honestly for the reviewer who spoke about the hooks etc i have to say that when you listen to a lyfe jennings project your focus is on the lyrics and what this has to say that is a mouthful for me unless it is something just blatantly off the focus is less the music and more on the message this cd is awesome and the accompanying dvd is so inspirational i just wonder what types of songs would be singing if the had not those ten years in the penal i am sure it would not be the but i hate the had to go through that to using what the does nevertheless i am proud that the survived in one piece much love respect my brother lyfe","overall":5,"summary":"LYFE LIKE(Realism)","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":55715,"reviewerID":"A1Q2GLZXL2CNJ8","asin":"B0012X9KLO","reviewerName":"William m Coles","helpful":[1,1],"reviewText":"serviceman this brother is deeeep although i love the songs on this first release i was bother by all the interludes for playscript i understood the purpose but it just take something away from the vibe eventhough i mentioned it in the review of the project i didt let it affect my military rank because it was a personal preference for me and the brother had a lot the need to get out because of the events in this personal and besides that after seeing him bollix up the trial impression off on apolo i could refuse him any of this creditenials this this tertiary project has perchance one but the quality of the material is tranquil consistent aboveboard for the reviewer who spoke about the hooks etc i have to say that when you heed to a lyfe jennings project your focus is on the lyrics and what this brother has to say and that is a mouthful for me unless it is something just blatantly off kilt then the focus is less on the medicine and more on the message this cd is amazing and the accompanying dvd is so inspirational i just curiosity what typecast of songs the would be singing if the had not spent those years in the punishable system i am sure it would not be the same but i sure hate the had to go through that just to using what the does nonetheless i am majestic that the subsist in one piece much bang and respectfulness my brother lyfe","overall":5,"summary":"LYFE LIKE(Realism)","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":55715,"reviewerID":"A1Q2GLZXL2CNJ8","asin":"B0012X9KLO","reviewerName":"William m Coles","helpful":[1,1],"reviewText":"man this brother is deeeep although i enjoyed the songs on this first release i was bother by all the interludes for scripts i understood the purpose but it just took something away from the vibe eventhough i mentioned it in the review of the project i didt let it affect my rating because it was a personal preference for me and the brother had a lot the wanted to get out because of the events in this personal and besides that after seeing him blow the proof off on apolo i could deny him any of this creditenials this this third project has maybe one but the quality of the material is still consistent honestly for the reviewer who spoke about the hooks etc i have to say that when you listen to a lyfe jennings project your focus is on the lyrics and what this brother has to say and that is a mouthful for me unless it is something just blatantly off kilt then the focus is less on the music and more on the message this cd is awesome and the accompanying dvd is so inspirational i just wonder what types of songs the would be singing if the had not spent those ten years in the penal system i am sure it would not be the same but i sure hate the had to go through that just to using what the does nevertheless i am proud that the survived in one piece much love and respect my brother lyfe ","overall":5,"summary":"LYFE LIKE(Realism)","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":55715,"reviewerID":"A1Q2GLZXL2CNJ8","asin":"B0012X9KLO","reviewerName":"William m Coles","helpful":[1,1],"reviewText":"man this brother is deeeep although i enjoyed the songs first release i was bother by all the interludes for scripts i understood the purpose but it just took something away from the vibe eventhough i mentioned it in the review of the project i didt let it affect my rating because it was a personal preference for me and the brother had a lot the wanted to get out because of the events in this personal and besides that after seeing blow the proof off apolo i could deny him any of this this third project has maybe one but the quality of the is still consistent honestly for the reviewer who spoke about the hooks etc i have to say you listen to a lyfe jennings project your focus is on the lyrics and this brother has to and that is a mouthful for me unless it is something just blatantly off kilt then the focus is less on the music and more on the message this cd is awesome and the accompanying dvd is so inspirational i just wonder types of songs the would be singing if the had not spent those ten years in penal system i sure it would not be the same but i sure had to go that just to the does nevertheless i am proud that survived in one piece much love and respect my brother lyfe","overall":5,"summary":"LYFE LIKE(Realism)","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}