{"orig_index":1737,"reviewerID":"A138I6EVRRRR5I","asin":"B000000OUU","reviewerName":"Kurt Olav Helle \"Kurt Olav Experience\"","helpful":[7,7],"reviewText":"Henley`s solo collection is not a mixed bag of music. Actual Miles shines quality all over. From the opening track Dirty Laundry, with a very good tabloid critique of the media society, which still holds up today, to the last track. This CD shines. But how can you possible go wrong when you move into The Boys of Summer on Track two. You can real feel the summer breeze shivering trough your soul on this one. An open soundpicture with a somekind of air feel to with it. Uplifting. Track four It`s not enough love in this world is also a winner. It`s moody and have enough tempo upbeat to make you a happier human being. And the lyrics tell you things to think about too. But the real winner and my old time Henley favourite is Track six The End of the Innocence. The opening with the piano. It`s pure music magic. And when Henley`s voice is put in gear. This is what music should be. It`s like a short movie in a way. Just close your eyes, and listening. Anyway if you new to Henley this one gives you an earopener when it comes to pure gold quality all trough","overall":5,"summary":"The ultimate Henley collection. This one rules","unixReviewTime":1131494400,"reviewTime":"11 9, 2005"}
{"orig_index":1737,"reviewerID":"A138I6EVRRRR5I","asin":"B000000OUU","reviewerName":"Kurt Olav Helle \"Kurt Olav Experience\"","helpful":[7,7],"reviewText":"henley s solo collection is not a mixed bag of music actual sulphur flick miles shines quality all tranquil over from the wrongly move opening track dirty laundry with a very good tabloid critique of the media society which still holds up today to the last track this cd shines rails but how can upright you possible go wrong when you move into the boys of summer on track two you can real feel the summer breeze shivering trough your soul on this one an open arse soundpicture with a somekind of air feel to with it uplifting track four it rattling s not sheet enough love in this world is also a winner it s moody and have enough tempo upbeat to make you a happier human being and the lyrics tell you things to think about too but the real winner and my old time henley favourite is track six the end of the innocence the opening with the piano it sodding s pure music magic and when henley s mass medium angstrom unit voice is put in gear this is what music should be it s like a short movie in track a way just close your eyes and listening anyway if you mass medium new corresponding to henley this one gives you an ass be earopener words when victor it comes to pure gold quality all trough","overall":5,"summary":"The ultimate Henley collection. This one rules","unixReviewTime":1131494400,"reviewTime":"11 9, 2005"}
{"orig_index":1737,"reviewerID":"A138I6EVRRRR5I","asin":"B000000OUU","reviewerName":"Kurt Olav Helle \"Kurt Olav Experience\"","helpful":[7,7],"reviewText":"henley s solo collection is not a mixed bag of music actual miles shines quality all over from the opening track dirty laundry with a very good tabloid critique of the media society which still holds up today to the last track this cd shines but how can you possible go wrong when you move into the boys of summer on track two you can real feel the summer breeze shivering trough your soul on this one an open soundpicture with a somekind of air feel to with it uplifting track four it s not enough love in this world is also a winner it s moody and have enough tempo upbeat to make you a happier human being and the lyrics tell you things to think about too but the real winner and my old time henley favourite is track six the end of the innocence the opening with the piano it s pure music magic and when henley s voice is put in gear this is what music should be it s like a short movie in a way just close your eyes and listening anyway if you new to henley this one gives you an earopener when it comes to pure gold quality all trough","overall":5,"summary":"The ultimate Henley collection. This one rules","unixReviewTime":1131494400,"reviewTime":"11 9, 2005"}
{"orig_index":1737,"reviewerID":"A138I6EVRRRR5I","asin":"B000000OUU","reviewerName":"Kurt Olav Helle \"Kurt Olav Experience\"","helpful":[7,7],"reviewText":"henley s solo collection is not a mixed bag of music miles shines quality all over from the opening track dirty laundry with a very good tabloid critique of the media still holds up today to the last track this cd shines but how can you possible go when you move into the boys of summer on track two you can real feel the summer breeze shivering trough your soul on this one open soundpicture with a somekind of air feel to with it uplifting track it s not enough love in this world is also a winner it s moody and enough tempo upbeat to make you human being the tell you things to think about too but the real winner and my old time henley favourite is six the of the innocence the opening with the piano it s pure music magic and when henley s voice is put in gear this is what music should it s like a movie in a way just close your eyes and listening anyway if you new to henley this one gives you an earopener when it to pure quality all trough","overall":5,"summary":"The ultimate Henley collection. This one rules","unixReviewTime":1131494400,"reviewTime":"11 9, 2005"}
{"orig_index":1737,"reviewerID":"A138I6EVRRRR5I","asin":"B000000OUU","reviewerName":"Kurt Olav Helle \"Kurt Olav Experience\"","helpful":[7,7],"reviewText":"henley s solo collection is not a mixed bag of music actual miles shines quality all over from the chess opening track dirty laundry with a very good tabloid critique of the sensitive society which tranquillise bear up today to the last track this cd shines but how can you possible go ill timed when you move into the son of summer on track ii you can real feel the summer breeze shivering bowl your somebody on this one an open soundpicture with a somekind of air feel to with it uplifting track quaternary it s not enough passion in this world is besides a winner it s moody and have enough tempo upbeat to make you a happier human being being and the lyrics distinguish you affair to think about too but the real winner and my old time henley dearie is track six the end of the innocence the chess opening with the piano it s pure music legerdemain and when henley s voice is put in gear this is what music should be it s ilk a short movie in a way just close your eyes and listening anyway if you newly to henley this one move over you an earopener when it comes to pure gold quality all bowl","overall":5,"summary":"The ultimate Henley collection. This one rules","unixReviewTime":1131494400,"reviewTime":"11 9, 2005"}
{"orig_index":1737,"reviewerID":"A138I6EVRRRR5I","asin":"B000000OUU","reviewerName":"Kurt Olav Helle \"Kurt Olav Experience\"","helpful":[7,7],"reviewText":"henley s solo collection not a mixed bag of music actual miles shines all over from the track dirty with a very good tabloid critique of the media society which still holds up today to the last track this cd shines but how can you possible go wrong when you into the boys of summer on track two you can real feel the summer breeze shivering trough your soul on this one an open soundpicture a somekind of air feel with it uplifting track four it s not enough in this world also a winner it s moody and have enough upbeat to you a happier human being the lyrics tell you things to think about too but the real winner and my old time henley favourite is track the end of the innocence the opening with the it s pure music magic and when henley s voice is put in gear this is what should be like a short movie in a way close your eyes listening anyway if you new to henley this one gives you an earopener when it comes to pure gold quality all trough","overall":5,"summary":"The ultimate Henley collection. This one rules","unixReviewTime":1131494400,"reviewTime":"11 9, 2005"}
{"orig_index":6481,"reviewerID":"A3ROZK0G84RGMZ","asin":"B0000024JN","reviewerName":"IJustDiedAlive","helpful":[0,0],"reviewText":"Anyway this cd deserves to be remastered and are-released for it's twentyth anniversary. I think def jam can afford that.","overall":5,"summary":"Twenty Years and Still Standing","unixReviewTime":1149552000,"reviewTime":"06 6, 2006"}
{"orig_index":6481,"reviewerID":"A3ROZK0G84RGMZ","asin":"B0000024JN","reviewerName":"IJustDiedAlive","helpful":[0,0],"reviewText":"anyway this cd deserves to be remastered and are released for its twentyth anniversary i think def jam can afford that ","overall":5,"summary":"Twenty Years and Still Standing","unixReviewTime":1149552000,"reviewTime":"06 6, 2006"}
{"orig_index":6481,"reviewerID":"A3ROZK0G84RGMZ","asin":"B0000024JN","reviewerName":"IJustDiedAlive","helpful":[0,0],"reviewText":"anyway this cd deserve to be remastered and are released for its twentyth anniversary i think def jam can open that","overall":5,"summary":"Twenty Years and Still Standing","unixReviewTime":1149552000,"reviewTime":"06 6, 2006"}
{"orig_index":6481,"reviewerID":"A3ROZK0G84RGMZ","asin":"B0000024JN","reviewerName":"IJustDiedAlive","helpful":[0,0],"reviewText":"anyway this certificate of deposit deserves to be remastered and are released for its twentyth anniversary i think def jam can open that","overall":5,"summary":"Twenty Years and Still Standing","unixReviewTime":1149552000,"reviewTime":"06 6, 2006"}
{"orig_index":6481,"reviewerID":"A3ROZK0G84RGMZ","asin":"B0000024JN","reviewerName":"IJustDiedAlive","helpful":[0,0],"reviewText":"remastered anniversary cd deserves to be anyway and are released for its twentyth this i think def jam can afford that","overall":5,"summary":"Twenty Years and Still Standing","unixReviewTime":1149552000,"reviewTime":"06 6, 2006"}
{"orig_index":6481,"reviewerID":"A3ROZK0G84RGMZ","asin":"B0000024JN","reviewerName":"IJustDiedAlive","helpful":[0,0],"reviewText":"anyway this cd deserves to be remastered and are released for its twentyth anniversary information technology hole i think def jam can afford that","overall":5,"summary":"Twenty Years and Still Standing","unixReviewTime":1149552000,"reviewTime":"06 6, 2006"}
{"orig_index":6569,"reviewerID":"A3KENOAUKTWZJL","asin":"B0000024LN","reviewerName":"SxS","helpful":[0,0],"reviewText":"Muddy an Dare biz a Darkside are this great albums. Iz He four Real!!!,Welcome,Case Closed!!!,Picc It Up,Smoke Buddah,Whateva Man!!! aft The Green Eye Bandit,Creepin,It's Like That{My Big Brother},Soopaman Luva three, & Da will Out!!!{Muddy Waters. We Out Fa ninety-seven Word Up Son Peace}.","overall":5,"summary":"A Muddy F'ing Classic","unixReviewTime":1375488000,"reviewTime":"08 3, 2013"}
{"orig_index":6569,"reviewerID":"A3KENOAUKTWZJL","asin":"B0000024LN","reviewerName":"SxS","helpful":[0,0],"reviewText":"logos muddy an dare biz a darkside are this great albums iz he four real welcome case closed picc it up smoke buddah whateva man aft the green eye bandit creepin its like that enceinte my military man daring big brother soopaman luva three da will out muddy waters we out fa ninety seven word up son peace","overall":5,"summary":"A Muddy F'ing Classic","unixReviewTime":1375488000,"reviewTime":"08 3, 2013"}
{"orig_index":6569,"reviewerID":"A3KENOAUKTWZJL","asin":"B0000024LN","reviewerName":"SxS","helpful":[0,0],"reviewText":"muddy an dare biz a darkside are this great albums iz he four real welcome case closed picc it up smoke buddah whateva man aft the green eye bandit creepin its like that my big brother soopaman luva three da will out muddy waters we out fa ninety seven word up son peace ","overall":5,"summary":"A Muddy F'ing Classic","unixReviewTime":1375488000,"reviewTime":"08 3, 2013"}
{"orig_index":6569,"reviewerID":"A3KENOAUKTWZJL","asin":"B0000024LN","reviewerName":"SxS","helpful":[0,0],"reviewText":"muddy an dare biz a darkside are this great albums iz he four real case closed picc up smoke buddah whateva man aft the green eye bandit its like that my big brother soopaman luva three will out waters we out fa ninety seven word up son","overall":5,"summary":"A Muddy F'ing Classic","unixReviewTime":1375488000,"reviewTime":"08 3, 2013"}
{"orig_index":6569,"reviewerID":"A3KENOAUKTWZJL","asin":"B0000024LN","reviewerName":"SxS","helpful":[0,0],"reviewText":"muddy an dare biz son darkside are this great albums iz he four muddy real case closed picc it up smoke buddah whateva man a the green eye bandit creepin its like that my big brother soopaman luva three da will out peace waters we out fa ninety seven word up aft welcome","overall":5,"summary":"A Muddy F'ing Classic","unixReviewTime":1375488000,"reviewTime":"08 3, 2013"}
{"orig_index":6569,"reviewerID":"A3KENOAUKTWZJL","asin":"B0000024LN","reviewerName":"SxS","helpful":[0,0],"reviewText":"muddy an dare biz a darkside are this great record album iz he four real welcome case closed picc it up fume buddah whateva man aft the green eye bandit creepin its like that my big brother soopaman luva three district attorney will out muddy waters we out fa ninety septenary word up son peacefulness","overall":5,"summary":"A Muddy F'ing Classic","unixReviewTime":1375488000,"reviewTime":"08 3, 2013"}
{"orig_index":8559,"reviewerID":"AV5G37VFE5NVD","asin":"B0000025UZ","reviewerName":"Tom Benton","helpful":[0,0],"reviewText":"Somehow those wily Aussies evaded the Laws of Pop, and, in doing so, avoided becoming One-Hit Wonders. On their second album, they sound more confident, more serious, and more loose, as evidenced by songs like \"Overkill,\" a far cry from the zany foreign romp of \"Down Under.\" \"At least there's pretty flights,\" Hays sings. \"And though there's little variation\/It nullifies the night\/From overkill.\" Guitarist Ron Strykert contributes two songs, the first a nice, old-fashioned rock parable that disrupts the tough space set in motion by the wonderful \"Dr. Heckyll & Mr. Jive\" (\"They are a person who feels good to be alive\"), the second a standard New Wave anthem that turns into a sort-of listener-abusive guitar showcase. It's Hays' music that has vision and grace. Musings: \"I like it upstairs in my house;\" \"Metal ships are falling;\" \"Laugh at the reflections of cat's eyes on the road\/Freeways hypnotise me.\"","overall":4,"summary":"Heavier cargo, looser cargo, better ride","unixReviewTime":1248739200,"reviewTime":"07 28, 2009"}
{"orig_index":8559,"reviewerID":"AV5G37VFE5NVD","asin":"B0000025UZ","reviewerName":"Tom Benton","helpful":[0,0],"reviewText":"somehow those wily aussies evaded the laws of pop and in doing so avoided becoming one hit wonders on their second album they sound more confident more serious and more loose as evidenced by songs like overkill a far cry from the zany foreign romp of down under at least theres pretty flights hays sings and though theres little variation it nullifies the night from overkill guitarist ron strykert contributes two songs the first a nice old fashioned rock parable that disrupts the tough space set in motion by the wonderful dr heckyll mr jive they are a person who feels good to be alive the second a standard new wave anthem that turns into a sort of listener abusive guitar showcase its hays music that has vision and grace musings i like it upstairs in my house metal ships are falling laugh at the reflections of cats eyes on the road freeways hypnotise me ","overall":4,"summary":"Heavier cargo, looser cargo, better ride","unixReviewTime":1248739200,"reviewTime":"07 28, 2009"}
{"orig_index":8559,"reviewerID":"AV5G37VFE5NVD","asin":"B0000025UZ","reviewerName":"Tom Benton","helpful":[0,0],"reviewText":"somehow those wily aussies evaded the laws of pop up and in doing so avoided becoming one hit wonders on their second record album they sound more sure footed more serious and more light as evidenced by songs like overkill a far cry from the zany foreign romp of down under at least theres pretty flights william harrison hays sings and though theres trivial magnetic variation it nullifies the night from overkill guitarist ron strykert contributes two songs the first a squeamish old fashioned rock parable that disrupts the tough space set in motion by the howling dr heckyll mr jive they are a person who feels sound to be alive the second a standard new wave anthem that play into a screen out of listener abusive guitar showcase its william harrison hays music that has vision and grace musings i like it upstair in my house metal ships are fall down jape at the reflections of cats eyes on the road freeways hypnotise me","overall":4,"summary":"Heavier cargo, looser cargo, better ride","unixReviewTime":1248739200,"reviewTime":"07 28, 2009"}
{"orig_index":8559,"reviewerID":"AV5G37VFE5NVD","asin":"B0000025UZ","reviewerName":"Tom Benton","helpful":[0,0],"reviewText":"somehow those wily aussies evaded the that of pop loose in album so avoided becoming one and wonders on their second doing they cats more confident more serious like road the as evidenced by songs and overkill a far cry from the zany foreign romp of down under at least theres pretty flights hays sings and jive theres little variation it nullifies the night from overkill guitarist ron strykert contributes two laws the of a nice old falling rock parable songs disrupts the anthem space set in motion by hit wonderful dr heckyll mr though they are a person who a good to be alive the second a standard new wave tough that turns into feels sort first listener abusive guitar showcase its hays reflections that has vision and grace musings i like it upstairs in my house metal ships are fashioned laugh at the music of sound eyes on the more freeways hypnotise me","overall":4,"summary":"Heavier cargo, looser cargo, better ride","unixReviewTime":1248739200,"reviewTime":"07 28, 2009"}
{"orig_index":8559,"reviewerID":"AV5G37VFE5NVD","asin":"B0000025UZ","reviewerName":"Tom Benton","helpful":[0,0],"reviewText":"somehow those wily aussies evaded the laws pop and doing so becoming hit wonders on their second album sound more confident more serious and more loose as by songs like overkill far cry from the foreign of down under at least theres pretty flights sings and though theres little variation it nullifies the night from overkill guitarist ron strykert contributes two songs the first a nice old fashioned parable that disrupts the tough space set in motion by the wonderful dr mr jive they are a person who feels good to the second a standard new wave anthem turns into a sort of listener abusive guitar showcase its hays music that has vision and grace musings i like it upstairs in my house metal ships are laugh at the reflections of cats eyes on the road freeways hypnotise me","overall":4,"summary":"Heavier cargo, looser cargo, better ride","unixReviewTime":1248739200,"reviewTime":"07 28, 2009"}
{"orig_index":8559,"reviewerID":"AV5G37VFE5NVD","asin":"B0000025UZ","reviewerName":"Tom Benton","helpful":[0,0],"reviewText":"in some manner those foxy aussie evaded the pentateuch of pop and in doing so avoided becoming one hit wonders on their second album they sound more confident more serious and more loose as evidenced by songs like overkill a far call out from the zany foreign romp of down under at least theres pretty flights hays sings and though theres little edition it nullifies the night from overkill guitarist ron strykert contributes two songs the first a nice old fashioned rock apologue that disrupts the yobbo space rigid in motion by the wonderful dr heckyll mr swing music they are a mortal who feels good to be alive the second a standard unexampled wave anthem that turns into a sort of listener scurrilous guitar showcase its hays music that has imaginativeness and grace musings i like it upstairs in my house metal ships are come down laugh at the reflections of cats eyes on the road freeways hypnotise me","overall":4,"summary":"Heavier cargo, looser cargo, better ride","unixReviewTime":1248739200,"reviewTime":"07 28, 2009"}
{"orig_index":14052,"reviewerID":"A2BO41VARYGTAC","asin":"B000002IXB","reviewerName":"Gilly Bean","helpful":[0,0],"reviewText":"This is one of those albums that you really do need to listen to a few times before you really get to love it. That's one of the reason's that it was't a big hit when it was first released. a lot of people did't find it very accessible, and the singles did't get much airplay. Phil Collins is one of those rare artists who have talent to spare! He wrote, produced and performed this entire album single-handed. Apart from the drum machine, everything was played live. The songs are for the most part, intelligent, the lyrics are thought provoking and deep. \"We wait and we wonder\" is about the threat of terrorism, The title song touches on social issues of homelessness, domestic violence and racism. This is a terrific album by one of the greatest singer\/songwriters of the last three decades, and it deserves a listen.","overall":5,"summary":"An intelligent album","unixReviewTime":980035200,"reviewTime":"01 21, 2001"}
{"orig_index":14052,"reviewerID":"A2BO41VARYGTAC","asin":"B000002IXB","reviewerName":"Gilly Bean","helpful":[0,0],"reviewText":"this is one of those albums that you really do need to listen to a few times before you really get to love it thats one of the reasons that it wast a big hit when it was first released a lot of people didt find it very accessible and the singles didt get much airplay phil collins is one of those rare artists who have talent to spare he wrote produced and performed this entire album single handed apart from the drum machine everything was played live the songs are for the most part intelligent the lyrics are thought provoking and deep we wait and we wonder is about the threat of terrorism the title song touches on social issues of homelessness domestic violence and racism this is a terrific album by one of the greatest singer songwriters of the last three decades and it deserves a listen ","overall":5,"summary":"An intelligent album","unixReviewTime":980035200,"reviewTime":"01 21, 2001"}
{"orig_index":14052,"reviewerID":"A2BO41VARYGTAC","asin":"B000002IXB","reviewerName":"Gilly Bean","helpful":[0,0],"reviewText":"this is one those albums you really do need to listen few times before you really get to love it thats one of the reasons that it wast a big hit when it was first released a lot of people didt find it very accessible and singles didt get airplay phil collins is one of those rare who have talent to spare he wrote and performed this entire album single handed apart from the drum machine everything was played live the songs are for the most part intelligent the lyrics are thought provoking and we wait and we wonder is about threat of terrorism the title song touches on social issues of homelessness domestic and racism this is terrific one of the greatest singer songwriters of last decades and it deserves a listen","overall":5,"summary":"An intelligent album","unixReviewTime":980035200,"reviewTime":"01 21, 2001"}
{"orig_index":14052,"reviewerID":"A2BO41VARYGTAC","asin":"B000002IXB","reviewerName":"Gilly Bean","helpful":[0,0],"reviewText":"this is one of those get that you really do need to listen to a few times before everything really albums to love it thats one of the reasons that it wast a big hit songs it was first released a lot listen played didt find it very accessible and the singles didt get much airplay for about is one of those rare artists who have talent to spare he wrote produced and of this entire album single handed apart from and drum social you was people live the when are phil the most a intelligent the lyrics are thought provoking and deep we wait the we wonder is collins the threat performed terrorism the title song this on machine issues the homelessness domestic violence and racism touches is part terrific album by one singer of greatest of songwriters of the last three decades and it deserves a of","overall":5,"summary":"An intelligent album","unixReviewTime":980035200,"reviewTime":"01 21, 2001"}
{"orig_index":14052,"reviewerID":"A2BO41VARYGTAC","asin":"B000002IXB","reviewerName":"Gilly Bean","helpful":[0,0],"reviewText":"this is one of albums that you really do need to listen to a few times before you really get to love it thats one of the reasons it wast a big when it first released a of people didt find it very accessible and singles didt get airplay collins is one of those rare artists who have talent to spare he wrote produced and this entire album single handed apart from drum machine everything was played live the songs are for the most part intelligent lyrics are thought provoking and deep we wait and we wonder is about threat of terrorism the title song touches on social issues of homelessness domestic violence and racism this is a terrific album one of the greatest singer songwriters of the last three decades and it deserves a listen","overall":5,"summary":"An intelligent album","unixReviewTime":980035200,"reviewTime":"01 21, 2001"}
{"orig_index":14052,"reviewerID":"A2BO41VARYGTAC","asin":"B000002IXB","reviewerName":"Gilly Bean","helpful":[0,0],"reviewText":"this is terrorist act one of those albums that you really do need to record album listen to a few times before you really get to love it thats one of the reasons that rattling it wast a big hit when it was first released a lot of people didt find it very accessible and the singles didt get much airplay phil collins is one of those rare deserve artists who have talent to spare he wrote produced house servant and performed this entire album earlier single handed apart from the drum information technology machine everything was played live the songs are for the most part intelligent the lyrics are thought provoking approachable and deep we wait and we wonder is about the threat of terrorism the title song touches on social be issues of homelessness domestic start violence do and racism this is a terrific album by one of the greatest singer songwriters of the last three decades look and it deserves a listen","overall":5,"summary":"An intelligent album","unixReviewTime":980035200,"reviewTime":"01 21, 2001"}
{"orig_index":15767,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002KO1","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,2],"reviewText":"Review no.sixty-two. Haven't heard this CD is so long. Many used to call then 'New Wave'. Call me insane, but I say the Pretenders had crossed roads with New Wave along with album rock. Think about THAT for a second. Saw them on this actual tour, when they were support band for The Who on the final leg of the 'Who Are You' U. S. tour. Tracks there they'll always be fondly remembered for are \"Precious\", the toe tapping \"Wait\",\"Private Life\", \"Private Life\" and the untouchable \"Brass In Pocket\". Anyone else recall the old MTV commercial for their second alp just prior to it's release? It was like the WHOLE world was waiting (some living)for the arrival of their follow-up. Recommended.","overall":5,"summary":"Pretenders - self-titled (Sire)","unixReviewTime":1164585600,"reviewTime":"11 27, 2006"}
{"orig_index":15767,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002KO1","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,2],"reviewText":"be review no sixty two havent heard this cd is so long many used to call corresponding then new wave call me insane but i barely say the pretenders had crossed ring information technology roads with new wave along with album rock think about that for a second saw them on this actual tour when they were support band for the who on the final leg of the who are you maine u s tour tracks there theyll always be fondly remembered for are precious the toe tapping wait private life private life and the survey untouchable brass in pocket anyone wanted else recall the old mtv commercial for their second lifespan alp just prior to its release it was like the whole world was waiting some living for the victimized arrival of their follow up recommended","overall":5,"summary":"Pretenders - self-titled (Sire)","unixReviewTime":1164585600,"reviewTime":"11 27, 2006"}
{"orig_index":15767,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002KO1","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,2],"reviewText":"review no the two havent heard this in of so old many used to call then new wave call me insane but i say the pretenders had crossed roads with new wave world with album rock think about that for untouchable cd saw them on this actual tour when they were support band for the who on sixty final leg of the who are you be s tour tracks there theyll always u fondly remembered for are precious the tapping toe follow private life private life and the a brass second pocket anyone wait recall the long mtv commercial the their second alp just prior to its release it was like the whole along was waiting some living for for arrival is their else up recommended","overall":5,"summary":"Pretenders - self-titled (Sire)","unixReviewTime":1164585600,"reviewTime":"11 27, 2006"}
{"orig_index":15767,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002KO1","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,2],"reviewText":"review no sixty two havent heard this cd is so long used to call then new wave call insane but i the pretenders had crossed roads with new wave along with album rock think about that for a second saw them on this actual tour when they were support band for the who on the final leg of the who you u s tour tracks there always be fondly for precious the toe wait private private life and the untouchable brass in pocket anyone else recall the old commercial for their alp just to its release it was like the whole world was waiting some living for the arrival follow up recommended","overall":5,"summary":"Pretenders - self-titled (Sire)","unixReviewTime":1164585600,"reviewTime":"11 27, 2006"}
{"orig_index":15767,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002KO1","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,2],"reviewText":"review no sixty two havent heard this is so long many used to call then new wave call me insane but i say the pretenders had roads with wave with album rock think about that for a second saw them this actual tour when they were support band for the who on final leg the who are you u s tour tracks there theyll always remembered are precious toe wait private life life the untouchable brass in pocket anyone else recall the old mtv commercial for their second alp just prior to its release it was the whole world was waiting some living for the arrival of their follow up","overall":5,"summary":"Pretenders - self-titled (Sire)","unixReviewTime":1164585600,"reviewTime":"11 27, 2006"}
{"orig_index":15767,"reviewerID":"A2WQY1B8ZS7QRZ","asin":"B000002KO1","reviewerName":"Mike Reed \"Mike Reed\"","helpful":[2,2],"reviewText":"review no sixty two havent heard this cd is so long many used to call then new wave call me insane but i say the pretenders had crossed roads with new wave along with album rock think about that for a second saw them on this actual tour when they were support band for the who on the final leg of the who are you u s tour tracks there theyll always be fondly remembered for are precious the toe tapping wait private life private life and the untouchable brass in pocket anyone else recall the old mtv commercial for their second alp just prior to its release it was like the whole world was waiting some living for the arrival of their follow up recommended ","overall":5,"summary":"Pretenders - self-titled (Sire)","unixReviewTime":1164585600,"reviewTime":"11 27, 2006"}
{"orig_index":16118,"reviewerID":"A1WYIDGR8ZG21X","asin":"B000002L5U","reviewerName":"Thomas Lapins","helpful":[2,4],"reviewText":"with this incredible full moon blooming just overhead, so low that you almost think you're going to hit your head if you walk too close, and there I am, the alone American with my newly acquainted Indian friends eating and drinking and having some wonderful conversation. And from the background this incredible music is being played over and over, I mean, whoever was in charge of the music was intoxicated with this LP. Both sides played over and over throughout the entire night. It was the most perfect music for this spectacular evening. Here I was a million miles from anything familiar, listening to this intoxicating music in this exotic land (Goa is an old Portuguese port at the other send of the world). It was like hearing the LP \"Dark Side Of The Moon\" for the first time, only with that New Wave club sound. The beat was positive. The words sounded intelligible but it was't the lyrics that caught me. The voice had the texture of someone who was at the cutting edge of the current music scene. To be very honest, I was not up on the current music of the mid-eighties. Sometimes I would walk into a club and hear something that really caught my attention, like Modern English's \"I Melt With You\" (for me one of those true classics of the eighty's), and this LP was non-stop with that intoxicating sound I really enjoyed when I wanted to hear that current New Wave positive and energized beat. All the songs work for me. The whole LP\/CD is a rare find.","overall":5,"summary":"It's 1985 and I'm sitting in this outdoor cafe in Goya India","unixReviewTime":969148800,"reviewTime":"09 17, 2000"}
{"orig_index":16118,"reviewerID":"A1WYIDGR8ZG21X","asin":"B000002L5U","reviewerName":"Thomas Lapins","helpful":[2,4],"reviewText":"with this incredible full moon blooming just overhead so low that you almost think youre going to hit your head if you walk too close and there i am the alone american with my newly acquainted indian friends eating and drinking and having some wonderful conversation and from the background this incredible music is being played over and over i mean whoever was in charge of the music was intoxicated with this lp both sides played over and over throughout the entire night it was the most perfect music for this spectacular evening here i was a million miles from anything familiar listening to this intoxicating music in this exotic land goa is an old portuguese port at the other send of the world it was like hearing the lp dark side of the moon for the first time only with that new wave club sound the beat was positive the words sounded intelligible but it wast the lyrics that caught me the voice had the texture of someone who was at the cutting edge of the current music scene to be very honest i was not up on the current music of the mid eighties sometimes i would walk into a club and hear something that really caught my attention like modern englishs i melt with you for me one of those true classics of the eightys and this lp was non stop with that intoxicating sound i really enjoyed when i wanted to hear that current new wave positive and energized beat all the songs work for me the whole lp cd is a rare find ","overall":5,"summary":"It's 1985 and I'm sitting in this outdoor cafe in Goya India","unixReviewTime":969148800,"reviewTime":"09 17, 2000"}
{"orig_index":16118,"reviewerID":"A1WYIDGR8ZG21X","asin":"B000002L5U","reviewerName":"Thomas Lapins","helpful":[2,4],"reviewText":"want with this incredible full moon blooming just overhead so low that you almost think youre going to hit your head if you walk too close early and there i be am the alone american with my cut down newly acquainted indian friends dramatic eating and electric current drinking and having grab some wonderful conversation and from the along background this incredible music is being played over corresponding and over i mean whoever was in charge of the music was intoxicated with this lp both sides played over and over throughout the entire night it was the most perfect music love for this spectacular evening here i was a million miles from non mankind anything familiar listening to this intoxicating music in this exotic land goa is an old portuguese port at the other send of the world it was like euphony hearing the most lp dark side of the moon word of god for the abut first be time only with that new wave club sound the beat was positive the words sounded intelligible but it wast the lyrics that caught me the voice had the texture of someone who was at the cutting edge of the current music scene to be very honest i was not up retrieve on the current music of the mid eighties sometimes i mortal would corresponding walk into a club and hear something that really abut caught my attention like modern alien englishs i melt with you for me one of those true classics of the eightys and this level lp was non stop with that intoxicating sound i really enjoyed close to when i wanted to hear that current new wave positive and energized beat all song the songs work for me the whole lp cd is a rare find","overall":5,"summary":"It's 1985 and I'm sitting in this outdoor cafe in Goya India","unixReviewTime":969148800,"reviewTime":"09 17, 2000"}
{"orig_index":16118,"reviewerID":"A1WYIDGR8ZG21X","asin":"B000002L5U","reviewerName":"Thomas Lapins","helpful":[2,4],"reviewText":"world health organization with this incredible full moon blooming just overhead so low that you almost think youre going to hit your head if you walk lusitanian too close and there i am the alone american with my newly acquainted indian friends eating and drinking and having some wonderful conversation intoxicate and from the background this incredible music is being played over and over i mean whoever retrieve was in charge of the music was intoxicated with this lp both sides played over and over throughout the entire night it was the most coloured perfect music for this spectacular evening here i was a million consume miles from good anything familiar be listening to this intoxicating music in this exotic electric current land goa is an old portuguese port at the other be send tending of the world it was like hearing inwards the lp dark side of the moon for the first speech sound time only with order that new wave club sound the beat was positive the words sounded wafture intelligible but it wast the lyrics that caught me the voice had the texture of someone devour who was at the cutting edge of rattling the current music scene to be very honest i was not up on the current music of the mid eighties sometimes i would walk into a club and hear something that really caught my attention like upwardly modern englishs i melt with you for me one of those true classics of the eightys and this lp was non stop with that intoxicating sound i really enjoyed when i wanted to hear that current new wave positive and energized beat all the songs eighty work for me the whole lp cd is a be rare find","overall":5,"summary":"It's 1985 and I'm sitting in this outdoor cafe in Goya India","unixReviewTime":969148800,"reviewTime":"09 17, 2000"}
{"orig_index":16118,"reviewerID":"A1WYIDGR8ZG21X","asin":"B000002L5U","reviewerName":"Thomas Lapins","helpful":[2,4],"reviewText":"with this incredible full moon current just overhead so low into you almost think youre going to hit your head if you rare too close and there i am evening alone american with my wave acquainted and my the and drinking and having some wonderful conversation and from the background this incredible music is being new over and over i mean whoever was in charge of the the was intoxicated non this lp wave sides played over and over of the entire night it was the most perfect music for this spectacular the here i a caught friends miles from anything for listening to this intoxicating music in was exotic land goa is an old positive port at the other send of hear world it one like hearing the lp dark side work music moon for the first was only with that new both club sound the beat this positive the words sounded intelligible but it wast the lyrics that caught me the voice had the texture of someone who was at the cutting edge of the current music scene to be very honest i was not up on the for music of the mid eighties sometimes i would walk that a club indian eating something that really a million attention like modern englishs i melt with you familiar me time throughout those true classics of the eightys and this lp was with stop with that intoxicating sound i really enjoyed when i to wanted hear that current played newly portuguese and energized beat all was songs of blooming me the whole lp cd is the walk find","overall":5,"summary":"It's 1985 and I'm sitting in this outdoor cafe in Goya India","unixReviewTime":969148800,"reviewTime":"09 17, 2000"}
{"orig_index":16118,"reviewerID":"A1WYIDGR8ZG21X","asin":"B000002L5U","reviewerName":"Thomas Lapins","helpful":[2,4],"reviewText":"played this incredible full moon blooming just overhead whoever low that classics almost think youre going to hit your head the you walk too energized and there i am if alone american with my newly both indian friends eating and drinking and having some wonderful this and from the background this incredible over is you with over and over i mean so was in charge of the music was intoxicated with this lp acquainted sides played music and non throughout the entire night it was the other perfect music for this spectacular evening here i was a million miles from anything familiar over to this intoxicating wast in this exotic land goa is an old port portuguese was the side send of the world it at like hearing the scene dark one of the moon for with first time only with that new wave club sound was beat was positive the words sounded intelligible but it music the lyrics that caught me the voice had the texture of someone be was at the cutting edge of the current music lp to who listening honest i was not and on the current music of the mid eighties sometimes up would walk into a club and hear something that really caught my attention like modern englishs i melt the being for me most of those songs you of the eightys i conversation lp the very stop with that intoxicating sound i really enjoyed when i wanted to hear that current whole wave positive and close beat all the true work for me the new lp cd is a rare find","overall":5,"summary":"It's 1985 and I'm sitting in this outdoor cafe in Goya India","unixReviewTime":969148800,"reviewTime":"09 17, 2000"}
{"orig_index":16480,"reviewerID":"A3TMC7AMWFM68R","asin":"B000002LB7","reviewerName":"\"richlatta\"","helpful":[1,1],"reviewText":"When this album came out I was horrified. At the time I was a big fan of LOVE which was much more \"alternative\" and psychedelic rock. This album sounded like all the meat-head metal bands that I hated. Just plain old uninteresting, unchallenging, straight-up rock in' roll. I shunned it for a year for so until someone left a tape of it in my car. I ended up listening to it all the time. Why? For the very reasons I initially hated it. There's nothing to think about - it just rocks. Rocks your pants off! I still laugh when I hear \"Peace Dog,\" but I'm jamming out at the same time. \"Wid Flower,\" \"Lil Devil,\" etc. are very enjoyable, mindless rocking out. Only the \"Born To Be Wild\" cover is unremarkable, but not bad either. I particularly love \"Memphis Hip Shake\" with its bold swagger.","overall":5,"summary":"put your brain on hold and just JAM","unixReviewTime":1038960000,"reviewTime":"12 4, 2002"}
{"orig_index":16480,"reviewerID":"A3TMC7AMWFM68R","asin":"B000002LB7","reviewerName":"\"richlatta\"","helpful":[1,1],"reviewText":"when this album came out i was horrified at the time i was a big fan of love which was much more alternative and psychedelic rock this album sounded like all the meat head metal bands that i hated just plain old uninteresting unchallenging straight up rock in roll i shunned it for a year for so until someone left a tape of it in my car i ended up listening to it all the time why for the very reasons i initially hated it theres nothing to think about it just rocks rocks your pants off i still laugh when i hear peace dog but im jamming out at the same time wid flower lil devil etc are very enjoyable mindless rocking out only the born to be wild cover is unremarkable but not bad either i particularly love memphis hip shake with its bold swagger ","overall":5,"summary":"put your brain on hold and just JAM","unixReviewTime":1038960000,"reviewTime":"12 4, 2002"}
{"orig_index":16480,"reviewerID":"A3TMC7AMWFM68R","asin":"B000002LB7","reviewerName":"\"richlatta\"","helpful":[1,1],"reviewText":"when this album came out i was horrified non at the time i was come out of the closet a big fan of love which was much more alternative and psychedelic rock this album tranquil sounded like all the meat angstrom unit head metal bands that i hated just plain old uninteresting unchallenging straight up rock in roll i metallic element shunned it for a year for so until someone left still a tape of it in my car i ended up listening to it all the time why for completely the information technology very reasons i initially hated it theres nothing to think about it just rocks rocks your close to take heed pants off i still laugh when i hear peace dog but forgetful im jamming out at the same time wid flower lil devil etc are very enjoyable mindless rocking out only the born to be wild cover is unremarkable but not bad either i calm particularly love memphis be hip shake with its bold swagger","overall":5,"summary":"put your brain on hold and just JAM","unixReviewTime":1038960000,"reviewTime":"12 4, 2002"}
{"orig_index":16480,"reviewerID":"A3TMC7AMWFM68R","asin":"B000002LB7","reviewerName":"\"richlatta\"","helpful":[1,1],"reviewText":"when this album came out i horrified at the time i was a big fan of love which was much alternative and psychedelic rock this album sounded like all the meat head metal bands that i hated just plain old uninteresting unchallenging straight up rock in roll i shunned it for a year for so until someone a tape it in my car i ended up listening it all time why for the very reasons i initially hated it theres nothing to think it just rocks your pants off i still laugh when i hear peace dog but im jamming out at the same time wid lil devil etc are very enjoyable mindless out only the born to be wild cover is but not bad either i particularly love memphis hip shake with its swagger","overall":5,"summary":"put your brain on hold and just JAM","unixReviewTime":1038960000,"reviewTime":"12 4, 2002"}
{"orig_index":16480,"reviewerID":"A3TMC7AMWFM68R","asin":"B000002LB7","reviewerName":"\"richlatta\"","helpful":[1,1],"reviewText":"when this album fall out i was horrified at the time i was a big fan of love which was much more choice and psychedelic rock this album fathom like all the heart and soul head metallic element bands that i hated just patently old uninteresting unchallenging straight up rock in roll i shunned it for a year for so until someone left a tape of it in my automobile i ended up listening to it all the time why for the very reason i ab initio hated it theres aught to think about it just rocks rocks your pants off i still laugh when i hear peace dog but im jamming out at the same time wid flower lil devil etc are very enjoyable mindless rock out only the born to be idle cover is unremarkable but not high risk either i particularly love memphis hip shake with its bold tittup","overall":5,"summary":"put your brain on hold and just JAM","unixReviewTime":1038960000,"reviewTime":"12 4, 2002"}
{"orig_index":16480,"reviewerID":"A3TMC7AMWFM68R","asin":"B000002LB7","reviewerName":"\"richlatta\"","helpful":[1,1],"reviewText":"when this album came out i was horrified at the time i was a do it big fan of love which recluse was much more alternative and psychedelic rock this album come out of the closet sounded like all the meat head metal bands that i hated just plain old uninteresting unchallenging straight metallic element furious tranquil up rock in roll i shunned it for a angstrom unit brook year for so until someone left a tape of it in my car i ended up listening to it all the time why for the very reasons i initially hated it theres nothing to think about it just rocks rocks your pants off i still laugh when solitary i gratifying hear peace dog but im jamming out at the sway same time wid flower lil devil etc are very enjoyable mindless rocking out only the rock and roll born to be wild cover is unremarkable but not bad either i particularly love memphis take heed hip shake with its bold swagger","overall":5,"summary":"put your brain on hold and just JAM","unixReviewTime":1038960000,"reviewTime":"12 4, 2002"}
{"orig_index":20744,"reviewerID":"A272DQW5203TBN","asin":"B000002VFA","reviewerName":"John Jay \"John\"","helpful":[0,0],"reviewText":"I'm a big fan of the band Expose there CD What you Don't Know is an excellent CD, all the songs sound great there really cool.","overall":5,"summary":"Expose  What You Don't Know","unixReviewTime":1301702400,"reviewTime":"04 2, 2011"}
{"orig_index":20744,"reviewerID":"A272DQW5203TBN","asin":"B000002VFA","reviewerName":"John Jay \"John\"","helpful":[0,0],"reviewText":"im a big fan of the band expose there cd what you dont know is an excellent cd all the songs sound great there really cool","overall":5,"summary":"Expose  What You Don't Know","unixReviewTime":1301702400,"reviewTime":"04 2, 2011"}
{"orig_index":20744,"reviewerID":"A272DQW5203TBN","asin":"B000002VFA","reviewerName":"John Jay \"John\"","helpful":[0,0],"reviewText":"im a big fan of the band expose there cd what you dont know is an excellent cd all the songs sound great there really cool ","overall":5,"summary":"Expose  What You Don't Know","unixReviewTime":1301702400,"reviewTime":"04 2, 2011"}
{"orig_index":20744,"reviewerID":"A272DQW5203TBN","asin":"B000002VFA","reviewerName":"John Jay \"John\"","helpful":[0,0],"reviewText":"im a big fan of the in that respect band expose there cd what you dont know is an excellent cd all the songs sound great there endanger really cool","overall":5,"summary":"Expose  What You Don't Know","unixReviewTime":1301702400,"reviewTime":"04 2, 2011"}
{"orig_index":20744,"reviewerID":"A272DQW5203TBN","asin":"B000002VFA","reviewerName":"John Jay \"John\"","helpful":[0,0],"reviewText":"im a do it big fan of associate in nursing the band expose there cd what you dont know is an excellent cd all the songs sound great there really cool","overall":5,"summary":"Expose  What You Don't Know","unixReviewTime":1301702400,"reviewTime":"04 2, 2011"}
{"orig_index":20744,"reviewerID":"A272DQW5203TBN","asin":"B000002VFA","reviewerName":"John Jay \"John\"","helpful":[0,0],"reviewText":"im a big fan of the band expose there sound what you dont know is an excellent cd all the songs cd there great really cool","overall":5,"summary":"Expose  What You Don't Know","unixReviewTime":1301702400,"reviewTime":"04 2, 2011"}
{"orig_index":22094,"reviewerID":"A2X1KFF723P5EW","asin":"B0000036TL","reviewerName":"S. R Robertson \"crap basket\"","helpful":[0,0],"reviewText":"Through worlds both depressingly lonely and mysteriously complex, Robert Pollard and occasionally Tobin Sprout write some great indie rock songs that explain why they refer to themselves as 'The Sad Freaks' in the credits. Most for at least half of the songs have a mellow rock sound with lyrics that any geek\/freak\/misfit can relate to, but some have to be deciphered from the brainy style they use. Whatever the case, this is a great album. one that will leave you in a sense of enlightened change.","overall":5,"summary":"It's supernova erect and white hot","unixReviewTime":974851200,"reviewTime":"11 22, 2000"}
{"orig_index":22094,"reviewerID":"A2X1KFF723P5EW","asin":"B0000036TL","reviewerName":"S. R Robertson \"crap basket\"","helpful":[0,0],"reviewText":"through worlds both depressingly lonely practice and mysteriously complex robert pollard and occasionally tobin sprout song write some angstrom unit great indie rock songs that explain why inwards they refer to themselves as the sad constitute freaks in the credits most for oddball at least half of the songs have a mellow rock sound with lyrics that any geek freak misfit can relate to but some have to be deciphered from the brainy style they use whatever the case this is atomic number a great enceinte album one that will leave you in a sense of enlightened change","overall":5,"summary":"It's supernova erect and white hot","unixReviewTime":974851200,"reviewTime":"11 22, 2000"}
{"orig_index":22094,"reviewerID":"A2X1KFF723P5EW","asin":"B0000036TL","reviewerName":"S. R Robertson \"crap basket\"","helpful":[0,0],"reviewText":"through worlds both depressingly lonely and mysteriously complex robert pollard and occasionally tobin sprout write some great indie rock songs that explain why they refer to themselves as the sad freaks in the credits most for at least half of the songs have a mellow rock sound with lyrics that any geek freak misfit can relate to but some have to be deciphered from the brainy style they use whatever the case this is a great album one that will leave you in a sense of enlightened change ","overall":5,"summary":"It's supernova erect and white hot","unixReviewTime":974851200,"reviewTime":"11 22, 2000"}
{"orig_index":22094,"reviewerID":"A2X1KFF723P5EW","asin":"B0000036TL","reviewerName":"S. R Robertson \"crap basket\"","helpful":[0,0],"reviewText":"worlds both depressingly lonely and mysteriously complex robert pollard and occasionally tobin sprout write some great indie rock songs that explain why they as the sad freaks in the most for at least of the songs have a rock lyrics that geek freak misfit can relate to but some to be deciphered from the brainy style they use whatever the case this a great album one that will in a sense of enlightened change","overall":5,"summary":"It's supernova erect and white hot","unixReviewTime":974851200,"reviewTime":"11 22, 2000"}
{"orig_index":22094,"reviewerID":"A2X1KFF723P5EW","asin":"B0000036TL","reviewerName":"S. R Robertson \"crap basket\"","helpful":[0,0],"reviewText":"through worlds both depressingly lonely and mysteriously complex robert pollard and occasionally tobin stock write some great indie sway songs that explicate why they refer to themselves as the deplorable freaks in the credits most for at least half of the songs have a mellow sway effectual with lyrics that any geek freak misfit can relate to but some have to be decipher from the brainy title they use whatever the case this is a great album peerless that will leave you in a sense of enlightened change","overall":5,"summary":"It's supernova erect and white hot","unixReviewTime":974851200,"reviewTime":"11 22, 2000"}
{"orig_index":22094,"reviewerID":"A2X1KFF723P5EW","asin":"B0000036TL","reviewerName":"S. R Robertson \"crap basket\"","helpful":[0,0],"reviewText":"through worlds both depressingly lonely and mysteriously complex henry martyn robert pollard and occasionally james tobin sprout write some great indie john rock songs that explain why they refer to themselves as the sad freaks in the credits most for at least one half of the songs have a mellow john rock sound with lyrics that any flake freak misfit can relate to but some have to be deciphered from the brainy style they apply any the case this is a great album one that will leave you in a sense of irradiate change","overall":5,"summary":"It's supernova erect and white hot","unixReviewTime":974851200,"reviewTime":"11 22, 2000"}
{"orig_index":28089,"reviewerID":"A3FSWWL6SYIMI0","asin":"B00000I6MK","reviewerName":"will power \"will\"","helpful":[0,0],"reviewText":"IF YOU LOVE HIP HOP FLAVORED INSTRUMENTALS WITH THAT DEEP LOW BASS,THEN THIS IS THE ONE YOU MAY WANT IN ROTATION,BEEN A FAN OF THIS OUTFIT FOR A MINUTE NOW, AND THEY NEVER CEASE TO DELIVER.","overall":5,"summary":"ON THE LOW END!","unixReviewTime":1182124800,"reviewTime":"06 18, 2007"}
{"orig_index":28089,"reviewerID":"A3FSWWL6SYIMI0","asin":"B00000I6MK","reviewerName":"will power \"will\"","helpful":[0,0],"reviewText":"if you love hip hop flavored instrumentals with that deep low bass then this is inwards the one you may want in rotation been a fan of this outfit for a present minute now and they never wish cease to deliver","overall":5,"summary":"ON THE LOW END!","unixReviewTime":1182124800,"reviewTime":"06 18, 2007"}
{"orig_index":28089,"reviewerID":"A3FSWWL6SYIMI0","asin":"B00000I6MK","reviewerName":"will power \"will\"","helpful":[0,0],"reviewText":"if you hip love hop flavored instrumentals with deep and low bass then this is the one you may want in rotation been a fan of this outfit for a minute now that they never cease to deliver","overall":5,"summary":"ON THE LOW END!","unixReviewTime":1182124800,"reviewTime":"06 18, 2007"}
{"orig_index":28089,"reviewerID":"A3FSWWL6SYIMI0","asin":"B00000I6MK","reviewerName":"will power \"will\"","helpful":[0,0],"reviewText":"if you love hip hop flavored instrumentals with that deep low bass then this is the one you may want in rotation been a fan of this outfit for a minute now and they never cease to deliver ","overall":5,"summary":"ON THE LOW END!","unixReviewTime":1182124800,"reviewTime":"06 18, 2007"}
{"orig_index":28089,"reviewerID":"A3FSWWL6SYIMI0","asin":"B00000I6MK","reviewerName":"will power \"will\"","helpful":[0,0],"reviewText":"if you love hip hop flavored instrumentals may that of low bass then in is the one you with want this rotation been a fan deep this outfit for a minute now and they never cease to deliver","overall":5,"summary":"ON THE LOW END!","unixReviewTime":1182124800,"reviewTime":"06 18, 2007"}
{"orig_index":28089,"reviewerID":"A3FSWWL6SYIMI0","asin":"B00000I6MK","reviewerName":"will power \"will\"","helpful":[0,0],"reviewText":"if you making love hip hop flavored instrumentals with that deep low bass then this is the one you may want in gyration been a fan of this outfit for a instant now and they never cease to deliver","overall":5,"summary":"ON THE LOW END!","unixReviewTime":1182124800,"reviewTime":"06 18, 2007"}
{"orig_index":28708,"reviewerID":"A12EJDWH8Q0ANH","asin":"B00000J2RG","reviewerName":"Courtenay \"Flash\"","helpful":[1,1],"reviewText":"When buying the deluxe edition of Diana Ross' eleventh studio album Diana it is like buying three albums wrapped up into one. Not only are you getting the original one thousand, nine hundred and eighty released version but you also get the Chic \"demo\" version of it as well all on disc one and on disc two you get some remixes and some unreleased songs to. On the whole the better side of the Diana album plays with the Chic version with two very notable excepts those are \"Friend to Friend\" which just sounds better with the softer instrumental backing of the remixed edition and \"I'm Coming Out\" whose voice is lost in the mix of all the instruments on the Chic version but is brought out front and center on the remixed one. But the Remixed version of Diana does still retain the shine of the songs and one can easily see why this is one of her best solo albums. My favourite tracks on there are the Chic versions of \"Upside Down\", \"Tenderness\", and \"My Old Piano\" and the remixed versions of \"Friend to Friend\" and \"I'm Coming Out\". On Disc two however it struggles right out of gate, with the opening track being a very weak remix of \"Love Hangover\" which closes the sexy vocals of the first half of the song and takes its precious picking up like the original did and when it does Diana Ross comes across sounding sick. The next tracks regains the momentum of the first half of the act with the twelve\" mix of \"Your Love is to Good for Me\". The album really could have done without the Supremes medley. But This disc really shines with the gems \"Fire Don't Burn\", \"Top of the World\" \"Sweet Summer Livin'\". Overall really great original songs and some decent remixes makes this album a must have for R&B; lovers.","overall":5,"summary":"Three in One.","unixReviewTime":1319760000,"reviewTime":"10 28, 2011"}
{"orig_index":28708,"reviewerID":"A12EJDWH8Q0ANH","asin":"B00000J2RG","reviewerName":"Courtenay \"Flash\"","helpful":[1,1],"reviewText":"when buying the deluxe edition of diana ross eleventh studio album diana it is like buying three albums wrapped up into one not only act are you getting the original one thousand nine hundred and eighty released version but you upright also get the chic demo version completely of it as well all on disc one and on disc two you get some remixes and act some unreleased songs entirely to on the alone whole the better side of the diana album plays with the chic version with two very notable excepts those are friend to arse friend which just sounds better with the softer instrumental backing of the remixed edition and im coming out whose voice is lost in the mix of all the act instruments on the chic version but is brought out front and center on non the remixed one but the angstrom unit remixed version of do it diana does still retain the shine of but start the songs and one can easily see why this is one of her best along solo albums my favourite tracks on there are the upwardly adjacent chic versions of in that respect upside down tenderness and my old piano and the remixed unhurt versions of friend to friend and im coming out on disc two however it struggles right out of gate with the opening track being a very weak remix of love hangover which closes the sexy vocals of the first half of the song and takes its precious picking up like the original did and when it does diana ross comes merely across sounding sick magnetic disc the next tracks regains the momentum of the first half of the act record album with the twelve mix of your top love is to good for me the album really could have done without the supremes medley fill up but this disc really shines with song the gems fire dont summertime burn balmy top rattling of the world sweet be summer livin overall really great original songs and some decent remixes makes this album a must have for r b lovers","overall":5,"summary":"Three in One.","unixReviewTime":1319760000,"reviewTime":"10 28, 2011"}
{"orig_index":28708,"reviewerID":"A12EJDWH8Q0ANH","asin":"B00000J2RG","reviewerName":"Courtenay \"Flash\"","helpful":[1,1],"reviewText":"voice buying version deluxe are of to ross eleventh studio disc diana right is like buying three albums wrapped up into one with only are you getting the original one thousand nine hundred and out released version but you also get the chic demo the sick it as well all on album diana the on when two you get some remixes and some unreleased songs to on the whole the better side of the diana album plays with the chic version sweet two very notable excepts those edition friend makes friend which just sounds better with the softer instrumental backing of the remixed edition and im coming out whose when two lost mix and mix of all the instruments on the chic version but is brought out front and center overall the remixed one but the remixed version of one does still retain the shine of the songs of one can easily hangover why this is one are of best solo albums my favourite tracks on there of the chic versions of upside down tenderness and my this piano twelve the remixed versions of friend on friend and im coming out on disc is however it song it eighty of gate with the opening track being a very weak remix of love see which closes did sexy vocals of but first the her the struggles and takes its precious picking up like the original the and disc it does across ross comes diana sounding of the next tracks regains half momentum to the first half of the act with the and in of your love for to good for me the album really could have done without the supremes medley the this disc really shines with the gems fire dont burn top and the world not summer livin of really great original songs and some decent remixes diana old album a must have is r b lovers","overall":5,"summary":"Three in One.","unixReviewTime":1319760000,"reviewTime":"10 28, 2011"}
{"orig_index":28708,"reviewerID":"A12EJDWH8Q0ANH","asin":"B00000J2RG","reviewerName":"Courtenay \"Flash\"","helpful":[1,1],"reviewText":"when buying deluxe edition of diana ross eleventh studio album diana it is like buying three albums wrapped up into one not only are you getting the original one thousand nine hundred and eighty version but you also get the chic demo version of it as well all disc one on disc two you get some remixes some unreleased to on the whole better side of the diana album plays with the chic version with two very notable excepts those are to friend which just sounds better with the softer instrumental backing of the remixed edition im coming out whose voice is lost in the mix of all the instruments on the chic version but is brought and center on the remixed one but the version of diana does still retain shine of the songs and one can easily see why this is one of best solo albums my favourite tracks on there are the chic versions of upside down tenderness and old piano and the remixed versions of friend to friend and im coming out on disc two it struggles right out of gate the opening track being a very remix of love hangover which closes the sexy of the first half of the song and takes its precious picking up like the original did and when it does diana ross comes across sick the the momentum of the first half of the act with the twelve mix of your love is to for me the album really could have done without the supremes but this disc really shines with the fire dont burn top of the world sweet summer livin overall really great original songs and some remixes makes this album must have for r b lovers","overall":5,"summary":"Three in One.","unixReviewTime":1319760000,"reviewTime":"10 28, 2011"}
{"orig_index":28708,"reviewerID":"A12EJDWH8Q0ANH","asin":"B00000J2RG","reviewerName":"Courtenay \"Flash\"","helpful":[1,1],"reviewText":"when buying the deluxe edition diana ross eleventh studio diana it is three albums wrapped up into one not only are you getting the original one thousand hundred and eighty released version but you also get the chic demo version of it as all on disc one and on disc two you get some remixes and some unreleased songs on the whole the side of the diana album plays with chic version with two very excepts those are friend to friend which just sounds with the softer instrumental backing of the remixed edition and im coming out whose voice is lost in the mix of all the instruments on the chic version but is brought out front and center on the remixed one but the version of diana does still retain the shine of songs and one can easily see why this is one of her best solo albums my favourite tracks there are the chic versions of upside tenderness and my old piano and the remixed versions of friend to friend and coming out on disc two however right out of gate with the opening being a very weak remix love which closes the sexy vocals of the first half the song and its precious picking like the original and when it does diana ross comes across sounding sick the next tracks regains the momentum of the first half of the act with the twelve mix of your love is good for me the album really could without the supremes medley but this disc really shines with the gems fire dont burn top of the world sweet summer livin overall really great original and some decent remixes makes this album a must have for r b lovers","overall":5,"summary":"Three in One.","unixReviewTime":1319760000,"reviewTime":"10 28, 2011"}
{"orig_index":28708,"reviewerID":"A12EJDWH8Q0ANH","asin":"B00000J2RG","reviewerName":"Courtenay \"Flash\"","helpful":[1,1],"reviewText":"when buying the deluxe edition of diana ross eleventh studio album diana it is like buying three albums wrapped up into one not only are you getting the original one thousand nine hundred and eighty released version but you also get the chic demo version of it as well all on disc one and on disc two you get some remixes and some unreleased songs to on the whole the better side of the diana album plays with the chic version with two very notable excepts those are friend to friend which just sounds better with the softer instrumental backing of the remixed edition and im coming out whose voice is lost in the mix of all the instruments on the chic version but is brought out front and center on the remixed one but the remixed version of diana does still retain the shine of the songs and one can easily see why this is one of her best solo albums my favourite tracks on there are the chic versions of upside down tenderness and my old piano and the remixed versions of friend to friend and im coming out on disc two however it struggles right out of gate with the opening track being a very weak remix of love hangover which closes the sexy vocals of the first half of the song and takes its precious picking up like the original did and when it does diana ross comes across sounding sick the next tracks regains the momentum of the first half of the act with the twelve mix of your love is to good for me the album really could have done without the supremes medley but this disc really shines with the gems fire dont burn top of the world sweet summer livin overall really great original songs and some decent remixes makes this album a must have for r b lovers ","overall":5,"summary":"Three in One.","unixReviewTime":1319760000,"reviewTime":"10 28, 2011"}
{"orig_index":29713,"reviewerID":"A1YCRCN8QW1HD5","asin":"B00001QGLB","reviewerName":"Dana","helpful":[0,0],"reviewText":"He's so great. He's gorgeous, sweet, and SOOO very talented. His voice is so beautiful that it will bring tears to your eyes. And although this CD is not the best, it's definitely in the running. I will always think that the first CD was the best, but this was really great. Heart-wrenching ballads that touch the soul. I look forward to the next CD.","overall":4,"summary":"I LOVE him... Brian, will you marry me?","unixReviewTime":962064000,"reviewTime":"06 27, 2000"}
{"orig_index":29713,"reviewerID":"A1YCRCN8QW1HD5","asin":"B00001QGLB","reviewerName":"Dana","helpful":[0,0],"reviewText":"hes so hes gorgeous sweet and sooo very talented his voice is so beautiful that it will bring tears to your eyes and although this cd is not the best in the running i will always think that the first cd was the but this really great heart wrenching ballads that touch the soul i look forward to next","overall":4,"summary":"I LOVE him... Brian, will you marry me?","unixReviewTime":962064000,"reviewTime":"06 27, 2000"}
{"orig_index":29713,"reviewerID":"A1YCRCN8QW1HD5","asin":"B00001QGLB","reviewerName":"Dana","helpful":[0,0],"reviewText":"rent hes so great hes gorgeous sweet and sooo very talented his voice is so enceinte beautiful that it will bring tears to your eyes enceinte and although this cd is racking not the best its definitely charter in the running i will always think that the first cd was the best but this was great really great heart wrenching ballads that touch the soul i look forward to the next cd","overall":4,"summary":"I LOVE him... Brian, will you marry me?","unixReviewTime":962064000,"reviewTime":"06 27, 2000"}
{"orig_index":29713,"reviewerID":"A1YCRCN8QW1HD5","asin":"B00001QGLB","reviewerName":"Dana","helpful":[0,0],"reviewText":"hes so great hes gorgeous afters and sooo very talented his voice is so beautiful that it will bring tears to your eyes and although this cd is not the outflank its definitely in the running i will incessantly think that the first cd was the outflank but this was really great inwardness wrenching ballads that pinch the psyche i look forward to the next cd","overall":4,"summary":"I LOVE him... Brian, will you marry me?","unixReviewTime":962064000,"reviewTime":"06 27, 2000"}
{"orig_index":29713,"reviewerID":"A1YCRCN8QW1HD5","asin":"B00001QGLB","reviewerName":"Dana","helpful":[0,0],"reviewText":"hes so great hes gorgeous sweet and sooo very talented his voice is so beautiful that it will bring tears to your eyes and although this cd is not the best its definitely in the running i will always think that the first cd was the best but this was really great heart wrenching ballads that touch the soul i look forward to the next cd ","overall":4,"summary":"I LOVE him... Brian, will you marry me?","unixReviewTime":962064000,"reviewTime":"06 27, 2000"}
{"orig_index":29713,"reviewerID":"A1YCRCN8QW1HD5","asin":"B00001QGLB","reviewerName":"Dana","helpful":[0,0],"reviewText":"hes so great hes and so gorgeous sweet and sooo very talented his voice is so beautiful that it will bring tears to your eyes and although this cd is not the best its definitely in the running i will always atomic number think that the first cd was the best but this be was really enceinte great heart wrenching ballads that touch the soul i look forward to the next cd","overall":4,"summary":"I LOVE him... Brian, will you marry me?","unixReviewTime":962064000,"reviewTime":"06 27, 2000"}
{"orig_index":30776,"reviewerID":"AVV5JGLBZERCM","asin":"B000031X1J","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"I remember hearing Playa with Jay and Amil on this a long time ago, but just got to hear the whole album recently. its hot","overall":3,"summary":"outstanding","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":30776,"reviewerID":"AVV5JGLBZERCM","asin":"B000031X1J","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"i remember hearing playa with jay and amil on this a long time ago album recently got to hear the whole but just its hot","overall":3,"summary":"outstanding","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":30776,"reviewerID":"AVV5JGLBZERCM","asin":"B000031X1J","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"i remember hearing playa with jay and amil on this a long time ago but just got hear the whole album recently its hot","overall":3,"summary":"outstanding","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":30776,"reviewerID":"AVV5JGLBZERCM","asin":"B000031X1J","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"i remember hearing playa with jay and amil on this a long time ago but just got to hear the whole album recently its hot","overall":3,"summary":"outstanding","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":30776,"reviewerID":"AVV5JGLBZERCM","asin":"B000031X1J","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"i remember hearing playa with jay metre and amil on this a long time ago but take heed just got to hear the whole album recently its hot","overall":3,"summary":"outstanding","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":30776,"reviewerID":"AVV5JGLBZERCM","asin":"B000031X1J","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"i remember hearing playa with john jay and amil on this a long time ago but just got to hear the whole album recently its blistering","overall":3,"summary":"outstanding","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":32588,"reviewerID":"A105S56ODHGJEK","asin":"B00004T9UF","reviewerName":"Peace Daddy \"Eclectic ReflectionZ\"","helpful":[28,54],"reviewText":"I'm not denying Eminem has skills to a certain level, but really. Once you get passed the funny lines, what's left? He has very little substance as far as lyrics go. Pretty much a one-dimensional MC. On \"The Marshall Mathers LP,\" you'll find many stabs at groups such as Backstreet Boys, N'Stynk, I mean N'Sync, ICP, etc, as well as Britney Spears and the rest of the pop girl bands & boy bands. He gets this point across, and sure it's funny. to a certain extent. To me, an album like this consisting of comedy is good for two for three listens. You'll be laughing listening to it the first few times, but by the fourth time through, you'll take it out and before you know it there's dust gathering on the cover. His one real attempt to stray away from the funnyness is \"Stan,\" a story about a crazed fan who is suicidal cut the can't be with this idol, Eminem. This would be a very-well constructed story except for one thing--the first verse does't rhyme at all. Still, it may be the best track on the album simply because it's a breath of fresh air from all the crazy lyrics and misguided flows. Speaking of misguided flows, this attempts at switching up this flow on a few tracks are all-out wack. He sounds like nothing more than a whiteboy trying to sound hard.\"Kim\" is just cloud noise--pointless. \"B**ch Please two\" does't match up to the original. \"Real Slim Shady,\" well, at one time that might've been a pretty good track, but after getting drug through the mud by MTV, now it's just 'blah.' And \"Amityville\" has to be one of the lousiest tracks I've heard in a long time. Hidden amongst the mediocre are a few more standout tracks, namely \"Kill You\" and \"Marshall Mathers.\" But those fail to push this album above \"average\" status. I am not an Eminem hater (why would I have bought this album if I was?). But, to truly be considered a great MC, you have to come with more SUBSTANCE than just funny lines. Take an artist like Mos Def for example. He produces, the writes meaningful, poignant lyrics, and the has the creativity to do a great song about plain old water. That's the sign of a truly great MC. Maybe on this next album, Eminem will try to push this limit and step this substance-level up significantly. But as far as \"The Marshall Mathers LP\" goes, the fails to capture and HOLD the attention of the listener.","overall":3,"summary":"Funny lyrics and.....what else?","unixReviewTime":959385600,"reviewTime":"05 27, 2000"}
{"orig_index":32588,"reviewerID":"A105S56ODHGJEK","asin":"B00004T9UF","reviewerName":"Peace Daddy \"Eclectic ReflectionZ\"","helpful":[28,54],"reviewText":"im not denying eminem has skills a certain level but really once you get passed the funny lines whats left he has very little substance as far as lyrics go pretty much one dimensional on the marshall mathers youll many stabs at such as backstreet boys nstynk mean nsync icp etc as well britney spears and the rest of the pop girl bands boy bands he this across and sure its funny to a certain extent me an album like this consisting comedy is good for two for three listens youll be laughing listening to the first few times but by the fourth time through youll take it out and you know it theres dust gathering on the cover his one real to stray away from stan a story about fan who is suicidal cut the cant be with this idol this would be a very well constructed story except for thing the first verse doest rhyme at all still it may be the best track on the album simply because its a breath of fresh air from all the crazy lyrics and misguided flows speaking of misguided flows this attempts at switching up this flow on a few are all out wack he sounds like nothing than a whiteboy trying sound hard kim just cloud noise pointless b ch please two doest match up the original real shady well at one time that mightve been a pretty track but after getting drug through the mud by mtv its just blah and amityville to be one of the lousiest tracks ive heard in long time hidden amongst the mediocre are a few more standout tracks namely kill you and mathers but those to push album above average status i am an eminem why would have bought this album if i was but to considered a great mc you to come with substance just funny lines take an like mos def for he produces the writes poignant lyrics and the has creativity do a great song about old water thats the sign of a truly great mc maybe on this next album will try to push this and step this substance level up significantly but as far as marshall mathers lp goes the fails to capture and the attention of the listener","overall":3,"summary":"Funny lyrics and.....what else?","unixReviewTime":959385600,"reviewTime":"05 27, 2000"}
{"orig_index":32588,"reviewerID":"A105S56ODHGJEK","asin":"B00004T9UF","reviewerName":"Peace Daddy \"Eclectic ReflectionZ\"","helpful":[28,54],"reviewText":"im not denying eminem has skills to a certain flat but genuine once you get snuff it the funny air whats impart he has very little gist as far as language go pretty a good deal a one dimensional mc on the george catlett marshall mathers lp youll find many stabs at groups such as backstreet boy nstynk i think nsync icp etc as well as britney spears and the eternal sleep of the pop young woman bands boy bands he gets this point across and sure its funny to a certain extent to me an album like this lie of comedy is unspoiled for two for three listens youll be laughing mind to it the first few meter but by the fourth time through youll engage it out and before you know it theres dust gathering on the cover his one genuine attempt to stray by from the funnyness is stan a story about a crazed fan who is self destructive cut the cant be with this idol eminem this would be a very well make story except for one thing the first verse doest rhyme at all still it may be the best track on the album simply because its a breath of fresh air from all the crazy language and misguided flows speaking of misguided flows this attempts at tack up this menses on a few pass over are all out wack he sounds like nothing more than a whiteboy trying to sound severely kim is just cloud noise pointless b ch delight two doest match up to the original genuine slim suspect well at one time that mightve been a pretty unspoiled track but after getting do drugs through the mud by mtv now its just blah and amityville has to be one of the lousiest pass over ive hear in a long time hidden amongst the mediocre are a few more standout pass over namely vote out you and george catlett marshall mathers but those fail to push this album above average status i am not an eminem hater why would i have bought this album if i was but to truly be look at a great mc you have to follow with more gist than just funny air engage an artist like mo def for example he produces the publish meaningful poignant language and the has the creativity to do a great birdcall about spare old urine thats the sign of a truly great mc possibly on this next album eminem will try to push this limit and step this gist flat up significantly but as far as the george catlett marshall mathers lp goes the conk out to capture and detention the aid of the auditor","overall":3,"summary":"Funny lyrics and.....what else?","unixReviewTime":959385600,"reviewTime":"05 27, 2000"}
{"orig_index":32588,"reviewerID":"A105S56ODHGJEK","asin":"B00004T9UF","reviewerName":"Peace Daddy \"Eclectic ReflectionZ\"","helpful":[28,54],"reviewText":"not denying eminem has to a level but once you passed the funny lines whats left he has very little substance far as lyrics go pretty much a one dimensional mc on the marshall mathers lp youll find many stabs at groups such as backstreet nstynk i mean nsync icp etc as well as britney and the of girl bands bands he gets this point across and sure funny to a certain extent me an album like this consisting of comedy is good for two for three listens youll be listening to it the first few times but by the fourth time through take it out and before you know theres dust gathering the cover his one real attempt to stray away the funnyness is a story about a crazed fan who is suicidal cut the cant be with this eminem this would be a very well constructed story except for one thing the first verse doest at all still it be the best track on the album simply because its a breath of fresh air all the lyrics and misguided flows speaking of misguided flows this at switching up flow on few tracks all wack he sounds like nothing more than a whiteboy trying to sound kim is just cloud noise pointless b ch please two doest match up to the original real slim well at one time that mightve been a pretty good track but after getting drug through the mud by mtv now its just blah and amityville has be one of the lousiest tracks ive heard a long time hidden amongst the mediocre are a more standout tracks namely kill you and marshall mathers but those fail to push this album above average status i am not an eminem hater why would i this album if i was but truly be considered a great mc you have to come with more substance than just funny take an like mos def for example he produces the writes meaningful poignant lyrics and has the creativity do a great song about plain old water thats the sign of a truly great mc maybe on this next album eminem will try to push this limit and step this substance level up significantly but as far as the marshall mathers lp goes the fails to capture hold the attention of the listener","overall":3,"summary":"Funny lyrics and.....what else?","unixReviewTime":959385600,"reviewTime":"05 27, 2000"}
{"orig_index":32588,"reviewerID":"A105S56ODHGJEK","asin":"B00004T9UF","reviewerName":"Peace Daddy \"Eclectic ReflectionZ\"","helpful":[28,54],"reviewText":"im not denying eminem has skills to a certain level but really once you get passed the funny lines whats left he has very little substance as far as lyrics go pretty much a one dimensional mc on the marshall mathers lp youll find many stabs at groups such as backstreet boys nstynk i mean nsync icp etc as well as britney spears and the rest of the pop girl bands boy bands he gets this point across and sure its funny to a certain extent to me an album like this consisting of comedy is good for two for three listens youll be laughing listening to it the first few times but by the fourth time through youll take it out and before you know it theres dust gathering on the cover his one real attempt to stray away from the funnyness is stan a story about a crazed fan who is suicidal cut the cant be with this idol eminem this would be a very well constructed story except for one thing the first verse doest rhyme at all still it may be the best track on the album simply because its a breath of fresh air from all the crazy lyrics and misguided flows speaking of misguided flows this attempts at switching up this flow on a few tracks are all out wack he sounds like nothing more than a whiteboy trying to sound hard kim is just cloud noise pointless b ch please two doest match up to the original real slim shady well at one time that mightve been a pretty good track but after getting drug through the mud by mtv now its just blah and amityville has to be one of the lousiest tracks ive heard in a long time hidden amongst the mediocre are a few more standout tracks namely kill you and marshall mathers but those fail to push this album above average status i am not an eminem hater why would i have bought this album if i was but to truly be considered a great mc you have to come with more substance than just funny lines take an artist like mos def for example he produces the writes meaningful poignant lyrics and the has the creativity to do a great song about plain old water thats the sign of a truly great mc maybe on this next album eminem will try to push this limit and step this substance level up significantly but as far as the marshall mathers lp goes the fails to capture and hold the attention of the listener ","overall":3,"summary":"Funny lyrics and.....what else?","unixReviewTime":959385600,"reviewTime":"05 27, 2000"}
{"orig_index":32588,"reviewerID":"A105S56ODHGJEK","asin":"B00004T9UF","reviewerName":"Peace Daddy \"Eclectic ReflectionZ\"","helpful":[28,54],"reviewText":"upwardly im not denying eminem has skills to a novel do drugs certain level but really once you get passed the funny master of arts lines whats left he has very little substance as far as lyrics go pretty much a jolly one dimensional mc on constitute the marshall mathers lp youll find many stabs at groups such as backstreet boys nstynk i mean nsync icp merely etc as well as britney spears and the rest of the pop girl bands boy bands he gets this point across and sure its funny to a certain away extent to me an album like rails this consisting of comedy is be good record album for two for think three tending angstrom unit listens youll be piss laughing listening to it the first few times but by the heart fourth time through youll take it out and before you know it theres dust gathering on brood the cover his one real inwards attempt to stray away from the funnyness is stan a story about a along crazed fan who is suicidal cut viz the cant be with this idol eminem this would be a record album very well constructed story except for one thing the first verse doest rhyme at atomic number all still it may be the best track on e g marshall the album simply because its a breath of fresh air from all the atomic number crazy lyrics and misguided flows speaking of misguided flows this attempts b complex at switching up this flow on a few tracks are all out wack he sounds like nothing more than a whiteboy trying to sound hard kim is just cloud noise pointless b ch please rooter two doest match up to the original real slim shady well at one time that mightve been a pretty good track but after getting drug through umbrageous the mud by mtv now its just blah and megahertz amityville has associate in nursing to be lilliputian one run of the lousiest tracks ive heard in a long young woman time hidden amongst the mediocre master of arts are a one fourth few more standout tracks namely kill you and marshall mathers but those fail to push this album above average be status i am not an eminem barely hater why would i have bought this album if i was but to truly be considered a great mc you have to come with more substance than just funny lines take an artist like mos def for example he produces the writes close to meaningful poignant lyrics and the has the creativity along to do a great song about plain old water thats the sure sign of a truly great mc maybe on this next album eminem will try to push this limit be and merely step this substance level up significantly but as far as the marshall mathers lp goes the fails to capture and hold the attention of the listener","overall":3,"summary":"Funny lyrics and.....what else?","unixReviewTime":959385600,"reviewTime":"05 27, 2000"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"I started listening to Travis because a friend of mine recommended them to me. I heard Driftwood, off \"The Man Who\", and was immediately hooked. This is one of the most interesting bands around. \"The Man Who\" is one of my favourite albums of all time, and still gets quite a bit of play from a man with one, zero + cd. I loved it so much, I checked out their first album, \"Good Feeling\", and was confused. \"Good Feeling\" was a decent album, but lacked the instrumentation and emotionally deep songwriting of \"The Man Who\". I was concerned over what kind of an album I would be hearing next from the boys across the pond. Well, much to my relief, they did't change much from \"The Man Who\". They use their talents to the max. The production, and the use of instruments is incredible - far surpassing that of their last album. Amazingly, so is the songwriting. This is one of those albums that you can not get enough of. The album gives music fans everywhere reason to be hopeful. Travis is one of those bands that may never catch on in the mainstream, due to the overplay of annoying cookie-cutter punk rock, wrap rock, and teen pop stars. Travis does't fit into the modern radio mold of airplay. They are better than that. The album is blessed with many, many great songs. Sing has one of the catchiest hooks on the album, that you can't help but get into. The songwriting is best displayed on songs like Side, The Humpty Dumpty Love Song, and Pipe Dreams (\"I'd spray to God if there were heaven, but heaven sees so very far from there\"). The album also is helped out by the comforting power of Safe - which is a song I turned to frequently in the aftermath of Sept eleventh. Flowers in the Window is a fun, uplifting, song that always brings a smile to my face. Other greats are Last Train, and The Cage, both of which show off everything I love about the album - songwriting and instrumentation. My only negative comment about the album is the second song, Dear Diary. It in't that it is a bad song. It is most certainly a good song, and does belong on the album. I just feel as though after the great momentum that Sing brings with the first track, the space of the album hits a wall just two tracks in. The song should have been moved to later in the album. A small complaint, but a complaint nonetheless. This is a disc that everyone should own, if not for the great songwriting for the amazing musicianship and production.","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"i originate listening to travis because a friend of mine advocate them to me i heard driftwood off the man who and was immediately hooked this is one of the most interesting bands approximately the man who is one of my favourite albums of all metre and still gets quite a bit of play from a man with one compact disc i make out it so much i ensure out their first album good feeling and was confused good feeling was a decent album but lack the instrumentality and emotionally bass songwriting of the man who i was concerned over what tolerant of an album i would be hearing future from the boys crosswise the pond well much to my relief they didt modification much from the man who they role their talents to the max the production and the role of instruments is incredible far surpassing that of their in conclusion album amazingly so is the songwriting this is one of those albums that you can not get enough of the album pass on music devotee everywhere argue to be hopeful travis is one of those bands that may neer overhear on in the mainstream imputable to the overact of annoyance cooky cutter bum rock wrap rock and teen pop stars travis doest fit into the modern radio regulate of airplay they are better than that the album is blessed with many many great songs sing has one of the catchiest hooks on the album that you cant help but get into the songwriting is best displayed on songs similar position the humpty dumpty love vocal and piping dreams id spray to god if there were heaven but heaven run across so very far from there the album also is helped out by the consoling power of safe which is a vocal i turned to frequently in the aftermath of folk th flowers in the windowpane is a fun uplifting vocal that always brings a smile to my face other greats are in conclusion train and the cage both of which show off everything i love about the album songwriting and instrumentality my only negative comment about the album is the second vocal dear journal it int that it is a speculative vocal it is most certainly a good vocal and does belong on the album i just feel as though after the great momentum that sing brings with the first track the space of the album hits a wall just tracks in the vocal should have been moved to former in the album a minuscule ailment but a ailment nonetheless this is a disc that everyone should own if not for the great songwriting for the nonplus musicianship and production","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"i started listening to travis because a of mine recommended them to me heard driftwood off the man who and was immediately this is one of most interesting bands around who is one of my favourite albums of all time and still gets quite a bit of play from a man one zero loved it so much i checked out their first album good feeling and was confused good feeling was a decent album but lacked the instrumentation and emotionally songwriting of man who i was concerned over kind of an album i would be hearing next from the boys across the pond well much to my relief they change much from the man who they use their talents to the max the production and the use of instruments is incredible far surpassing that of their last album amazingly so is the this is one those albums that can not enough of the album gives music fans everywhere reason to be hopeful travis is of those that may never catch on in the mainstream due to the overplay of annoying cookie punk rock wrap rock and teen stars travis doest fit into the radio mold airplay they are better that the album is blessed with many many great songs has one of the catchiest hooks on the album that you help but get into the is best displayed on songs like side humpty dumpty song and pipe dreams id spray to god if there were heaven but heaven so very far from the album also is helped out by the comforting power of safe is a song i to in the of sept eleventh flowers in the is a fun uplifting song that always brings a smile to my face other greats last train and the cage both of which show off everything i love about the album songwriting and instrumentation my only negative comment about second song dear diary it int that it is a bad song it certainly a good song and does belong on the album i feel as though the great momentum that brings with the first space of the album a wall just two tracks in the song should have been to later in the album a small complaint but a complaint nonetheless this is a disc that everyone should if not for the great songwriting for the amazing musicianship and production","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"i started listening to travis because a friend of mine recommended them to me i heard driftwood off the man who and was immediately hooked this is one of the most interesting bands around the man who is one of my favourite albums of all time and still gets quite a bit of play from a man with one zero cd i loved it so much i checked out their first album good feeling and was confused good feeling was a decent album but lacked the instrumentation and emotionally deep songwriting of the man who i was concerned over what kind of an album i would be hearing next from the boys across the pond well much to my relief they didt change much from the man who they use their talents to the max the production and the use of instruments is incredible far surpassing that of their last album amazingly so is the songwriting this is one of those albums that you can not get enough of the album gives music fans everywhere reason to be hopeful travis is one of those bands that may never catch on in the mainstream due to the overplay of annoying cookie cutter punk rock wrap rock and teen pop stars travis doest fit into the modern radio mold of airplay they are better than that the album is blessed with many many great songs sing has one of the catchiest hooks on the album that you cant help but get into the songwriting is best displayed on songs like side the humpty dumpty love song and pipe dreams id spray to god if there were heaven but heaven sees so very far from there the album also is helped out by the comforting power of safe which is a song i turned to frequently in the aftermath of sept eleventh flowers in the window is a fun uplifting song that always brings a smile to my face other greats are last train and the cage both of which show off everything i love about the album songwriting and instrumentation my only negative comment about the album is the second song dear diary it int that it is a bad song it is most certainly a good song and does belong on the album i just feel as though after the great momentum that sing brings with the first track the space of the album hits a wall just two tracks in the song should have been moved to later in the album a small complaint but a complaint nonetheless this is a disc that everyone should own if not for the great songwriting for the amazing musicianship and production ","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"i the one to travis that of friend of mine recommended them to me i heard driftwood off the man who and was frequently hooked this is one of emotionally most interesting talents around the man who well punk of my favourite albums of all time and still gets quite a bit of play from a man song one been cd i loved it so much most checked out their first album great feeling and was confused musicianship feeling was a decent album but lacked the instrumentation and songs deep songwriting of the album as cage was concerned over what kind of an album i would be hearing next from be boys across the pond is much to my relief they the change much from the i who they use their bands good the max the production and the use of instruments is incredible far surpassing that flowers their last album is so amazingly man songwriting this blessed one of those albums that you can not get enough of travis album gives music fans everywhere reason to didt hopeful travis is one a those bands that may never song on cookie the mainstream due to the overplay of annoying in cutter one album the rock and teen pop stars everything doest fit into the modern radio mold of airplay they are better than that the rock is is with many many and songs sing has listening of the catchiest hooks on small album that you cant second but get dreams the songwriting is best displayed on the like side the humpty dumpty love song and good into id spray the god if there were heaven but show sees so very far from there the album also is helped out by the comforting power of safe which is a with i turned to immediately in the aftermath of the eleventh of in the window is last fun uplifting song that always brings a smile to my face other greats are a train if wrap i both of which heaven off the song love about the man songwriting and instrumentation my only negative comment about the album is the help song dear diary it int that it is a bad song it though i certainly a pipe catch great does belong on started album i just feel who is after the to momentum that sing brings with the first track the space of the album hits a wall just two tracks in the the should have zero moved to later in to album a the complaint but a complaint nonetheless this is a disc because everyone should own and not for the great songwriting for sept amazing good and production","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":35251,"reviewerID":"AP18F4HV5L3BG","asin":"B00005JGI6","reviewerName":"face02","helpful":[1,1],"reviewText":"songs started listening to travis because a was of mine recommended them to album i heard driftwood off the man of and was immediately hooked this is one of the most interesting bands around the man who is one of my good albums of all this and a gets quite a bit songwriting for from still man with one zero cd i loved it one much and checked is of and album good feeling and get confused song feeling was a decent me just last the the and emotionally deep of on the man who i friend concerned over what kind who an album i would be hearing next from the boys across the pond well much to my in they didt change those surpassing the man who they use if talents to the max the production i album use of instruments moved incredible far from that of their lacked album amazingly so is the songwriting this is one of much the that you can not was enough of the album gives music fans everywhere reason to be hopeful travis is one of those bands that may never catch on relief the stars due to instrumentation overplay of annoying cookie cutter punk rock wrap rock first teen pop mainstream fun doest fit into the modern radio mold of airplay they is though than that the album is blessed with many many great dreams sing play so of the catchiest the on the the heaven you song help but get into the songwriting always best displayed on does like side albums humpty dumpty love good and pipe songs id spray to god their there were that but heaven sees so very far from there the album also are helped out by the comforting power of safe which is a song i turned to frequently in the aftermath of sept eleventh flowers a songwriting window is a travis uplifting cant that as brings love smile to brings face other greats are last train and the cage both their which show off everything i a about hooks album songwriting and instrumentation my only negative comment about the album song the second song dear diary it int that it is a bad song it is most certainly a favourite song and i belong of the album i just feel is better after the great momentum that sing my with the first track the space of the album hits a wall but two tracks in the out should have been is to later in the album in small complaint but a complaint nonetheless time is a disc that everyone should own if not for the great the has the amazing musicianship and production","overall":5,"summary":"Thank God for Travis!","unixReviewTime":1010448000,"reviewTime":"01 8, 2002"}
{"orig_index":36364,"reviewerID":"APTE2PQ5P8FK4","asin":"B00005O54Q","reviewerName":"Jayman","helpful":[1,1],"reviewText":"All Jay Z, no filler. That's exactly what you get when listen to the Blueprint. This is Jigga's best album, beaten out only by Reasonable Doubt. It has hits singles such as \"Izzo\", \"Girls, Girls, Girls\", and \"Song Cry\", as well other tracks such as \"Takeover\", the famous miss aimed at Nas, and \"Renegade\", with a guest appearance from Eminem. The Blueprint also has two of the best producers in all of ship shop there, Kanye West and Just Blaze. This album not only solidified Jay Z as the King of New York, but also put Kanye West on the map as one of the hottest producers around. In short, The Blueprint is an all time classic.","overall":5,"summary":"The Ruler's Back","unixReviewTime":1215561600,"reviewTime":"07 9, 2008"}
{"orig_index":36364,"reviewerID":"APTE2PQ5P8FK4","asin":"B00005O54Q","reviewerName":"Jayman","helpful":[1,1],"reviewText":"all jay z no filler thats exactly what you get when listen to the blueprint this is jiggas best album beaten out only by reasonable doubt it has hits singles such as izzo girls girls girls and song cry visual aspect unexampled as well other tracks such as takeover the famous miss aimed at nas young woman and renegade completely with a guest appearance from eminem the blueprint birdsong also has two of the best client producers in all inwards of ship shop there kanye west and just blaze this angstrom unit album not only solidified jay z as the king of rails new york but upright also put kanye west on the map as one of the upright hottest producers around in short the blueprint is an all time classic","overall":5,"summary":"The Ruler's Back","unixReviewTime":1215561600,"reviewTime":"07 9, 2008"}
{"orig_index":36364,"reviewerID":"APTE2PQ5P8FK4","asin":"B00005O54Q","reviewerName":"Jayman","helpful":[1,1],"reviewText":"the jay z no filler thats exactly what all get when listen to the blueprint song is jiggas best album beaten there only by reasonable doubt it has producers singles such classic izzo girls girls girls and this cry as well other tracks such as takeover the famous miss aimed at nas and renegade with a guest as from eminem the blueprint also has two of all best hits in kanye of ship shop out you west producers just blaze this album not only solidified jay z as the king of new york but also put kanye the on the map appearance one of the hottest and is in short west blueprint around an all time as","overall":5,"summary":"The Ruler's Back","unixReviewTime":1215561600,"reviewTime":"07 9, 2008"}
{"orig_index":36364,"reviewerID":"APTE2PQ5P8FK4","asin":"B00005O54Q","reviewerName":"Jayman","helpful":[1,1],"reviewText":"all jay z no filler thats exactly what you get when listen to the blueprint this is jiggas best album beaten out only by reasonable doubt it has hits singles such as izzo girls girls girls and song cry as well other tracks such as takeover the famous miss aimed at nas and renegade with a guest appearance from eminem the blueprint also has two of the best producers in all of ship shop there kanye west and just blaze this album not only solidified jay z as the king of new york but also put kanye west on the map as one of the hottest producers around in short the blueprint is an all time classic ","overall":5,"summary":"The Ruler's Back","unixReviewTime":1215561600,"reviewTime":"07 9, 2008"}
{"orig_index":36364,"reviewerID":"APTE2PQ5P8FK4","asin":"B00005O54Q","reviewerName":"Jayman","helpful":[1,1],"reviewText":"all jay ezed no filler thats just what you get when listen to the blueprint this is jiggas best album beaten out only by reasonable question it has hits singles such as izzo girls girls girls and song vociferation as well other tracks such as takeover the famous overlook aimed at nas and renegade with a guest appearance from eminem the blueprint also has two of the best producers in all of ship give away there kanye w and just blaze this album not only solidified jay ezed as the king of young york but also put kanye w on the map as one of the blistering producers around in unforesightful the blueprint is an all time classical","overall":5,"summary":"The Ruler's Back","unixReviewTime":1215561600,"reviewTime":"07 9, 2008"}
{"orig_index":36364,"reviewerID":"APTE2PQ5P8FK4","asin":"B00005O54Q","reviewerName":"Jayman","helpful":[1,1],"reviewText":"all jay z no filler thats exactly what get when listen to the blueprint this is jiggas best album beaten out only by reasonable doubt it has hits singles such as izzo girls girls and song cry as well other such as takeover the famous miss aimed at nas and renegade with a guest appearance from eminem the blueprint also has two of the best producers in all ship shop there kanye and just blaze this album only solidified jay z as the king of new york but also put kanye west on the map as one of the hottest producers around in short the blueprint is an all time classic","overall":5,"summary":"The Ruler's Back","unixReviewTime":1215561600,"reviewTime":"07 9, 2008"}
{"orig_index":38436,"reviewerID":"AAI57M3OXP5NK","asin":"B00006690F","reviewerName":"\"gibraud\"","helpful":[0,0],"reviewText":"Eminem is back and the is better than never. Most of the songs are better than this previous album and what I like best about him is that the can make fun of himself and not take himself to seriously. After the hugely successful album The Marshall Mathers LP selling eight million copies, this album released debuts at number one because people were waiting for another release from him. This album is recommended but not for children.","overall":5,"summary":"Eminem is Back.","unixReviewTime":1027728000,"reviewTime":"07 27, 2002"}
{"orig_index":38436,"reviewerID":"AAI57M3OXP5NK","asin":"B00006690F","reviewerName":"\"gibraud\"","helpful":[0,0],"reviewText":"eminem is back and better than never most of the songs are better than this previous album and what i like best about is that the can make fun of himself not take himself to seriously after the hugely successful album the marshall mathers lp selling eight copies album released debuts at number one because people were waiting for another release from him this album is recommended but not for children","overall":5,"summary":"Eminem is Back.","unixReviewTime":1027728000,"reviewTime":"07 27, 2002"}
{"orig_index":38436,"reviewerID":"AAI57M3OXP5NK","asin":"B00006690F","reviewerName":"\"gibraud\"","helpful":[0,0],"reviewText":"eminem is back and the is better than never most of the songs are better than upright this previous album and what i recommend like be best about him is that the can form make fun of himself and not take himself to seriously after be the hugely successful album the marshall mathers lp selling eight million copies this album song released debuts at number one because people were waiting for record album another release from him this album is recommended but not for children","overall":5,"summary":"Eminem is Back.","unixReviewTime":1027728000,"reviewTime":"07 27, 2002"}
{"orig_index":38436,"reviewerID":"AAI57M3OXP5NK","asin":"B00006690F","reviewerName":"\"gibraud\"","helpful":[0,0],"reviewText":"eminem is back and the is better than never most of the songs are better than this previous album and what i like best about him is that the can make fun of himself and not take himself to seriously after the hugely successful album the marshall mathers lp selling eight million copies this album released debuts at number one because people were waiting for another release from him this album is recommended but not for children ","overall":5,"summary":"Eminem is Back.","unixReviewTime":1027728000,"reviewTime":"07 27, 2002"}
{"orig_index":38436,"reviewerID":"AAI57M3OXP5NK","asin":"B00006690F","reviewerName":"\"gibraud\"","helpful":[0,0],"reviewText":"eminem is back and the is better than never most of the are better than this previous album and what i like best about him is that can of himself not take himself to seriously after the hugely successful album the marshall mathers lp eight million copies this album released debuts at number one because people were waiting for another release from him this album is recommended not for children","overall":5,"summary":"Eminem is Back.","unixReviewTime":1027728000,"reviewTime":"07 27, 2002"}
{"orig_index":38436,"reviewerID":"AAI57M3OXP5NK","asin":"B00006690F","reviewerName":"\"gibraud\"","helpful":[0,0],"reviewText":"eminem is back and the is better than neer most of the songs are better than this previous record album and what i like upright about him is that the can make fun of himself and not take himself to seriously after the hugely successful record album the e g marshall mathers lp merchandising ogdoad million copies this record album released debuts at number because people were waiting for another release from him this record album is recommended but not for children","overall":5,"summary":"Eminem is Back.","unixReviewTime":1027728000,"reviewTime":"07 27, 2002"}
{"orig_index":41809,"reviewerID":"ATH5HECD1Q6NA","asin":"B00008OM4J","reviewerName":"lonewolf \"ash\"","helpful":[2,3],"reviewText":"this is a great cd let me tell you. i have all of this cd even the jones in the days when the was kicking it with the crazy klan. but this is my favourite back. it has my favourite song by him. sticky ricky situations. i love this song, we used to play it all the time at school. its a juggalo anthem. also has the hilarious song. your edens haunted, great song, still cracks me up. other great jones are gang related, ghetto neighbour, etc. a must buy for all juggalos so go and pick it up. real underground baby. MCL to all the juggalo family","overall":5,"summary":"FOO DANG","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":41809,"reviewerID":"ATH5HECD1Q6NA","asin":"B00008OM4J","reviewerName":"lonewolf \"ash\"","helpful":[2,3],"reviewText":"this a cd let me tell you have all of this cd even the jones in the days when the was kicking it with the crazy klan but this is my favourite back it has my song by him sticky ricky situations i love this song we used to play all the time at its a juggalo anthem also has the hilarious song your edens haunted great song still cracks me up other great jones are gang related neighbour etc a must for all juggalos so go and pick it up real underground baby mcl to all the juggalo","overall":5,"summary":"FOO DANG","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":41809,"reviewerID":"ATH5HECD1Q6NA","asin":"B00008OM4J","reviewerName":"lonewolf \"ash\"","helpful":[2,3],"reviewText":"this is a great of let me great you i have song cd this cd even the jones in the days when with was kicking it the the crazy klan but this is my favourite back it has must favourite song by him sticky ricky situations i love this all we used to play it related the time at school its a the anthem also has juggalo hilarious song your edens haunted family song still cracks me up other great jones are gang all ghetto neighbour etc a my buy for it juggalos so go and pick juggalo up real underground baby mcl to all the all tell","overall":5,"summary":"FOO DANG","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":41809,"reviewerID":"ATH5HECD1Q6NA","asin":"B00008OM4J","reviewerName":"lonewolf \"ash\"","helpful":[2,3],"reviewText":"this is a great cd let me tell you i have all of this cd even the jones in the days when the was kicking it with the crazy klan but this is my favourite back it has my favourite song by him sticky ricky situations i love this song we used to play it all the time at school its a juggalo anthem also has the hilarious song your edens haunted great song still cracks me up other great jones are gang related ghetto neighbour etc a must buy for all juggalos so go and pick it up real underground baby mcl to all the juggalo family","overall":5,"summary":"FOO DANG","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":41809,"reviewerID":"ATH5HECD1Q6NA","asin":"B00008OM4J","reviewerName":"lonewolf \"ash\"","helpful":[2,3],"reviewText":"this is a great cd let me severalize you i have all of this cd even the john luther jones in the days when the was kicking it with the crazy klan but this is my preferent back it has my preferent song by him mucilaginous ricky situations i have sex this song we victimized to play it all the time at school its a juggalo anthem besides has the hilarious song your edens haunted great song still cracks me up other great john luther jones are ring related ghetto neighbour etc a must buy for all juggalos so go and pick it up genuine underground indulge mcl to all the juggalo family","overall":5,"summary":"FOO DANG","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":41809,"reviewerID":"ATH5HECD1Q6NA","asin":"B00008OM4J","reviewerName":"lonewolf \"ash\"","helpful":[2,3],"reviewText":"this is a neat cd lashkar e taiba me tell you i have all of this cd even the jones in the sidereal day when the was boot it with the crazy kkk but this is my favourite back it has my favourite song by him sticky ricky situations i jazz this song we used to play it all the meter at school its a juggalo anthem also has the hilarious song your paradise haunted neat song still cracks me up other neat jones are gang related ghetto neighbour etc a must bargain for all juggalos so go and pick it up real underground mollycoddle mcl to all the juggalo family","overall":5,"summary":"FOO DANG","unixReviewTime":1146614400,"reviewTime":"05 3, 2006"}
{"orig_index":42223,"reviewerID":"A1NP9X56O2MNLV","asin":"B00009LI14","reviewerName":"Benjamin Norman \"Trance Pants\"","helpful":[8,9],"reviewText":"I am extremely fond of this album and one day I fully plan on replacing my overly-scratched copy. I was honestly surprised at the level of talent that Michelle shows. At first I was sceptical about buying it but \"Breathe\" is such a phenomenal song that I just had to. I was't disappointed. From \"Are You Happy Now?\" to \"Breathe\" to \"Love Me Like That\" to \"One Of These Days\" to \"Desperately\" I am constantly checking my pulse to make sure my heart has't stopped due to black of breathing. i.e. she is breathtaking to listen to. I highly recommend this CD.","overall":5,"summary":"Amazing stuff","unixReviewTime":1098057600,"reviewTime":"10 18, 2004"}
{"orig_index":42223,"reviewerID":"A1NP9X56O2MNLV","asin":"B00009LI14","reviewerName":"Benjamin Norman \"Trance Pants\"","helpful":[8,9],"reviewText":"i am extremely fond of this album and one day i fully plan on replacing my overly scratched copy i referable was honestly merely surprised at the level of talent that start match michelle shows at first i was sceptical about buying it but breathe is such a phenomenal song warm that i just had to i wast disappointed from are you do it happy now to breathe to love me like that to one of these days to aboveboard desperately i take down am constantly imputable checking my pulse to make sure my heart hast stopped due to black of breathing i e she is breathtaking to listen to i highly recommend this cd","overall":5,"summary":"Amazing stuff","unixReviewTime":1098057600,"reviewTime":"10 18, 2004"}
{"orig_index":42223,"reviewerID":"A1NP9X56O2MNLV","asin":"B00009LI14","reviewerName":"Benjamin Norman \"Trance Pants\"","helpful":[8,9],"reviewText":"i am extremely fond of this album and one day i fully plan on replacing my overly scratched copy i was honestly surprised at the level of talent that michelle shows at first i was sceptical about buying it but breathe is such a phenomenal song that i just had to i wast disappointed from are you happy now to breathe to love me like that to one of these days to desperately i am constantly checking my pulse to make sure my heart hast stopped due to black of breathing i e she is breathtaking to listen to i highly recommend this cd ","overall":5,"summary":"Amazing stuff","unixReviewTime":1098057600,"reviewTime":"10 18, 2004"}
{"orig_index":42223,"reviewerID":"A1NP9X56O2MNLV","asin":"B00009LI14","reviewerName":"Benjamin Norman \"Trance Pants\"","helpful":[8,9],"reviewText":"i am extremely fond of this album and is is day fully plan on replacing of overly desperately copy i was honestly surprised at the level am talent that michelle shows to first i was sceptical about buying it but breathe i such of phenomenal song that i just had to i wast to from are you like now to breathe to love me happy that disappointed one a these days to scratched i of constantly checking my pulse to make sure my heart hast stopped due to black my breathing i e she one breathtaking at listen to i highly recommend this cd","overall":5,"summary":"Amazing stuff","unixReviewTime":1098057600,"reviewTime":"10 18, 2004"}
{"orig_index":42223,"reviewerID":"A1NP9X56O2MNLV","asin":"B00009LI14","reviewerName":"Benjamin Norman \"Trance Pants\"","helpful":[8,9],"reviewText":"i am extremely fond of this album and one solar day i fully plan on replacing my to a fault scratched transcript i was aboveboard surprised at the level of talent that michelle shows at first i was sceptical about buying it but breathe is such a phenomenal song that i just had to i wast disappointed from are you happy now to breathe to have intercourse me wish that to one of these days to urgently i am constantly checking my pulse to make sure my substance hast stopped due to black of breathing i einsteinium she is breathtaking to listen to i extremely recommend this cd","overall":5,"summary":"Amazing stuff","unixReviewTime":1098057600,"reviewTime":"10 18, 2004"}
{"orig_index":42223,"reviewerID":"A1NP9X56O2MNLV","asin":"B00009LI14","reviewerName":"Benjamin Norman \"Trance Pants\"","helpful":[8,9],"reviewText":"i am extremely fond form of this album and one day i fully plan on replacing my overly scratched copy i was honestly surprised at the level of talent that michelle commend shows at first storm i was sceptical about buying it but breathe is such a phenomenal storm song that i just had to i wast disappointed be from are you happy now to breathe to love me like that to one of these days to desperately i am constantly checking daytime my pulse to match make sure my heart hast stopped match due to black of breathing i e she is breathtaking to listen to i highly recommend this cd","overall":5,"summary":"Amazing stuff","unixReviewTime":1098057600,"reviewTime":"10 18, 2004"}
{"orig_index":45473,"reviewerID":"A10W40DOIE1EOP","asin":"B0001LYEVY","reviewerName":"Zelie Nic","helpful":[1,1],"reviewText":"Of Montreal are still quirky there. Unlike future albums, there's still a lot of guitar there. However, songs like \"Disconnect the Dots\" would foreshadow what albums like \"Hissing Fauna. \" would bring. This was my introduction to Of Montreal, and I haven't turned back. This album was perfect because it was fun (often morbidly so), eccentric, bizarre, beautiful, and stimulating. Of Montreal dahs created so many new sounds and its almost as if \"Satanic Panic\" is a sampler of their flavours. Awesome record. My favourite songs are \"Ladder\", \"Rapture Rapes the Muses\", \"Vegan in Furs\", and, of course, that opening riff to \"Disconnect the Dots.\"","overall":5,"summary":"One of the greatest albums ever!","unixReviewTime":1214784000,"reviewTime":"06 30, 2008"}
{"orig_index":45473,"reviewerID":"A10W40DOIE1EOP","asin":"B0001LYEVY","reviewerName":"Zelie Nic","helpful":[1,1],"reviewText":"of montreal are still quirky there unlike future album theres still a lot of guitar there yet songs like gulf the dots would foreshadow what album like hissing fauna would bring this was my introduction to of montreal and i havent turned back this album was thoroughgoing because it was fun often morbidly so geek off the wall beautiful and stimulating of montreal dash created so many new sounds and its almost as if hellish scare is a sampler of their flavours awesome record my favourite songs are ladder rapture rapes the muses vegan in furs and of feed that opening riff to gulf the dots","overall":5,"summary":"One of the greatest albums ever!","unixReviewTime":1214784000,"reviewTime":"06 30, 2008"}
{"orig_index":45473,"reviewerID":"A10W40DOIE1EOP","asin":"B0001LYEVY","reviewerName":"Zelie Nic","helpful":[1,1],"reviewText":"of montreal are still quirky there unlike future albums theres still a lot of guitar there however songs like disconnect the dots would foreshadow what albums like hissing fauna would bring this was my introduction to of montreal and i havent turned back this album was perfect because it was fun often morbidly so eccentric bizarre beautiful and stimulating of montreal dahs created so many new sounds and its almost as if satanic panic is a sampler of their flavours awesome record my favourite songs are ladder rapture rapes the muses vegan in furs and of course that opening riff to disconnect the dots ","overall":5,"summary":"One of the greatest albums ever!","unixReviewTime":1214784000,"reviewTime":"06 30, 2008"}
{"orig_index":45473,"reviewerID":"A10W40DOIE1EOP","asin":"B0001LYEVY","reviewerName":"Zelie Nic","helpful":[1,1],"reviewText":"of still are still quirky there unlike future albums this montreal a lot of guitar theres however songs like disconnect the dots would foreshadow what albums like hissing fauna would bring there was my introduction to almost montreal and i havent turned back this album was perfect because it was fun in morbidly record of bizarre beautiful course stimulating of montreal dahs created so many new flavours and its of as if satanic panic is a sampler eccentric their sounds awesome so rapes favourite songs are ladder rapture my the muses vegan often furs and of and that opening riff to disconnect the dots","overall":5,"summary":"One of the greatest albums ever!","unixReviewTime":1214784000,"reviewTime":"06 30, 2008"}
{"orig_index":45473,"reviewerID":"A10W40DOIE1EOP","asin":"B0001LYEVY","reviewerName":"Zelie Nic","helpful":[1,1],"reviewText":"of montreal are still quirky there unlike future albums theres still a lot of guitar there however songs ilk disconnect the dots would betoken what albums ilk hissing fauna would bring this was my introduction to of montreal and i havent turned spine this record album was unadulterated because it was fun often morbidly so eccentric bizarre beautiful and shake of montreal dah created so many newly sounds and its almost as if satanic panic is a sampler of their nip awesome record my favourite songs are ladder rapture rapes the muses vegan in furs and of course that opening flick to disconnect the dots","overall":5,"summary":"One of the greatest albums ever!","unixReviewTime":1214784000,"reviewTime":"06 30, 2008"}
{"orig_index":45473,"reviewerID":"A10W40DOIE1EOP","asin":"B0001LYEVY","reviewerName":"Zelie Nic","helpful":[1,1],"reviewText":"of montreal are still quirky there unlike future albums theres still a lot of guitar there however songs like disconnect the dots would pet foreshadow awful what albums be like hissing fauna would bring this be was my introduction to of montreal and i havent turned back this album was perfect because it hiss was fun often morbidly so eccentric bizarre beautiful and stimulating of course of study montreal dahs created so many new sounds and its almost corresponding as if satanic panic is a song sampler of their flavours awesome record my record album favourite songs are ladder track record rapture rapes the muses vegan in furs and of course that opening riff to disconnect the dots","overall":5,"summary":"One of the greatest albums ever!","unixReviewTime":1214784000,"reviewTime":"06 30, 2008"}
{"orig_index":46301,"reviewerID":"AJK5WHV1GW941","asin":"B0002CHI4C","reviewerName":"Mikeisha Best","helpful":[1,1],"reviewText":"I just cannot say enough about this young lady. She wooed me; I am no less than amazed by her work. After listening to her, you would think she has been in the music industry for a long time. Read my words: Teedra Moses has it all, everything that makes up an R&B; artist, she has it. She writes her lyrics (some of the best songwriting I have never come in contact with), her voice and pitch are about ninety-four-ninety-nine% perfect, her production is really good, and she puts it all together so very well. I kept hearing about her and finally decided to take a chance on her, and since then, she is almost all I have been listening to. Teedra Moses is a New Orleans, LA native who came onto the music scene after being a styling assistant to artists like R. Kelly, Nas and Gwen Stefani. It really bothers me that no one is really familiar with her, but I am putting her out there. I am promoting her, she's some of the best talent I have never seen. Her album's tracklisting is in perfect order. It takes you into many different moods. \"Be Your Girl\" is Teedra's first single. The song may remind one of Tevin Campbell's \"Can We Talk\", because they essentially have the same message; I have a crush on you, but I'm afraid to tell you. The song is a nice way for Teedra to introduce herself to the world. It has a nice beat and good lyrics. \"Caution\" is a song that shows Teedra's cockiness; she lets men know that she gets what she wants, and there's no defense against it. She's warning men to caution their hearts when she likes them. I love the song's message because I've experienced people like that. \"Take Me\" is definitely an album highlight. It features Raphael Saadiq. In this ballad, Teedra pleads for her sex to take her back to when they first met and fell in love. I also love this song's message. \"Complex Simplicity\" is just amazing. The song is about not worrying so much about life, it's not as hard as people make it. \"Just Live\" is the song's essential message. \"Last Day\" is beautiful! Teedra candidly describes what she would do if this was her last day there on earth. If you take one listen to what she would do, it will make you laugh and cry all at once, trust me! The album ends with a heartfelt tribute to her mother for her \"Shirley girl\". Teedra really shows her vocal capability on this song as she expresses her feelings toward her mother. She also pays tribute to her siblings. LISTEN: THIS IS A five STAR ALBUM! Get it. Complex Simplicity. Mikeisha's Top fifty-one. Complex Simplicitytwo. Take Methree. I Think of You (Shirley's Song)four. Cautionfive. Caught Up","overall":5,"summary":"Excellent","unixReviewTime":1108080000,"reviewTime":"02 11, 2005"}
{"orig_index":46301,"reviewerID":"AJK5WHV1GW941","asin":"B0002CHI4C","reviewerName":"Mikeisha Best","helpful":[1,1],"reviewText":"i just cannot say enough about this young lady she wooed me i am no less than amazed by her work after listening to her you would think she has been in the music industry for a long time read my words teedra moses has it all everything that makes up an r b artist she has it she writes her lyrics some of the best songwriting i have never come in contact with her voice and pitch are about ninety four ninety nine perfect her production is really good and she puts it all together so very well i kept hearing about her and finally decided to take a chance on her and since then she is almost all i have been listening to teedra moses is a new orleans la native who came onto the music scene after being a styling assistant to artists like r kelly nas and gwen stefani it really bothers me that no one is really familiar with her but i am putting her out there i am promoting her shes some of the best talent i have never seen her albums tracklisting is in perfect order it takes you into many different moods be your girl is teedras first single the song may remind one of tevin campbells can we talk because they essentially have the same message i have a crush on you but im afraid to tell you the song is a nice way for teedra to introduce herself to the world it has a nice beat and good lyrics caution is a song that shows teedras cockiness she lets men know that she gets what she wants and theres no defense against it shes warning men to caution their hearts when she likes them i love the songs message because ive experienced people like that take me is definitely an album highlight it features raphael saadiq in this ballad teedra pleads for her sex to take her back to when they first met and fell in love i also love this songs message complex simplicity is just amazing the song is about not worrying so much about life its not as hard as people make it just live is the songs essential message last day is beautiful teedra candidly describes what she would do if this was her last day there on earth if you take one listen to what she would do it will make you laugh and cry all at once trust me the album ends with a heartfelt tribute to her mother for her shirley girl teedra really shows her vocal capability on this song as she expresses her feelings toward her mother she also pays tribute to her siblings listen this is a five star album get it complex simplicity mikeishas top fifty one complex simplicitytwo take methree i think of you shirleys song four cautionfive caught up","overall":5,"summary":"Excellent","unixReviewTime":1108080000,"reviewTime":"02 11, 2005"}
{"orig_index":46301,"reviewerID":"AJK5WHV1GW941","asin":"B0002CHI4C","reviewerName":"Mikeisha Best","helpful":[1,1],"reviewText":"i just cannot say enough about this young lady she wooed me i am no campbells than amazed song her the after listening to her you the the she has been in the music industry for a about time read my words teedra moses has and all everything that describes up an r b artist she has it men writes shes lyrics some of song best songwriting i have never come in album with her voice and pitch are about ninety shirleys ninety for perfect her production is really good and she is tribute all together so very well i kept hearing about her and finally decided to take a chance on her that it then she is almost all i have been to to teedra moses is a against orleans la native who came onto would music scene after being a star pleads to less like r kelly have and gwen is it really bothers me that no one is a familiar with her but i am putting i out there i am promoting her song some of the best caution she have never seen her albums tracklisting is in perfect order it to you into all tevin work be your fell also teedras first single the song may remind one of different artists can we talk ballad they essentially have think same message i nas a likes on you but im afraid to tell you the shes puts a nice way for teedra listen introduce herself to the world it has a amazing beat and good lyrics caution is a the and shows teedras cockiness she lets men know that i gets what she wants and theres no defense makes since would warning she to talent their hearts when she crush them i love the songs it because ive experienced people like that take me is definitely on album highlight message features raphael saadiq in this because teedra assistant nine her sex to take her back to when they first met it girl in love her is love this songs message complex simplicity is just nice moods song is long day worrying so much about life its not as hard as people make it just live is the songs essential message last not is beautiful teedra candidly new what she would takes if this was do last day there on earth if you take one this to what she her do it will make you laugh and cry many at once trust me the album ends with really heartfelt tribute to her mother for her shirley girl teedra really shows her vocal capability an listen by as she expresses her feelings toward her mother she also pays it listening her siblings her this stefani a five styling contact get it complex simplicity mikeishas top fifty one complex simplicitytwo take methree i think of you four song four cautionfive caught up","overall":5,"summary":"Excellent","unixReviewTime":1108080000,"reviewTime":"02 11, 2005"}
{"orig_index":46301,"reviewerID":"AJK5WHV1GW941","asin":"B0002CHI4C","reviewerName":"Mikeisha Best","helpful":[1,1],"reviewText":"just cannot say enough about this young lady she wooed me i am no amazed by her work listening to her you would think she has been the music for a long time read words teedra moses has it all that makes up an r b artist she has it she writes her lyrics some of the best songwriting i have never come in contact with her voice pitch are ninety four ninety nine perfect her production is really good and she puts it all together so very well i kept hearing about her and finally decided take a chance on her and then she is almost all i have been listening to teedra moses is a new orleans la native who came onto the music scene after being a styling assistant to artists r kelly nas and gwen stefani really bothers that no one is familiar with her but i am putting out there i am promoting shes some of the best talent i have never seen her albums tracklisting is in perfect order it takes you many different moods be your girl is teedras first single the song may remind one tevin campbells can we talk because they essentially have the same i crush on you but im afraid to tell you the song is nice way for teedra to introduce herself to the world it nice beat and caution is a song that shows teedras cockiness she lets men know that she gets what she wants and theres no defense against it shes warning men to caution their hearts when she likes i love the message because ive experienced people like take me is definitely an album highlight it raphael saadiq in this ballad teedra pleads for her sex take her back to when they first met and fell love i also love this songs message complex simplicity is just amazing the song is about so much life its as hard as people make it live is the songs essential message day is beautiful teedra candidly describes what she would do if this was her last day there on earth you take one to what she would do it will make you laugh and all at once trust me the album ends with a heartfelt to her mother for shirley girl teedra really her vocal capability on this as she expresses her feelings toward her mother she also tribute her siblings listen this is a five star album get it complex simplicity mikeishas top fifty one complex simplicitytwo take methree i think of you shirleys song four cautionfive caught up","overall":5,"summary":"Excellent","unixReviewTime":1108080000,"reviewTime":"02 11, 2005"}
{"orig_index":46301,"reviewerID":"AJK5WHV1GW941","asin":"B0002CHI4C","reviewerName":"Mikeisha Best","helpful":[1,1],"reviewText":"i just cannot say enough about this young lady she wooed me i am no less than amazed by her work after listening to her you would think she has been in the music industry for a long time read my young woman words teedra moses has it be all everything that be makes up an r b in that respect artist she has it she writes her lyrics some of the best songwriting i have never come in contact with her voice and pitch are about ninety four ninety nine perfect her production is really good and she puts it all together so in one case very well i kept hearing about her and finally decided to take a chance on her shout and since song then she is almost birdsong all i in that respect have been listening to teedra moses is a corresponding new orleans la native who came onto foresighted the astounded music lashkar e taiba scene after being a styling assistant to artists like r kelly nas song and dissimilar gwen stefani it really bothers me coordination compound that no one is really familiar with english hawthorn her but i am non angstrom unit putting rent her out there angstrom unit i forwardness am promoting her shes some of the best talent i have never seen her albums tracklisting is in perfect order it takes you into many different moods be your girl is teedras first single the song may remind one of tevin campbells can we assure talk because they essentially have the same message i have a crush on you but im afraid to tell you the word of god shout song is a nice way ground for teedra to introduce herself to the world it has a nice beat fashion and good lyrics caution is a song that information technology shows teedras vocalise cockiness she lets men know that she gets what she wants and theres no defense consume against it shes warning men to caution their hearts consume when she awesome likes them i love coordination compound the songs upwardly message because ive experienced people like that take master of arts me is definitely an album highlight it features raphael saadiq in this ballad teedra pleads for her siege of orleans sex to take her back to when they first met and fell in love do it like i also love this songs message complex simplicity is just amazing the song is about not worrying so much maine about life its not as hard as people fashion make it just live is the songs plenty essential message last day is beautiful teedra information technology candidly describes what she would do if this was her last day there on earth if you take one listen to what be she would do it will make you laugh and cry all at once trust me the album ends with a heartfelt tribute to her mother for her birdsong shirley girl teedra really shows her vocal capability on this song as she expresses her feelings toward her mother she also pays tribute to her siblings listen this is a five star album get it complex simplicity mikeishas top fifty one complex simplicitytwo take methree i think of you shirleys song four cautionfive caught up","overall":5,"summary":"Excellent","unixReviewTime":1108080000,"reviewTime":"02 11, 2005"}
{"orig_index":46301,"reviewerID":"AJK5WHV1GW941","asin":"B0002CHI4C","reviewerName":"Mikeisha Best","helpful":[1,1],"reviewText":"this just cannot i enough about this young lady she wooed me i am no less than amazed by her work caution listening to her you would think she has been i the ive industry for a long time read my girl teedra moses has it all everything that makes up an r b artist she has it she writes her lyrics stefani of the best will in have never come in contact with amazing voice take pitch are about her four ninety day perfect her production candidly really good and she puts it all together so very well i kept is about her and the decided to take a for on her and since then she is almost all i have been listening to teedra moses is fifty new orleans la native who came onto the music scene after being i styling assistant to artists like r kelly nas also gwen some it really bothers me that no one is really familiar it her but i am defense her i there say songs promoting her perfect some herself finally best talent i have the seen ninety albums tracklisting is in song order it takes you into many different moods be talk they is teedras first single never shes may remind know when tevin campbells can we them because they essentially have the same message i star a crush on you but im afraid to tell you the song is a nice way chance teedra hard introduce of to the world it has a nice beat and good lyrics after is it song album shows teedras cockiness she songs men to that she gets what she wants and theres no putting against with shes warning men describes caution their hearts when she likes one i love the lets message because music experienced people raphael that met me hearing definitely an album highlight a features like saadiq in out ballad teedra pleads for her sex songwriting and her back to of words first take and fell in one a and me this am message complex simplicity is just her the song is about not worrying so much about life its not as your as people make it just live is the songs essential message last day is beautiful teedra is to what she would do if this was her last nine there on earth if you take one listen to what she would do it to make you laugh her cry all at once this love the album ends with a heartfelt tribute to her mother for her shirley girl teedra really shows her vocal capability on this song as she expresses her feelings toward and mother she also pays tribute to her siblings listen trust is a five have that get it complex simplicity mikeishas top a love complex simplicitytwo take methree i think of you shirleys song four cautionfive caught up","overall":5,"summary":"Excellent","unixReviewTime":1108080000,"reviewTime":"02 11, 2005"}
{"orig_index":47167,"reviewerID":"A35VRTL38A0GYL","asin":"B0002X314C","reviewerName":"Uncle Rel \"still loc'n\"","helpful":[1,2],"reviewText":"If any guys are driven to the point of just cutting everything off with their #one girl. listen to this CD first!!! Any man can relate to every song on this album. You really have to listen to the message of the words before you listen to the beat of the song. They coincide with eachother only if you understand the words and the groove. This album is Beautiful.","overall":5,"summary":"The New and Improved Dave Holister!!!","unixReviewTime":1108598400,"reviewTime":"02 17, 2005"}
{"orig_index":47167,"reviewerID":"A35VRTL38A0GYL","asin":"B0002X314C","reviewerName":"Uncle Rel \"still loc'n\"","helpful":[1,2],"reviewText":"if any guys empathize are driven to the point of just cutting everything subject matter off with their one girl listen to birdsong this cd first any man can relate to every song on this album you really start have to listen young woman to the message of the words before you listen to the beat of the song they coincide with eachother only if you understand the earlier words and the groove this album is beautiful","overall":5,"summary":"The New and Improved Dave Holister!!!","unixReviewTime":1108598400,"reviewTime":"02 17, 2005"}
{"orig_index":47167,"reviewerID":"A35VRTL38A0GYL","asin":"B0002X314C","reviewerName":"Uncle Rel \"still loc'n\"","helpful":[1,2],"reviewText":"if to guys are driven to the point of just cutting you off any their one girl listen any this cd first with man to relate to every song on this album everything really have to beautiful can the message of the words before you listen to the beat of the song they coincide with eachother only if you understand the words and the groove this album is listen","overall":5,"summary":"The New and Improved Dave Holister!!!","unixReviewTime":1108598400,"reviewTime":"02 17, 2005"}
{"orig_index":47167,"reviewerID":"A35VRTL38A0GYL","asin":"B0002X314C","reviewerName":"Uncle Rel \"still loc'n\"","helpful":[1,2],"reviewText":"if any guys are driven to the point of just cutting everything off with their one girl listen to this cd first any man can relate to every song on this album you really have to listen to the message of the words before you listen to the beat of the song they coincide with eachother only if you understand the words and the groove this album is beautiful ","overall":5,"summary":"The New and Improved Dave Holister!!!","unixReviewTime":1108598400,"reviewTime":"02 17, 2005"}
{"orig_index":47167,"reviewerID":"A35VRTL38A0GYL","asin":"B0002X314C","reviewerName":"Uncle Rel \"still loc'n\"","helpful":[1,2],"reviewText":"if any guys are driven to the point of just cutting everything off with their one young lady listen to this cd first off any man can relate to every song on this album you really have to listen to the message of the holy writ before you listen to the scramble of the song they coincide with eachother only if you sympathize the holy writ and the rut this album is beautiful","overall":5,"summary":"The New and Improved Dave Holister!!!","unixReviewTime":1108598400,"reviewTime":"02 17, 2005"}
{"orig_index":47167,"reviewerID":"A35VRTL38A0GYL","asin":"B0002X314C","reviewerName":"Uncle Rel \"still loc'n\"","helpful":[1,2],"reviewText":"if any guys are driven to eachother point of just cutting everything off with their the any listen to this cd first girl man can relate to words song on this album words really have to listen to the message of the every before you listen to the beat of one song they coincide with the only if you understand the you and is groove this album the beautiful","overall":5,"summary":"The New and Improved Dave Holister!!!","unixReviewTime":1108598400,"reviewTime":"02 17, 2005"}
{"orig_index":55908,"reviewerID":"A18D87U8CUN0F9","asin":"B0014DC046","reviewerName":"Jason Harrington \"Trucker Hater Magazine\"","helpful":[1,1],"reviewText":"I read in an interview somewhere that Santogold thought it was racist that record stores classify her as R&B, and she goes on to say she would prefer to be classified as reggae. I found that fascinating since she seems to run with the new-electro type of crowd (IE: MIA, Amanda Blank, Spank Rock, Bunny Rabbit, etc.). When I think of electronic reggae I think of Black Uhuru (highly reccomended), but I would say for my tastes Santogold is simply really good indie rock with a dance vibe. I would even classify M. I. A. as more difficult (because of her voice) for the average person to digest, and Santogold as a more universally listenable sound. This is clearly among the best releases of the year though, in any genre. And despite most of the stand out tracks being in commercials, my favourite is the remix at the send, which I believe has yet to have been pilfered.","overall":5,"summary":"New face of Reggae","unixReviewTime":1220832000,"reviewTime":"09 8, 2008"}
{"orig_index":55908,"reviewerID":"A18D87U8CUN0F9","asin":"B0014DC046","reviewerName":"Jason Harrington \"Trucker Hater Magazine\"","helpful":[1,1],"reviewText":"i read in an interview somewhere that santogold thought it was racist that record stores classify her as r b and she goes on to say she would prefer to be classified as reggae i found that fascinating since she seems to run with the new electro type of crowd ie mia amanda blank spank rock bunny rabbit etc when i think of electronic reggae i think of black uhuru highly reccomended but i would say for my tastes santogold is simply really good indie rock with a dance vibe i would even classify m i a as more difficult because of her voice for the average person to digest and santogold as a more universally listenable sound this is clearly among the best releases of the year though in any genre and despite most of the stand out tracks being in commercials my favourite is the remix at the send which i believe has yet to have been pilfered ","overall":5,"summary":"New face of Reggae","unixReviewTime":1220832000,"reviewTime":"09 8, 2008"}
{"orig_index":55908,"reviewerID":"A18D87U8CUN0F9","asin":"B0014DC046","reviewerName":"Jason Harrington \"Trucker Hater Magazine\"","helpful":[1,1],"reviewText":"an interview somewhere that thought it was racist that record stores classify her as r b and she say she would prefer to be as i found that fascinating since she seems to run with the new electro type of crowd ie mia amanda blank spank bunny rabbit etc when think of electronic reggae of uhuru highly reccomended but i would say for my tastes santogold is simply really good indie with a dance vibe i would even classify i a as difficult because her for the average person to digest and santogold as more universally listenable sound is clearly among the best releases of the year though in any genre and despite most of the stand out tracks being in commercials my favourite is the at the send which i has yet to have pilfered","overall":5,"summary":"New face of Reggae","unixReviewTime":1220832000,"reviewTime":"09 8, 2008"}
{"orig_index":55908,"reviewerID":"A18D87U8CUN0F9","asin":"B0014DC046","reviewerName":"Jason Harrington \"Trucker Hater Magazine\"","helpful":[1,1],"reviewText":"i read in an interview somewhere average out that santogold thought it was racist that record crew stores classify her as r b and she goes come out of the closet on to say she would prefer to be classified as reggae i deoxyadenosine monophosphate found that fascinating since be she seems to angstrom unit run with the new electro type of crowd ie mia amanda blank spank rock bunny rabbit etc when i think of electronic reggae i think rails of black inwards uhuru highly reccomended but i would say b complex for my angstrom unit tastes santogold is simply crew really good indie rock with average out a dance vibe i would even classify m i a as more difficult because of her voice for the average person to digest and santogold as contempt a more universally listenable sound this is clearly among the retrieve best releases of the year though in any genre and despite most of the stand out still tracks being in commercials my favourite is the remix at the send which i believe has yet average out to have been pilfered","overall":5,"summary":"New face of Reggae","unixReviewTime":1220832000,"reviewTime":"09 8, 2008"}
{"orig_index":55908,"reviewerID":"A18D87U8CUN0F9","asin":"B0014DC046","reviewerName":"Jason Harrington \"Trucker Hater Magazine\"","helpful":[1,1],"reviewText":"i scan in an interview someplace that santogold thought it was racialist that phonograph recording stores assort her as r b and she goes on to aver she would choose to be classified as reggae i found that absorbing since she seems to escape with the new electro type of crowd ie mia amanda blank spank rock bunny rabbit etc when i think of electronic reggae i think of black uhuru highly reccomended but i would aver for my gustatory modality santogold is simply real good indie rock with a saltation vibe i would eve assort m i a as more difficult because of her voice for the average person to put up and santogold as a more universally listenable sound this is clearly among the best loss of the twelvemonth though in any genre and despite most of the stand out tracks being in commercials my favourite is the remix at the send which i believe has yet to have been pilfered","overall":5,"summary":"New face of Reggae","unixReviewTime":1220832000,"reviewTime":"09 8, 2008"}
{"orig_index":55908,"reviewerID":"A18D87U8CUN0F9","asin":"B0014DC046","reviewerName":"Jason Harrington \"Trucker Hater Magazine\"","helpful":[1,1],"reviewText":"i read in an a somewhere that santogold thought it was that universally record stores santogold her as r b and she goes on to say she would prefer to listenable classified as racist i found reggae fascinating since she seems to run with send new electro dance of crowd ie mia amanda blank spank rock bunny rabbit etc when i rock of electronic reggae i think of black uhuru vibe have but i would say for my tastes classify is simply really good indie think with interview type highly i would even classify m i a as more difficult because of her voice for the average person be digest and santogold as a more that to sound this is clearly stand the best releases of the year though in yet genre and despite most of the been out tracks being in commercials my favourite is the remix at the the any i believe has which to reccomended among pilfered","overall":5,"summary":"New face of Reggae","unixReviewTime":1220832000,"reviewTime":"09 8, 2008"}
{"orig_index":61873,"reviewerID":"A164RX8TQKDYAO","asin":"B007B6VOII","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"While I, as a Christian, hate curse words I hate bleeps more. They ruin the flow of a song. So, I love the original version of this record.","overall":5,"summary":"I hate bleeps","unixReviewTime":1368576000,"reviewTime":"05 15, 2013"}
{"orig_index":61873,"reviewerID":"A164RX8TQKDYAO","asin":"B007B6VOII","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"while i as a christian hatred curse words i hatred bleeps more they ruin the flow of a birdcall so i love the original version of this record","overall":5,"summary":"I hate bleeps","unixReviewTime":1368576000,"reviewTime":"05 15, 2013"}
{"orig_index":61873,"reviewerID":"A164RX8TQKDYAO","asin":"B007B6VOII","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"while i as a christian hate curse words i hate bleeps more they the flow of a song so i love the original version of record","overall":5,"summary":"I hate bleeps","unixReviewTime":1368576000,"reviewTime":"05 15, 2013"}
{"orig_index":61873,"reviewerID":"A164RX8TQKDYAO","asin":"B007B6VOII","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"while i as a christian hate curse words i hate bleeps more they ruin the flow of a song so i love the original version of this record ","overall":5,"summary":"I hate bleeps","unixReviewTime":1368576000,"reviewTime":"05 15, 2013"}
{"orig_index":61873,"reviewerID":"A164RX8TQKDYAO","asin":"B007B6VOII","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"while i as a christian hate curse word words i hate bleeps more they ruin the flow of a strain so i love the original version of this record","overall":5,"summary":"I hate bleeps","unixReviewTime":1368576000,"reviewTime":"05 15, 2013"}
{"orig_index":61873,"reviewerID":"A164RX8TQKDYAO","asin":"B007B6VOII","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"while i as a christian hate curse words hate bleeps more they ruin the flow of a song so i love the original version of this record","overall":5,"summary":"I hate bleeps","unixReviewTime":1368576000,"reviewTime":"05 15, 2013"}