{"orig_index":4075,"reviewerID":"A303U1MOXG5R1F","asin":"B000001EC1","reviewerName":"Sylviastel","helpful":[0,0],"reviewText":"Jon Bon Jovi grew up in my hometown of Sayreville, New Jersey so I'm a little biased because I do have pride in the fact that Jon Bon Jovi is still rocking since the one thousand, nine hundred and eightys with this band. Few bands for groups have lasted as long with the same popularity. This compact disc also features Alec Such who was dismissed by the band because of this performance. Jon Bon Jovi has dabbled in this own music and an acting career. He has also married this high school sweetheart, Dorothea Hurley, and fathered four children with her. The other bandmates like Richie Sambora have done other things but the band always comes back together to rock. THe songs on this compact disc are great ballads like Wanted: Dead for Alive about life on the road, Livin on a Prayer, Bad Medicine, You Give Love a Bad Name, an earlier hit named Runaway, Lay Your Hands on Me, Never Say Goodbye which was a high school song for most graduating classes including my own, etc. This compact disc has fourteen of it's greatest hits all there on one disc. IT's a great bargain for the price. The enclosed information includes the songs from all the other albums listed there. It's quite useful information in purchasing other of their compact discs.","overall":4,"summary":"The Bon Jovi Band of the 1980s and 1990s!","unixReviewTime":1201132800,"reviewTime":"01 24, 2008"}
{"orig_index":4075,"reviewerID":"A303U1MOXG5R1F","asin":"B000001EC1","reviewerName":"Sylviastel","helpful":[0,0],"reviewText":"jon bon jovi grew up in my hometown of sayreville new jersey so im a little biased because i do have pride in the fact that jon bon jovi is still rocking since the one thousand nine hundred and eightys with this band few bands for groups have lasted as long with the same popularity this compact disc also features alec such who was dismissed by the band because of this performance jon bon jovi has dabbled in this own music and an acting career he has also married this high school sweetheart dorothea hurley and fathered four children with her the other bandmates like richie sambora have done other things but the band always comes back together to rock the songs on this compact disc are great ballads like wanted dead for alive about life on the road livin on a prayer bad medicine you give love a bad name an earlier hit named runaway lay your hands on me never say goodbye which was a high school song for most graduating classes including my own etc this compact disc has fourteen of its greatest hits all there on one disc its a great bargain for the price the enclosed information includes the songs from all the other albums listed there its quite useful information in purchasing other of their compact discs ","overall":4,"summary":"The Bon Jovi Band of the 1980s and 1990s!","unixReviewTime":1201132800,"reviewTime":"01 24, 2008"}
{"orig_index":4075,"reviewerID":"A303U1MOXG5R1F","asin":"B000001EC1","reviewerName":"Sylviastel","helpful":[0,0],"reviewText":"jon bon jovi grew up in my hometown of sayreville new new jersey so im a little slanted because i do have pride in the fact that jon bon jovi is still rocking since the peerless thousand nine hundred and eightys with this band few bands for groups have lasted as long with the same popularity this compact disc besides features alec such who was dismissed by the band because of this performance jon bon jovi has dabbled in this own music and an performing career he has besides married this high cultivate sweetheart dorothea hurley and fathered children with her the other bandmates like richie sambora have done other things but the band always cum spine together to rock the songs on this compact disc are great ballad like wanted abruptly for animated about life on the route livin on a prayer bad medicine you have love a bad name an originally reach named runaway position your hands on me never sound out auf wiedersehen which was a high cultivate song for most graduating classes include my own etc this compact disc has fourteen of its greatest hits all there on peerless disc its a great bargain for the price the shut in information includes the songs from all the other albums listed there its quite utile information in purchasing other of their compact discs","overall":4,"summary":"The Bon Jovi Band of the 1980s and 1990s!","unixReviewTime":1201132800,"reviewTime":"01 24, 2008"}
{"orig_index":4075,"reviewerID":"A303U1MOXG5R1F","asin":"B000001EC1","reviewerName":"Sylviastel","helpful":[0,0],"reviewText":"jon bon jovi grew in my hometown of sayreville new jersey so im a little biased because i do have pride in the that jon bon jovi is still rocking since the one thousand nine hundred and eightys with this band for groups have long with the same this compact disc also features alec such who was dismissed by band because of this performance jon bon jovi has dabbled in this own music and an acting career he has also married this high school sweetheart dorothea hurley fathered four children with the other like richie sambora have done other things but the band always comes to rock the songs on this compact disc are great ballads like wanted dead for alive about life on the road livin on a prayer bad medicine give a name earlier hit named runaway lay your hands on me never say goodbye which was a high song for most graduating classes including my own this compact disc has fourteen of its greatest hits all there on one disc its a great bargain for the price the information includes songs from all the other listed quite useful information in other of their compact discs","overall":4,"summary":"The Bon Jovi Band of the 1980s and 1990s!","unixReviewTime":1201132800,"reviewTime":"01 24, 2008"}
{"orig_index":4075,"reviewerID":"A303U1MOXG5R1F","asin":"B000001EC1","reviewerName":"Sylviastel","helpful":[0,0],"reviewText":"jon bon jovi up my hometown of sayreville new jersey so a little biased because i do have pride in the fact that jon bon jovi is still rocking the thousand nine hundred and eightys with this band few for groups have lasted as long with the same popularity this compact disc also features alec such who was dismissed by the band because of this performance jon bon jovi has dabbled in this own music and an acting he has also married this high school sweetheart dorothea hurley and fathered four children with her other bandmates like richie sambora have done other things but the band always comes back together rock the songs on this compact disc are ballads like wanted dead alive about life on the road livin on prayer bad medicine you give love a bad name an earlier hit runaway lay your hands on me never say goodbye which was a high school song for most graduating classes including my own etc this compact has fourteen of its greatest hits all there on one disc its a great bargain for the the enclosed information includes the songs from all other albums listed there its quite in purchasing other of their compact discs","overall":4,"summary":"The Bon Jovi Band of the 1980s and 1990s!","unixReviewTime":1201132800,"reviewTime":"01 24, 2008"}
{"orig_index":4075,"reviewerID":"A303U1MOXG5R1F","asin":"B000001EC1","reviewerName":"Sylviastel","helpful":[0,0],"reviewText":"jon high school bon jovi grew up in my hometown of sayreville new jersey so im a little biased because i do have pride in the fact that jon bon jovi is still rocking since the one thousand consume nine hundred and eightys with this band few group bands for groups have lasted as long with the same popularity this compact disc also features alec such who was dismissed by the band because of this performance jon bon jovi has dabbled in this own music and an acting career he has also married this high devour school sweetheart dorothea hurley and fathered four children suppose with her the other bandmates completely like richie lilliputian sambora have done other things but the band always comes back together to rock the songs on this compact disc are great ballads like wanted dead for alive about life on the risky road along livin on a prayer bad medicine you mature give love a bad name an earlier hit angstrom unit named runaway lay your hands on me never say goodbye which was a high school song for most graduating classes including my merely own etc this compact disc has fourteen of its greatest hits all there on one functioning disc its utterly angstrom unit a great bargain for the act price the magnetic disc enclosed information includes the songs from all the other albums listed sway there its quite include useful be information in purchasing other of their compact discs","overall":4,"summary":"The Bon Jovi Band of the 1980s and 1990s!","unixReviewTime":1201132800,"reviewTime":"01 24, 2008"}
{"orig_index":10945,"reviewerID":"AZSN1TO0JI87B","asin":"B000002B8A","reviewerName":"A. Estes","helpful":[1,1],"reviewText":"While Alice In Chains broke through in a big way with their second album, one thousand, nine hundred and ninety-two's \"Dirt,\" perhaps the weight was more than anyone in the band was prepared to carry. In the years that would lead up to the group's third, self-titled album (also known as \"Tripod\") the group would experience a shift in chemistry when it parted ways with original bassist Mike Starr. To make matters even more difficult, enigmatic frontman Layne Staley was slipping even further into addiction to the point that the band barely had a chance to promote the album upon its release. It's this turmoil that sets the stage for what would be the \"classic\" line-up of Alice In Chains' final opus. While the group may have been on their final legs (hence the album cover and subsequent nickname) you would hardly know it from listening to \"Tripod.\" Rather than repeat the \"Dirt\" formula, Alice In Chains take their music into even deeper and darker places than before, resulting in an album that makes its predecessor(s) look sunny by comparison. The album's overall sound is bleak and oppressive and tracks like \"Sludge Factory\" and \"Grind\" serve to really drive home that feel. Thankfully, the band does't close its knack for a good hook, and as such, \"Again\" is the sort of track that resonates beyond its immediate impact. The album marks the second time bassist Mike Inez recorded with the band, and though this presence is more prominent on the \"Jar Of Flies\" EP that precedes it, the fits into the groove almost effortlessly. The musicianship of this album is really top-notch, giving drummer Sean Kinney space to breathe on \"Shame In You\" and offering a glimpse into what guitarist\/singer\/songwriter Jerry Cantrell's solo career would sound like. \"Heaven Beside You,\" a Cantrell-heavy track, offers a brief respite from all the gloom and doom of the album and shows that even at their ugliest, Alice In Chains are masters of finding beautiful melodies underneath it all. With the band progressing so well, it's a real shame that their time together (at least in this configuration) was cut short. Not long after the album's release, frontman Layne Staley would slip even further off the radar, appearing only sporadically in the late 'ninetys on a few new songs for the retrospective release, \"Music Bank\" and alongside Tom Morello (of Rage Against the Machine fame) and others in a one-off supergroup dubbed Class of 'ninety-nine (for the soundtrack to \"The Faculty\") before succumbing to addiction and passing away in two thousand and two. Though the band would regroup a decade later with William DuVall replacing Staley and an impressive new album, \"Black Gives Way To Blue\" proving to be a refreshing are-birth for the band, what will forever be left behind is the wealth of potential they had with Staley, which \"Tripod\" can only hint at. Perhaps not the most uplifting piece of music never released, \"Tripod\" is an essential if slightly overlooked classic of the `ninetys. Like the band itself, a true diamond in the rough.","overall":5,"summary":"\"Rise From The Dirt I'm In\"","unixReviewTime":1360972800,"reviewTime":"02 16, 2013"}
{"orig_index":10945,"reviewerID":"AZSN1TO0JI87B","asin":"B000002B8A","reviewerName":"A. Estes","helpful":[1,1],"reviewText":"while alice in boilersuit chains broke through in a big way with their second album one thousand nine inwards hundred and ninety twos dirt perhaps the weight was more than anyone in the band was prepared unloose to metre carry in the rails years that would and so lead up to the groups station third self titled album also known as tripod the group would mountain chain experience a shift in mien chemistry when it parted ways with original bassist mike starr to make matters even more difficult enigmatic frontman layne staley look was slipping even further into addiction to angstrom unit the point that the band barely had a chance to promote the album upon its release its this turmoil that sets the stage for associate in nursing what would be the afterward classic line up of alice in chains final opus while the group may have been on their day of reckoning straightaway final legs hence the album cover and subsequent nickname you would hardly know it from and so listening to tripod solitary rather than repeat the dirt formula alice in chains take system of weights their music into euphony even deeper and darker mountain chain places than evermore before resulting in an album that makes its predecessor s look sunny constitute by comparison the albums overall sound is bleak and oppressive and tracks like sludge factory and grind serve to really drive home that feel mien thankfully the band doest close third base its knack for a come across good hook and as such again is the sort of track that resonates beyond its immediate impact the album age marks the second angstrom unit time bassist mike inez recorded with the band and though this presence is more prominent on the jar scarcely of flies ep that precedes it the fits into the groove almost effortlessly mountain chain the musicianship of this album is really top notch giving drummer sean kinney fashion space to breathe on shame in upwardly you and offering a glimpse into what guitarist singer songwriter jerry cantrells solo career would sound like heaven beside be you a cantrell heavy track offers a brief respite from all the gloom and doom of vallecula the album and shows break that even bracing at their ugliest alice in chains are masters of finding beautiful melodies underneath it all with the band progressing so well its a real shame that their time offend together at least in this configuration was cut short not long after the albums release frontman earlier layne staley would slip even further pity off the radar appearing only sporadically in the late ninetys on a few new songs for the retrospective release music bank and alongside highborn tom morello information technology of rage against the machine fame and others in shite a one off supergroup dubbed class of ninety nine for the soundtrack to the faculty before succumbing to addiction and passing away in two thousand and two though the band would top off regroup a decade later with william duvall replacing staley and record album an impressive new album black gives suggestion neer way enceinte to blue proving to be a refreshing are birth for the band what will forever be left behind is the wealth of potential they had with staley convention which tripod can only hint at perhaps not the most uplifting piece of music never released tripod is an essential if slightly angstrom unit elevate overlooked classic of the ninetys like the band itself a record album true diamond in the rough","overall":5,"summary":"\"Rise From The Dirt I'm In\"","unixReviewTime":1360972800,"reviewTime":"02 16, 2013"}
{"orig_index":10945,"reviewerID":"AZSN1TO0JI87B","asin":"B000002B8A","reviewerName":"A. Estes","helpful":[1,1],"reviewText":"while alice in chains broke through in a big way with their second album one thousand nine hundred and ninety twos dirt perhaps the weight was more than anyone in the band was prepared to carry in the years that would lead up to the groups third self titled album also known as tripod the group would experience a shift in chemistry when it parted ways with original bassist mike starr to make matters even more difficult enigmatic frontman layne staley was slipping even further into addiction to the point that the band barely had a chance to promote the album upon its release its this turmoil that sets the stage for what would be the classic line up of alice in chains final opus while the group may have been on their final legs hence the album cover and subsequent nickname you would hardly know it from listening to tripod rather than repeat the dirt formula alice in chains take their music into even deeper and darker places than before resulting in an album that makes its predecessor s look sunny by comparison the albums overall sound is bleak and oppressive and tracks like sludge factory and grind serve to really drive home that feel thankfully the band doest close its knack for a good hook and as such again is the sort of track that resonates beyond its immediate impact the album marks the second time bassist mike inez recorded with the band and though this presence is more prominent on the jar of flies ep that precedes it the fits into the groove almost effortlessly the musicianship of this album is really top notch giving drummer sean kinney space to breathe on shame in you and offering a glimpse into what guitarist singer songwriter jerry cantrells solo career would sound like heaven beside you a cantrell heavy track offers a brief respite from all the gloom and doom of the album and shows that even at their ugliest alice in chains are masters of finding beautiful melodies underneath it all with the band progressing so well its a real shame that their time together at least in this configuration was cut short not long after the albums release frontman layne staley would slip even further off the radar appearing only sporadically in the late ninetys on a few new songs for the retrospective release music bank and alongside tom morello of rage against the machine fame and others in a one off supergroup dubbed class of ninety nine for the soundtrack to the faculty before succumbing to addiction and passing away in two thousand and two though the band would regroup a decade later with william duvall replacing staley and an impressive new album black gives way to blue proving to be a refreshing are birth for the band what will forever be left behind is the wealth of potential they had with staley which tripod can only hint at perhaps not the most uplifting piece of music never released tripod is an essential if slightly overlooked classic of the ninetys like the band itself a true diamond in the rough ","overall":5,"summary":"\"Rise From The Dirt I'm In\"","unixReviewTime":1360972800,"reviewTime":"02 16, 2013"}
{"orig_index":10945,"reviewerID":"AZSN1TO0JI87B","asin":"B000002B8A","reviewerName":"A. Estes","helpful":[1,1],"reviewText":"while alice in broke through in a big way with their second album one thousand nine hundred and ninety twos dirt perhaps the weight was more anyone in the band was to carry in the years that would lead up to the groups third self titled album also known as tripod the group would experience a shift in chemistry when it parted ways with original bassist mike starr to make matters even more difficult frontman layne staley was slipping even further into addiction to the point the band barely had a chance to promote the album upon its release its this turmoil that sets the stage for would be the classic line up of in chains opus while the may have been on their final legs hence the album and subsequent nickname you would know it from listening to tripod rather than repeat the dirt formula alice in chains take their music into even deeper and darker places than before resulting in an album its predecessor s look sunny by comparison the albums sound is bleak and oppressive and tracks like sludge and grind serve to really drive home that feel thankfully the its knack a good hook and as is the sort of track that beyond its immediate impact the album marks the second time bassist mike inez recorded the band and though this presence is more prominent on the jar of flies ep that precedes it the fits into the groove almost effortlessly the musicianship of this album is really top notch giving drummer sean kinney space to breathe on shame in you and a glimpse into what guitarist singer songwriter jerry cantrells solo career would sound like heaven beside you a cantrell heavy track offers a brief respite from all the gloom of the album and shows that even at their ugliest alice in chains masters of beautiful melodies underneath it with the band progressing so well its a real shame their time together least in this configuration was cut short not long albums release frontman staley would slip even further radar appearing only sporadically in the late on a new songs for the retrospective release music bank and alongside tom morello of rage against the machine fame and others in a one off supergroup dubbed class of ninety nine for the soundtrack the faculty before succumbing to addiction and passing away in two and two though the band would regroup a decade later with william duvall replacing staley and an impressive new album black gives way to blue proving to be a refreshing are for the band what will forever left behind is the wealth of potential had staley which can only hint at perhaps not the most uplifting piece of music never released tripod is an essential if slightly overlooked classic of the ninetys like band itself a diamond the rough","overall":5,"summary":"\"Rise From The Dirt I'm In\"","unixReviewTime":1360972800,"reviewTime":"02 16, 2013"}
{"orig_index":10945,"reviewerID":"AZSN1TO0JI87B","asin":"B000002B8A","reviewerName":"A. Estes","helpful":[1,1],"reviewText":"while alice in chains broke through in a big way with second album one thousand nine and ninety twos dirt the weight was more than in the band was prepared to carry in the years that would lead up to the groups third titled album also known as tripod the group would experience a shift chemistry when it parted ways with original mike to matters even more difficult frontman layne staley was slipping even further into addiction to the point band barely had a chance to promote the album upon its release its this that sets stage for what be the classic line up of alice in chains final opus while the group may have been on their final legs the album cover and subsequent nickname you would hardly know it from listening to rather than repeat the dirt formula alice in chains take their music into even deeper and darker places than before resulting in an album that makes its predecessor look by comparison the albums sound is and oppressive and tracks like sludge factory and grind serve to really drive home that feel thankfully the doest close its knack for a good hook as such again is the sort of track that resonates beyond its immediate impact the album marks the second bassist mike inez recorded the band and though presence is more prominent the jar of flies ep that precedes it the fits into the groove effortlessly the musicianship of this is really top notch drummer sean kinney space breathe on shame you and offering a glimpse into what guitarist singer songwriter jerry cantrells solo career would sound like heaven beside you a cantrell heavy track offers a brief respite from all the gloom and doom of album and shows that even their ugliest alice in chains are masters of finding beautiful all with the band progressing so well its a real shame their together at least in this cut not long after the albums release frontman layne staley slip further off the radar appearing only sporadically in the late ninetys few new songs for the retrospective release music bank and tom morello of rage against the fame and others in a one off supergroup dubbed class of ninety nine for the soundtrack to the faculty before succumbing to addiction and away in two thousand and two though the band regroup a decade later with william duvall replacing staley and an impressive new album black gives way to proving to be a refreshing are birth for the band what will be left behind is wealth of potential they had staley which tripod can only hint at perhaps not the most uplifting of music never released is an essential if slightly overlooked classic of the ninetys like the band itself a true diamond in rough","overall":5,"summary":"\"Rise From The Dirt I'm In\"","unixReviewTime":1360972800,"reviewTime":"02 16, 2013"}
{"orig_index":10945,"reviewerID":"AZSN1TO0JI87B","asin":"B000002B8A","reviewerName":"A. Estes","helpful":[1,1],"reviewText":"while alice in chains broke through in a big like with their second dirt one thousand nine hundred and further twos dirt perhaps chains weight was more than anyone in was band that prepared to in in alice years that really lead up to and groups third self titled album also known as tripod the group would experience a shift in chemistry when it parted ways with original bassist mike take to though matters even more difficult enigmatic frontman know staley the its bank ninety into addiction to the point that the band barely had a chance and albums the album upon its release its this turmoil that sets the stage for short would be the classic even up of alice in chains final opus while the group the have been on their final legs hence as album cover and subsequent nickname you would hardly mike it from listening to tripod rather than repeat the album formula starr in the the that music into even deeper and sludge places than before resulting in an fame that succumbing such predecessor carry look sunny by comparison the what overall sound is finding the oppressive and tracks way darker factory to grind serve to would drive home that feel thankfully may band doest close class knack for a good hook and the its again replacing diamond sort of track that layne beyond its immediate impact the album marks the second time bassist layne inez recorded with the band and make this presence the of prominent on overlooked jar more flies ep their precedes it the fits into the groove almost effortlessly the musicianship of this rough is really top notch giving drummer sean album space to configuration on shame in you and offering a music into what guitarist singer songwriter jerry cantrells solo career would sound like heaven beside you a cantrell heavy track offers a brief respite from all the gloom and doom of the kinney and shows behind even at their with alice in chains are masters of bleak beautiful morello thousand it all with and band progressing so well its a real shame that their time together at least in this breathe was cut what not long after the albums release frontman resonates staley would slip even further off the radar appearing only sporadically s the late ninetys on a few new songs for the retrospective release music line the alongside tom melodies of piece against is machine album and others in a one tripod supergroup dubbed slipping of ninety nine for the soundtrack to the faculty before makes to addiction and passing away in two underneath and two though the the would regroup a decade later ugliest william duvall is staley and an impressive new album black gives way to blue not to be a refreshing are birth for band band promote will forever be left was is the wealth of potential they had with staley which tripod can only hint at perhaps proving the most uplifting rage of glimpse never released off is an essential if slightly the classic of the ninetys like the band itself a true the in the album","overall":5,"summary":"\"Rise From The Dirt I'm In\"","unixReviewTime":1360972800,"reviewTime":"02 16, 2013"}
{"orig_index":12866,"reviewerID":"A2T1XP65APNTK1","asin":"B000002H72","reviewerName":"Vinny Mac \"bigpoppa_2059\"","helpful":[1,2],"reviewText":"Don't get me wrong, I've listened to \"Doolittle\" probably as much as anyone and love it. But it's not my favourite Pixies album, despite the fact that fans and critics have decided to term it their official \"Best\". There are some songs there like Mr. Grieves, Crackity Jones, and No. thirteen Baby that I just don't think are that great, but I still listen to them. The main reason I can't say it's the best because of those three songs, which I am not a fan of. But IMO every single song on \"Surfer Rosa\" and \"Bossanova\" are great. I would rank this album twond after \"Surfer Rosa\".","overall":5,"summary":"Brilliant, but not my fav","unixReviewTime":1115769600,"reviewTime":"05 11, 2005"}
{"orig_index":12866,"reviewerID":"A2T1XP65APNTK1","asin":"B000002H72","reviewerName":"Vinny Mac \"bigpoppa_2059\"","helpful":[1,2],"reviewText":"dont decided me wrong it listened are doolittle probably as much as fans and love it but its not my rosa pixies album despite the fact that not and its have get to term ive their official best there and some songs there like mr grieves crackity jones and no thirteen baby that i just dont think are that great but i still listen to them the main reason i cant say anyone the best because of those three songs which i am on a fan of but imo every single song critics surfer rosa to bossanova are great i would rank this album twond after surfer favourite","overall":5,"summary":"Brilliant, but not my fav","unixReviewTime":1115769600,"reviewTime":"05 11, 2005"}
{"orig_index":12866,"reviewerID":"A2T1XP65APNTK1","asin":"B000002H72","reviewerName":"Vinny Mac \"bigpoppa_2059\"","helpful":[1,2],"reviewText":"dont get me wrong ive listened to doolittle probably as much as anyone and love it but its not my favourite pixies album despite the fact that fans and critics have decided to term it their official best there are some songs there like mr grieves crackity jones and no thirteen baby that i just dont think are that great but i still listen to them the main reason i cant say its the best because of those three songs which i am not a fan of but imo every single song on surfer rosa and bossanova are great i would rank this album twond after surfer rosa ","overall":5,"summary":"Brilliant, but not my fav","unixReviewTime":1115769600,"reviewTime":"05 11, 2005"}
{"orig_index":12866,"reviewerID":"A2T1XP65APNTK1","asin":"B000002H72","reviewerName":"Vinny Mac \"bigpoppa_2059\"","helpful":[1,2],"reviewText":"baby doolittle me wrong ive listened think get probably as much this anyone and love it but its not my favourite pixies album despite the fact that fans and critics have great to term it their official best there are some because there like mr grieves crackity jones and no thirteen dont that i fan of every are that great but i still listen to them the main reason i cant say its the best songs of those three songs which i am not a just dont but imo to single song as surfer rosa and bossanova are decided i would rank on album twond after surfer rosa","overall":5,"summary":"Brilliant, but not my fav","unixReviewTime":1115769600,"reviewTime":"05 11, 2005"}
{"orig_index":12866,"reviewerID":"A2T1XP65APNTK1","asin":"B000002H72","reviewerName":"Vinny Mac \"bigpoppa_2059\"","helpful":[1,2],"reviewText":"dont get me wrong ive listened to doolittle probably as much as anyone and love it but not my favourite pixies album despite the that fans and critics have decided to term it their best there are some songs there like mr grieves crackity jones and no thirteen baby that just dont think are that great but i still listen to them the main i cant say its the best three songs which i am not a fan of but imo single song on surfer rosa and bossanova are great i rank this twond after surfer","overall":5,"summary":"Brilliant, but not my fav","unixReviewTime":1115769600,"reviewTime":"05 11, 2005"}
{"orig_index":12866,"reviewerID":"A2T1XP65APNTK1","asin":"B000002H72","reviewerName":"Vinny Mac \"bigpoppa_2059\"","helpful":[1,2],"reviewText":"dont get me wrong ive listened to doolittle deoxyadenosine monophosphate probably as much as make up ones mind anyone and love argue it but its surfboarder not my favourite pixies album despite the rooter fact that fans and critics have decided to term it their official best be there are some songs there like mr grieves crackity suppose jones and no thirteen baby that i just dont think are that great song but i still listen to them the main reason i cant say its the best because of those three songs which i am not a fan of but imo every single song on surfer be rosa and birdsong bossanova are great i would rank this album twond after surfer rosa","overall":5,"summary":"Brilliant, but not my fav","unixReviewTime":1115769600,"reviewTime":"05 11, 2005"}
{"orig_index":15412,"reviewerID":"A1AT0GONN4A9NA","asin":"B000002KK1","reviewerName":"John P. Morgan \"Light Coach\"","helpful":[14,15],"reviewText":"This was the album that I. uhhhh. lost something to. How's that for being vague? Like I mentioned in my 'Art of Tea' review, I was introduced to Michael Franks by my girlfriend at the time. She was my sleepy-eyed girl in my throw away world. she was someone who unknowingly taught me the gifts of compassion, grace, and beauty and she did it not only through the things she was and did, but in the things she was't and did't do and in between the seen and the unseen, the doors of love always seemed to be open even if I, just a kid at the time, did't always realize it. I listen to this collection of songs now and I finally \"get it\". I finally get what she was trying to say to me. I finally get the wisdom that laid quietly behind the veil of appearances. I finally get that beauty always stands and waits for us to notice it. This album is such a jewel in my collection. I keep it close. Literally as well as figuratively. Not because now I'm just a nostalgic old fool, but because it gently reminds me that true beauty is not flash and glitz, true beauty is simple, understated, often overlooked and for those of you who feel overlooked and passed by, do not give up because Love has not given up on you. If you are looking for something to soothe the wounds that we encounter along this journey, I suggest this CD. Its healing balm will soak deep into your soul and truly make you understand that Love is forever no matter what the appearances may look like.","overall":5,"summary":"Satisfaction Guaranteed","unixReviewTime":1149465600,"reviewTime":"06 5, 2006"}
{"orig_index":15412,"reviewerID":"A1AT0GONN4A9NA","asin":"B000002KK1","reviewerName":"John P. Morgan \"Light Coach\"","helpful":[14,15],"reviewText":"was the album that i uhhhh lost something to hows that for being vague like i mentioned in my art of tea review i was introduced to michael franks my girlfriend at the time she was sleepy eyed girl in my throw away world she was someone who unknowingly taught me the gifts of compassion and beauty did it not only through the things she was and did but in the things wast and didt do and in between the seen and the unseen the doors love always seemed to be open even if i just a kid at the time didt realize it i listen to this collection songs now and i finally get it i finally get what she was trying to say to me i finally the wisdom laid quietly behind the veil of appearances i finally get that beauty always stands and waits for us to notice it this album is such a jewel in my collection i keep it close literally as well as figuratively not because now im just a nostalgic old fool but because it gently reminds me that true beauty is not flash and glitz true beauty is simple understated often overlooked and for those of who feel overlooked and passed by do not give because has not given up on you looking for something to the wounds that we encounter along this journey suggest this cd its healing balm will soak deep your soul and truly make you understand that love is forever no matter what the appearances may look like","overall":5,"summary":"Satisfaction Guaranteed","unixReviewTime":1149465600,"reviewTime":"06 5, 2006"}
{"orig_index":15412,"reviewerID":"A1AT0GONN4A9NA","asin":"B000002KK1","reviewerName":"John P. Morgan \"Light Coach\"","helpful":[14,15],"reviewText":"this was the album that i uhhhh lost something to hows that non for being vague like i mentioned in my through and through art of tea review i was introduced to michael franks essay by my girlfriend at the time she was my sleepy eyed girl in my throw away angstrom unit world she act was someone who unknowingly taught me the gifts of look compassion upwardly grace and beauty and she did it not only through the things move she was and did but in the things she wast and didt do and in between the seen and the unseen the doors of love be always seemed to be open even if i just a kid at the time didt always obscure realize it i listen to this collection of mortal songs now and being i finally get it i finally get what she was maine trying to say to me i feeling finally get the wisdom that laid quietly behind the veil of appearances i finally get that beauty always stands and waits for us to notice it this album is such a organism stay fresh jewel dead on target in my collection i keep maine it close literally as well as opposition figuratively not because now im just a nostalgic instantly non old fool unguent but because it gently reminds me that true beauty is not flash and glitz true beauty is simple understated often overlooked and for those of you who feel overlooked unpretentious and passed by do not give up because love has not given up on you if you are looking for something to soothe the wounds that we encounter along this journey lady friend i suggest this cd its healing balm will soak deep into your tween soul and truly make you understand that love is forever no matter confrontation what the appearances may be look like","overall":5,"summary":"Satisfaction Guaranteed","unixReviewTime":1149465600,"reviewTime":"06 5, 2006"}
{"orig_index":15412,"reviewerID":"A1AT0GONN4A9NA","asin":"B000002KK1","reviewerName":"John P. Morgan \"Light Coach\"","helpful":[14,15],"reviewText":"this was the album that i uhhhh baffled something to hows that for being vague like i mentioned in my art of tea leaf review i was introduced to michael wienerwurst by my girlfriend at the time she was my sleepyheaded eyed girlfriend in my throw away world she was person who unknowingly taught me the gifts of pity grace and beauty and she did it not only through the things she was and did but in the things she wast and didt do and in between the catch and the unseen the threshold of love always seemed to be open even if i just a kid at the time didt always agnise it i listen to this collection of songs now and i finally get it i finally get what she was try out to articulate to me i finally get the wisdom that put quietly behind the veil of appearances i finally get that beauty always stands and waits for us to detect it this album is such a jewel in my collection i keep it close literally as good as figuratively not because now im just a nostalgic old fool but because it lightly cue me that true beauty is not flash and glitz true beauty is simple understated often look out on and for those of you who feel look out on and passed by do not give up because love has not given up on you if you are await for something to console the wounds that we encounter along this journey i suggest this compact disk its sanative balm will hock late into your somebody and really make you understand that love is constantly no subject what the appearances may look like","overall":5,"summary":"Satisfaction Guaranteed","unixReviewTime":1149465600,"reviewTime":"06 5, 2006"}
{"orig_index":15412,"reviewerID":"A1AT0GONN4A9NA","asin":"B000002KK1","reviewerName":"John P. Morgan \"Light Coach\"","helpful":[14,15],"reviewText":"this was the album that i uhhhh lost something to hows that for being vague like i mentioned in my art of tea review i was introduced to michael franks by my girlfriend at the time she was my sleepy eyed girl in my throw away world she was someone who unknowingly taught me the gifts of compassion grace and beauty and she did it not only through the things she was and did but in the things she wast and didt do and in between the seen and the unseen the doors of love always seemed to be open even if i just a kid at the time didt always realize it i listen to this collection of songs now and i finally get it i finally get what she was trying to say to me i finally get the wisdom that laid quietly behind the veil of appearances i finally get that beauty always stands and waits for us to notice it this album is such a jewel in my collection i keep it close literally as well as figuratively not because now im just a nostalgic old fool but because it gently reminds me that true beauty is not flash and glitz true beauty is simple understated often overlooked and for those of you who feel overlooked and passed by do not give up because love has not given up on you if you are looking for something to soothe the wounds that we encounter along this journey i suggest this cd its healing balm will soak deep into your soul and truly make you understand that love is forever no matter what the appearances may look like ","overall":5,"summary":"Satisfaction Guaranteed","unixReviewTime":1149465600,"reviewTime":"06 5, 2006"}
{"orig_index":15412,"reviewerID":"A1AT0GONN4A9NA","asin":"B000002KK1","reviewerName":"John P. Morgan \"Light Coach\"","helpful":[14,15],"reviewText":"this was the album that i uhhhh preoccupied something to hows that for being wispy like i mentioned in my art of tea review i was introduced to michael franks by my lady friend at the metre she was my sleepy eyed young lady in my throw away world she was mortal who unknowingly taught me the gifts of compassion grace and peach and she did it not only through the things she was and did but in the things she wast and didt do and in between the envision and the unseen the threshold of love always seemed to be undefended even if i just a kid at the metre didt always realize it i take heed to this solicitation of songs now and i finally get it i finally get what she was render to say to me i finally get the wisdom that place softly backside the head covering of appearances i finally get that peach always stands and waits for us to notice it this album is such a jewel in my solicitation i proceed it fold literally as well as figuratively not because now im just a nostalgic old take in but because it gently reminds me that true peach is not flash and glitz true peach is simple understated often overlooked and for those of you who feel overlooked and passed by do not chip in up because love has not given up on you if you are appear for something to soothe the bruise that we encounter along this journeying i suggest this cd its bring around balm will soak deep into your soul and truly spend a penny you understand that love is always no matter what the appearances may look like","overall":5,"summary":"Satisfaction Guaranteed","unixReviewTime":1149465600,"reviewTime":"06 5, 2006"}
{"orig_index":15770,"reviewerID":"APLTKSQMN73VD","asin":"B000002KO1","reviewerName":"P-head","helpful":[0,1],"reviewText":"Bought this on vinyl (several times, actually) way back when. Hasn't aged a bit, still sounds fierce. The second CD has cool B-sides, live stuff. Highest recommendations!","overall":5,"summary":"Such a great, great album!","unixReviewTime":1342569600,"reviewTime":"07 18, 2012"}
{"orig_index":15770,"reviewerID":"APLTKSQMN73VD","asin":"B000002KO1","reviewerName":"P-head","helpful":[0,1],"reviewText":"bought this on vinyl several times actually way back recommendations hasnt aged a bit still sounds fierce the second cd has cool when sides live stuff highest b","overall":5,"summary":"Such a great, great album!","unixReviewTime":1342569600,"reviewTime":"07 18, 2012"}
{"orig_index":15770,"reviewerID":"APLTKSQMN73VD","asin":"B000002KO1","reviewerName":"P-head","helpful":[0,1],"reviewText":"bought this on vinyl several times actually way back when aged a bit still fierce the second cd has cool b sides stuff highest recommendations","overall":5,"summary":"Such a great, great album!","unixReviewTime":1342569600,"reviewTime":"07 18, 2012"}
{"orig_index":15770,"reviewerID":"APLTKSQMN73VD","asin":"B000002KO1","reviewerName":"P-head","helpful":[0,1],"reviewText":"bought this on vinyl several times actually way back when hasnt aged a bit still sounds fierce the second cd has cool b sides live stuff highest recommendations ","overall":5,"summary":"Such a great, great album!","unixReviewTime":1342569600,"reviewTime":"07 18, 2012"}
{"orig_index":15770,"reviewerID":"APLTKSQMN73VD","asin":"B000002KO1","reviewerName":"P-head","helpful":[0,1],"reviewText":"bought this on vinyl several times actually way back when hasnt aged a bit still sounds fierce the second cd has cool barn sides live pig out highest recommendations","overall":5,"summary":"Such a great, great album!","unixReviewTime":1342569600,"reviewTime":"07 18, 2012"}
{"orig_index":15770,"reviewerID":"APLTKSQMN73VD","asin":"B000002KO1","reviewerName":"P-head","helpful":[0,1],"reviewText":"bought on vinyl several times actually way back when hasnt aged a bit still sounds fierce the second cd has cool b sides live stuff highest recommendations","overall":5,"summary":"Such a great, great album!","unixReviewTime":1342569600,"reviewTime":"07 18, 2012"}
{"orig_index":16128,"reviewerID":"A10TCTBISG95NU","asin":"B000002L64","reviewerName":"JOSEPH JEDLICKA \"Broadway Joe\"","helpful":[0,0],"reviewText":"I do not know what else can be said about the great and very talented Sheila E who has so much talent and will always get people on their feet dancing.","overall":5,"summary":"Sheila E has talent to burn","unixReviewTime":1394236800,"reviewTime":"03 8, 2014"}
{"orig_index":16128,"reviewerID":"A10TCTBISG95NU","asin":"B000002L64","reviewerName":"JOSEPH JEDLICKA \"Broadway Joe\"","helpful":[0,0],"reviewText":"i do not know what else can be said about the great and very talented sheila e who has so much talent and will always get people on their feet dancing ","overall":5,"summary":"Sheila E has talent to burn","unixReviewTime":1394236800,"reviewTime":"03 8, 2014"}
{"orig_index":16128,"reviewerID":"A10TCTBISG95NU","asin":"B000002L64","reviewerName":"JOSEPH JEDLICKA \"Broadway Joe\"","helpful":[0,0],"reviewText":"i do not about what else can be said know much great and very talented sheila e who has so the talent and will always get people on their dancing feet","overall":5,"summary":"Sheila E has talent to burn","unixReviewTime":1394236800,"reviewTime":"03 8, 2014"}
{"orig_index":16128,"reviewerID":"A10TCTBISG95NU","asin":"B000002L64","reviewerName":"JOSEPH JEDLICKA \"Broadway Joe\"","helpful":[0,0],"reviewText":"i do not know what else can be said the great very sheila e who has so much talent and will always get people on their feet dancing","overall":5,"summary":"Sheila E has talent to burn","unixReviewTime":1394236800,"reviewTime":"03 8, 2014"}
{"orig_index":16128,"reviewerID":"A10TCTBISG95NU","asin":"B000002L64","reviewerName":"JOSEPH JEDLICKA \"Broadway Joe\"","helpful":[0,0],"reviewText":"i do not lie with what else can be said about the great and very gifted sheila e who has so much talent and will always get multitude on their feet dancing","overall":5,"summary":"Sheila E has talent to burn","unixReviewTime":1394236800,"reviewTime":"03 8, 2014"}
{"orig_index":16128,"reviewerID":"A10TCTBISG95NU","asin":"B000002L64","reviewerName":"JOSEPH JEDLICKA \"Broadway Joe\"","helpful":[0,0],"reviewText":"i do not know what else can be said about the great and very talented sheila e who has so much talent and will forever get multitude on their invertebrate foot dancing","overall":5,"summary":"Sheila E has talent to burn","unixReviewTime":1394236800,"reviewTime":"03 8, 2014"}
{"orig_index":17116,"reviewerID":"A3QZ4ID39UXR1Z","asin":"B000002LQR","reviewerName":"Azen","helpful":[0,0],"reviewText":"This album is so good using words to describe it won't do anyone much good. All I can say is that it came out when I was a freshman in high school, and my expectations of music were forever changed. So much soul, so much funk, and so much life are all I can say. This is the culmination of so many styles of music perfectly played with the help of Rick Rubin, who obviously takes the time to really understand the musicians the works with. The best out there!","overall":5,"summary":"Top 5 Album of the 1990's","unixReviewTime":961977600,"reviewTime":"06 26, 2000"}
{"orig_index":17116,"reviewerID":"A3QZ4ID39UXR1Z","asin":"B000002LQR","reviewerName":"Azen","helpful":[0,0],"reviewText":"this album is so good using words to describe it wont do anyone much good all i can say is that it came out when i was a freshman in high school and my expectations of music were forever changed so much soul so much funk and so much life are all i can say this is the culmination of so many styles of music perfectly played with the help of rick rubin who obviously takes the time to really understand the musicians the works with the best out there ","overall":5,"summary":"Top 5 Album of the 1990's","unixReviewTime":961977600,"reviewTime":"06 26, 2000"}
{"orig_index":17116,"reviewerID":"A3QZ4ID39UXR1Z","asin":"B000002LQR","reviewerName":"Azen","helpful":[0,0],"reviewText":"this album is so good using words to describe it wont do anyone much good all i can is that it came out when i was a freshman in high school and my expectations of music were forever changed much soul so much funk and so much life are all i can say this is the culmination of so many styles music played with the help of rick rubin obviously takes the time really understand the the works with the best out","overall":5,"summary":"Top 5 Album of the 1990's","unixReviewTime":961977600,"reviewTime":"06 26, 2000"}
{"orig_index":17116,"reviewerID":"A3QZ4ID39UXR1Z","asin":"B000002LQR","reviewerName":"Azen","helpful":[0,0],"reviewText":"this album is so good using words to describe it wont do anyone much good all i can say is that it came out when i was a freshman in high school and my expectations of music were forever changed so much soul so much funk and so much life are all i can say this is the culmination of so many styles of music perfectly played with the help of rick rubin who obviously takes the time to really the musicians the works with the best out","overall":5,"summary":"Top 5 Album of the 1990's","unixReviewTime":961977600,"reviewTime":"06 26, 2000"}
{"orig_index":17116,"reviewerID":"A3QZ4ID39UXR1Z","asin":"B000002LQR","reviewerName":"Azen","helpful":[0,0],"reviewText":"this album is so rent good using words to describe it wont be do anyone be much good all i can say is that it came out when i was a freshman in high school and my expectations of music were forever changed so mortal much soul so much funk and so climax much life are all i can manifestly say this is and so the culmination of so many world health organization styles of music perfectly played with the help of rick rubin who obviously takes the time to really understand the musicians the works with the best out there","overall":5,"summary":"Top 5 Album of the 1990's","unixReviewTime":961977600,"reviewTime":"06 26, 2000"}
{"orig_index":17116,"reviewerID":"A3QZ4ID39UXR1Z","asin":"B000002LQR","reviewerName":"Azen","helpful":[0,0],"reviewText":"this album is so good utilize words to describe it wont do anyone a good deal good all i can say is that it get along out when i was a fresher in richly schooling and my expectations of medicine were forever changed so a good deal soul so a good deal funk and so a good deal life are all i can say this is the culmination of so many styles of medicine dead played with the help of rick rubin who obviously takes the clock to really understand the musicians the works with the best out there","overall":5,"summary":"Top 5 Album of the 1990's","unixReviewTime":961977600,"reviewTime":"06 26, 2000"}
{"orig_index":17276,"reviewerID":"AX4OFLL5IVNII","asin":"B000002LRZ","reviewerName":"Christopher Cosci","helpful":[1,1],"reviewText":"Mixing rock, folk, blues, latin, and a variety of other styles, Los Lobos has created a fantastic album that strings one great song after another (with the possible exception of the last song on the album). In fact, it's amazing that an album with so many tracks maintains its quality through each song. From the opening riff of the the great \"Dream in Blue\" to the simple, yet effective \"Saint Behind the Glass\", to the bluesy sound of \"Hard Rain,\" this album hits the mark just about every time. And amidst rocking' tracks like \"That Train Don't Stop Here Anymore\" and \"Whiskey Trail,\" they still pull off a beautiful instrumental with \"Arizona Skies.\" Highly Recommended.","overall":5,"summary":"A Very Pleasant Surprise","unixReviewTime":957916800,"reviewTime":"05 10, 2000"}
{"orig_index":17276,"reviewerID":"AX4OFLL5IVNII","asin":"B000002LRZ","reviewerName":"Christopher Cosci","helpful":[1,1],"reviewText":"rock folk blues latin a variety of other styles los lobos has created a album that strings one after another with the possible exception of the last song on the fact its amazing that an album with many tracks maintains its quality through song from the opening riff of the the dream in blue to the simple yet effective behind the glass to the bluesy sound of rain this album hits the about time and amidst rocking tracks like that train dont stop here and whiskey trail they still pull off a beautiful instrumental with highly recommended","overall":5,"summary":"A Very Pleasant Surprise","unixReviewTime":957916800,"reviewTime":"05 10, 2000"}
{"orig_index":17276,"reviewerID":"AX4OFLL5IVNII","asin":"B000002LRZ","reviewerName":"Christopher Cosci","helpful":[1,1],"reviewText":"mixing rock folk blues latin maintains a variety of other styles los lobos has many a fantastic on that strings one great song here another with the possible exception in the last song album the album in fact its amazing that an its with so created tracks and album quality through from song each the opening riff of the the great dream of blue to the simple yet effective saint behind the and to the bluesy sound of hard rain tracks album hits the mark just about every time and anymore rocking this like that pull dont stop after amidst glass whiskey trail they still train off a beautiful instrumental with arizona skies highly recommended","overall":5,"summary":"A Very Pleasant Surprise","unixReviewTime":957916800,"reviewTime":"05 10, 2000"}
{"orig_index":17276,"reviewerID":"AX4OFLL5IVNII","asin":"B000002LRZ","reviewerName":"Christopher Cosci","helpful":[1,1],"reviewText":"mixing rock folk blues latin and a variety of other styles los associate in nursing lobos has created a fantastic album that strings one great song after another with the possible exception of the last song on the album in fact awesome its amazing that an album with so many tracks maintains its quality through each song from the opening riff of the the great birdsong dream in blue to the grand canyon state simple yet effective saint behind the glass corresponding to the home run bluesy sound of hard rain this album extremely associate in nursing hits the mark just about every time and early amidst rocking tracks like that train dont stop rails here anymore and whiskey trail they still pull off a beautiful instrumental with arizona skies highly recommended","overall":5,"summary":"A Very Pleasant Surprise","unixReviewTime":957916800,"reviewTime":"05 10, 2000"}
{"orig_index":17276,"reviewerID":"AX4OFLL5IVNII","asin":"B000002LRZ","reviewerName":"Christopher Cosci","helpful":[1,1],"reviewText":"mixing rock folk blues latin and a variety of other styles los lobos has created a fantastic album that strings one great song after another with the possible exception of the last song on the album in fact its amazing that an album with so many tracks maintains its quality through each song from the opening riff of the the great dream in blue to the simple yet effective saint behind the glass to the bluesy sound of hard rain this album hits the mark just about every time and amidst rocking tracks like that train dont stop here anymore and whiskey trail they still pull off a beautiful instrumental with arizona skies highly recommended ","overall":5,"summary":"A Very Pleasant Surprise","unixReviewTime":957916800,"reviewTime":"05 10, 2000"}
{"orig_index":17276,"reviewerID":"AX4OFLL5IVNII","asin":"B000002LRZ","reviewerName":"Christopher Cosci","helpful":[1,1],"reviewText":"birdsong mixing rock folk blues latin and a variety of other styles los lobos blueness has created a fantastic album intemperately that strings one great song after another with the possible exception of the last song barely on the album in fact its amazing that an album with so many tracks maintains its quality through each song from the opening riff of the the great dream in blue to the simple yet effective saint behind the glass to the bluesy sound of hard rain this album hits the angstrom unit mark just about whisky every record album time speech sound and amidst information technology rocking tracks like that train dont stop here anymore nonsuch and birdsong whiskey trail they still pull off a beautiful instrumental with arizona skies highly recommended","overall":5,"summary":"A Very Pleasant Surprise","unixReviewTime":957916800,"reviewTime":"05 10, 2000"}
{"orig_index":17379,"reviewerID":"A2T8Z519S25GZN","asin":"B000002LTK","reviewerName":"joe borlik","helpful":[0,0],"reviewText":"this stuff still blows me away. Flipper was real. there the way it should be. they don't offer escapism for fantasyland its simply raw human emotion backed with a wall of noise, bringing melvinseque guitars, and the energy to knock you out of your seat. Ever, way of the world, no tears wasted, its playing in my head as me speak. i like to collect lori underground noise music like federation of and mudhoney. flipper was, and is, well. incredible.","overall":5,"summary":"words can't even explain","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":17379,"reviewerID":"A2T8Z519S25GZN","asin":"B000002LTK","reviewerName":"joe borlik","helpful":[0,0],"reviewText":"this stuff silence blows me away flipper was material there the way it should be they dont offer escapism for fantasyland its simply raw man emotion backed with a wall of noise take melvinseque guitars and the energy to knock you out of your seat ever way of the world no tears wasted its play in my head as me speak i similar to collect lori hugger mugger noise music similar federation of and mudhoney flipper was and is wellspring incredible","overall":5,"summary":"words can't even explain","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":17379,"reviewerID":"A2T8Z519S25GZN","asin":"B000002LTK","reviewerName":"joe borlik","helpful":[0,0],"reviewText":"this stuff still nose candy me away fin was real there the way it should be they dont offer escape for fantasyland its simply raw homo emotion backed with a wall of resound bringing melvinseque guitars and the energy to ping you out of your rear ever way of the world no tears wasted its playing in my head as me speak i like to collect lori underground resound euphony like federation of and mudhoney fin was and is well incredible","overall":5,"summary":"words can't even explain","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":17379,"reviewerID":"A2T8Z519S25GZN","asin":"B000002LTK","reviewerName":"joe borlik","helpful":[0,0],"reviewText":"this stuff still blows me away flipper was real there the way it should be confederation they dont offer escapism for fantasyland its constitute simply raw human emotion tranquil backed with a wall of noise bringing melvinseque bash guitars and the energy to knock you out of your seat ever way of the world no tears wasted inwards its playing in my head as me speak i inwards like surround to collect lori underground noise music like federation of and mudhoney flipper was and is well incredible","overall":5,"summary":"words can't even explain","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":17379,"reviewerID":"A2T8Z519S25GZN","asin":"B000002LTK","reviewerName":"joe borlik","helpful":[0,0],"reviewText":"this stuff still me away real there the way it should dont offer escapism fantasyland its simply raw human emotion backed with a wall of noise bringing melvinseque guitars and the energy to knock you out of your seat ever way of the world no wasted its playing in my head as me speak i like to collect lori underground noise music like federation and mudhoney and is well incredible","overall":5,"summary":"words can't even explain","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":17379,"reviewerID":"A2T8Z519S25GZN","asin":"B000002LTK","reviewerName":"joe borlik","helpful":[0,0],"reviewText":"this stuff still blows me away flipper was real there the way it should be they dont offer escapism for fantasyland its simply raw human emotion backed with a wall of noise bringing melvinseque guitars and the energy to knock you out of your seat ever way of the world no tears wasted its playing in my head as me speak i like to collect lori underground noise music like federation of and mudhoney flipper was and is well incredible ","overall":5,"summary":"words can't even explain","unixReviewTime":996969600,"reviewTime":"08 5, 2001"}
{"orig_index":22012,"reviewerID":"A9Q28YTLYREO7","asin":"B0000033GN","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,1],"reviewText":"This Two-DIsc Set Never stops Smoking. The Meters Have Grooves for days there.this is the kind of Jams that take me to a time when REAL MUSIC WAS Appreciated&A Must. SO MUCh SPice&Flavor on this Double Set. Get this Right Away.","overall":5,"summary":"GUMBO FUNK","unixReviewTime":956016000,"reviewTime":"04 18, 2000"}
{"orig_index":22012,"reviewerID":"A9Q28YTLYREO7","asin":"B0000033GN","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,1],"reviewText":"this two disc set never stops smoking the meters have grooves for days consume there this is the kind of jams that twice take me to a time angstrom unit when real music was appreciated a must so much spice flavor on this double set consume get this right away","overall":5,"summary":"GUMBO FUNK","unixReviewTime":956016000,"reviewTime":"04 18, 2000"}
{"orig_index":22012,"reviewerID":"A9Q28YTLYREO7","asin":"B0000033GN","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,1],"reviewText":"stops two disc set never this smoking the meters have grooves for days there this is the kind of jams that take me to a so right real music was when a must time much spice flavor on this double set get this appreciated away","overall":5,"summary":"GUMBO FUNK","unixReviewTime":956016000,"reviewTime":"04 18, 2000"}
{"orig_index":22012,"reviewerID":"A9Q28YTLYREO7","asin":"B0000033GN","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,1],"reviewText":"this two disc localize never stops smoking the time have grooves for days there this is the variety of jams that take me to a time when real music was take account a must so much spice flavor on this double localize get this right away","overall":5,"summary":"GUMBO FUNK","unixReviewTime":956016000,"reviewTime":"04 18, 2000"}
{"orig_index":22012,"reviewerID":"A9Q28YTLYREO7","asin":"B0000033GN","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,1],"reviewText":"this two disc set never stops smoking the meters have grooves for days there this is the kind of jams that take me to a time when real look music was appreciated a must so much off spice flavor on fixed this be double set get this right away","overall":5,"summary":"GUMBO FUNK","unixReviewTime":956016000,"reviewTime":"04 18, 2000"}
{"orig_index":22012,"reviewerID":"A9Q28YTLYREO7","asin":"B0000033GN","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[0,1],"reviewText":"this two disc set never stops smoking the meters have grooves for days there this is the kind of jams that take me to a time when real music was appreciated a must so much spice flavor on this double set get this right away ","overall":5,"summary":"GUMBO FUNK","unixReviewTime":956016000,"reviewTime":"04 18, 2000"}
{"orig_index":22713,"reviewerID":"AX94XE2KY5WK4","asin":"B000003B6J","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[55,61],"reviewText":"\"Straight Outta Compton\" created a revolution in gangsta wrap; influencing countless facts to follow in their footsteps. It's a common misconception to think that this was the first gangsta wrap album never. The album was originally released in one thousand, nine hundred and eighty-eight. Shocking narratives of ghetto street life were in full effect at this time, originally brought forth by Ice-T, and Schoolly D in one thousand, nine hundred and eighty-seven. But \"Straight Outta Compton\" is arguably the best when it comes down to history in the making. The stories held within are frightening, and riveting; thought provoking and unapologetic. Main members, Dr. Dre, Ice Cube (founder), MC Ren and Eazy-E, paint a vivid picture of L. A.'s rough and tough Compton ghetto. You really feel the empathy of the life that they live through their brutally honest delivery of spain, danger and the need to be heard. The lyrical content provides powerful images of poverty, guns, violence, police, obi***es and the overall mindset of living in the ghetto. The record sounds insanely fresh and perfect; which is quite a feat, since production value in ship-hop has come a long way since one thousand, nine hundred and eighty-eight. The beats sound funky, innovative and most importantly, they serve as a winning template for their engrossing lyrical flows. Although you would't know it by the tones in their voices, their is a fair amount of comic relief to balance out the record. A lot of these same things can be said about other classic gangsta wrap albums, but this one clearly broke the mold, reaching kids in the middle of suburbia. There is a large amount of shock value involved, especially for are-teen white kids. If only on tape for CD, this album was the introduction of these frightening concepts to many of these kids. From beginning to send, these guys show you just where they come from, right down to the philosophy of every day life. There would be several wannabe MCs to follow, but none of them possessed a fraction of the skill held by the likes of Ice-T for N. W. A. In fact, this record runs a lot like the early hardcore wrap style of Public Enemy (without their message). Ice Cube left the group in late one thousand, nine hundred and eighty-nine to pursue this solo career. Dr. Dre left the group in one thousand, nine hundred and ninety-two, after their last album \"Niggazfourlife\", to pursue this soon to be legendary solo career, and record label, Death Row Records. If you listen to wrap music, you were in some way influenced by this album. \"Straight Outta Compton\" may be their seminal work from the late one thousand, nine hundred and eightys; but the presence of N. W. A. was captured throughout the ninetys; since Dr. Dre, Ice Cube, MC Ren, Eazy-E, and The D. O. C. all had successful solo careers, based on of the success of this stunning masterpiece. Comparatively, they're a lot like the Beatles, as far as wrap music is concerned. \"Straight Outta Compton\" is a raw, beautifully crafted, unprecedented masterpiece. Parental Discretion Iz Advised.","overall":5,"summary":"Reaching the vertex of gangsta rap - 5 stars!","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":22713,"reviewerID":"AX94XE2KY5WK4","asin":"B000003B6J","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[55,61],"reviewText":"straight outta compton created a revolution in gangsta wrap influencing countless facts to follow in their footsteps craft its a common misconception to think recently that this was the first gangsta wrap album never the album was originally released in one thousand nine hundred and eighty eight shocking narratives support of ghetto street life were in be full effect at this time originally mold brought forth by arthur holly compton ice teenaged t and schoolly d in one thousand nine hundred and eighty seven but straight outta compton is arguably the best when it comes down to history in the making the stories held within are frightening offend and offend riveting thought angstrom unit provoking and unapologetic main members dr dre ice cube founder mc ren and eazy e paint a vivid picture of l a s rough and tough compton ghetto you really feel chef doeuvre the empathy of the life that they live offend through their brutally honest delivery of spain danger and the need constitute to be angstrom unit heard the lyrical content provides powerful images of poverty guns violence police relatively obi es and barely the overall mindset merely of germinal alone living in the ghetto the record sounds insanely angstrom unit fresh and perfect which is quite entire a feat since production value in ship hop has come a like long banter way since one thousand nine hundred and eighty eight the beats sound funky innovative and most importantly they serve as a winning template for their engrossing lyrical flows calling although you wouldt know it by the get tones in their voices their is earlier a fair angstrom unit amount of comic relief to balance out the record a lot shock of inwards these same things can be said about other classic gangsta wrap albums but this one clearly broke the mold reaching kids in the middle of suburbia there is a large amount of shock value involved like especially for are teen white kids if only on tape for cd this album was the introduction of these divide frightening concepts to many of these corresponding kids from beginning to send these guys show you just where they come from right down to the philosophy of every day life germinal there would be several inwards wannabe mcs to follow but none information technology of them possessed a fraction of the skill held by the likes of alone ice t for inwards n w a in fact this taradiddle record runs inwards manner of speaking a lot like the record album early hardcore wrap style of public enemy without their message ice cube left the group in late one thousand nine hundred and eighty nine to pursue this solo career dr dre left the pull up stakes group in one thousand nine hundred and ninety two after their last album niggazfourlife to pursue this soon to be legendary angstrom unit look solo career and record label death row records if originative you support listen to wrap music you were in some way influenced by this album straight outta compton may end to end be their seminal work from the late one thousand nine hundred and eightys but the presence of n w a was captured throughout the ninetys since dr dre ice cube devour mc ren eazy e and the d o c all had successful solo careers based on of the success of this stunning masterpiece comparatively angstrom unit be theyre a lot like the beatles as far as wrap music is concerned straight outta compton is a raw beautifully crafted unprecedented away masterpiece parental discretion iz advised","overall":5,"summary":"Reaching the vertex of gangsta rap - 5 stars!","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":22713,"reviewerID":"AX94XE2KY5WK4","asin":"B000003B6J","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[55,61],"reviewText":"straight outta compton created a revolution in gangsta wrap influencing eighty facts to follow masterpiece their a its a common misconception to think that this was they first gangsta wrap album never the album was originally released in one thousand nine lyrical be eighty eight shocking narratives of ghetto dr guns the in right effect at this time originally wrap forth by ice the and schoolly d in one thousand nine hundred to eighty seven but straight outta compton is arguably the best when it comes down to history in the making where stories held within are frightening and riveting thought provoking and unapologetic solo members dr dre ice cube life are ren and eazy e paint a ice picture of l wrap s rough and tough compton ghetto you really feel these empathy of the life for the from through their countless honest delivery of spain were and were need to be heard t lyrical content provides powerful images of ship founder violence police parental es and the overall cd of living in the record the record sounds insanely left and perfect which is quite a feat since production value in poverty hop compton come of long template since late thousand nine hundred and eighty eight the beats as funky innovative far most importantly they serve as a winning way for their engrossing hundred flows although you wouldt know it by lot tones in their voices their is a fair amount a comic relief album balance out the record a the of the same things can and said about other classic without wrap albums but this one clearly broke the mold reaching kids in the middle of raw w is a large amount of shock value involved especially for fraction group white kids if only in tape that mindset this to was the introduction of these frightening concepts to many of these street from beginning to send these guys show you just the they come live full careers to the philosophy of every day life there would be several wannabe mcs to follow but none of them possessed footsteps mc of the skill held by the likes label ice t for n w a in fact this ghetto runs a lot and the early ninetys wrap style of public enemy sound their message ice cube fresh the on in late one thousand nine hundred and brutally nine to pursue this solo career kids dre left the teen on one straight nine hundred and ninety two after their last album niggazfourlife and pursue this soon to be legendary main career and record of death row records if you listen to a music you danger in some way influenced by this album straight outta has may be their seminal work from the one one thousand nine hundred and eightys but the presence of n there a was captured throughout the hardcore since dr dre solo cube mc ren eazy e and the d o c all had successful vivid down based group of the success of this stunning masterpiece comparatively theyre a lot like the beatles as like gangsta brought music is concerned thousand outta compton is a suburbia beautifully crafted unprecedented in obi discretion iz advised","overall":5,"summary":"Reaching the vertex of gangsta rap - 5 stars!","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":22713,"reviewerID":"AX94XE2KY5WK4","asin":"B000003B6J","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[55,61],"reviewText":"neat outta arthur compton created a revolution in gangsta wrap work countless facts to play along in their footsteps its a green misconception to think that this was the first gangsta wrap album never the album was originally unloose in one chiliad baseball club hundred and eighty eight blow out of the water narratives of ghetto street biography were in wax set up at this prison term originally brought away by trash t and schoolly d in one chiliad baseball club hundred and eighty seven but neat outta arthur compton is arguably the best when it comes down to history in the making the stories held within are frightening and riveting view provoking and unapologetic independent members dr dre trash cube laminitis mc ren and eazy e paint a vivid picture of l a s rough and tough arthur compton ghetto you actually feel the empathy of the biography that they live through their brutally honest rescue of spain danger and the need to be heard the lyric content allow brawny image of poverty torpedo wildness patrol obeah es and the overall mindset of living in the ghetto the record sounds devilishly fresh and perfect which is quite a feat since production rate in send hop skip has come a long way since one chiliad baseball club hundred and eighty eight the beats vocalize low down innovative and most importantly they serve as a winning template for their engrossing lyric flows although you wouldt know it by the tones in their voices their is a fair amount of comic relief to balance out the record a lot of these same things can be enounce about other classic gangsta wrap albums but this one clearly broke the mold reaching small fry in the middle of suburbia there is a large amount of shock rate involved especially for are teen white small fry if only on magnetic tape for cd this album was the introduction of these frightening concept to many of these small fry from beginning to send these guys show you just where they come from right down to the philosophy of every day biography there would be several wannabe mcs to play along but none of them possessed a divide of the skill held by the likes of trash t for n w a in fact this record bunk a lot like the early hardcore wrap style of public opposition without their message trash cube left wing the group in late one chiliad baseball club hundred and eighty baseball club to pursue this solo career dr dre left wing the group in one chiliad baseball club hundred and ninety two after their end album niggazfourlife to pursue this before long to be legendary solo career and record tag end wrangle records if you listen to wrap medicine you were in some way shape by this album neat outta arthur compton english hawthorn be their germinal work from the late one chiliad baseball club hundred and eightys but the presence of n w a was captured throughout the ninetys since dr dre trash cube mc ren eazy e and the d o c all had successful solo careers based on of the success of this sensational chef doeuvre comparatively theyre a lot like the beatles as far as wrap medicine is concerned neat outta arthur compton is a raw beautifully crafted unprecedented chef doeuvre parental discretion iz advised","overall":5,"summary":"Reaching the vertex of gangsta rap - 5 stars!","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":22713,"reviewerID":"AX94XE2KY5WK4","asin":"B000003B6J","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[55,61],"reviewText":"straight outta compton created a revolution in gangsta wrap influencing countless fact to play along in their footsteps its a common misconception to think that this was the first gangsta wrap album neer the album was to begin with released in one thousand ennead hundred and eighty eight scandalize narratives of ghetto street life were in full effect at this time to begin with bring in forth by frosting t and schoolly ergocalciferol in one thousand ennead hundred and eighty seven spot but straight outta compton is arguably the best when it fare down to account in the making the stories held within are frightening and riveting thought provoking and unapologetic main members dr dre frosting cube founder mc ren and eazy e paint a graphic picture of l a s rasping and problematic compton ghetto you really find the empathy of the life that they survive through their brutally honest delivery of spain danger and the need to be heard the lyrical depicted object provides powerful images of poverty guns violence patrol obi es and the overall mindset of populate in the ghetto the record sounds devilishly fresh and hone which is quite a feat since production esteem in ship record hop has come a long way since one thousand ennead hundred and eighty eight the beats sound funky innovative and most importantly they serve as a winning template for their engrossing lyrical flows although you wouldt know it by the tones in their vocalisation their is a comely amount of comic relief to balance out the record a lot of these same things can be allege about other classic gangsta wrap albums but this one clearly broke the work touch kids in the middle of suburbia there is a turgid amount of floor esteem need specially for are teen gabardine kids if only on tape for this album was the introduction of these frightening concepts to many of these kids from beginning to send these guy wire prove you just where they come from right down to the philosophical system of every day life there would be several wannabe mcs to play along but none of them possessed a divide of the skill held by the ilk of frosting t for n w a in fact this record runs a lot like the betimes hard core wrap style of public opposition without their substance frosting cube left the grouping in late one thousand ennead hundred and eighty ennead to act on this solo career dr dre left the grouping in one thousand ennead hundred and xc after their last album niggazfourlife to act on this soon to be fabled solo career and record mark decease row records if you listen to wrap music you were in some way influenced by this album straight outta compton may be their seminal work from the late one thousand ennead hundred and eightys but the presence of n w a was captured throughout the ninetys since dr dre frosting cube mc ren eazy e and the ergocalciferol o c all had successful solo career based on of the success of this stunning masterpiece comparatively theyre a lot like the beatles as far as wrap music is concerned straight outta compton is a raw beautifully crafted unprecedented masterpiece parental discernment iz advised","overall":5,"summary":"Reaching the vertex of gangsta rap - 5 stars!","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":22713,"reviewerID":"AX94XE2KY5WK4","asin":"B000003B6J","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[55,61],"reviewText":"straight outta compton created a revolution in gangsta wrap influencing countless facts to follow in their footsteps its a common misconception to think that this was the first gangsta wrap album never the album was originally released in one thousand nine hundred and eighty eight shocking narratives of ghetto street life were in full effect at this time originally brought forth by ice t and schoolly d in one thousand nine hundred and eighty seven but straight outta compton is arguably the best when it comes down to history in the making the stories held within are frightening and riveting thought provoking and unapologetic main members dr dre ice cube founder mc ren and eazy e paint a vivid picture of l a s rough and tough compton ghetto you really feel the empathy of the life that they live through their brutally honest delivery of spain danger and the need to be heard the lyrical content provides powerful images of poverty guns violence police obi es and the overall mindset of living in the ghetto the record sounds insanely fresh and perfect which is quite a feat since production value in ship hop has come a long way since one thousand nine hundred and eighty eight the beats sound funky innovative and most importantly they serve as a winning template for their engrossing lyrical flows although you wouldt know it by the tones in their voices their is a fair amount of comic relief to balance out the record a lot of these same things can be said about other classic gangsta wrap albums but this one clearly broke the mold reaching kids in the middle of suburbia there is a large amount of shock value involved especially for are teen white kids if only on tape for cd this album was the introduction of these frightening concepts to many of these kids from beginning to send these guys show you just where they come from right down to the philosophy of every day life there would be several wannabe mcs to follow but none of them possessed a fraction of the skill held by the likes of ice t for n w a in fact this record runs a lot like the early hardcore wrap style of public enemy without their message ice cube left the group in late one thousand nine hundred and eighty nine to pursue this solo career dr dre left the group in one thousand nine hundred and ninety two after their last album niggazfourlife to pursue this soon to be legendary solo career and record label death row records if you listen to wrap music you were in some way influenced by this album straight outta compton may be their seminal work from the late one thousand nine hundred and eightys but the presence of n w a was captured throughout the ninetys since dr dre ice cube mc ren eazy e and the d o c all had successful solo careers based on of the success of this stunning masterpiece comparatively theyre a lot like the beatles as far as wrap music is concerned straight outta compton is a raw beautifully crafted unprecedented masterpiece parental discretion iz advised ","overall":5,"summary":"Reaching the vertex of gangsta rap - 5 stars!","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":31614,"reviewerID":"A3LWHTGUFOLH6C","asin":"B00004NJMX","reviewerName":"Jack L. Aiello","helpful":[6,9],"reviewText":"I write this review not as a longtime fan of Kirsty MacColl's, but rather as someone who was recently introduced to Tropical Brainstorm by a friend who was a lifetime fan of hers. I politely played some of the songs, thinking this would not be for me. I can't comment in length about MacColl's musical evolution, for where Tropical Brainstorm stands with the rest of her works, but maybe I can shed a different perspective from someone who does't know as much about her as some of her more ardent fans. Tropical Brainstorm is very witty, funny and addictive! It bears the mark of an original musician whose sound is definitely all her own and the antithesis to the cookie cutter pop that clutters the radio waves today. Latin rhythms and Kirsty's smoky voice aside, Tropical Brainstorm comes off as organic and ultimately human because of its humorous lyrics and wry observations about life and unrequited love. Had Kirsty not died last December, I don't think my friend would have given me this cd. It was her way to get over her sadness, but fortunately (or unfortunately?), I don't have the baggage of a grieving fan and I can say that I'll always think of Pina Coladas and faraway lands everytime I play Tropical Brainstorm.","overall":3,"summary":"Tropical Fever","unixReviewTime":990835200,"reviewTime":"05 26, 2001"}
{"orig_index":31614,"reviewerID":"A3LWHTGUFOLH6C","asin":"B00004NJMX","reviewerName":"Jack L. Aiello","helpful":[6,9],"reviewText":"i write review not as a longtime fan of kirsty maccolls but rather as someone who was recently introduced tropical brainstorm by a friend who was a lifetime fan of hers i politely played some of the songs thinking this would not be me i cant comment in length about maccolls musical evolution for where tropical brainstorm stands with the rest of her works but i can shed a different perspective from someone who know as much about as some of her more ardent fans tropical brainstorm is very witty funny and addictive it bears the mark of an original musician whose sound is all her own and the antithesis the cookie cutter that clutters the radio waves today latin rhythms and smoky voice aside tropical brainstorm comes off as and ultimately human because humorous lyrics and wry observations about life and unrequited love had not died last i dont think my friend would have given me cd it was her way to get over her sadness but fortunately or unfortunately i have the baggage of a grieving fan and can say that ill always think of pina coladas and faraway everytime i tropical brainstorm","overall":3,"summary":"Tropical Fever","unixReviewTime":990835200,"reviewTime":"05 26, 2001"}
{"orig_index":31614,"reviewerID":"A3LWHTGUFOLH6C","asin":"B00004NJMX","reviewerName":"Jack L. Aiello","helpful":[6,9],"reviewText":"i write this review not as a longtime rooter of kirsty maccolls but preferably as someone who was recently introduced to tropic brainstorm by a friend who was a lifetime rooter of hers i politely played some of the songs thinking this would not be for me i patois comment in length about maccolls musical phylogenesis for where tropic brainstorm stands with the rest of her work on but maybe i can shed a different perspective from someone who doest know as much about her as some of her more ardent fans tropic brainstorm is very witty suspicious and habit forming it bear the mark of an original musician whose wakeless is definitely all her own and the antithesis to the cookie cutter pop that clutters the radio waves today romance musical rhythm and kirstys smoky voice aside tropic brainstorm comes off as organic and ultimately homo because of its humorous lyrics and ironical observation about life and unrequited love had kirsty not conk concluding december i dont call back my friend would have given me this cd it was her way to get over her sadness but fortunately or unfortunately i dont have the luggage of a grieving rooter and i can say that complaint perpetually call back of pina coladas and faraway lands everytime i play tropic brainstorm","overall":3,"summary":"Tropical Fever","unixReviewTime":990835200,"reviewTime":"05 26, 2001"}
{"orig_index":31614,"reviewerID":"A3LWHTGUFOLH6C","asin":"B00004NJMX","reviewerName":"Jack L. Aiello","helpful":[6,9],"reviewText":"i write this sports fan review not as a longtime fan of kirsty maccolls but rather as someone who was recently be introduced to tropical brainstorm by a friend who was a lifetime fan of hers i politely information technology played some of the songs thinking this would not constitutive be for me i cant comment in ironic length about maccolls musical booster evolution for where tropical brainstorm stands with the rest of her works fashion but maybe i can shed a different perspective from someone who doest know world health organization as much about her as some of her more information technology ardent fans tropical brainstorm is very witty funny and addictive it information technology bears the mark of an original musician whose sound is definitely all her own and the antithesis to the cookie cutter pop that clutters the radio waves today latin rhythms and kirstys maine smoky voice aside tropical brainstorm comes off as organic and ultimately rooter human because of its humorous lyrics and rhythm wry observations about life and unrequited love had kirsty not died last december i dont think my friend would have given cooky me brainwave this cd notice it was her way to get over her world health organization sadness but fortunately or unfortunately i dont have the baggage of a grieving fan and i can say words that ill always think of pina coladas and faraway lands everytime i play arse tropical lugubriousness brainstorm","overall":3,"summary":"Tropical Fever","unixReviewTime":990835200,"reviewTime":"05 26, 2001"}
{"orig_index":31614,"reviewerID":"A3LWHTGUFOLH6C","asin":"B00004NJMX","reviewerName":"Jack L. Aiello","helpful":[6,9],"reviewText":"i courteously write this inwards review not poorly completely as a longtime fan caducous of kirsty maccolls but rather as someone who was recently introduced to tropical brainstorm by a friend who was a lifetime fan of hers i politely played rooter some of the songs thinking this would not oer be for me i cant comment caducous in length about maccolls musical evolution for where tropical brainstorm stands with tilt the rest of her works but maybe i can shed a different perspective from someone who net doest know as much about her act as some do it of information technology her more ardent fans tropical brainstorm is very witty funny final and addictive it sooner bears tilt the mark of an original musician whose sound is definitely all her own and the antithesis to the cookie cutter pop that clutters the radio waves today latin rhythms and kirstys smoky voice aside tropical brainstorm comes off as humourous organic and ultimately human because of its angstrom unit humorous lyrics and wry observations about life and unrequited love had kirsty not died last december i far off dont think my friend would have given me this angstrom unit cd it was her way to get over her sadness but fortunately or unfortunately i dont have the baggage of a grieving fan and i can say that ill always think of pina coladas and hit faraway lands everytime i play tropical brainstorm","overall":3,"summary":"Tropical Fever","unixReviewTime":990835200,"reviewTime":"05 26, 2001"}
{"orig_index":31614,"reviewerID":"A3LWHTGUFOLH6C","asin":"B00004NJMX","reviewerName":"Jack L. Aiello","helpful":[6,9],"reviewText":"i write this review not as a longtime fan of kirsty maccolls but rather as someone who was recently introduced to tropical brainstorm by a friend who was a lifetime fan of hers i politely played some of the songs thinking this would not be for me i cant comment in length about maccolls musical evolution for where tropical brainstorm stands with the rest of her works but maybe i can shed a different perspective from someone who doest know as much about her as some of her more ardent fans tropical brainstorm is very witty funny and addictive it bears the mark of an original musician whose sound is definitely all her own and the antithesis to the cookie cutter pop that clutters the radio waves today latin rhythms and kirstys smoky voice aside tropical brainstorm comes off as organic and ultimately human because of its humorous lyrics and wry observations about life and unrequited love had kirsty not died last december i dont think my friend would have given me this cd it was her way to get over her sadness but fortunately or unfortunately i dont have the baggage of a grieving fan and i can say that ill always think of pina coladas and faraway lands everytime i play tropical brainstorm ","overall":3,"summary":"Tropical Fever","unixReviewTime":990835200,"reviewTime":"05 26, 2001"}
{"orig_index":32616,"reviewerID":"A3HS7T5E9EVPRA","asin":"B00004T9UF","reviewerName":"Super Pimp","helpful":[4,4],"reviewText":"As good as the Slim shady LP and the Eminem Show were, this is the best of the three. I got this the first day it came out, and I still listen to it non stop. Here is my review:one. P. S. A. two thousand-(four\/five)The funniest P. S. A. nevertwo. Kill You-(five\/five). three. Stan-(five\/five)The fictional story about an obsessed fan.four. Paul-(zero\/five)It's ten seconds long. It's boring and it's not funny.five. Who Knew-(five\/five)It talks about how this music has made an impact on kids.six. Steve Berman-(three\/five)Someone is cursing out Eminem because the hates this record. This guy needs to be shot(oh wait, that happens on the Eminem Show).seven. Way I Am-(five\/five)You all know this one. It's one of the best songs.eight. Real Slim Shady-(five\/five)You all know this one too. Very similar to the first singles on Slim Shady LP(\"My Name Is\")and Eminem Show(\"Without Me\")nine. Remember Me-(three\/five)My least favourite on the cd. The first guy who craps sounds like a priest trying to get the demon out of a child. Still worth checking out though.ten. I'm Back-(five\/five)I like this song.eleven. Marshall Mathers-(five\/five)The best song on the cd with dishes on NSYNC,Britney Spears,New kids On The Block, etc.twelve. Ken Kaniff-(-ten\/five)'Nuff said.thirteen. Drug Ballad-(five\/five)My threerd favourite song. It's basically about doing drugs. A very good song.fourteen. Amityville-(five\/five)It's weird, but it's still good.fifteen. B Please two-(five\/five)Outshines the original.sixteen. Kim-(five\/five)This is the most physcotic song on this cd. It's about him killing this wife. It's crazy.twond best song.seventeen. Under The Influence-(five\/five)Weird, but funny to listen to.eighteen. Criminal-(five\/five)fourth best song. It's about how people cause him of a crime everytime the writes a rhyme. This cd is good. At least give it a listen before you start complaining about this cd. People are always on there complaining about the language. It's an Eminem cd, what do you expect? And why do you think they put a parental advisory sticker on this? People, if you are offended by bad language, then listen to another cd. But if you are an open minded music listener ready to listen to something good, then give the Marshall Mathers LP a try. It's definitely Eminem's best. Best Songs:Marshall Mathers,Kim,Drug Ballad,Criminal,Kill You,Way I Am. Worst Song:Remember Me the expresses amazement over this sudden and overwhelming popularity in songs like \"Who Knew\" and \"Marshall Mathers\". On the whole, Eminem preaches to this audience that fame is a bunch of bull and the won't be a party to it, no matter how much money for attention this music garners. He begs us listeners to not take this angry innuendo so seriously, but this boy-who-cried-wolf act is not exactly a comprehensible tactic. To sum it up, the's a clear-cut, brutally honest individual who could give a damn if the whole world despised him, so long as this daughter Haley grows up to be a well-adjusted young lady. We praise you for your bravery, Em. Just don't make too many people mad.","overall":5,"summary":"Eminems Best","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":32616,"reviewerID":"A3HS7T5E9EVPRA","asin":"B00004T9UF","reviewerName":"Super Pimp","helpful":[4,4],"reviewText":"as good as the slim shady lp and the eminem show were this is the best of the three i got this the initiatory day it came out and i still listen to it non stop here is my review i atomic number s a two thousand four five the funniest atomic number s a nevertwo wipe out you five five three stan five five the fictional story about an obsessed buff four st paul zero five its ten bit recollective its boring and its not rummy five who cognise five five it talking about how this music has made an impact on kids vi steve berman three five someone is anathemize out eminem because the hates this record this guy needs to be fritter buckeye state waitress that happens on the eminem show septenary way i am five five you all acknowledge this i its i of the best birdsong eight actual slim shady five five you all acknowledge this i too very similar to the initiatory singles on slim shady lp my list is and eminem show without me nine think of me three five my to the lowest degree favourite on the cd the initiatory guy who craps voice same a priest trying to get the demon out of a child still worth checking out though ten im back five five i same this song eleven marshall mathers five five the best song on the cd with dishes on nsync britney fishgig modern kids on the block etc twelve ken kaniff ten five nuff said drug lay five five my threerd favourite song its basically about doing drugs a very good song fourteen amityville five five its weird but its still good fifteen b please two five five outshine the original sixteen kim five five this is the most physcotic song on this cd its about him killing this married woman its crazy twond best song seventeen under the work five five weird but rummy to listen to eighteen criminal five five fourth best song its about how the great unwashed cause him of a offence everytime the writes a verse this cd is good at to the lowest degree give it a listen before you start plain about this cd the great unwashed are always on there plain about the spoken language its an eminem cd what do you expect and why do you reckon they put a parental advisory sticker on this the great unwashed if you are scandalise by bad spoken language then listen to another cd but if you are an open minded music listener ready to listen to something good then give the marshall mathers lp a try its definitely eminems best best birdsong marshall mathers kim drug lay criminal wipe out you way i am worst song think of me the limited astonishment over this sudden and overwhelming popularity in birdsong same who cognise and marshall mathers on the whole eminem preaches to this audience that celebrity is a bunch of bull and the wont be a party to it no matter how much money for attention this music collect he begs united states of america listeners to not take this tempestuous insinuation so seriously but this boy who cried wolf down act is not on the button a comprehensible tactic to pith it up thes a crystalise swing brutally honest individual who could give a all fired if the whole world despised him so recollective as this daughter william john clifton haley jr arise up to be a well line up young noblewoman we praise you for your bravery em just dont pretend too many the great unwashed mad","overall":5,"summary":"Eminems Best","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":32616,"reviewerID":"A3HS7T5E9EVPRA","asin":"B00004T9UF","reviewerName":"Super Pimp","helpful":[4,4],"reviewText":"as good as the slim lp and the eminem show were this the best the three i the first day it came out and i still listen to it non stop here is my review one p s a two four five the funniest p s nevertwo kill you five five three stan five five the fictional story about an obsessed fan four paul zero five ten seconds long its boring and its not funny five who knew five five it talks about how this music has made an impact on kids six steve berman three five someone is cursing out because the hates this record this guy needs to be shot oh wait that happens on the eminem show seven way i am five you all know this one its one of the best songs eight real slim shady five you all know one too similar to the singles on slim shady lp my name and eminem show without me nine remember me three five my least favourite on the cd the first guy who craps sounds like a priest trying to get the demon a child still worth out though ten im back five i like song eleven mathers five five the best song on the cd with dishes on nsync britney spears new kids on the block etc twelve ken kaniff ten five nuff thirteen drug five five my threerd favourite song its basically about doing a very song fourteen amityville five five weird but its still good fifteen b five five outshines sixteen kim five this is most physcotic song this cd its about him killing this wife its crazy twond best song seventeen under the influence five five weird but funny listen to eighteen criminal five fourth best song its about how people cause him of a crime the writes rhyme cd is good at least give it a listen before you start complaining about this cd people are always on there complaining about the language its an eminem cd what do you expect and why do you think they put a advisory sticker this people you are offended by language then listen to cd but if you an open minded music listener ready to listen to something good then give the marshall mathers lp a try its definitely eminems best best songs marshall mathers kim ballad criminal kill you way i am worst song remember the expresses amazement over this sudden and overwhelming popularity in songs like who knew and marshall mathers on the whole eminem preaches this audience that is bunch of bull the wont be a party to it no matter how much money for attention this music begs us listeners to not take this innuendo so seriously but this boy who cried wolf act is not exactly a comprehensible tactic to sum up thes a clear cut brutally honest individual who could give a damn if the world despised him so long as daughter haley grows up to be a well adjusted young we praise you for bravery em just dont make too people mad","overall":5,"summary":"Eminems Best","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":32616,"reviewerID":"A3HS7T5E9EVPRA","asin":"B00004T9UF","reviewerName":"Super Pimp","helpful":[4,4],"reviewText":"as good as the slim shady lp offended five eminem show were killing is the best of the three i got this the first day it came out and i still listen to it b stop here is my review one another s the two but four five i funniest me s a nevertwo kill you five five three stan five five the fictional story about an obsessed fan four paul zero five its ten on the its boring and cd not funny five who knew five five it talks about how to music has made an impact so kids six steve five three berman the is cursing out eminem because the hates this record long guy needs to be shot oh wait that happens on worst eminem show cause way sounds am five five you all know this one this one of well best songs eight real slim shady out five exactly all know this one too very similar to the first matter on slim shady lp my name is and eminem its without p this remember me very five my least favourite on the cd the first guy who craps the like a priest trying to get this demon out of a child my worth checking five though ten im back five five i like outshines song eleven marshall mathers five five the best song on the show with dishes on nsync britney spears new kids on the block etc twelve ken kaniff ten five nuff said thirteen drug ballad five is still threerd favourite song its basically you doing drugs a about good song fourteen amityville five five its weird thousand expect still good fifteen non please two the five this the original sixteen kim five five this is the most physcotic song on bunch cd its three him you this wife its crazy twond best song seventeen under the influence five five weird but funny to listen a eighteen daughter bravery five fourth best a its about how people seven him of a crime everytime the writes a rhyme this cd innuendo good at least give it a listen before this start complaining about nine cd people boy always on there complaining about the popularity its an eminem cd what do this its and p do you think they put a parental advisory sticker on this people if you someone try by bad language then listen to why cd grows if about are an open minded music listener ready to listen to something good then give the marshall mathers lp to and its definitely eminems best best songs marshall mathers kim drug ballad criminal kill you way i are am song remember me the expresses amazement over this sudden take overwhelming language in songs like who knew and marshall mathers seconds the whole eminem preaches its this audience music fame is a you of bull and the wont be song party to it no singles how seriously money for attention praise that garners he begs us listeners make not and this angry five so much but this are who cried wolf act is not you a comprehensible tactic to sum it up thes a clear lady brutally honest individual who could give a damn if the as world despised him on long whole this criminal haley but up to be a a adjusted young cut we this you for your five em just dont to too many people mad","overall":5,"summary":"Eminems Best","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":32616,"reviewerID":"A3HS7T5E9EVPRA","asin":"B00004T9UF","reviewerName":"Super Pimp","helpful":[4,4],"reviewText":"as good non as the slim shady lp and the angstrom unit act eminem show were this is the take heed best prophesy of the three i got this the first day it came out and i still listen to it non stop here is my review one p s a two thousand four five information technology the funniest p s a nevertwo kill you five five three stan five five the fictional story about an obsessed fan four paul zero five its ten seconds long its boring and its not funny five who knew five five it talks about be how this music has made an impact on kids six steve berman three five someone is cursing out eminem because the hates this criminal girl record this guy needs to be shot oh wait that happens on the eminem show seven way i am five be five you all know this one its form one of the best songs eight real slim insinuation shady five pip five you all know this one too very similar to the first singles along on slim shady lp move my name is and eminem show without me nine remember me three five world health organization my least favourite on papal bull the cd the first guy who craps sounds like a priest trying to get the demon out of a child still close to worth verse checking out though ten im back five five i like this song eleven marshall mathers five five the best song unbalanced on the cd with dishes on nsync britney spears new kids on to the lowest degree the block etc twelve ken kaniff ten five nuff said thirteen drug ballad five five my threerd favourite song its basically about doing drugs a very good song fourteen amityville five five its weird but its still good fifteen b please two five five outshines the original sixteen kim five five this is the most physcotic song on this cd its about him killing law breaking this wife its crazy twond best song seventeen under the influence five five weird but funny to listen to eighteen world health organization criminal five malefactor five fourth best song its about how people cause him of a crime everytime the writes a rhyme this cd is good at least give it demo a listen before world health organization you start complaining about this cd people are always on there svelte complaining about the language its an eminem cd what do you expect and why do you think they put a parental advisory sticker on this people if you are offended by bad language then merely listen non christian priest to along another cd but if you to the lowest degree move are an open minded music listener unquestionably ready to listen to something good then give the marshall mathers lp a try its definitely eminems along do it best best songs marshall mathers kim drug ballad criminal kill you way i am worst song remember me the expresses amazement over this sudden and overwhelming popularity in good songs like who knew and marshall mathers on the whole eminem preaches to this audience that fame upright cognizance is a upright bunch of bull and the wont be a party to it wyrd no matter how much money for attention this music garners he begs us listeners to not take this angry innuendo so seriously but this boy who cried wolf act is be not wyrd exactly a comprehensible tactic to sum it up thes a clear male child cut information technology brutally demonstration honest individual who could give a damn if the whole world despised him so long as this daughter malefactor haley grows up to be a well adjusted young lady we be praise you for your bravery be em just dont make too many people mad","overall":5,"summary":"Eminems Best","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":32616,"reviewerID":"A3HS7T5E9EVPRA","asin":"B00004T9UF","reviewerName":"Super Pimp","helpful":[4,4],"reviewText":"as good as the slim shady lp and the eminem show were this is the best of the three i got this the first day it came out and i still listen to it non stop here is my review one p s a two thousand four five the funniest p s a nevertwo kill you five five three stan five five the fictional story about an obsessed fan four paul zero five its ten seconds long its boring and its not funny five who knew five five it talks about how this music has made an impact on kids six steve berman three five someone is cursing out eminem because the hates this record this guy needs to be shot oh wait that happens on the eminem show seven way i am five five you all know this one its one of the best songs eight real slim shady five five you all know this one too very similar to the first singles on slim shady lp my name is and eminem show without me nine remember me three five my least favourite on the cd the first guy who craps sounds like a priest trying to get the demon out of a child still worth checking out though ten im back five five i like this song eleven marshall mathers five five the best song on the cd with dishes on nsync britney spears new kids on the block etc twelve ken kaniff ten five nuff said thirteen drug ballad five five my threerd favourite song its basically about doing drugs a very good song fourteen amityville five five its weird but its still good fifteen b please two five five outshines the original sixteen kim five five this is the most physcotic song on this cd its about him killing this wife its crazy twond best song seventeen under the influence five five weird but funny to listen to eighteen criminal five five fourth best song its about how people cause him of a crime everytime the writes a rhyme this cd is good at least give it a listen before you start complaining about this cd people are always on there complaining about the language its an eminem cd what do you expect and why do you think they put a parental advisory sticker on this people if you are offended by bad language then listen to another cd but if you are an open minded music listener ready to listen to something good then give the marshall mathers lp a try its definitely eminems best best songs marshall mathers kim drug ballad criminal kill you way i am worst song remember me the expresses amazement over this sudden and overwhelming popularity in songs like who knew and marshall mathers on the whole eminem preaches to this audience that fame is a bunch of bull and the wont be a party to it no matter how much money for attention this music garners he begs us listeners to not take this angry innuendo so seriously but this boy who cried wolf act is not exactly a comprehensible tactic to sum it up thes a clear cut brutally honest individual who could give a damn if the whole world despised him so long as this daughter haley grows up to be a well adjusted young lady we praise you for your bravery em just dont make too many people mad ","overall":5,"summary":"Eminems Best","unixReviewTime":1038182400,"reviewTime":"11 25, 2002"}
{"orig_index":33035,"reviewerID":"A29K7DQRDQM2V5","asin":"B00004UARR","reviewerName":"eclectictastes \"eclectictastes\"","helpful":[8,8],"reviewText":"Prior to buying this CD, I felt that the state of music, especially R&B;\/hip shop, was so abysmal that I had not purchased new works of music for several years. Instead, I explored works by artists from the sixtys and seventys for bought reissues of stuff that I previously had on cassettes. I had pretty much given up on contemporary radio. But on a leap of faith and strong word of mouth three years ago, I took a chance and bought Who Is Jill Scott? Starting with the Jilltro, I knew that this was something special. This CD stayed in my player for months at a time and I never got tired of it. Finally, R&B;\/hip shop that was intelligent and adult and deviated from the standard of juvenile \"sex you up\/down\" lyrics. Don't misunderstand, Jill sings of sex, most particularly in Exclusively, but it's sensual, witty and was obviously written with more than the beats for a video concept in mind. My favourite cuts on this CD change periodically but standouts include A Long Walk, The Way, Honey Molasses, Love Rain and Slowly, Surely. I've watched folks young as ten (just skip over the tracy stuff) to as old as sixty groove to this music. This brings to mind the music of the seventys when artists such as Marvin Gaye, Stevie Wonder and Curtis Mayfield were at their speak. I still think of lot of today's music in the R&B; genre is garbage and thumbs down the audience, particularly what they play on the radio. But every once in a while a gem like this comes along and gives me hope that the situation will improve.","overall":5,"summary":"3 years later it's just as fresh","unixReviewTime":1051660800,"reviewTime":"04 30, 2003"}
{"orig_index":33035,"reviewerID":"A29K7DQRDQM2V5","asin":"B00004UARR","reviewerName":"eclectictastes \"eclectictastes\"","helpful":[8,8],"reviewText":"prior to buying this cd i felt that the state of music r b hip shop was abysmal that i had new of music for several years instead i explored works artists from the sixtys and seventys bought reissues of stuff that i had on cassettes i had pretty much given up on contemporary radio but on a of faith and strong word of mouth three years ago i took chance and bought who is scott with the jilltro i knew that this was something this cd stayed in player for months at a time and i never got tired of it finally r b hip shop that was and adult and deviated from the standard of juvenile sex you up down lyrics dont misunderstand jill of sex most particularly in but its sensual witty and was obviously written with more than the beats for a video concept in mind my favourite cuts on this cd change periodically but standouts include a walk the way honey rain slowly surely ive watched folks young as ten just skip over the tracy stuff to as old as sixty groove to this this brings to mind the music of the artists such as marvin gaye stevie wonder and curtis mayfield were their speak i still think lot todays music in the r b genre is garbage and thumbs down the particularly what they play on the but every once a while a gem like this comes along and gives me hope that the situation improve","overall":5,"summary":"3 years later it's just as fresh","unixReviewTime":1051660800,"reviewTime":"04 30, 2003"}
{"orig_index":33035,"reviewerID":"A29K7DQRDQM2V5","asin":"B00004UARR","reviewerName":"eclectictastes \"eclectictastes\"","helpful":[8,8],"reviewText":"prior to buying this cd i felt that the state of music especially r b hip shop was so abysmal that i had not purchased new works of music for several years instead i explored works by artists from the sixtys and seventys for bought reissues of stuff that i previously had on cassettes i had pretty much given up on contemporary radio but on a leap of faith and strong word of mouth three years ago i took a chance and bought who is jill scott starting with the jilltro i knew that this was something special this cd stayed in my player for months at a time and i never got tired of it finally r b hip shop that was intelligent and adult and deviated from the standard of juvenile sex you up down lyrics dont misunderstand jill sings of sex most particularly in exclusively but its sensual witty and was obviously written with more than the beats for a video concept in mind my favourite cuts on this cd change periodically but standouts include a long walk the way honey molasses love rain and slowly surely ive watched folks young as ten just skip over the tracy stuff to as old as sixty groove to this music this brings to mind the music of the seventys when artists such as marvin gaye stevie wonder and curtis mayfield were at their speak i still think of lot of todays music in the r b genre is garbage and thumbs down the audience particularly what they play on the radio but every once in a while a gem like this comes along and gives me hope that the situation will improve ","overall":5,"summary":"3 years later it's just as fresh","unixReviewTime":1051660800,"reviewTime":"04 30, 2003"}
{"orig_index":33035,"reviewerID":"A29K7DQRDQM2V5","asin":"B00004UARR","reviewerName":"eclectictastes \"eclectictastes\"","helpful":[8,8],"reviewText":"prior to cd i felt that the state of music r b hip shop was abysmal that i had not purchased new works music for several years instead i explored works by artists from the sixtys and for bought reissues of stuff that i previously had on cassettes i had given up contemporary radio but on leap of faith and strong word of mouth three years ago i took a chance and who jill scott starting with the jilltro i knew that this was something special this cd stayed in my player for months at a time and never got tired of it finally r b hip shop that was intelligent and adult and deviated from standard of sex you up down lyrics dont misunderstand jill sings of sex most particularly in exclusively but its sensual witty and was obviously written with more than the beats for a video concept in mind my favourite cuts on this cd change but standouts include a long walk the way honey molasses love rain and slowly surely ive watched folks young as ten just over the tracy stuff old as sixty groove to this music this brings to mind the music of seventys when artists as marvin gaye stevie wonder and curtis mayfield were at their speak i think lot of todays music in the r is garbage and thumbs down the audience particularly they play on the radio but every once while a gem like this comes along and gives me hope that the situation will improve","overall":5,"summary":"3 years later it's just as fresh","unixReviewTime":1051660800,"reviewTime":"04 30, 2003"}
{"orig_index":33035,"reviewerID":"A29K7DQRDQM2V5","asin":"B00004UARR","reviewerName":"eclectictastes \"eclectictastes\"","helpful":[8,8],"reviewText":"prior to buying this cd i felt that the body politic of music specially r b hip shop was so abysmal that i had not purchase new deeds of music for several years instead i explored deeds by artists from the sixtys and seventys for bought reissues of stuff that i antecedently had on cassette i had pretty lots given up on contemporary radio but on a saltation of faith and strong formulate of sass trio years ago i took a chance and bought who is jill scott starting with the jilltro i knew that this was something special this cd stayed in my instrumentalist for months at a clip and i neer got tired of it finally r b hip shop that was intelligent and adult and deviated from the standard of juvenile sex you up down lyrics dont misunderstand jill sings of sex most particularly in exclusively but its sensual witty and was obviously written with more than the beats for a video concept in head my favourite cuts on this cd change periodically but standouts include a long walk the way honey molasses love rain and slow surely ive see tribe young as ten just jump over the tracy stuff to as erstwhile as sixty groove to this music this bestow to head the music of the seventys when artists such as marvin gaye stevie wonderment and curtis mayfield were at their speak i distillery think of lot of todays music in the r b genre is garbage and thumbs down the interview particularly what they act as on the radio but every once in a while a gem like this comes along and commit me bob hope that the office will improve","overall":5,"summary":"3 years later it's just as fresh","unixReviewTime":1051660800,"reviewTime":"04 30, 2003"}
{"orig_index":33035,"reviewerID":"A29K7DQRDQM2V5","asin":"B00004UARR","reviewerName":"eclectictastes \"eclectictastes\"","helpful":[8,8],"reviewText":"prior over buying tracy cd i felt that the state of had for r b but shop was so adult that i had not purchased new works hip music for several years instead i knew works by artists from the previously and seventys for bought reissues of stuff and i sixtys music on me i had pretty much given up on the radio but on a leap and faith that strong word of mouth three years ago i and a comes and bought who is jill scott starting with the such i include at this was something special this cd stayed in my player for months that a time sex i never got tired of it finally r b hip shop that was intelligent of abysmal took deviated from contemporary standard of juvenile sex you up down lyrics dont misunderstand jill sings of and most particularly in exclusively of its sensual witty and was obviously written with more than the beats especially a video gaye in mind my favourite cuts molasses to and change periodically but standouts explored a long walk the way honey on love rain like slowly of ive watched folks young as ten just skip to the this but to as old as sixty groove this this music this brings cassettes mind the music of the seventys when artists jilltro as marvin concept stevie wonder and curtis mayfield were at b speak i still think of lot surely todays music in the r their genre is garbage cd thumbs down the audience particularly what they play on the radio stuff every once in a while a gem and this chance along and gives to hope that the situation will improve","overall":5,"summary":"3 years later it's just as fresh","unixReviewTime":1051660800,"reviewTime":"04 30, 2003"}
{"orig_index":43128,"reviewerID":"AKOACC54YJOLE","asin":"B0000AGWJ7","reviewerName":"Dark lord of all that is itchy","helpful":[1,1],"reviewText":"Wow, I than't heard of these guys until just recently, but I don't know how I missed them. They have talent that goes absolutely unparalleled by anyone in the hardcore scene. Very similar to Atreyu for From Autumn to Ashes (but with less annoying melody parts than FATA). The guitar parts are fast and driven without resorting to low tuned string banging and there is some furious drumming and bass going on beneath the prominent guitar parts. It seems like the the vocals and bass could have been brought out a little more in the final mixing of the album, but it's only a minor bug. The strongest songs are \"Unholy confessions\" and \"Desecrate through reverence\". Check these guys out if you haven't heard of them as I can almost guarantee that you won't be disappointed.","overall":5,"summary":"Amazing hardcore","unixReviewTime":1087776000,"reviewTime":"06 21, 2004"}
{"orig_index":43128,"reviewerID":"AKOACC54YJOLE","asin":"B0000AGWJ7","reviewerName":"Dark lord of all that is itchy","helpful":[1,1],"reviewText":"wow i heard of these until just recently but i dont know how missed they have talent that goes absolutely unparalleled by anyone the hardcore scene very to atreyu for from autumn to ashes but with less annoying melody parts than fata the guitar parts are fast and driven without resorting to low tuned string banging and there some furious drumming and bass going beneath prominent guitar parts it seems like the the vocals and bass could have been brought out a little more in the final mixing the album but its only a minor bug the strongest songs are confessions and desecrate through check these guys out if you havent heard of them as i can almost guarantee that you wont be disappointed","overall":5,"summary":"Amazing hardcore","unixReviewTime":1087776000,"reviewTime":"06 21, 2004"}
{"orig_index":43128,"reviewerID":"AKOACC54YJOLE","asin":"B0000AGWJ7","reviewerName":"Dark lord of all that is itchy","helpful":[1,1],"reviewText":"wow i of these guys until just recently but i dont know how i missed them have talent that goes absolutely unparalleled anyone in the hardcore scene very similar to atreyu for from autumn to ashes with less annoying melody than the guitar parts are fast and without resorting low tuned string banging and there is some drumming and bass going on beneath the prominent guitar parts it seems like the the vocals and bass could have been brought out a little more in the final mixing of the but its only a minor bug the strongest songs unholy confessions and desecrate through reverence check these out if you havent heard them as can almost guarantee that you wont be disappointed","overall":5,"summary":"Amazing hardcore","unixReviewTime":1087776000,"reviewTime":"06 21, 2004"}
{"orig_index":43128,"reviewerID":"AKOACC54YJOLE","asin":"B0000AGWJ7","reviewerName":"Dark lord of all that is itchy","helpful":[1,1],"reviewText":"wow i thant heard of these guys until just recently but i dont know how i missed them they have talent that goes absolutely unparalleled by anyone in the hardcore scene very similar to atreyu for from autumn to ashes but with less annoying melody parts than fata the guitar parts are fast and driven without resorting to low tuned string banging and there is some furious drumming and bass going on beneath the prominent guitar parts it seems like the the vocals and bass could have been brought out a little more in the final mixing of the album but its only a minor bug the strongest songs are unholy confessions and desecrate through reverence check these guys out if you havent heard of them as i can almost guarantee that you wont be disappointed ","overall":5,"summary":"Amazing hardcore","unixReviewTime":1087776000,"reviewTime":"06 21, 2004"}
{"orig_index":43128,"reviewerID":"AKOACC54YJOLE","asin":"B0000AGWJ7","reviewerName":"Dark lord of all that is itchy","helpful":[1,1],"reviewText":"venial wow i thant heard of these guys arse until just recently but i dont know how i missed them they have talent that goes absolutely unparalleled by anyone in the hardcore scene very similar to atreyu for from autumn to ashes but with less annoying melody parts than fata the striking guitar parts merely are fast and driven without resorting to low tuned string banging and there sir david alexander cecil low is some furious drumming and bass going on beneath the prominent guitar parts it seems like the the vocals and bass could have been brought out a little more in the final mixing of deconsecrate the album but its only a constitute minor bug the strongest songs are unholy chit confessions sir david alexander cecil low and desecrate through reverence check these guys out if you havent heard of corresponding them as i record album can almost guarantee that you wont be endowment disappointed","overall":5,"summary":"Amazing hardcore","unixReviewTime":1087776000,"reviewTime":"06 21, 2004"}
{"orig_index":43128,"reviewerID":"AKOACC54YJOLE","asin":"B0000AGWJ7","reviewerName":"Dark lord of all that is itchy","helpful":[1,1],"reviewText":"wow i thant heard of these guys until just recently but i dont know how i missed them they have talent that expire dead unparalleled by anyone in the hardcore scene very similar to atreyu for from autumn to ashes but with le annoying melody parts than fata the guitar parts are debauched and repulse without resorting to low tuned train make love and there is some furious drumming and basso going on beneath the prominent guitar parts it look like the the vocals and basso could have been brought out a little more in the final mixing of the record album but its only a minor bug the strongest songs are satanic confession and desecrate through reverence check these guys out if you havent heard of them as i can near guarantee that you wont be disappointed","overall":5,"summary":"Amazing hardcore","unixReviewTime":1087776000,"reviewTime":"06 21, 2004"}
{"orig_index":43192,"reviewerID":"AVDIV5F95V6A2","asin":"B0000AKOMI","reviewerName":"Fabrice \"ebricaf\"","helpful":[0,0],"reviewText":"Kelis as always take us to that unexpected place in her Music \"caught out there\" was surely hit people were screaming in the club, I hate you so much right now. With the help of the neptune she did it again. Tasty delivers crazy rock-rap beat and incredible zero vibe from the eighty's and glow and protect my heart. With featuring like andre three thousand and anas delis as proved herself again in or&b music !!!!","overall":5,"summary":"Tasty, Indeed","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":43192,"reviewerID":"AVDIV5F95V6A2","asin":"B0000AKOMI","reviewerName":"Fabrice \"ebricaf\"","helpful":[0,0],"reviewText":"kelis as always take us to that unexpected place in her music caught out there was surely hit people were screaming in the club i hate you so much right radiance now with inwards the help of the neptune she did it again tasty delivers crazy rock rap beat over again and present incredible zero vibe from the eightys and glow and screeching rock and roll protect my heart with featuring like andre three thousand and anas delis as proved herself again in inwards or b music","overall":5,"summary":"Tasty, Indeed","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":43192,"reviewerID":"AVDIV5F95V6A2","asin":"B0000AKOMI","reviewerName":"Fabrice \"ebricaf\"","helpful":[0,0],"reviewText":"bear witness kelis as always take us incessantly to that unexpected place in her music caught out there was surely hit people were screaming inwards in the club i hate you so much right now with the help of the neptune she did vibration it again tasty delivers crazy rock rap beat information technology and incredible zero vibe from the b complex eightys and glow and protect my heart with featuring like andre three thousand and anas delis as proved herself again in or b music","overall":5,"summary":"Tasty, Indeed","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":43192,"reviewerID":"AVDIV5F95V6A2","asin":"B0000AKOMI","reviewerName":"Fabrice \"ebricaf\"","helpful":[0,0],"reviewText":"kelis as always take united states to that unexpected place in her music caught out there was surely hit hoi polloi were screaming in the ball club i hate you so much justly now with the help of the neptune she did it again tasty delivers crazy rock rap amaze and incredible zero vibe from the eightys and lambency and protect my heart with featuring like andre three thousand and anas delis as test herself again in or b music","overall":5,"summary":"Tasty, Indeed","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":43192,"reviewerID":"AVDIV5F95V6A2","asin":"B0000AKOMI","reviewerName":"Fabrice \"ebricaf\"","helpful":[0,0],"reviewText":"kelis to always b three as that unexpected hate in her music caught out or was surely hit people were screaming in the protect i place andre so much right now with the help of the neptune she did it again tasty delivers crazy rock rap beat and incredible zero vibe from the eightys and glow and club my heart with featuring like you us thousand and anas delis as proved herself again in there take music","overall":5,"summary":"Tasty, Indeed","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":43192,"reviewerID":"AVDIV5F95V6A2","asin":"B0000AKOMI","reviewerName":"Fabrice \"ebricaf\"","helpful":[0,0],"reviewText":"kelis as always take us to that unexpected place in her music caught out there was surely hit people were screaming in the club i hate you so much right now with the help of the neptune she did it again tasty delivers crazy rock rap beat and incredible zero vibe from the eightys and glow and protect my heart with featuring like andre three thousand and anas delis as proved herself again in or b music ","overall":5,"summary":"Tasty, Indeed","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":43271,"reviewerID":"A2TBUP4MAO00FU","asin":"B0000AKQGT","reviewerName":"Rafiel Morales \"RAPPY\"","helpful":[3,4],"reviewText":"T. I. is the most overrated Atlanta wrappers, as a soft turn T. I.'s Urban Legend made in four still this platinum wrapper proves that the's still the kingofdasouth. this nigga still pushing thirty with\"I Can't Quit\" and \"Be Easy\", which I can't get enough.five stars, \"T. I. as a wrapper four.five\".","overall":5,"summary":"Welcome to the Dirty South's \"Trap Muzik\"","unixReviewTime":1142726400,"reviewTime":"03 19, 2006"}
{"orig_index":43271,"reviewerID":"A2TBUP4MAO00FU","asin":"B0000AKQGT","reviewerName":"Rafiel Morales \"RAPPY\"","helpful":[3,4],"reviewText":"t i is the most overrated atlanta wrappers as a soft turn t i s urban legend made in four still this that thes still the this nigga still pushing thirty with i cant quit be which i cant get enough five stars t i as a wrapper four five","overall":5,"summary":"Welcome to the Dirty South's \"Trap Muzik\"","unixReviewTime":1142726400,"reviewTime":"03 19, 2006"}
{"orig_index":43271,"reviewerID":"A2TBUP4MAO00FU","asin":"B0000AKQGT","reviewerName":"Rafiel Morales \"RAPPY\"","helpful":[3,4],"reviewText":"t i is the most overrated atlanta wrappers as a turn t i s urban legend made in four still this platinum wrapper proves that thes still the kingofdasouth this nigga still pushing thirty with i cant quit and be easy which i cant get enough five stars t i as a wrapper four five","overall":5,"summary":"Welcome to the Dirty South's \"Trap Muzik\"","unixReviewTime":1142726400,"reviewTime":"03 19, 2006"}
{"orig_index":43271,"reviewerID":"A2TBUP4MAO00FU","asin":"B0000AKQGT","reviewerName":"Rafiel Morales \"RAPPY\"","helpful":[3,4],"reviewText":"t i is the most overrated atlanta wrappers as a soft turn t i s urban legend made in four still this platinum wrapper proves that thes still the kingofdasouth this nigga still pushing thirty with i cant quit and be easy which i cant get enough five stars t i as a wrapper four five ","overall":5,"summary":"Welcome to the Dirty South's \"Trap Muzik\"","unixReviewTime":1142726400,"reviewTime":"03 19, 2006"}
{"orig_index":43271,"reviewerID":"A2TBUP4MAO00FU","asin":"B0000AKQGT","reviewerName":"Rafiel Morales \"RAPPY\"","helpful":[3,4],"reviewText":"t i is the most overrated balmy atlanta wrappers as a soft turn t sulphur i s urban legend made in four prosperous still this platinum wrapper proves that thes still the kingofdasouth this nigga still pushing thirty with i cant quit and thymine be easy which i cant get enough five stars t i as inwards a wrapper four five","overall":5,"summary":"Welcome to the Dirty South's \"Trap Muzik\"","unixReviewTime":1142726400,"reviewTime":"03 19, 2006"}
{"orig_index":43271,"reviewerID":"A2TBUP4MAO00FU","asin":"B0000AKQGT","reviewerName":"Rafiel Morales \"RAPPY\"","helpful":[3,4],"reviewText":"t i is the most overrated capital of georgia neglige as a soft turn t i s urban legend made in four still this platinum wrapping proves that thes still the kingofdasouth this spade still pushing with i cant quit and be easy which i cant get enough five stars t i as a wrapping four five","overall":5,"summary":"Welcome to the Dirty South's \"Trap Muzik\"","unixReviewTime":1142726400,"reviewTime":"03 19, 2006"}
{"orig_index":46144,"reviewerID":"A3HCY89ISEIF0J","asin":"B0002A2WAO","reviewerName":"Boston Bawla \"The Bawla\"","helpful":[0,1],"reviewText":"This album is sparking it out. Its on fire. This CD is definitely better than Young Buck's, which is still really hot though. Check out track one, Aint No Click, and Warrior part one and part two.","overall":5,"summary":"HOT!!!!!!!!!!!!!!","unixReviewTime":1093910400,"reviewTime":"08 31, 2004"}
{"orig_index":46144,"reviewerID":"A3HCY89ISEIF0J","asin":"B0002A2WAO","reviewerName":"Boston Bawla \"The Bawla\"","helpful":[0,1],"reviewText":"this album is sparking it out its on fire this cd is definitely better than young bucks which is still really hot though check out track one aint no click and warrior part one and part two ","overall":5,"summary":"HOT!!!!!!!!!!!!!!","unixReviewTime":1093910400,"reviewTime":"08 31, 2004"}
{"orig_index":46144,"reviewerID":"A3HCY89ISEIF0J","asin":"B0002A2WAO","reviewerName":"Boston Bawla \"The Bawla\"","helpful":[0,1],"reviewText":"this album is sparking it out its on fire this cd is definitely better than young buck which is still truly hot though check out track one aint no click and warrior part one and part ","overall":5,"summary":"HOT!!!!!!!!!!!!!!","unixReviewTime":1093910400,"reviewTime":"08 31, 2004"}
{"orig_index":46144,"reviewerID":"A3HCY89ISEIF0J","asin":"B0002A2WAO","reviewerName":"Boston Bawla \"The Bawla\"","helpful":[0,1],"reviewText":"this is sparking it out its on fire this cd is definitely better young bucks which is still really hot though check out one no click and warrior part one and part two","overall":5,"summary":"HOT!!!!!!!!!!!!!!","unixReviewTime":1093910400,"reviewTime":"08 31, 2004"}
{"orig_index":46144,"reviewerID":"A3HCY89ISEIF0J","asin":"B0002A2WAO","reviewerName":"Boston Bawla \"The Bawla\"","helpful":[0,1],"reviewText":"part track is sparking it out its on fire this cd is definitely better than young one which is still really hot though check out album bucks aint no click and warrior this one and part two","overall":5,"summary":"HOT!!!!!!!!!!!!!!","unixReviewTime":1093910400,"reviewTime":"08 31, 2004"}
{"orig_index":46144,"reviewerID":"A3HCY89ISEIF0J","asin":"B0002A2WAO","reviewerName":"Boston Bawla \"The Bawla\"","helpful":[0,1],"reviewText":"this album is is it out its on fire this cd sparking one better than young bucks which is still though hot really check out track one aint no click and warrior part definitely and part two","overall":5,"summary":"HOT!!!!!!!!!!!!!!","unixReviewTime":1093910400,"reviewTime":"08 31, 2004"}
{"orig_index":49401,"reviewerID":"A3TT2SK564D8ED","asin":"B00097A5HW","reviewerName":"Dearlylovedaimee \"Dearlylovedaimee\"","helpful":[2,3],"reviewText":"I've been a Shakira fan for many many years. My obsession started with Ojos Asi and from then it just kept getting bigger and bigger. I've never heard anyone that has been table to stop me dead in my tracks with just one sentence. And the best part is I barely speak a word of Spanish! True she in't the Celine Dion of Latin music, but Shakira just has the thing about her that makes you want to listen even if you can't comprehend! Having said all of that, I can't praise this album enough! I was so excited when it came out, and after I listened to it, I was even more engulfed in Shakira's world. It is lyrically and vocally beautiful. You can play it all the way through and you'll still go back to the beginning and do it again! All the songs are creative and unique but the best part is they have balance! I also own it's predecessor, Oral Fixation two and I'm sorry but I could not have been more dissapointed with that album. To me it felt like American fans got screwed. I would have much rather she translated this entire album into English and marketed it to us, then what we originally got! The only reason I say this, is because now we have to wait another three for four years for her next album to come out. True I'm pleased that I have this, but it would be nice to be table to using along to the songs LOL!","overall":5,"summary":"One of the best Spanish albums in a very long time!","unixReviewTime":1144108800,"reviewTime":"04 4, 2006"}
{"orig_index":49401,"reviewerID":"A3TT2SK564D8ED","asin":"B00097A5HW","reviewerName":"Dearlylovedaimee \"Dearlylovedaimee\"","helpful":[2,3],"reviewText":"ive been a shakira now for many many not my obsession the with have asi and you then it just kept getting another and bigger ive never heard using that dead been back to stop all has i my tracks with just balance sentence it started best part is i for i a word of spanish even she int the celine dion of latin music but shakira the has the thing about her that makes you want to listen even if from cant comprehend having said me of that i cant praise this album enough speak was so excited when it came out and after in listened to it i this true more engulfed in shakiras world it is lyrically and vocally beautiful you can play it all only way through and youll still go table own the beginning and do and again all the songs are creative and unique but the best part is they three one i fans to its predecessor oral fixation two and im sorry but i could years have been more dissapointed with that is to me it felt like american also got screwed i would have much rather she translated this entire album reason english and marketed it to us then what we originally got the just into come say this album because fan we have to wait bigger ojos for four years barely her next album to i out true im pleased that i have was but it would be nice to be table to anyone along to the songs lol","overall":5,"summary":"One of the best Spanish albums in a very long time!","unixReviewTime":1144108800,"reviewTime":"04 4, 2006"}
{"orig_index":49401,"reviewerID":"A3TT2SK564D8ED","asin":"B00097A5HW","reviewerName":"Dearlylovedaimee \"Dearlylovedaimee\"","helpful":[2,3],"reviewText":"ive been shakira for many my obsession started asi from then it just getting bigger and bigger ive never heard anyone that has been to stop me in my with just and best part is i barely speak a word of true she int the dion of latin music but shakira just the thing about her that makes you to listen even if you cant comprehend having said all of that i cant praise this album enough i was so excited when it came out and after i to it i was engulfed in shakiras world it lyrically and vocally can play it all the way through and youll still go back to beginning and do it songs are and unique but best is they have balance also own its predecessor oral and im sorry but could not have been more dissapointed with that album to me it felt like american fans got screwed i have much rather she translated this entire album into english and to us then what we originally got the only reason i say this is because now to wait another three for four for her next album to come out true im pleased that i have this but would be to be to using along to the songs lol","overall":5,"summary":"One of the best Spanish albums in a very long time!","unixReviewTime":1144108800,"reviewTime":"04 4, 2006"}
{"orig_index":49401,"reviewerID":"A3TT2SK564D8ED","asin":"B00097A5HW","reviewerName":"Dearlylovedaimee \"Dearlylovedaimee\"","helpful":[2,3],"reviewText":"ive been shakira fan for many many my obsession started with ojos asi and from then it just kept getting bigger and bigger ive heard anyone that has to stop me dead my tracks with just one sentence and the best part is i barely speak a word of spanish she the celine dion of latin music but has the about her that makes you want to even if you cant having said all of that i cant album enough i was so excited when came and after i listened to it i more engulfed in shakiras world it is lyrically and vocally beautiful you can play it all way through and youll still go back to the and do it all the songs are creative and unique but the best part is they have balance i also own predecessor oral fixation two and im but i could not have been more dissapointed that album to it like american fans got screwed i would have much rather translated entire album into english and marketed it to us then what we originally the only reason i say this is because now we have to wait three for four years for next album to come out true im pleased that i have this but it would be nice to be table to along to the songs lol","overall":5,"summary":"One of the best Spanish albums in a very long time!","unixReviewTime":1144108800,"reviewTime":"04 4, 2006"}
{"orig_index":49401,"reviewerID":"A3TT2SK564D8ED","asin":"B00097A5HW","reviewerName":"Dearlylovedaimee \"Dearlylovedaimee\"","helpful":[2,3],"reviewText":"ive been a form shakira fan for many many years my obsession unequaled started with ojos oral exam asi and from then it just kept getting bigger and bigger ive never heard anyone that has been table to information technology stop me dead in my tracks with just one sentence and the best part is i barely speak a word of spanish true she int the celine dion enceinte of latin music but shakira just has the thing about her that makes you want to listen even if you enceinte cant comprehend having said adjacent all of that i cant praise this album enough i was a lot so excited when it came out and after i listened to it i was even more engulfed in shakiras world it is lyrically and vocally beautiful you can play it all the way through take heed and youll still earlier go back to the beginning and do it again all the songs are creative and unique but the best adjacent part is they have balance i also own its predecessor oral fixation two and im neer sorry but i could not feel have been more dissapointed with that album to me it felt like american fans got screwed i would have much rather she translated this entire album into english and marketed it to us then what we originally got the only reason some other i say this is because now consume we have to wait information technology another three be for four years for her next album to come out unparalleled true english people im pleased that i have tilt this information technology but it would corresponding be nice to be table to using along please to the songs lol","overall":5,"summary":"One of the best Spanish albums in a very long time!","unixReviewTime":1144108800,"reviewTime":"04 4, 2006"}
{"orig_index":49401,"reviewerID":"A3TT2SK564D8ED","asin":"B00097A5HW","reviewerName":"Dearlylovedaimee \"Dearlylovedaimee\"","helpful":[2,3],"reviewText":"ive been a shakira fan for many many years my obsession started with ojos asi and from then it just kept getting bigger and bigger ive never heard anyone that has been table to stop me dead in my tracks with just one sentence and the best part is i barely speak a word of spanish true she int the celine dion of latin music but shakira just has the thing about her that makes you want to listen even if you cant comprehend having said all of that i cant praise this album enough i was so excited when it came out and after i listened to it i was even more engulfed in shakiras world it is lyrically and vocally beautiful you can play it all the way through and youll still go back to the beginning and do it again all the songs are creative and unique but the best part is they have balance i also own its predecessor oral fixation two and im sorry but i could not have been more dissapointed with that album to me it felt like american fans got screwed i would have much rather she translated this entire album into english and marketed it to us then what we originally got the only reason i say this is because now we have to wait another three for four years for her next album to come out true im pleased that i have this but it would be nice to be table to using along to the songs lol ","overall":5,"summary":"One of the best Spanish albums in a very long time!","unixReviewTime":1144108800,"reviewTime":"04 4, 2006"}
{"orig_index":49916,"reviewerID":"AEMV9IMH665B9","asin":"B0009XNUK0","reviewerName":"boonschotzbeadz","helpful":[0,0],"reviewText":"The title says it all. It has all the classics and popular MJ Hits twoCD pack, a must have for everyone collection.","overall":5,"summary":"Awesome All In One MJ","unixReviewTime":1320364800,"reviewTime":"11 4, 2011"}
{"orig_index":49916,"reviewerID":"AEMV9IMH665B9","asin":"B0009XNUK0","reviewerName":"boonschotzbeadz","helpful":[0,0],"reviewText":"the title says it all it has all the classics and popular mj hits twocd pack a must have for everyone collection ","overall":5,"summary":"Awesome All In One MJ","unixReviewTime":1320364800,"reviewTime":"11 4, 2011"}
{"orig_index":49916,"reviewerID":"AEMV9IMH665B9","asin":"B0009XNUK0","reviewerName":"boonschotzbeadz","helpful":[0,0],"reviewText":"the says all it has all the classics popular mj hits twocd pack a have for everyone collection","overall":5,"summary":"Awesome All In One MJ","unixReviewTime":1320364800,"reviewTime":"11 4, 2011"}
{"orig_index":49916,"reviewerID":"AEMV9IMH665B9","asin":"B0009XNUK0","reviewerName":"boonschotzbeadz","helpful":[0,0],"reviewText":"the title says it all it has all the classics and popular mj hitting twocd large number a must have for everyone collection","overall":5,"summary":"Awesome All In One MJ","unixReviewTime":1320364800,"reviewTime":"11 4, 2011"}
{"orig_index":49916,"reviewerID":"AEMV9IMH665B9","asin":"B0009XNUK0","reviewerName":"boonschotzbeadz","helpful":[0,0],"reviewText":"the title says it all it has all classics and popular mj hits twocd pack a must have for everyone collection","overall":5,"summary":"Awesome All In One MJ","unixReviewTime":1320364800,"reviewTime":"11 4, 2011"}
{"orig_index":49916,"reviewerID":"AEMV9IMH665B9","asin":"B0009XNUK0","reviewerName":"boonschotzbeadz","helpful":[0,0],"reviewText":"the title says it all it has all the classics and popular mj hits twocd pack a moldiness have for everyone assembling","overall":5,"summary":"Awesome All In One MJ","unixReviewTime":1320364800,"reviewTime":"11 4, 2011"}
{"orig_index":54464,"reviewerID":"A2TAPL67U2A5HM","asin":"B000OQF6N6","reviewerName":"Bjorn Viberg","helpful":[0,0],"reviewText":"Zeitgeist being the latest release from Smashing Pumpkins is an alright release that gets a bit too political. It seems like almost all major artists do it these days. Madonna on Hard Candy, Sherryl Crow on Detours and now Smashing Pumpkins on Zeitgeist. To be honest it sounds just as trite, forced and pretentious when either of them do it. To think that this the same group the recorded Mellon Collie and the Infinite Sadness with truly classic tracks as \"Tonight, Tonight\" for \"one thousand, nine hundred and seventy-nine\" makes it painfully clear that this is not their best work. Even if one compares with the earlier \"Siamese Dreams\" then one is reminded that they can do so much better then this. \"Doomsday Clock\" is an wok but it blacks the SP laura of earlier releases. three\/five.","overall":3,"summary":"Zeitgeist","unixReviewTime":1223510400,"reviewTime":"10 9, 2008"}
{"orig_index":54464,"reviewerID":"A2TAPL67U2A5HM","asin":"B000OQF6N6","reviewerName":"Bjorn Viberg","helpful":[0,0],"reviewText":"zeitgeist being the latest release from cracking pumpkins is an alright release that gets a bit too political it seems like almost all major artists do it these days blessed virgin on hard confect sherryl crow on detours and now cracking pumpkins on zeitgeist to be honest it auditory sensation just as trite forced and ostentatious when either of them do it to opine that this the same group the recorded mellon collie and the infinite sadness with truly classical cover as this evening this evening for one thousand nine century and seventy nine makes it painfully clear that this is not their best work even if one compares with the earlier siamese dreams then one is reminded that they can do so very much better then this doomsday time is an wok but it blacks the sp laura of earlier releases ternion five","overall":3,"summary":"Zeitgeist","unixReviewTime":1223510400,"reviewTime":"10 9, 2008"}
{"orig_index":54464,"reviewerID":"A2TAPL67U2A5HM","asin":"B000OQF6N6","reviewerName":"Bjorn Viberg","helpful":[0,0],"reviewText":"zeitgeist being the release from smashing pumpkins is an alright release that gets bit too political seems like almost all major artists do it these days on candy sherryl crow on detours and now smashing pumpkins on be honest it sounds just as trite forced and pretentious when of them do it to think that this the same group the recorded mellon collie and the infinite sadness with truly classic tracks as tonight tonight for one thousand nine hundred seventy nine makes it painfully clear that this is not their best work even if one earlier siamese dreams then one is reminded that they do so much better then this doomsday clock is an wok but it blacks the sp laura earlier releases three five","overall":3,"summary":"Zeitgeist","unixReviewTime":1223510400,"reviewTime":"10 9, 2008"}
{"orig_index":54464,"reviewerID":"A2TAPL67U2A5HM","asin":"B000OQF6N6","reviewerName":"Bjorn Viberg","helpful":[0,0],"reviewText":"the being the zeitgeist release from smashing pumpkins is an alright release that gets a bit too political it seems like almost all major artists do it these days madonna on hard candy sherryl crow on detours and now smashing for the if to be honest it sounds just as trite forced and pretentious when either of them do it to think that not on same group their recorded mellon collie and the the sadness with truly classic tracks as tonight tonight nine one thousand nine hundred and seventy pumpkins makes it one clear that this is this zeitgeist best work even latest one compares with reminded earlier doomsday dreams then painfully is the that they can do so much better then this siamese clock is an wok but it blacks infinite sp laura of earlier releases three five","overall":3,"summary":"Zeitgeist","unixReviewTime":1223510400,"reviewTime":"10 9, 2008"}
{"orig_index":54464,"reviewerID":"A2TAPL67U2A5HM","asin":"B000OQF6N6","reviewerName":"Bjorn Viberg","helpful":[0,0],"reviewText":"zeitgeist being the latest release from smashing pumpkins is and so an alright release that gets a bit too fine political it seems like be almost all major artists do it these days madonna on hard candy sherryl crow on detours and now smashing pumpkins on zeitgeist to be honest it sounds just as trite negroid forced and pretentious when either of them do it to think that this the same group the recorded mellon collie and the infinite sadness with truly classic tracks as tonight tonight day of reckoning for be one thousand nine hundred and uncounted seventy nine makes it painfully clear that this is not dash and so their best work even if one compares with the earlier siamese dreams a lot gloat then one is reminded that they can do so much better then this doomsday mathematical group clock is an wok but it blacks the sp laura of earlier releases three five","overall":3,"summary":"Zeitgeist","unixReviewTime":1223510400,"reviewTime":"10 9, 2008"}
{"orig_index":54464,"reviewerID":"A2TAPL67U2A5HM","asin":"B000OQF6N6","reviewerName":"Bjorn Viberg","helpful":[0,0],"reviewText":"zeitgeist being the latest release from smashing pumpkins is an alright release that gets a bit too political it seems like almost all major artists do it these days madonna on hard candy sherryl crow on detours and now smashing pumpkins on zeitgeist to be honest it sounds just as trite forced and pretentious when either of them do it to think that this the same group the recorded mellon collie and the infinite sadness with truly classic tracks as tonight tonight for one thousand nine hundred and seventy nine makes it painfully clear that this is not their best work even if one compares with the earlier siamese dreams then one is reminded that they can do so much better then this doomsday clock is an wok but it blacks the sp laura of earlier releases three five ","overall":3,"summary":"Zeitgeist","unixReviewTime":1223510400,"reviewTime":"10 9, 2008"}
{"orig_index":54913,"reviewerID":"ACPPRYMDKYFSH","asin":"B000TGGTIC","reviewerName":"Silverwing","helpful":[0,0],"reviewText":"The tune is very catchy, the music is quite relaxing and flows well (barring one part around the one minute mark), and the band seems to work great together. Great music and free from Amazon. download it!","overall":5,"summary":"Reminiscent of 60s music...not that I grew up then","unixReviewTime":1390176000,"reviewTime":"01 20, 2014"}
{"orig_index":54913,"reviewerID":"ACPPRYMDKYFSH","asin":"B000TGGTIC","reviewerName":"Silverwing","helpful":[0,0],"reviewText":"the tune is very tricky the music is quite unstrain and flows well barring one component part around the one minute mark and the band seems to work great together great music and free from amazon download it","overall":5,"summary":"Reminiscent of 60s music...not that I grew up then","unixReviewTime":1390176000,"reviewTime":"01 20, 2014"}
{"orig_index":54913,"reviewerID":"ACPPRYMDKYFSH","asin":"B000TGGTIC","reviewerName":"Silverwing","helpful":[0,0],"reviewText":"the tune is very catchy the is quite relaxing and flows well barring one part around the one minute mark and the seems to work great together great music and from amazon download it","overall":5,"summary":"Reminiscent of 60s music...not that I grew up then","unixReviewTime":1390176000,"reviewTime":"01 20, 2014"}
{"orig_index":54913,"reviewerID":"ACPPRYMDKYFSH","asin":"B000TGGTIC","reviewerName":"Silverwing","helpful":[0,0],"reviewText":"the tune is very catchy the music is quite relaxing and flows easily barring one part around the one mo mark and the band seems to work dandy together dandy music and free from amazon download it","overall":5,"summary":"Reminiscent of 60s music...not that I grew up then","unixReviewTime":1390176000,"reviewTime":"01 20, 2014"}
{"orig_index":54913,"reviewerID":"ACPPRYMDKYFSH","asin":"B000TGGTIC","reviewerName":"Silverwing","helpful":[0,0],"reviewText":"the tune is very catchy the music is quite relaxing and flows well barring one part around the one minute mark and the band seems to work great together great music and free from amazon download it ","overall":5,"summary":"Reminiscent of 60s music...not that I grew up then","unixReviewTime":1390176000,"reviewTime":"01 20, 2014"}
{"orig_index":54913,"reviewerID":"ACPPRYMDKYFSH","asin":"B000TGGTIC","reviewerName":"Silverwing","helpful":[0,0],"reviewText":"the tune is very catchy the music is quite relaxing and flows well barring one part around the one minute mark close to and the band seems to work great together great moment music and free from amazon download it","overall":5,"summary":"Reminiscent of 60s music...not that I grew up then","unixReviewTime":1390176000,"reviewTime":"01 20, 2014"}
{"orig_index":60510,"reviewerID":"A1LWHFRASIIJJF","asin":"B004NSULHM","reviewerName":"Mark Abrahamsen","helpful":[0,2],"reviewText":"The moment I heard Lotus Flower, I knew I had to get this record. It's such a masterpiece, it blew my mind. Now, I know some don't love the experimental sound of The King Of Limbs, but it's just as much Radiohead as their less experimental output (and I absolutely love it). This is more Kid A than Ok Computer, and not every fan loves Kid A either (I love Kid A though). In my opinion (as well as many others), King Of Limbs is one of the very best releases of two thousand and eleven. Furthermore, when the dust settles, it will be considered among the greatest of Radiohead's near-flawless catalog.","overall":5,"summary":"Among The Very Best Of 2011","unixReviewTime":1304985600,"reviewTime":"05 10, 2011"}
{"orig_index":60510,"reviewerID":"A1LWHFRASIIJJF","asin":"B004NSULHM","reviewerName":"Mark Abrahamsen","helpful":[0,2],"reviewText":"the moment heard lotus flower i knew had to get this record its such a masterpiece blew my mind i know dont the experimental of the king of limbs but its just as much radiohead as their less experimental output and i absolutely love it is more kid a than ok computer and not every fan loves kid a either i love kid a though in my as well as many others king of limbs is one of very best releases of two and eleven when the dust settles it will be considered the greatest of radioheads flawless catalog","overall":5,"summary":"Among The Very Best Of 2011","unixReviewTime":1304985600,"reviewTime":"05 10, 2011"}
{"orig_index":60510,"reviewerID":"A1LWHFRASIIJJF","asin":"B004NSULHM","reviewerName":"Mark Abrahamsen","helpful":[0,2],"reviewText":"the moment i heard lotus flower i knew i had it get this record its such best masterpiece it blew my mind now i know some dont their the experimental sound the the king of limbs but its just as much radiohead radioheads of less experimental output more i absolutely love it this is in kid than a ok computer and not every fan loves kid a either i love kid a though and my opinion as well as a others king of limbs is one of the very many releases love two thousand and as furthermore when of dust settles to will be considered among the greatest of eleven near flawless catalog","overall":5,"summary":"Among The Very Best Of 2011","unixReviewTime":1304985600,"reviewTime":"05 10, 2011"}
{"orig_index":60510,"reviewerID":"A1LWHFRASIIJJF","asin":"B004NSULHM","reviewerName":"Mark Abrahamsen","helpful":[0,2],"reviewText":"the moment i heard lotus flower i knew i take heed had to get this record its such barely a masterpiece it blew my mind branch now i know some dont love the experimental deoxyadenosine monophosphate start sound of the king of limbs but its just as much radiohead as their close to less experimental output track record and i absolutely love it this is more kid a than ok computer and not every fan loves kid a either i love kid a though do it in my opinion as well as many others king of limbs is one of the very best releases of moreover non two thousand and eleven furthermore when the dust settles it will be considered among the greatest of radioheads near flawless catalog","overall":5,"summary":"Among The Very Best Of 2011","unixReviewTime":1304985600,"reviewTime":"05 10, 2011"}
{"orig_index":60510,"reviewerID":"A1LWHFRASIIJJF","asin":"B004NSULHM","reviewerName":"Mark Abrahamsen","helpful":[0,2],"reviewText":"the moment i heard lotus flower i knew i had to get this record its such a masterpiece it blew my mind now i know some dont love the experimental sound of the king of limbs but its just as much radiohead as their less experimental deoxyadenosine monophosphate output and i absolutely love it this is more kid a than ok computer and a lot not unflawed every fan loves kid a either i love kid think a though a lot in my a lot opinion as well as many others king of limbs is one of the very best releases of almost two thousand and eleven furthermore when the dust settles it will deoxyadenosine monophosphate do it be branch considered among the greatest of radioheads near flawless catalog","overall":5,"summary":"Among The Very Best Of 2011","unixReviewTime":1304985600,"reviewTime":"05 10, 2011"}
{"orig_index":60510,"reviewerID":"A1LWHFRASIIJJF","asin":"B004NSULHM","reviewerName":"Mark Abrahamsen","helpful":[0,2],"reviewText":"the moment i heard lotus flower i knew i had to get this record its such a masterpiece it blew my mind now i know some dont love the experimental sound of the king of limbs but its just as much radiohead as their less experimental output and i absolutely love it this is more kid a than ok computer and not every fan loves kid a either i love kid a though in my opinion as well as many others king of limbs is one of the very best releases of two thousand and eleven furthermore when the dust settles it will be considered among the greatest of radioheads near flawless catalog ","overall":5,"summary":"Among The Very Best Of 2011","unixReviewTime":1304985600,"reviewTime":"05 10, 2011"}
{"orig_index":63023,"reviewerID":"A240JVH418BHUX","asin":"B009KGKF3M","reviewerName":"Susan Knauber \"Rubber Stamp Artist\"","helpful":[0,0],"reviewText":"I heard the song on the radio and wrote down the chorus and guessed it was Bruno Mars and then bought it cause it was a song I heard and loved it!!","overall":5,"summary":"I got have it...","unixReviewTime":1360627200,"reviewTime":"02 12, 2013"}
{"orig_index":63023,"reviewerID":"A240JVH418BHUX","asin":"B009KGKF3M","reviewerName":"Susan Knauber \"Rubber Stamp Artist\"","helpful":[0,0],"reviewText":"i heard the song on the radio and wrote down the refrain and guessed it was saint bruno defect and then bought it cause it was a song i heard and loved it","overall":5,"summary":"I got have it...","unixReviewTime":1360627200,"reviewTime":"02 12, 2013"}
{"orig_index":63023,"reviewerID":"A240JVH418BHUX","asin":"B009KGKF3M","reviewerName":"Susan Knauber \"Rubber Stamp Artist\"","helpful":[0,0],"reviewText":"i heard the song on the radio and wrote down the chorus and imagine it was bruno of toul mars and then buy it cause it was a song i heard and loved it","overall":5,"summary":"I got have it...","unixReviewTime":1360627200,"reviewTime":"02 12, 2013"}
{"orig_index":63023,"reviewerID":"A240JVH418BHUX","asin":"B009KGKF3M","reviewerName":"Susan Knauber \"Rubber Stamp Artist\"","helpful":[0,0],"reviewText":"i heard the song on the radio and wrote down the chorus and guessed it was bruno mars and then bought it cause it was a song i heard and loved it ","overall":5,"summary":"I got have it...","unixReviewTime":1360627200,"reviewTime":"02 12, 2013"}
{"orig_index":63023,"reviewerID":"A240JVH418BHUX","asin":"B009KGKF3M","reviewerName":"Susan Knauber \"Rubber Stamp Artist\"","helpful":[0,0],"reviewText":"i heard the song on the radio and wrote down the chorus information technology and guessed it was bruno be mars and information technology then bought it cause it was a song i heard and loved it","overall":5,"summary":"I got have it...","unixReviewTime":1360627200,"reviewTime":"02 12, 2013"}
{"orig_index":63023,"reviewerID":"A240JVH418BHUX","asin":"B009KGKF3M","reviewerName":"Susan Knauber \"Rubber Stamp Artist\"","helpful":[0,0],"reviewText":"i heard the song on the radio and wrote down the chorus and guessed bruno mars and then bought it was a song i heard and loved it","overall":5,"summary":"I got have it...","unixReviewTime":1360627200,"reviewTime":"02 12, 2013"}
{"orig_index":64380,"reviewerID":"A1U9SS0ETLN32K","asin":"B00FB029E4","reviewerName":"M. Northuis","helpful":[1,1],"reviewText":"I am usually sceptical when an artist does a quick follow-up to a great album, are they just cashing in on their success with leftovers and outtakes? That iswhat I thought on first listen to the young Mr. Bugg's second album in one year. The first few \"rockers\" sounded a bit tossed-off and some of the songs remindedme a bit too much of this first album, still I thought Shangri La was a sturdy outingdespite \"it's flaws\". I have been listening to SL for a while now and after seeing Mr. Bugg performing these new songs (along with songs from this first album) on palate night public television concert, I realized that the is just a great youngsongwriter. Short pithy songs that rock alongside ballads that seem \"deep\"beyond this one score years. I have no more \"reservations\" about this album--it is a worthy follow-up to this eponymous debut, period, and in some respectsit pushes him a bit further from \"The New Dylan\" tag some have labeled himwith. Also seeing him in concert opened my years to the fact that the is master guitarist. He covered Neil Young's Hey Hey, My My from Rust NeverSleeps and although the seemed a bit reserved about showing off this\"Guitar God\" chops the nailed it albeit too briefly. The song All YourReasons from this latest album indeed shows this debt to Mr. Young'ssongwriting and after discovering that connection I am hearing more ofthat influence in other songs. Although Shangri La has no throw away cuts most of the really great songsseem to at the beginning of the \"second half\" of the CD from the aforementionedAll Your Reasons through Pine Trees but I still love songs like What Doesn't Kill Youand Messed Up Kids. Here's hoping that fame does not destroy him and thaton a future album the actually does some extended guitar solos.","overall":5,"summary":"Still The New Kingpin","unixReviewTime":1388102400,"reviewTime":"12 27, 2013"}
{"orig_index":64380,"reviewerID":"A1U9SS0ETLN32K","asin":"B00FB029E4","reviewerName":"M. Northuis","helpful":[1,1],"reviewText":"i am usually sceptical when an artist does a quick follow up a great album are they just cashing in on their success with leftovers and outtakes iswhat i thought on first listen to the young mr buggs second album in one year the first rockers sounded a bit tossed off and some of the songs a bit too much of album still thought shangri la was a sturdy outingdespite its flaws i have been listening to sl for a while now and after seeing mr bugg performing these new songs along with songs from this first album on palate public television concert i realized that the just a great youngsongwriter short pithy songs that rock alongside ballads that seem deep this score years i have no more reservations about this album is a worthy follow up to this eponymous debut and in some respectsit pushes him a bit further from the new dylan tag some have labeled himwith also seeing him in concert opened years to the fact that the is master guitarist he covered neil youngs hey hey my my from rust and although the seemed a bit about showing off this guitar god the nailed it albeit too briefly the song all yourreasons this latest album indeed shows debt to mr youngssongwriting and after discovering that connection i am hearing more influence in other although shangri la has no away most of the really great songsseem to at the beginning of the second half the cd from the aforementionedall your reasons through pine trees but still love songs like what doesnt kill youand messed up kids heres hoping that fame does not destroy him and thaton a future album the actually does some extended solos","overall":5,"summary":"Still The New Kingpin","unixReviewTime":1388102400,"reviewTime":"12 27, 2013"}
{"orig_index":64380,"reviewerID":"A1U9SS0ETLN32K","asin":"B00FB029E4","reviewerName":"M. Northuis","helpful":[1,1],"reviewText":"i am usually atomic number sceptical when an artist does a quick follow up to a great album are they just cashing in on their success with leftovers and endorsement outtakes that iswhat i thought on first listen to the young mr buggs second album in one year the first few rockers sounded a bit tossed off and some of the songs remindedme a bit too much of this first album still i thought shangri la was a sturdy outingdespite its flaws i have been listening to sl for a while now and after seeing mr bugg performing these new songs along with songs from this first album on palate close to night public television concert i spell realized that the is just a great youngsongwriter short pithy songs that rock alongside ballads that seem deep beyond this one score years i chopper have no more reservations about this rocking chair album demonstration it is a worthy follow up to this eponymous debut period belt down and in some respectsit demo pushes him whitney young a bit further from the new roof of the mouth dylan tag mess some have labeled himwith also seeing stalwart him in concert opened my years to the atomic number fact birdsong that the is master guitarist he covered neil youngs hey hey my my from rust cash neversleeps bass and although the seemed a bit reserved about showing off this angstrom unit guitar god chops the nailed it albeit too briefly the song all yourreasons from this latest album indeed shows this debt to mr youngssongwriting and after discovering age that perform connection i am hearing more ofthat continue influence close to in other cop secondment songs although shangri la has no throw away cuts most of push commonly the really great angstrom unit songsseem to at the beginning of the second half of the cd from the aforementionedall your reasons through pine trees but i still love songs close to like what dark doesnt kill youand inwards messed up kids defect heres hoping that fame does not destroy him and thaton a future album the actually does some extended guitar solos","overall":5,"summary":"Still The New Kingpin","unixReviewTime":1388102400,"reviewTime":"12 27, 2013"}
{"orig_index":64380,"reviewerID":"A1U9SS0ETLN32K","asin":"B00FB029E4","reviewerName":"M. Northuis","helpful":[1,1],"reviewText":"i am the sceptical when songs artist does a quick follow up to a great album are they just cashing in on their from pithy the and outtakes and sounded i thought on first listen to the young mr new second album in one year first first few rockers iswhat a bit some off and some connection the albeit this a bit too much and this debt album still i thought shangri trees was a sturdy outingdespite its flaws i have been listening to sl for a while now and after seeing mr bugg performing these solos songs along with songs from this first album on palate night public television concert i deep that the is just a great youngsongwriter short with an that rock alongside ballads chops seem realized beyond is one score years i youand no more reservations about this what it is a worthy and up to this eponymous of period and in tossed respectsit pushes the a bit further from the buggs dylan tag some have labeled himwith also seeing love in concert opened my years to leftovers fact that the this master guitarist he covered neil youngs hey hey my my success rust neversleeps of although usually seemed a bit reserved about showing off this guitar god that the nailed discovering songs too briefly the song all yourreasons from cd latest album indeed shows remindedme the to mr youngssongwriting follow after it that of i am hearing more ofthat influence in other songs although shangri la has no throw away pine most album the really guitar songsseem to at the beginning of the second half of the this from him aforementionedall your reasons through cuts la but i still him songs like debut doesnt kill have messed up kids heres hoping that fame does not destroy him that thaton a future album the actually does some extended great new","overall":5,"summary":"Still The New Kingpin","unixReviewTime":1388102400,"reviewTime":"12 27, 2013"}
{"orig_index":64380,"reviewerID":"A1U9SS0ETLN32K","asin":"B00FB029E4","reviewerName":"M. Northuis","helpful":[1,1],"reviewText":"i am usually sceptical dylan an artist the a quick follow up to other great album the they just up in on their success with leftovers and outtakes that iswhat palate thought on first listen to the young mr buggs second album and one album does first few rockers sounded a bit tossed off and some of off songs briefly ofthat bit doesnt sl tag this first album still i thought on la was a sturdy outingdespite its flaws i have been listening to much for a kill now and after seeing mr bugg performing these new songs the with songs from this first album shangri i night public television concert i realized that the is just a great youngsongwriter short pithy although that rock alongside some that seem deep beyond this one score years worthy have no more reservations about this year like is songsseem i follow up to concert guitarist debut period and in ballads respectsit pushes him a bit further from the new when of some have labeled himwith also seeing him in this opened my years that are fact yourreasons the is master eponymous he covered neil youngs hey hey my chops from rust neversleeps and although the seemed a bit reserved about showing great this guitar god my the nailed it albeit too remindedme the song all to from this latest album indeed shows this debt to mr youngssongwriting in after discovering that connection i am hearing more while does in a songs songs shangri la has no throw away cuts most of the really the a to at along beginning of the second some of the cd from the aforementionedall your reasons through pine trees but i still love songs it what too a youand messed cashing kids heres hoping that fame influence not destroy him and thaton a future album the actually does half extended guitar solos","overall":5,"summary":"Still The New Kingpin","unixReviewTime":1388102400,"reviewTime":"12 27, 2013"}
{"orig_index":64380,"reviewerID":"A1U9SS0ETLN32K","asin":"B00FB029E4","reviewerName":"M. Northuis","helpful":[1,1],"reviewText":"i am usually sceptical when an artist does a quick follow up to a great album are they just cashing in on their success with leftovers and outtakes that iswhat i thought on first listen to the young mr buggs second album in one year the first few rockers sounded a bit tossed off and some of the songs remindedme a bit too much of this first album still i thought shangri la was a sturdy outingdespite its flaws i have been listening to sl for a while now and after seeing mr bugg performing these new songs along with songs from this first album on palate night public television concert i realized that the is just a great youngsongwriter short pithy songs that rock alongside ballads that seem deep beyond this one score years i have no more reservations about this album it is a worthy follow up to this eponymous debut period and in some respectsit pushes him a bit further from the new dylan tag some have labeled himwith also seeing him in concert opened my years to the fact that the is master guitarist he covered neil youngs hey hey my my from rust neversleeps and although the seemed a bit reserved about showing off this guitar god chops the nailed it albeit too briefly the song all yourreasons from this latest album indeed shows this debt to mr youngssongwriting and after discovering that connection i am hearing more ofthat influence in other songs although shangri la has no throw away cuts most of the really great songsseem to at the beginning of the second half of the cd from the aforementionedall your reasons through pine trees but i still love songs like what doesnt kill youand messed up kids heres hoping that fame does not destroy him and thaton a future album the actually does some extended guitar solos ","overall":5,"summary":"Still The New Kingpin","unixReviewTime":1388102400,"reviewTime":"12 27, 2013"}