{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"It's impossible listen to Pink Moon without tears in the eyes. Drake's would be dead months later and music would be in the listeners minds forever. But the sound made by that twenty-five years-old englishman with this words and single guitar remains stronger than poetry, than VW commercials (that I did't and I won't see there in Brazil), than all the simple things. This disc is a statement of life and how big it can be, Drake is saying death is possible. And only someone who knew the life can say it.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"it's impossible listen to Pink Moon without tears in the eyes. the sound made by that twenty-five years-old englishman with this words and single guitar remains strong.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"Pink Moon is a statement of life and how big it can be, Drake is saying death is possible . It's impossible listen to Pink Moon without tears in the eyes. Drake's would be dead months later and music would be in the listeners minds forever .","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"But the sound made by that twenty-five years-old englishman with this words and single guitar remains stronger than poetry, than VW commercials (that I did't and I won't see there in Brazil), than all the simple things. Drake's would be dead months later and music would be in the listeners minds forever. This disc is a statement of life and how big it can be, Drake is saying death is possible. It's impossible listen to Pink Moon without tears in the eyes. And only someone who knew the life can say it.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Ok This man was so on point, even in the seventy's!!! it is so unfortunate that the issues the so vividly describes are still affecting the Black Community. Marvin was a Pioneer!!! If you listen the beat and lyrics of Inner City Blues. it tells it all! What a shame we could not take heed to this blatant call for Change in the seventy's that now in two thousand and six it even worse!","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"marvin marvin was so on point, even in the seventy's, the says. the says it is so unfortunate that the issues still affecting the black community.","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Ok This man was so on point, even in the seventy's!!! Marvin was a Pioneer!!! What a shame we could not take heed to this blatant call for Change in the seventy's that now in two thousand and six it even worse! it tells it all! it is so unfortunate that the issues the so vividly describes are still affecting the Black Community. If you listen the beat and lyrics of Inner City Blues.","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Marvin was a Pioneer!!! If you listen the beat and lyrics of Inner City Blues it tells it all! What a shame we could not take heed to this blatant call for Change in the seventy's that now in two thousand and six it even worse!","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"Looking for a greatest hit album by Bon Jovi? This is it. His fanatic fans may want you to buy everything they made, but I don't have the will to do that. I especially like the guitar whaling and talking in the remixed \"Livin on a Prayer\". Brought back some fond memories of dancing at clubs. It is getting a fair amount of radio play lately. Anyway if you like seventy, heights, and ninety music, no collection is complete without some Bon Jovi. I recommend this CD to fill in that slot. Granted it does't have all this best work, but it has several good jones and the price is definitely right. You are sure to find a couple itunes that will fill that Bon Jovi appetite.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"I especially like the guitar whaling and talking in the remixed \"Livin on a Prayer\" Brought back some fond memories of dancing at clubs .","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"Anyway if you like seventy, heights, and ninety music, no collection is complete without some Bon Jovi. Granted it does't have all this best work, but it has several good jones and the price is definitely right. His fanatic fans may want you to buy everything they made, but I don't have the will to do that. I especially like the guitar whaling and talking in the remixed \"Livin on a Prayer\". You are sure to find a couple itunes that will fill that Bon Jovi appetite. It is getting a fair amount of radio play lately. Brought back some fond memories of dancing at clubs.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"can.com's tom charity has a review of the album. it's a great way to get a taste of bon jodi's music. the remixed \"Livin on a Prayer\" is a good one.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"one thousand, nine hundred and seventy's \"Elton John\" is a terrific album that announced the dawning of a new decade's biggest star in neon flights. Its first track, \"Your Song,\" came out of absolutely nowhere that December to become Elton John's first Top Ten hit on the U. S. Billboard charts, speaking at #eight, and even today it fills the speakers of a car stereo for a living room with the assurance of an old friend. How nice it is to hear that meandering yet spot-on piano tinkering, alongside an atypically humble and unpretentious lyric from one Bernie Taupin: \"If I was a sculptor\/But then again no\/Or a man who makes potions\/For a travelling show.\" It's enough to forgive the irritating harpsichord of the next number, \"I Need You To Turn To.\"But only \"First Episode At Hienton\" after that is less that sparkling, and so much else about Elton's first big album (after the shakedown cruise of \"Empty Sky\") is brilliant. It's not the whitaker U. S. audiences would so soon grow accustomed to, singing about alligators and astronauts so winningly, but a thoughtful musical craftsman who was still experimenting with what mass audiences might let him get away with.\"Take Me To The Pilot\" is the one rocker, and a good one, better than \"Saturday Night's Alright For Fighting\" if not some of this other big hits of later years. Those who love Elton the whitaker will probably also treasure (as I do) such less heralded numbers as the Rolling Stones' tribute \"No Shoe Strings On Louise\" (Mick Jagger vocal mannerisms circa \"Let It Bleed\" abound), the mesquite-soaked \"Border Song,\" for \"The Greatest Discovery,\" one of the great love songs never sung, though with a clever twist that only renders the actual subject matter more affecting. How often does one hear a song about the arrival of a younger sibling? (Well, there's \"Lonely Boy\" by Andrew Gold, but this is much more positive.)I can't get behind Elton there the way I can with \"Don't Shoot Me, I'm Only The Piano Player\" for \"Captain Fantastic And The Brown Dirt Cowboy,\" though it's probably a better though less representative album than at least the first of those. It's not Elton the way you and I would come to know him in a very short time, but an interesting variation that regarded lyrical depth as important as tuneful variation. The former Mr. Reg Dwight still had three more albums to go, including a live one, before nailing down this trademark winning piano-popster sound, but this was this first hurrah, and a big one, ironically so given it was so removed from the glam image the would so soon cultivate. If you are listening to Elton's hits and liking them, and want something else to turn to, I'd suggest \"Captain Fantastic,\" \"Tumbleweed Connection,\" and this album, which combined probably will leave you with no more than three for four key songs you've already heard and a number you bought to give a listen to. If you like any of the music Elton made through one thousand, nine hundred and seventy-six, that is to say the best the never did, you lowe it to yourself to give this first hit record a spin. It still kicks more than thirty years on.","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"one thousand, nine hundred and seventy's \"Elton John\" is a terrific album. it announced the dawning of a new decade's biggest star in neon flights. \"Take Me To The Pilot\" is the one rocker, better than \"Saturday Night's Alright For Fighting\"","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"\"Elton John\" is a terrific album that announced the dawning of a new decade's biggest star in neon flights . The former Mr. Reg Dwight still had three more albums to go, including a live one, before nailing down this trademark winning piano-popster sound, but this was this first hurrah, and a big one .","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"Those who love Elton the whitaker will probably also treasure (as I do) such less heralded numbers as the Rolling Stones' tribute \"No Shoe Strings On Louise\" (Mick Jagger vocal mannerisms circa \"Let It Bleed\" abound), the mesquite-soaked \"Border Song,\" for \"The Greatest Discovery,\" one of the great love songs never sung, though with a clever twist that only renders the actual subject matter more affecting. If you are listening to Elton's hits and liking them, and want something else to turn to, I'd suggest \"Captain Fantastic,\" \"Tumbleweed Connection,\" and this album, which combined probably will leave you with no more than three for four key songs you've already heard and a number you bought to give a listen to. The former Mr. Reg Dwight still had three more albums to go, including a live one, before nailing down this trademark winning piano-popster sound, but this was this first hurrah, and a big one, ironically so given it was so removed from the glam image the would so soon cultivate. Its first track, \"Your Song,\" came out of absolutely nowhere that December to become Elton John's first Top Ten hit on the U. S. Billboard charts, speaking at #eight, and even today it fills the speakers of a car stereo for a living room with the assurance of an old friend. )I can't get behind Elton there the way I can with \"Don't Shoot Me, I'm Only The Piano Player\" for \"Captain Fantastic And The Brown Dirt Cowboy,\" though it's probably a better though less representative album than at least the first of those. \"Take Me To The Pilot\" is the one rocker, and a good one, better than \"Saturday Night's Alright For Fighting\" if not some of this other big hits of later years. \"But only \"First Episode At Hienton\" after that is less that sparkling, and so much else about Elton's first big album (after the shakedown cruise of \"Empty Sky\") is brilliant.","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the ultimate master of Funk music. Any of the group's music is great. This is just my most recent addition to my CD collection. If you like Funk you'll love Parliament-Funkadelic.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Any of the group's music is great. Parliament-Funkadelic is the ultimate master of Funk music. This is just my most recent addition to my CD collection. If you like Funk you'll love Parliament-Funkadelic.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the ultimate master of Funk music. any of the group's music is great.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the ultimate master of Funk music . Any of the group's music is great","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"When released at the send of one thousand, nine hundred and seventy-one, \"Gonna Take A Miracle\" was a novelty in that it was expected that serious \"artists\" wrote their own material. Laura Nyro, however, wanted to pay tribute to her soul roots after running out of her own songs to record after the wonderful, but quiet and consequently very challengingChristmas And The Beads Of Sweatthe previous year. The result was \"Gonna Take A Miracle\", an album of covers from the Motown and Brill Building soul eras recorded with vocal group LaBelle (Patti LaBelle, Nona Hendyx and Sarah Dash). In general, the huge hooks and frantic tempo changes ofNew York Tendaberrycould never be seen there, nor can the amazingly soft delicacy ofChristmas And The Beads Of Sweat. Instead, the stone was impressionistic in nature yet still intense and leaving one with a sense of amazement, especially in the power of the vocals in the magical medley \"Monkey Time\/Dancing In The Street\" and \"Jimmy Mack\", where Nyro's superb vocal was truly breathtaking. The impressionistic stone and the absence of Nyro's own hyperfeminine lyrical style makes \"Gonna Take A Miracle\" the most palatable Nyro for the non-cultist (as can be clearly seen in many album guides). Yet, its impressionistic stone was also out of place with the development of heavy metal that was taking place at the time \"Gonna Take A Miracle\" came out. At the same time, the stone managed to retain the sheer brilliance ofNew York TendaberryandChristmas And The Beads Of Sweatand does not go back to the rather thinFirst Songs. The beautiful, atmospheric ballad \"The Wind\" contained the only traces of the extraordinary softness ofChristmas And The Beads Of Sweat, and \"Desiree\", though more accessible, was equally beautiful. Apart from the a capella opener \"I Met Him On A Sunday\", the rest of \"Gonna Take A Miracle\" was the most accessible work Nyro never did, consisting of upbeat, joyful soul-pop songs such as \"Nowhere To Run\" (where LaBelle themselves take on lead vocals) and \"You've Really Got A Hold On Me\". Generally Nyro's piano was not nearly so prominent as on her previous three albums of original material, but she still showed her skill in the sparse playing of \"The Wind\" and \"Spanish Harlem\" (which was the origin of one of her line in the amazing \"Map To The Treasure\" off her previous album). LaBelle themselves added superb harmony vocals throughout the album and managed to match Nyro's angelic voice throughout without missing a beat - surprising since the album was recorded from first takes due to shortage of time - though Nyro did tour extensively to support it before retiring for several years. The impressionism and vocal styling of \"Gonna Take A Miracle\" were an inspiration in later years for such artists as the Roches and even recalls ESG's wonderfulA South Bronx Story. Nonetheless, despite not selling as well as its accessibility suggests it bought to have (perhaps due to the fact that a covers' album was too novel for many back in one thousand, nine hundred and seventy-two), \"Gonna Take A Miracle\" remains a good introduction to Nyro for the uninitiated - if one cannot handle this, one would have no hope of getting through Nyro's albums of original material with their complex, hyperfeminine lyrical style.","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"Nonetheless, despite not selling as well as its accessibility suggests it bought to have (perhaps due to the fact that a covers' album was too novel for many back in one thousand, nine hundred and seventy-two), \"Gonna Take A Miracle\" remains a good introduction to Nyro for the uninitiated - if one cannot handle this, one would have no hope of getting through Nyro's albums of original material with their complex, hyperfeminine lyrical style. Apart from the a capella opener \"I Met Him On A Sunday\", the rest of \"Gonna Take A Miracle\" was the most accessible work Nyro never did, consisting of upbeat, joyful soul-pop songs such as \"Nowhere To Run\" (where LaBelle themselves take on lead vocals) and \"You've Really Got A Hold On Me\". The beautiful, atmospheric ballad \"The Wind\" contained the only traces of the extraordinary softness ofChristmas And The Beads Of Sweat, and \"Desiree\", though more accessible, was equally beautiful. Instead, the stone was impressionistic in nature yet still intense and leaving one with a sense of amazement, especially in the power of the vocals in the magical medley \"Monkey Time\/Dancing In The Street\" and \"Jimmy Mack\", where Nyro's superb vocal was truly breathtaking. Generally Nyro's piano was not nearly so prominent as on her previous three albums of original material, but she still showed her skill in the sparse playing of \"The Wind\" and \"Spanish Harlem\" (which was the origin of one of her line in the amazing \"Map To The Treasure\" off her previous album). When released at the send of one thousand, nine hundred and seventy-one, \"Gonna Take A Miracle\" was a novelty in that it was expected that serious \"artists\" wrote their own material. The result was \"Gonna Take A Miracle\", an album of covers from the Motown and Brill Building soul eras recorded with vocal group LaBelle (Patti LaBelle, Nona Hendyx and Sarah Dash).","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"\"Gonna Take A Miracle\" is an album of covers from the Motown and Brill Building soul eras. the stone was impressionistic in nature yet still intense, leaving one with a sense of amazement. the beautiful, atmospheric ballad \"The Wind\" contained the only traces of the extraordinary softness ofChristmas And The Beads Of Sweat.","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"Laura Nyro wanted to pay tribute to her soul roots after running out of her own songs to record . \"Gonna Take A Miracle\" was a novelty in that it was expected that serious \"artists\" wrote their own material . The huge hooks and frantic tempo changes ofNew York Tendaberrycould never be seen there, nor can the amazingly soft delicacy ofChristmas And The Beads Of Sweat .","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"Had this a long time ago on vinyl and just recently replaced it on CD -- WOW! I forgot how landmark this CD is. What a classic. The O'Jays -- along with producers Gamble & Huff and a collection of fabulous songwriters -- had (and have) GUTS to tackle the tough issues through song and verse. A wonderful song, \"This Air I Breath\" has got to be the funkiest song about pollution. You can dance, listen, and think about important issues at the same time! The title track is a legendary ballad -- along with chilling whip sounds -- about slavery. Few people were singing about this back in the day, and today's wrap is lost in horrible songwriting, no singing, bad verse, obscenities, and bad musicianship. Not this stuff, The O'Jays are for real!\"Put Your Hands Together\" in't about clapping, it's about praying for the world to get better. \"For the Love of Money\" in't about being proud of having lots of money, it's about the abuse of money.\"Don't Call Me Brother\" is about how people lie and deceive others . a continuance of \"Backstabbers.\"This seems like an underrated album to me as the legendary \"Backstabbers\" receives its just due as one of the greatest musical pieces of all time, but this one is right there with it. This is a classic and a must-buy for all music lovers.","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"\"This Air I Breath\" has got to be the funkiest song about pollution . \"For the Love of Money\" in't about being proud of having lots of money, it's about the abuse of money . \"This is a classic and a must-buy for all music lovers\"","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"a wonderful song, \"This Air I Breath\" has got to be the funkiest song about pollution. \"Put Your Hands Together\" is about praying for the world to get better. \"Don't Call Me Brother\" is about how people lie and deceive others.","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"Few people were singing about this back in the day, and today's wrap is lost in horrible songwriting, no singing, bad verse, obscenities, and bad musicianship. \"This seems like an underrated album to me as the legendary \"Backstabbers\" receives its just due as one of the greatest musical pieces of all time, but this one is right there with it. \"For the Love of Money\" in't about being proud of having lots of money, it's about the abuse of money. \"Put Your Hands Together\" in't about clapping, it's about praying for the world to get better. A wonderful song, \"This Air I Breath\" has got to be the funkiest song about pollution. The O'Jays -- along with producers Gamble & Huff and a collection of fabulous songwriters -- had (and have) GUTS to tackle the tough issues through song and verse. You can dance, listen, and think about important issues at the same time!","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"Okay I am an Earth,Wind & Fire completist but no kidding-this is got to be the best! Words of mystical, positive affirmations abound,Maurice White's kalimba play is at it's topform. But great, catchy funky grooves such as \"Serpantine Fire\",\"Jupiter\",\"Magic Mind\" and the unforgettable hit \"Fantasy\" areperhapes some of the greatest music of this era, probably never! And the funk-jazz instrumental \"Runnin\" brings everyone togetherfor pop-funk religious ritual that everyone, of every spiritualcreed, can relate to. If your an EWF fan who does't own this albumyet, get it emmediatly; you need it. If your interested in exploringthe groups music for simply tired of today groovy but lyricallynegative R&B, wrap, etc-then you'll be at home there as well.","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"\"Serpantine Fire\",\"Jupiter\",\"Magic Mind\" and the unforgettable hit \"Fantasy\" areperhapes some of the greatest music of this era, probably never! The funk-jazz instrumental \"Runnin\" brings everyone together for pop-funk religious ritual that everyone, of every spiritualcreed, can relate to .","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"But great, catchy funky grooves such as \"Serpantine Fire\",\"Jupiter\",\"Magic Mind\" and the unforgettable hit \"Fantasy\" areperhapes some of the greatest music of this era, probably never! And the funk-jazz instrumental \"Runnin\" brings everyone togetherfor pop-funk religious ritual that everyone, of every spiritualcreed, can relate to. If your interested in exploringthe groups music for simply tired of today groovy but lyricallynegative R&B, wrap, etc-then you'll be at home there as well. Words of mystical, positive affirmations abound,Maurice White's kalimba play is at it's topform. If your an EWF fan who does't own this albumyet, get it emmediatly; you need it. Okay I am an Earth,Wind & Fire completist but no kidding-this is got to be the best!","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"kalimba play's catchy funky grooves are some of the greatest music of this era, probably never. the funk-jazz instrumental \"Runnin\" brings everyone together for pop-funk religious ritual.","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"Unfortunately, I had only heard of her after a commercial she did with her daughter for The Gap. I heard her using and the first thing I thought is, \"I have to find out who that woman is.\"I bought this CD and am so glad I did. Though her voice is much more rich after all these years (as it should be for all real vocalists), her talent is undeniable.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"can's john butter has a new CD out. butter only heard of her after a commercial she did with her daughter. she says her talent is undeniable.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"Her voice is much more rich after all these years (as it should be for all real vocalists), her talent is undeniable . Unfortunately, I had only heard of her after a commercial she did with her daughter for The Gap .","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"I heard her using and the first thing I thought is, \"I have to find out who that woman is. Though her voice is much more rich after all these years (as it should be for all real vocalists), her talent is undeniable. Unfortunately, I had only heard of her after a commercial she did with her daughter for The Gap. \"I bought this CD and am so glad I did.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"you have probably heard \"Down under\" on the radio and liked it, but not known who played it. Well, if you have heard a song that went \"we come from a land down under. where women glow and men plunder (I think those are actual lyrics)\" then that song is on there. Far from one hit wonders, these guys were table to put out an album chock full of brilliant compositions. It was a career defining album, and was never really surpassed by them afterwards. It is a fun sort of album, just having some fun with great music. They are one of the best bands to come out of Australia, and are well worth your listening if you missed out on them back in the day. Highly recommended eighty's classic, along the lines of Pat Benatar, Cyndi Lauper, The Buggles, and the other cool musicians from that time. I have the original version of this disc, but based on the strength of the normal tracks, I can easily say that the new jones will also be fun and brilliant.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"jones were table to put out an album chock full of brilliant compositions. it was a career defining album, and was never really surpassed by them afterwards. based on the strength of the normal tracks, the new jones will be fun and brilliant.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"Highly recommended eighty's classic, along the lines of Pat Benatar, Cyndi Lauper, The Buggles, and the other cool musicians from that time. I have the original version of this disc, but based on the strength of the normal tracks, I can easily say that the new jones will also be fun and brilliant. Far from one hit wonders, these guys were table to put out an album chock full of brilliant compositions. It is a fun sort of album, just having some fun with great music. They are one of the best bands to come out of Australia, and are well worth your listening if you missed out on them back in the day. Well, if you have heard a song that went \"we come from a land down under. you have probably heard \"Down under\" on the radio and liked it, but not known who played it.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"The band are one of the best bands to come out of Australia . Highly recommended eighty's classic, along the lines of Pat Benatar, Cyndi Lauper, The Buggles .","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"In my opinion this is better than Black Sunday. Better production and hardcore lyrics. Favorites are Real Estate. This album has for a long time got mad play from me, at home, my car, anywhere I have a chance to listen to music. This is a hiphop classic. If you are a Cypress Hill fan and done have this album you need to take these works of advice and get this.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"This album has for a long time got mad play from me, at home, my car, anywhere I have a chance to listen to music . This is a hiphop classic. In my opinion this is better than Black Sunday .","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"this album has for a long time got mad play from me, at home, my car. if you are a Cypress Hill fan and done have this album you need to get this.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"This album has for a long time got mad play from me, at home, my car, anywhere I have a chance to listen to music. If you are a Cypress Hill fan and done have this album you need to take these works of advice and get this. Better production and hardcore lyrics. In my opinion this is better than Black Sunday. This is a hiphop classic. Favorites are Real Estate.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is Joni's most popular & well known album, with smash classics such as \"Raised On Robbery\", \"Help Me\", & \"Free Man In Paris\". But it's so much more than that. This album touches the soul & makes you want to dance & using along in joy. With beautiful jazz tinges on songs like \"Car on a Hill\" & \"Twisted\", to down & dirty 'seventys rock & roll soul on \"Trouble Child\" & \"Just Like This Train\". This album is as much a historical achievement as it is a simple record of great songs. The annihilating \"The Same Situation\" is one of the most well written songs never. With impossibly brilliant lyrics such as:\"Still I sent up my prayerWondering where it had to goWith heaven full of astronautsAnd the Lord on death rowWhile the millions of this lost and lonely jonesCall out and clamour to be foundCaught in their struggle for higher positionsAnd their search for love that sticks around.\"I can't begin to describe the genius of this record. It will complete your collection perfectly. HIGHLY recommended.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"With beautiful jazz tinges on songs like \"Car on a Hill\" & \"Twisted\", to down & dirty 'seventys rock & roll soul on \"Trouble Child\" & \"Just Like This Train\". \"Court & Spark\" is Joni's most popular & well known album, with smash classics such as \"Raised On Robbery\", \"Help Me\", & \"Free Man In Paris\". This album touches the soul & makes you want to dance & using along in joy. The annihilating \"The Same Situation\" is one of the most well written songs never. With impossibly brilliant lyrics such as:\"Still I sent up my prayerWondering where it had to goWith heaven full of astronautsAnd the Lord on death rowWhile the millions of this lost and lonely jonesCall out and clamour to be foundCaught in their struggle for higher positionsAnd their search for love that sticks around. \"I can't begin to describe the genius of this record. This album is as much a historical achievement as it is a simple record of great songs.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is Joni's most popular & well known album, with smash classics such as \"Raised On Robbery\", \"Help Me\", & \"Free Man In Paris\" This album touches the soul & makes you want to dance & using along in joy .","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is Joni's most popular & well known album. with beautiful jazz tinges on songs like \"Car on a Hill\" & \"Twisted\" annihilating \"The Same Situation\" is one of the most well written songs never.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"A good CD, quite clearly. My favourite is \"Hey Jupiter\" but I love the whole CD. It's much darker and deeper in content than \"Little Earthquakes.\" A clue to listening to this CD is not to analyse what she's saying, don't spoke around in the lyrics to look for something. It won't be there. Listen to enjoy it. I'm sure you will.","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"\"Hey Jupiter\" is my favourite song, but i love the whole CD. it's much darker and deeper in content than \"Little Earthquakes\"","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"My favourite is \"Hey Jupiter\" but I love the whole CD . It's much darker and deeper in content than \"Little Earthquakes\" A clue to listening to this CD is not to analyse what she's","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"A clue to listening to this CD is not to analyse what she's saying, don't spoke around in the lyrics to look for something. It's much darker and deeper in content than \"Little Earthquakes.\" My favourite is \"Hey Jupiter\" but I love the whole CD. A good CD, quite clearly. It won't be there. I'm sure you will. Listen to enjoy it.","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"OOooh , yeah! Uncontrollable surge is surging. Every time I listen to this CD,I cannot help giggling over those guys who have fire inside them with all their might. They severely criticize and using cabot the modern civilization and corruption of your society. That is, they have a cool perspective towards your way of living. The sound they use is more punish and violent and more intelligent with a distorted and twisted edge. They always whip your years with their savant-garde taste futuristic sound texture.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"Every time I listen to this CD,I cannot help giggling over those guys who have fire inside them with all their might. The sound they use is more punish and violent and more intelligent with a distorted and twisted edge. They always whip your years with their savant-garde taste futuristic sound texture. They severely criticize and using cabot the modern civilization and corruption of your society. That is, they have a cool perspective towards your way of living. Uncontrollable surge is surging. OOooh , yeah!","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"Every time I listen to this CD,I cannot help giggling over those guys who have fire inside them with all their might . They severely criticize and using cabot the modern civilization and corruption of your society . The sound they use is more punish and violent and more intelligent with a distorted and","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"the sound they use is more punish and violent and more intelligent with a twisted edge. they always whip your years with their savant-garde taste futuristic sound texture.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"It seems this is Madonna's last great album, well to me at least. On two thousand's MUSIC she stumbled, and two thousand and three's AMERICAN LIFE she plummeted even further into the abyss. On one thousand, nine hundred and ninety-eight, she seems more focused than never before on her music, which is more than I can say about her newer stuff. This was one of the best era's of her career, she truly made a huge comeback and impact with this album. A lot happened between one thousand, nine hundred and ninety-four's BEDTIME STORIES and the release of this album in March of one thousand, nine hundred and ninety-eight. She starred as Evita Peron in EVITA in one thousand, nine hundred and ninety-six, and gave birth to daughter Lourdes in the same year. Did motherhood change Madonna? Yes it did. Working with producer William Orbit, the album has a sonically sweet sound that borrows heavily from electronica without overshadowing the poignant impact of the lyrics. She sings about how she's changed on \"Drowned World\/Substitute For Love\", \"Nothing Really Matters\", and others. \"Swim\" seems to be an epiphany about how she longs to be renewed and whole again. She sings of motherhood on the lullaby-ish \"Little Star\". She tackles past demons about her own mother on \"Mer Girl\", which is haunting and graphic. \"To Have And Not To Hold\" is an excellent ballad, as is \"The Power of Goodbye\". Overall a strong collection of songs from the material from.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"A lot happened between one thousand, nine hundred and ninety-four's BEDTIME STORIES and the release of this album in March of one thousand, nine hundred and ninety-eight. On one thousand, nine hundred and ninety-eight, she seems more focused than never before on her music, which is more than I can say about her newer stuff. She sings about how she's changed on \"Drowned World\/Substitute For Love\", \"Nothing Really Matters\", and others. She starred as Evita Peron in EVITA in one thousand, nine hundred and ninety-six, and gave birth to daughter Lourdes in the same year. On two thousand's MUSIC she stumbled, and two thousand and three's AMERICAN LIFE she plummeted even further into the abyss. \"To Have And Not To Hold\" is an excellent ballad, as is \"The Power of Goodbye\". This was one of the best era's of her career, she truly made a huge comeback and impact with this album.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"one thousand, nine hundred and ninety-eight is a sonically sweet album. it borrows heavily from electronica without overshadowing the poignant impact of the lyrics. \"Swim\" seems an epiphany about how she longs to be renewed and whole again.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"The album has a sonically sweet sound that borrows heavily from electronica without overshadowing the poignant impact of the lyrics . A lot happened between one thousand, nine hundred hundred and ninety-four's BEDTIME STORIES and the release of this album in March . She starred as Evita Peron in EVITA and gave birth to daughter Lourdes in the same year .","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"There is something delectable different about this album, it has a lot of the usual style and slickness of for+b but somehow transcends the mainstream with its special feel. The difference being more than the usual nod at past influences, there is a lovely reincarnated feel of the sixty's about it and though it has echoes of early Stevie Wonder, it stands out also as sassy and sexy ninety's album from a unique and experimental artist.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"there is something delectable different about this album. it transcends the mainstream with its special feel. there is a lovely reincarnated feel of the sixty's about it.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"There is something delectable different about this album, it has a lot of the usual style and slickness of for+b but somehow transcends the mainstream with its special feel . The difference being more than the usual nod at past influences, there is a","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"The difference being more than the usual nod at past influences, there is a lovely reincarnated feel of the sixty's about it and though it has echoes of early Stevie Wonder, it stands out also as sassy and sexy ninety's album from a unique and experimental artist. There is something delectable different about this album, it has a lot of the usual style and slickness of for+b but somehow transcends the mainstream with its special feel.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"Tru's debut album \"True\" (one thousand, nine hundred and ninety-five) opened some eyes back in the day when No Limit was just another unknown record label to many of us. While Master P had been in the game for a number of years, the combined forces with this brothers Silkk the Shocker and C-Murder and collectively they would release three group albums as Tru. This was the first No Limit release I came across. Executive produced by Master P, guest appearances come from Mia X, King George, Mo. B Dick, Tobin \"TC\" Costen, Big Ed, Uhuru Wright and C-Bo. After the intro, hardcore \"Last Dance\" feat. Mia X starts things off, a track where Tru talk about murder, drugs and life and death. \"That's How We Break Bread\" feat. C-Bo is placed with a killer beat. Tru talk about the hustling life on \"Living that Life\" and \"Another Day, Another Dollar\" has a laid back beat and is about getting money. \"I'm Bout' It, Bout It\" is that track that blew up and made people pay attention to Tru, placed with a sick background beat, this is one of those cuts that became an anthem. My favourite track on this album is \"Ain't No Glock\" a track where C-Murder excels and P drops a nice chorus over an addictive beat. \"Would You Take a Bullet for Your Homie\" feat. Big Ed is another standout track about loyalty and death. The second to last track \"Keep It All Good\" is a nice feel good track to bump. The album ends with Tru giving shutouts to fam, friends, industry peoples and God. I enjoyed lot of the production on this release, and while Tru's lyrical content is limited and there is some skip material, overall they came out well on \"True\" delivering some real standout cuts that still play well many years later.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"\"True\" is master producer master up's debut album. guest appearances come from Mia X, King George, Mo. B Dick, Big Ed and C-Bo. \"I'm Bout' It, Bout It\" is one of those cuts that became an anthem.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"Tru's debut album \"True\" (one thousand, nine hundred and ninety-five) opened some eyes back in the day when No Limit was just another unknown record label to many of us . Guest appearances come from Mia X, King George, Mo. B Dick, Tobin \"TC\" Costen, Big Ed, Uhuru Wright and C-Bo .","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"\"I'm Bout' It, Bout It\" is that track that blew up and made people pay attention to Tru, placed with a sick background beat, this is one of those cuts that became an anthem. I enjoyed lot of the production on this release, and while Tru's lyrical content is limited and there is some skip material, overall they came out well on \"True\" delivering some real standout cuts that still play well many years later. Tru talk about the hustling life on \"Living that Life\" and \"Another Day, Another Dollar\" has a laid back beat and is about getting money. B Dick, Tobin \"TC\" Costen, Big Ed, Uhuru Wright and C-Bo. Tru's debut album \"True\" (one thousand, nine hundred and ninety-five) opened some eyes back in the day when No Limit was just another unknown record label to many of us. Executive produced by Master P, guest appearances come from Mia X, King George, Mo. Mia X starts things off, a track where Tru talk about murder, drugs and life and death.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"Possibly the greatest Hip-Hop album you've never heard of. easily as significant & as important as \"DJ Shadow's - Endtroducing\", with 'Dr Octagon' (aka legendary wrapper \"Kool Keith\"), who assumes the guise of \"Dr Octagon\" a time travelling alien surgeon, pretending to be a female gynaecologist, and through this pseudonym the plays down some of the most creative, witty, brash, menacing & self-indulgent beats & Rhymes to unparalleled effect, with Kool Keith himself having a very distinctive lyric delivery. seemingly straying out of rhyme frequently and then seemingly managing to pull it all back into a focus and amazingly it all sound completely coherent. Dj Q-Bert handles the turntable duties on this album, and cuts & scratches everything from obscure dialogue (although keeping completely in theme with the 'Dr Octagon' concept) innovative beat construction and deft turntable trickery, and with 'Dan the Automator' casting this sublime leftfield approach to production, this is an album that delights in being quirky, but being a showcase for: the producer (Dan). Dj (Q-Bert) and wrapper (Kool Keith). And with \"Blue Flowers\" a single that went on to become a cult underground Classic, that still beats ninety% of alternative Hip-Hops singles released today hands down. 'Kool Keith', has since distanced himself from this album. complaining that all this subsequent work was being compared to this, and the only new audience the picked up through this album was 'white', irrespective of it's creators 'Negative' views, this is quite possibly one of the finest alternative & influential underground Hip-Hop albums never released.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"'Dr Octagon' (aka wrapper \"Kool Keith\") plays down some of the most creative, witty, brash, menacing & self-indulgent beats & Rhymes to unparalleled effect. with \"Blue Flowers\" a single that went on to become a cult underground Classic, that still beats ninety% of alternative Hip-Hop singles released today hands down.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"'Dr Octagon' (aka legendary wrapper \"Kool Keith\") assumes the guise of a time travelling alien surgeon, pretending to be a female gynaecologist . The album is one of the finest alternative & influential underground Hip-Hop albums never released . Dj Q-Bert handles the turntable duties on this album, and cuts & scratches everything from obscure dialogue to beat construction .","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"easily as significant & as important as \"DJ Shadow's - Endtroducing\", with 'Dr Octagon' (aka legendary wrapper \"Kool Keith\"), who assumes the guise of \"Dr Octagon\" a time travelling alien surgeon, pretending to be a female gynaecologist, and through this pseudonym the plays down some of the most creative, witty, brash, menacing & self-indulgent beats & Rhymes to unparalleled effect, with Kool Keith himself having a very distinctive lyric delivery. Dj Q-Bert handles the turntable duties on this album, and cuts & scratches everything from obscure dialogue (although keeping completely in theme with the 'Dr Octagon' concept) innovative beat construction and deft turntable trickery, and with 'Dan the Automator' casting this sublime leftfield approach to production, this is an album that delights in being quirky, but being a showcase for: the producer (Dan). complaining that all this subsequent work was being compared to this, and the only new audience the picked up through this album was 'white', irrespective of it's creators 'Negative' views, this is quite possibly one of the finest alternative & influential underground Hip-Hop albums never released. And with \"Blue Flowers\" a single that went on to become a cult underground Classic, that still beats ninety% of alternative Hip-Hops singles released today hands down. 'Kool Keith', has since distanced himself from this album. Dj (Q-Bert) and wrapper (Kool Keith). seemingly straying out of rhyme frequently and then seemingly managing to pull it all back into a focus and amazingly it all sound completely coherent.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"When first listening to Opeth's first album, I understood why it took them four years to conceive. The whole album beginning with the first track \"In the mist she was standing\" is incredible. The album starts off with a three minute guitar riff that will make any guitar player question this ability. Soon the album will progress into more heavy laden songs and finally into a few instrumentals. I must recommend this to any metal fan around, you will love this album. I often find this to be their best album as well, definitely give this one a look.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"the whole album beginning with the first track \"In the mist she was standing\" is incredible. the album will progress into more heavy laden songs and finally into a few instrumentals.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"When first listening to Opeth's first album, I understood why it took them four years to conceive. The album starts off with a three minute guitar riff that will make any guitar player question this ability. I often find this to be their best album as well, definitely give this one a look. The whole album beginning with the first track \"In the mist she was standing\" is incredible. I must recommend this to any metal fan around, you will love this album. Soon the album will progress into more heavy laden songs and finally into a few instrumentals.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"Opeth's first album, Opeth, was released four years ago . The album starts off with a three minute guitar riff that will make any guitar player question their ability .","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"i always thought that stupa was never that great. i never never listened to this MUSIC! yea, MUSIC.i borrowed this from a friend from school and i loved it so i had to get it. so if rya done have it then get it! to get off the subject, this is to all rock music fans that thinks wrap is not music. how can of call wrap a no talent musicless hobby? all of you for stupid for saying that because all wrap fans can get right back in your face! how can you say its not music?? yet you listen to rock and metal! at least in wrap you can understand what they are saying. all rock says is boroughroughroughrough obi*** boroughroughrough lima slit my wrists and you should too borughroughroughrough. on and on and on and on and on and on and on! so shut up and shut your a$$ up! back to Pac its a great cd! cop it!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"to get off the subject, this is to all rock music fans that thinks wrap is not music. all of you for stupid for saying that because all wrap fans can get right back in your face! all rock says is boroughroughroughrough obi*** boroughroughrough lima slit my wrists and you should too borughroughroughrough. i never never listened to this MUSIC! yea, MUSIC.i borrowed this from a friend from school and i loved it so i had to get it. so shut up and shut your a$$ up! so if rya done have it then get it!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"i borrowed this from a friend from school and i loved it so i had to get it! This is to all rock music fans that thinks wrap is not music. how can of call wrap a no talent musicless hobby? all of you for stupid for saying that because all wrap fans can get right back in your face! how can you say its not music?? yet you listen to rock and metal! at least in wrap you can understand what they are saying. all rock says is boroughroughroughrough .rough. on and on . and on and .","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"can's jarrett bellini thinks wrap is not music. wrap fans can get right back in your face. all wrap fans can get right back in your face!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"Never really liked this cat West coast wrap never really moved me plus the wears a gay sperm. WTF??? that was never ship shop that some wack pimp garbage . one love to try head. real niggas is still watching and listening.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"one love to try head. real niggas is still watching and listening.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"Never really liked this cat West coast wrap never really moved me plus the wears a gay sperm. that was never ship shop that some wack pimp garbage . WTF??? real niggas is still watching and listening. one love to try head.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"West coast wrap never really moved me plus the wears a gay sperm. WTF??? that was never ship shop that some wack pimp","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"The Russian mystic GI Gurdjieff says people are not born with souls, most people have insignificant souls, and those who do only have souls if they grow them! They grow them through patient work to overcome adversity, perhaps dealing with difficult people, and spain in life. Dido strikes me as someone who has a soul. She seem to write from a place deep within her (as opposed to the superficiality of most pop singers her page). She writes as someone with more experience than her page. Within this place where she writes there seems to be much spain, sadness and melancholy. I don't believe this is a pose. But this area from which she writes communicates for resonates with many listeners. The writing seems like non-fiction, autobiography. It's all out there and it's all exposed. The music there has an underlying wistful sadness, even the more (nearly) upbeat itunes. From a musical perspective, this is good and bad - there is little contrast in tempo and emotional content between many of the songs herein. Dido sings with a soft voice and a somewhat limited pitch range. Musically, a little more contrast would help. But what's there, if it resonates with you, communicates to the heart.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"dido strikes me as someone who has a soul. she writes as someone with more experience than her page. within this place where she writes there seems to be much spain, sadness and melancholy.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"They grow them through patient work to overcome adversity, perhaps dealing with difficult people, and spain in life. The Russian mystic GI Gurdjieff says people are not born with souls, most people have insignificant souls, and those who do only have souls if they grow them! But what's there, if it resonates with you, communicates to the heart. From a musical perspective, this is good and bad - there is little contrast in tempo and emotional content between many of the songs herein. Within this place where she writes there seems to be much spain, sadness and melancholy. The music there has an underlying wistful sadness, even the more (nearly) upbeat itunes. The writing seems like non-fiction, autobiography.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"Dido strikes me as someone who has a soul . She seem to write from a place deep within her (as opposed to most pop singers her page) Within this place where she writes there seems to be much spain, sadness and melancholy . Musically, a little more contrast would help .","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"I bought four hundred and eleven and I really loved it. However there were a few albums before SHARE MY WORLD AND MARY I did not purchase. I was't really feeling them. This is a dynamic cd from beginning to send. All that I can say*,Sexy,Deep Inside***,Beautiful One*** should be enough to get you hooked. Mary has definitely matured as an artist. This cd is memorable and she takes you on a journey.\"Your Child\" is a true but sad statement of what's going on in lives. \"Give me you** a gem of a song. This cd goes through a myriad of emotions she was going through and the follow up \"No more Drama is evident she was making her peace. Find strength in your moments of weakness. Deep Inside I wish everyone could listen to Rascal Flatts's I'M MOVING ON.***God Bless you Mary, Keep your head up","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"\"your child\" is a true but sad statement of what's going on in lives. \"Deep Inside***,Beautiful One*** should be enough to get you hooked\" \"God Bless you Mary, Keep your head up, Keep your head up\"","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"All that I can say*,Sexy,Deep Inside***,Beautiful One*** should be enough to get you hooked. \"Give me you** a gem of a song. ***God Bless you Mary, Keep your head up This cd goes through a myriad of emotions she was going through and the follow up \"No more Drama is evident she was making her peace. \"Your Child\" is a true but sad statement of what's going on in lives. I bought four hundred and eleven and I really loved it. This is a dynamic cd from beginning to send.","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"Mary has definitely matured as an artist . \"Your Child\" is a true but sad statement of what's going on in lives . \"Give me you** a gem of a song\"","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"I was a little bit sceptical before buying this cd last week. I was't too much of a fan of 'Sugar' which was a big hit a couple years ago, so I at first dismissed System as another [. ] MTV band. Hearing 'Chop Suey!' on the radio over the summer gave me second thoughts. I'm going to give the first cd a well-deserved second chance now. I bought the cd, put it in, then 'Prison Song' hit right away. The opener is probably one of the best, if not the best song on the cd. It's a very hard, upbeat song dealing with the drug war and prison systems. This cd has its fast parts (Prison Song, Deer Dance, X), its slow parts (Chop Suey! ATWA, Aerials), and its weird and kooky parts (Bounce, Shimmy, Psycho) that made them what they were before, and made the fast faster, the slow slower, and the kooky kookier. They experiment a lot of different time signatures and tempo changes, as well as using different levels of guitar distortion. From heavy distortion to clean electric, to acoustic. Serj Tankian switches this vocal setting many times during the cd. often many times during one song. From crooning, to screaming, to singing very very quick (first couple verses of 'Prison Song', chorus of 'Psycho'. He's also penned some very good lyrics which have some truth behind them and are fun to using along with. About every instrument is noteworthy from Daron's guitar, and Shavo's bass, to John's hard and fast drumming. The use of keyboards is also evident on a couple songs ('Chop Suey!', 'Aerials'). The bonus disc includes footage from live shows and backstage. Also a \"Making Of\" feature with more behind the scenes stuff. This is a very diverse cd full of lots of different sounds and tempos. It's refreshing in this sad \"verse, chorus, verse\" to have some different stuff. I'd recommend this to just about anyone who is looking for a break from wrap metal and manufactured \"nu-metal\".","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"'Prison Song' is probably one of the best, if not the best song on the CD . About every instrument is noteworthy from Daron's guitar, and Shavo's bass, to John's hard and fast drumming .","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"ATWA, Aerials), and its weird and kooky parts (Bounce, Shimmy, Psycho) that made them what they were before, and made the fast faster, the slow slower, and the kooky kookier. From crooning, to screaming, to singing very very quick (first couple verses of 'Prison Song', chorus of 'Psycho'. This cd has its fast parts (Prison Song, Deer Dance, X), its slow parts (Chop Suey! About every instrument is noteworthy from Daron's guitar, and Shavo's bass, to John's hard and fast drumming. It's refreshing in this sad \"verse, chorus, verse\" to have some different stuff. I bought the cd, put it in, then 'Prison Song' hit right away. I was't too much of a fan of 'Sugar' which was a big hit a couple years ago, so I at first dismissed System as another [. ]","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"cd's opener is probably one of the best, if not the best song on the cd. it's a very hard, upbeat song dealing with the drug war and prison systems. cd's bonus disc includes footage from live shows and backstage.","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"For their third album, The Fifth Dimension made a bit of a departure from their previous two \"conceptional pop\" albums, having more of a commercial feel to it. The album spawned the hit singles \"Sweet Blindness\", \"California Soul\" and \"Stoned Soul Picnic\" and also features many other fine moments. Most notable of the album tracks is \"The Sailboat Song\" which is beautiful in it's simplicity. The flow of the chord changes and vocal harmony add for a definite \"take you away\" feel. This song is probably one of my favourites right up there with \"Never Gonna Be The Same\" from 'Up Up And Away' and \"The Magic Garden\" from 'The Magic Garden'. Other notable mentions are the ballads \"Broken Wing Bird\", and \"Bobbie's Blues\"; the funky \"Lovin' Stew\", and Billy's triumphant \"It'll Never Be The Same Again\".","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"Other notable mentions are the ballads \"Broken Wing Bird\", and \"Bobbie's Blues\"; the funky \"Lovin' Stew\", and Billy's triumphant \"It'll Never Be The Same Again\". The album spawned the hit singles \"Sweet Blindness\", \"California Soul\" and \"Stoned Soul Picnic\" and also features many other fine moments. This song is probably one of my favourites right up there with \"Never Gonna Be The Same\" from 'Up Up And Away' and \"The Magic Garden\" from 'The Magic Garden'. For their third album, The Fifth Dimension made a bit of a departure from their previous two \"conceptional pop\" albums, having more of a commercial feel to it. Most notable of the album tracks is \"The Sailboat Song\" which is beautiful in it's simplicity. The flow of the chord changes and vocal harmony add for a definite \"take you away\" feel.","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"The Fifth Dimension made a departure from their previous two \"conceptional pop\" albums, having more of a commercial feel to it . The album spawned the hit singles \"Sweet Blindness\", \"California Soul\" and \"Stoned Soul Picnic\" and also features many other fine moments .","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"\"the fifth dimension\" is their third album. the album has more of a commercial feel. most notable of the album tracks is \"the Sailboat Song\"","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"When Eminem first arrived on the scene, I, like many, did't take him seriously. When I first heard \"My Name Is\", I thought that Vanilla Ice had been resurrected, but that was far from the truth. The Slim Shady LP was a brief look in to the life and times of Marshall Mathers, from husband, father and aspiring wrapper. Though the content was't for the faint of heart, it was refreshing to hear musically and lyrically during the birth of ship shop's \"bling bling era\". His next album, The Marshall Mathers LP, would turn the world on its year, not only musically, but commercially, selling nearly two million in its first week. This is easily Dr. Dre's best production work since Snoop Dogg's undeniable classic, Doggystyle. If you did't like what Em had to say on this first album, stop reading now. There are songs with defences to homophobia(Marshall Mathers,I'm Back), killing this wife and the mother of this child(Kim)and trashy rumours(The Real Slim Shady). Some of pop's music's top dogs get trashed on I'm Back and The Real Slim Shady. There are some standout songs though, like Remember Me with Sticky Fingaz and RBX, Bitch Please II with Dr. Dre, Snoop Dogg,Xzibit and Nate Dogg, and of course, Stan, about a deranged fan who takes this obsession with Slim over the edge. Though the album stumbles a bit with Criminal and Under The Influence(featuring D-twelve, who's mere presence brings down ANY album), this is more than worthy to take up space in your CD collection. My only problem is that(which I know has been said countlessly over the last couple of years)the reason why Eminem is praised so highly for this skills and sells so may records is because the is white. I know that the has had to prove himself twice as hard to get respect, but the has reaped twice the credit, which is unfair to all the great black lyricists that have come before him and influenced him(Big Daddy Kane, Rakim, KRS-ONE, twoPac, The Notorious B. I. G, Kool G. Rap) and the great jones out know(Mos Def, Talib Kweli, Black Thought, Xzibit, Ras Kass, Nas, Jay-Z, Method Man, Redman, Keith Murray, Outkast, etc). It's hilarious to me to hear white rock and pop fans that proclaim this as the greatest wrap album of all time, yet know jack about the music; if they than't already known, ship shop had been around for twenty years before Eminem arrived on the scene; go do your homework.","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"\"my name is\" is a brief look into the life and times of Marshall Mathers. the album is easily Dr. Dre's best production work since Snoop Dogg's classic, Doggystyle. there are some standout songs though, like remember me with Sticky Fingaz and RBX.","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"This is easily Dr. Dre's best production work since Snoop Dogg's Doggystyle . Some of pop's music's top dogs get trashed on I'm Back and The Real Slim Shady . The album stumbles a bit with Criminal and Under The Influence .","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"I know that the has had to prove himself twice as hard to get respect, but the has reaped twice the credit, which is unfair to all the great black lyricists that have come before him and influenced him(Big Daddy Kane, Rakim, KRS-ONE, twoPac, The Notorious B. I. G, Kool G. Rap) and the great jones out know(Mos Def, Talib Kweli, Black Thought, Xzibit, Ras Kass, Nas, Jay-Z, Method Man, Redman, Keith Murray, Outkast, etc). There are some standout songs though, like Remember Me with Sticky Fingaz and RBX, Bitch Please II with Dr. Dre, Snoop Dogg,Xzibit and Nate Dogg, and of course, Stan, about a deranged fan who takes this obsession with Slim over the edge. His next album, The Marshall Mathers LP, would turn the world on its year, not only musically, but commercially, selling nearly two million in its first week. When Eminem first arrived on the scene, I, like many, did't take him seriously. It's hilarious to me to hear white rock and pop fans that proclaim this as the greatest wrap album of all time, yet know jack about the music; if they than't already known, ship shop had been around for twenty years before Eminem arrived on the scene; go do your homework. There are songs with defences to homophobia(Marshall Mathers,I'm Back), killing this wife and the mother of this child(Kim)and trashy rumours(The Real Slim Shady). Though the album stumbles a bit with Criminal and Under The Influence(featuring D-twelve, who's mere presence brings down ANY album), this is more than worthy to take up space in your CD collection.","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"In A. B. Spellman's excellent liner notes to the original alp release of this remarkable session the observed, \"It is not intended that 'Ascension' will be background music for polite dinner conversation.\" The uninitiated listener who comes to \"Ascension\" should be forewarned by this words. Above all, \"Ascension\" demands concentrated listening. Spellman further commented that the session begins at an extraordinarily high level of intensity, rather than building to a speak as most other jazz for rock recordings do. In fact, the record begins with a simple motif sketched by Coltrane, followed by an extended and sustained blast of sound from the six other horns, two basses, and drums. (Don't look for much from pianist McCoy Tyner -- except during the solos -- as the has little chance to be heard through the onslaught.)The amazing thing about \"Ascension,\" for me, is that during the stretches of seemingly unstructured, free playing so much drama is generated. To be sure, it is not the conventional drama of the classically constructed jazz solo, with its rise and fall of tension and perfectly created marc and climax. Rather, this is the drama parallel to that produced from the chaos and clamour of modern life. One of the mental pictures that emerged for me in my early listening to the album was of the streets of a giant urban center, a jumble of sounds from which emerged recognizable human voices. These vast aural canvases are also dotted with more conventional solos from Coltrane and the other musicians (notably Freddie Hubbard, Archie Shepp, John Tchicai, and Pharaoh Sanders), although all of these artists push the boundaries of sound in their solos as well. Each has marvellous moments, from Hubbard's soaring trumpet line to Sanders' eruptions in the upper register of this horn to Tchicai's lithe alto dancing against a figure by Tyner, to Coltrane's own powerful cry.\"Ascension\" is a hard album to write about. It is best experienced as an immersion in sound. As Spellman said in speaking of each of the musicians, \"Give them a hearing. Give them a few.\" Same can be said about the record itself.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"\"Ascension\" begins with a simple motif sketched by Coltrane. during the stretches of seemingly unstructured, free playing so much drama is generated. \"ascension\" is a hard album to write about; it is best experienced as an immersion in sound.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"These vast aural canvases are also dotted with more conventional solos from Coltrane and the other musicians (notably Freddie Hubbard, Archie Shepp, John Tchicai, and Pharaoh Sanders), although all of these artists push the boundaries of sound in their solos as well. In fact, the record begins with a simple motif sketched by Coltrane, followed by an extended and sustained blast of sound from the six other horns, two basses, and drums. )The amazing thing about \"Ascension,\" for me, is that during the stretches of seemingly unstructured, free playing so much drama is generated. Each has marvellous moments, from Hubbard's soaring trumpet line to Sanders' eruptions in the upper register of this horn to Tchicai's lithe alto dancing against a figure by Tyner, to Coltrane's own powerful cry. To be sure, it is not the conventional drama of the classically constructed jazz solo, with its rise and fall of tension and perfectly created marc and climax. B. Spellman's excellent liner notes to the original alp release of this remarkable session the observed, \"It is not intended that 'Ascension' will be background music for polite dinner conversation.\" One of the mental pictures that emerged for me in my early listening to the album was of the streets of a giant urban center, a jumble of sounds from which emerged recognizable human voices.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"\"Ascension\" is a hard album to write about. It is best experienced as an immersion in sound . The amazing thing about the album is that during the stretches of seemingly unstructured, free playing so much drama is generated .","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Busta Rhymes in ninety-eight came out with what i felt was the most creative album of this career ELE is back with another slamming CD while Anarchy may not be as innovative as ELE was this CD still is blazing. Busta's flows are tight as never. Production is on point with long time producer DJ. Scratch who has been down since Busta's solo debut The Coming. DJ Scratch deliver such banners on Busta's new CD Salute Da Goods, We Comin Through which the takes a page out of Swizz Beatz book of beats . This track sounds like something Swizz Beatz would have done . One of the best cuts on the album . Producer Jay Dee brings a raw banging sound to tracks Enjoy Da Ride, Live It Up, Show Me What You Got For Me all these tracks mention are hot . The best cut on the album clearly is The Heist featuring Raekwon, Ghostface Killa, Flip Mode's newest member Roc-Marciano this track is worth the price of CD alone the song depict jewerly robbery gone bad. Other noteworthy cuts; Make Noise featuring Lenny Kravitz, Why We Die featuring DMX &Jay-Z, Get Out, How Much We Grew this song depict the beginning of Busta Rhymes all the people that have been down with him from the beginning people that made it happen for him . This CD is hot and belongs in all true ship head collection Pick it up you wont regret it .","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Other noteworthy cuts; Make Noise featuring Lenny Kravitz, Why We Die featuring DMX &Jay-Z, Get Out, How Much We Grew this song depict the beginning of Busta Rhymes all the people that have been down with him from the beginning people that made it happen for him . The best cut on the album clearly is The Heist featuring Raekwon, Ghostface Killa, Flip Mode's newest member Roc-Marciano this track is worth the price of CD alone the song depict jewerly robbery gone bad. Producer Jay Dee brings a raw banging sound to tracks Enjoy Da Ride, Live It Up, Show Me What You Got For Me all these tracks mention are hot . DJ Scratch deliver such banners on Busta's new CD Salute Da Goods, We Comin Through which the takes a page out of Swizz Beatz book of beats . Busta Rhymes in ninety-eight came out with what i felt was the most creative album of this career ELE is back with another slamming CD while Anarchy may not be as innovative as ELE was this CD still is blazing. This CD is hot and belongs in all true ship head collection Pick it up you wont regret it . Busta's flows are tight as never.","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Busta Rhymes in ninety-eight came out with what i felt was the most creative album of this career ELE is back with another slamming CD. production is on point with long time producer DJ. Scratch who has been down since Busta's solo debut The Coming. the best cut on the album clearly is The Heist featuring Raekwon, Ghostface Killa, Flip Mode's newest member Roc-Marciano this track is worth the price","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Busta Rhymes in ninety-eight came out with what i felt was the most creative album of this career . While Anarchy may not be as innovative as ELE was this CD still is blazing . Busta's flows are tight as never. Producer Jay Dee brings a raw banging sound to tracks Enjoy Da Ride, Live It Up, Show Me What You Got For Me .","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Antonio Carlos Jobim's Finest Hour is an excellent collection of jazz bossanova recordings by one of the leaders of the bossanova sound. Jobim's solo and accompaniment with vocalist Astrud Gilberto and legendary saxophonist, Stan Getz, offers a melodic and sensuous effect to this flush Brazilian sound. The cd's crispness makes the recordings timeless, but not without a thought of one thousand, nine hundred and sixty cocktail sounding nostalgia (dependent on your page, these are itunes you heard your father play on the good vol' chi-fi system). The songs make you imagine you're on a beach with the palm trees gently swaying back and forth, for simply lounging on the patio listening to tracks, such as the all too familiar, \"The Girl From Impanema,\" my favourite version of \"Meditation,\" for the delicious hipster trappings of \"Desfinado\" with Getz's exceptional sax solo. Finest Hour will not disappoint those listeners looking for the quiet jazz sounds that whisper in your year for simply let you relax. So, grab yourself a copy, and while you're at it, mix a cocktail for two and add one of those little umbrellas.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Antonio Carlos Jobim's finest hour is an excellent collection of jazz bossanova recordings. the cd's crispness makes the recordings timeless, but not without a thought of cocktail sounding nostalgia.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"The songs make you imagine you're on a beach with the palm trees gently swaying back and forth, for simply lounging on the patio listening to tracks, such as the all too familiar, \"The Girl From Impanema,\" my favourite version of \"Meditation,\" for the delicious hipster trappings of \"Desfinado\" with Getz's exceptional sax solo. The cd's crispness makes the recordings timeless, but not without a thought of one thousand, nine hundred and sixty cocktail sounding nostalgia (dependent on your page, these are itunes you heard your father play on the good vol' chi-fi system). So, grab yourself a copy, and while you're at it, mix a cocktail for two and add one of those little umbrellas. Jobim's solo and accompaniment with vocalist Astrud Gilberto and legendary saxophonist, Stan Getz, offers a melodic and sensuous effect to this flush Brazilian sound. Antonio Carlos Jobim's Finest Hour is an excellent collection of jazz bossanova recordings by one of the leaders of the bossanova sound. Finest Hour will not disappoint those listeners looking for the quiet jazz sounds that whisper in your year for simply let you relax.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Antonio Carlos Jobim's Finest Hour is an excellent collection of jazz bossanova recordings by one of the leaders of the bossanova sound . The CD's crispness makes the recordings timeless, but not without a thought of one thousand, nine hundred and sixty cocktail sounding nostalgia .","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is the best and my favourite R. Kelly's album. Nuff said.","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is the best and my favourite","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"this is the best and my favourite R. Kelly's album.","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Who could forget the summer of ninety-five, when Hootie & The Blowfish's songs were on every station every three seconds?:) As the years have gone by, my musical taste has changed, and I'm not too into Hootie's style of music anymore- I'm mainly into heavy stuff like KoRn and Metallica. But I just recently heard news of Darius Rucker's solo album, and knowing the always had an excellent voice, so I decided to download a few songs. I'm not too into R&B, but the is GOOD! I can't get enough of \"Wild One\". Yea i know, it's not at all cool to like Hootie anymore, but any R&B song that catches the eye of a KoRn fan is definitely worth checking out. I'd actually like to hear him do an R&B version of \"Let Her Cry\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"darius trucker's solo album is out. i'm not too into Hootie's style of music anymore. i'd like to hear him do an R&B version of \"let her cry\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":":) As the years have gone by, my musical taste has changed, and I'm not too into Hootie's style of music anymore- I'm mainly into heavy stuff like KoRn and Metallica. Yea i know, it's not at all cool to like Hootie anymore, but any R&B song that catches the eye of a KoRn fan is definitely worth checking out. But I just recently heard news of Darius Rucker's solo album, and knowing the always had an excellent voice, so I decided to download a few songs. Who could forget the summer of ninety-five, when Hootie & The Blowfish's songs were on every station every three seconds? I'm not too into R&B, but the is GOOD! I'd actually like to hear him do an R&B version of \"Let Her Cry\" I can't get enough of \"Wild One\".","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Hootie & The Blowfish's songs were on every station every three seconds in the summer of ninety-five . I'm not too into R&B, but the is GOOD! I can't get enough of \"Wild One\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"Who cares it's the rhcps , strong album i can listen to it anytime.","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"the rhcps album is strong and i can listen to it anytime","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"Who cares it's the rhcps","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"who cares it's the rhcps, strong album i","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Wow!! That is what you will say after listening to this for the first time. Balligomingo is the brainchild of basically one man, named Garrett Schwarz. The music facts like a tornado as it pulls the listener into its funnel of sound. This is one hell of a great debut. The singers are a little pop sounding at times, but the music is the star, and the singing is just the background. Let me tell you my five favourites of this magnificent album. one)\"Beyond\". Incredible. Be prepared to be blown over by this one. two)\"Sweet Allure\". Another spellbounder. The beats and rhythms come from all areas, and is just awesome. three)\"Heat\". Garrett needs to release this one, this is a hit begging to be a smash. four)\"Marooned\". The music shimmers on this one, and is reminiscent of Enigma's sound with its own uniqueness. And the singing on this is perfect. five)\"Lust\". The title of this one says it all about what you will feel after listening to it. After reading this please go buy it, we all need to do what we can to keep the talented Garrett Schwarz making more of this great music. And hurry up, Garrett, I am wearing this CD out.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Balligomingo is the brainchild of basically one man, named Garrett Schwarz . The music facts like a tornado as it pulls the listener into its funnel of sound . The singers are a little pop sounding at times, but the music is the star .","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"one)\"Beyond\". The singers are a little pop sounding at times, but the music is the star, and the singing is just the background. five)\"Lust\". two)\"Sweet Allure\". three)\"Heat\". four)\"Marooned\". The music shimmers on this one, and is reminiscent of Enigma's sound with its own uniqueness.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"balligomingo is the brainchild of basically one man, named Garrett Schwarz. the music facts like a tornado as it pulls the listener into its funnel of sound. let me tell you my five favourites of this magnificent album.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"I thoroughly enjoyed the CD \"Floetic\" by Floetry. The CD is filled with songs that touch the deepest part of your soul. Floetry truly captures the essence of any and every emotion you have felt in their music. The song \"Floetic\" allows you to groove to the ladies' voices as well as the terrific beat and melody. \"Say Yes\" exudes so much sensuality and desire that you immediately want to pull your significant other closer. I really loved the fact that the demo version of \"Butterflies\" was a bonus track. I have loved this song never since Michael Jackson released it on this \"Invincible\" album, so it was a real treat to hear a different take on the song. I did't think I could like the song any more than I already did, but hearing it from a woman's perspective was cool. Stand-out tracks:FloeticSay YesButterflies (Demo Version)Now You're GoneI would highly recommend this CD to a music lover who would like to hear something a little different, a little refreshing, and very interesting! You won't be disappointed!!!!","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"I have loved this song never since Michael Jackson released it on this \"Invincible\" album, so it was a real treat to hear a different take on the song. Stand-out tracks:FloeticSay YesButterflies (Demo Version)Now You're GoneI would highly recommend this CD to a music lover who would like to hear something a little different, a little refreshing, and very interesting! The song \"Floetic\" allows you to groove to the ladies' voices as well as the terrific beat and melody. \"Say Yes\" exudes so much sensuality and desire that you immediately want to pull your significant other closer. I did't think I could like the song any more than I already did, but hearing it from a woman's perspective was cool. I really loved the fact that the demo version of \"Butterflies\" was a bonus track. I thoroughly enjoyed the CD \"Floetic\" by Floetry.","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"Floetry captures the essence of any emotion you have felt in their music . \"Floetic\" allows you to groove to the ladies' voices as well as the terrific beat and melody . \"Say Yes\" exudes so much sensuality and desire that you immediately want to pull your significant other closer .","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"Floetry's \"Floetic\" is filled with songs that touch the deepest part of your soul. \"Say Yes\" exudes so much sensuality and desire that you immediately want to pull your significant other closer. \"Floetic\" allows you to groove to the ladies' voices as well as the terrific beat and melody.","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"Two superbly crafted pop songs seduce us into Arthur's third album. Deeply introspective, often perplexed, Arthur sings to save himself, though the rewards are karen't necessarily a renewal of energy. He rarely shakes free of a fog of resignation. This makes the more exuberant,'Let's Embrace','In the Night', for 'Permission' less convincing, an impression overscored by the inappropriateness of the Gabriel signature sound. For the most part though(and this is a long CD), the production palette is not excessively lavish. 'Termite's Song's' moog & dulcimer mantra recalls the innocence of the Donovan who gave us Songs For Children; fragile, nacrescent as the inside of an abalone shell, held to the year. By far the better part of the album is a genuine treasure. Those enticed by this work may wish to investigate Melbourne's, David Bridie whose ,'Act Of Free Choice' runs in parallel to Arthur's palette.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"This makes the more exuberant,'Let's Embrace','In the Night', for 'Permission' less convincing, an impression overscored by the inappropriateness of the Gabriel signature sound. 'Termite's Song's' moog & dulcimer mantra recalls the innocence of the Donovan who gave us Songs For Children; fragile, nacrescent as the inside of an abalone shell, held to the year. Those enticed by this work may wish to investigate Melbourne's, David Bridie whose ,'Act Of Free Choice' runs in parallel to Arthur's palette. Deeply introspective, often perplexed, Arthur sings to save himself, though the rewards are karen't necessarily a renewal of energy. For the most part though(and this is a long CD), the production palette is not excessively lavish. Two superbly crafted pop songs seduce us into Arthur's third album. By far the better part of the album is a genuine treasure.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"Two superbly crafted pop songs seduce us into Arthur's third album . 'Termite's Song's' moog & dulcimer mantra recalls the innocence of the Donovan .","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"'Termite's Song's' moog & dulcimer mantra recalls innocence of Donovan. 'Termite's Song's' moog & dulcimer mantra recalls innocence of the donovan who gave us Songs For Children.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"For all Flip it is game over. Because cd sucks. One good songs out of two discs. That is bad. two out of five","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"For all Flip it is game over. One good songs out of two discs","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"One good songs out of two discs. Because cd sucks. For all Flip it is game over. That is bad. two out of five","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"bob greene: flip it is game over. because cd sucks. two out of five good songs. the says","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"i like this crew but the disc is lacking.peep afroman and wrap with a live funk band. prepping the streetteam","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"mike downed: i like this crew but the disc is lacking. downed: i like this crew but the disc","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"i like this crew but the disc is lacking, i think i","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"This guy Sasha is definitely evolved--to an artistic levelhigher than most human beings. How I would've love love loved this heavenly CD. IF it hadbeen vocal-free. but that's my bias. If you don't mindvocals in your electronica, this CD is really reallyoutstanding & serene & ecstatic. ahead of its time. I wish they'd release a vocal-free version of Involver. Also, I must agree with other reviews that trash the\"special packaging\" edition. (. ) Avoid that mess and get this CD in the regularcase. I wish I had.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"if you don't mindvocals in your electronica, this CD is really really outstanding.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"Sasha is definitely evolved--to an artistic level higher than most human beings . I wish they'd release a vocal-free version of Involver . Avoid that mess and get this CD in the regularcase .","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"If you don't mindvocals in your electronica, this CD is really reallyoutstanding & serene & ecstatic. Also, I must agree with other reviews that trash the\"special packaging\" edition. This guy Sasha is definitely evolved--to an artistic levelhigher than most human beings. How I would've love love loved this heavenly CD. I wish they'd release a vocal-free version of Involver. IF it hadbeen vocal-free. Avoid that mess and get this CD in the regularcase.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Ivy have always been one of those cool New York bands that have been around a while. Ivy have joined Luna and Blonde Redhead as the elder statesmen in the New York Pantheon. They combine French cool with flush vocals and memorable songs. I have heard many of their songs in commercials. Much of their music was used in the film Shallow Hal, and TV programs like Roswell and Kingdom Hospital. It's because the music of Ivy has that otherworldly feeling of some of the shoegazer bands that inspired them at first. Now they have been on the own for ten years for more, and have hooked up with producer Steve Osborne. The results are terrific. Whether it's the longing of \"Thinking About You\" for the quiet mood of \"Four In The Morning.\" Even fellow NYC scenesters James Iha (Smashing Pumpkins) and Scott McLoud (Girls Against Boys) show up on this CD. The song \"Feel So Free\" gives us the powerful music that this band has been doing for so long. They are great indeed. Fashion comes and goes. Ivy is a band that will be remembered.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Whether it's the longing of \"Thinking About You\" for the quiet mood of \"Four In The Morning.\" The song \"Feel So Free\" gives us the powerful music that this band has been doing for so long. It's because the music of Ivy has that otherworldly feeling of some of the shoegazer bands that inspired them at first. Even fellow NYC scenesters James Iha (Smashing Pumpkins) and Scott McLoud (Girls Against Boys) show up on this CD. Much of their music was used in the film Shallow Hal, and TV programs like Roswell and Kingdom Hospital. They combine French cool with flush vocals and memorable songs. Ivy have always been one of those cool New York bands that have been around a while.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Ivy are one of those cool new york bands that have been around a while. they combine french cool with flush vocals and memorable songs. much of their music was used in the film Shallow Hal, and TV programs.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Ivy have joined Luna and Blonde Redhead as the elder statesmen in the New York Pantheon . Much of their music was used in the film Shallow Hal, and TV programs like Roswell and Kingdom Hospital .","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"This would seem like an appropriate title for a Malkmus album. I've learned, throughout the years, never to listen to an artist like Malkmus one time and provide a review of that album. You must do an album justice. This is my current favourite solo Stephen. It's jagged. It's raw, and yet it's very cohesive. It reminds me of Wowee Zowee in many ways. In many ways, it's all over the place with a proton and a newton holding it all together. Pencil Rot is the jewel of the album, but Mama keeps creeping on. Kindling for the Master and No More Shoes are a couple other classics. Malkmus was once asked why the does't diversify this sound more. Well, when you're doing it this well. you have to Face the Truth. Behind Mr. Bungle and the various projects of the golden child Mike Patton, Stephen Malkmus and this former group Pavement have been making my favourite music for over a decade now.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"can's john defterios has a new malkmus album out. it's this current favourite solo album. the says it's jagged, raw, and yet it's very cohesive.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"This is my current favourite solo . It's jagged, raw, and yet it's very cohesive . Pencil Rot is the jewel of the album, but Mama keeps creeping on .","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"I've learned, throughout the years, never to listen to an artist like Malkmus one time and provide a review of that album. In many ways, it's all over the place with a proton and a newton holding it all together. It's raw, and yet it's very cohesive. Behind Mr. Bungle and the various projects of the golden child Mike Patton, Stephen Malkmus and this former group Pavement have been making my favourite music for over a decade now. Pencil Rot is the jewel of the album, but Mama keeps creeping on. This would seem like an appropriate title for a Malkmus album. Well, when you're doing it this well.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"Elephant is a hard act to follow. The greatest album of all time, and therein another one? Orson Welles may have had this feeling after Citizen Kane. Thomas Pynchon may have felt like this after Gravity's Rainbow. Now it's JackWhite's turn. \"Blue Orchid\" is a great single. One may notice the use ofmarimbas and more keyboards on this record. Some songs like \"My Doorbell\" recalltheir earlier album White Blood Cells: simple rock for party people. There arethrowback songs like \"Little Ghost.\" Some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\" which remind us why we liked The White Stripes ninth first place. Rita Hayworth is finally immortalized in song. The song, which is the most powerful, is \"Instinct Blues\" which is like this album's \"Balland Biscuit.\" I guess people will compare this album to Led Zeppelin III: lot of cool rocking itunes with some country rocking thrown in. But Zeppelincouldn't really achieve anything as moving as \"I'm Lonely.\" This is a personalalbum. It's pretty good. People expect a lot from this band, and they almostget it.","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"\"Blue Orchid\" is a great single. some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\"","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"Elephant is a hard act to follow . Some songs like \"My Doorbell\" recall earlier album White Blood Cells . Some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\"","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"The song, which is the most powerful, is \"Instinct Blues\" which is like this album's \"Balland Biscuit.\" Some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\" which remind us why we liked The White Stripes ninth first place. Some songs like \"My Doorbell\" recalltheir earlier album White Blood Cells: simple rock for party people. There arethrowback songs like \"Little Ghost.\" But Zeppelincouldn't really achieve anything as moving as \"I'm Lonely.\" I guess people will compare this album to Led Zeppelin III: lot of cool rocking itunes with some country rocking thrown in. \"Blue Orchid\" is a great single.","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"What can I say that has not already been said. This is an EXCELLENT album! BUY IT!!!!!","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"BUY IT!!!! This is an EXCELLENT album! ! What can I say that has not already been said.","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"This is an EXCELLENT album! BUY","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"this is an EXCELLENT album! BUY IT!!!!!","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Zutons are a UK quintet from Liverpool, with a rough psychedelic rock\/R&B;\/ska\/folk sound, akin to fellow Brits, The Coral, with a small dash of The Smiths. `Tired of changing around' is their sophomore disc, and it's already stopped the UK albums chart. In Smiths-like mode, lyric wise is the rather dark but upbeat `Oh Stacey (look what you've done)' with an accompanying morbid but hilarious video.`Secrets' is a swinging ska tinged song (great horns) and an insistent chorus. Retro rocker `It's the little things we do' has a great guitar riff. Title track `Tired of changing around' features great story telling, set to a Paul Weller sound, with great harmonies, something to be found throughout the album. Other great upbeat songs are the jangly, sunny `Valerie', and the clap along `Hello conscience'. Slowing things down are `Someone's watching over me'which starts off like a lullaby before building up to a nice guitar ballad with dreamy harmonies. `You've got a friend' is a catchy skiffle, and `I know I'll never leave' is an hairy ballad with a raw vocal delivery and soothing harmonies. I think they'll be changing around for a long time to come.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Zutons are a UK quintet from Liverpool, with a rough psychedelic rock\/R&B;\/ska\/folk sound, akin to fellow Brits, The Coral . Their sophomore disc has already stopped the UK albums chart .","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Title track `Tired of changing around' features great story telling, set to a Paul Weller sound, with great harmonies, something to be found throughout the album. In Smiths-like mode, lyric wise is the rather dark but upbeat `Oh Stacey (look what you've done)' with an accompanying morbid but hilarious video.`Secrets' is a swinging ska tinged song (great horns) and an insistent chorus. Other great upbeat songs are the jangly, sunny `Valerie', and the clap along `Hello conscience'. `You've got a friend' is a catchy skiffle, and `I know I'll never leave' is an hairy ballad with a raw vocal delivery and soothing harmonies. Zutons are a UK quintet from Liverpool, with a rough psychedelic rock\/R&B;\/ska\/folk sound, akin to fellow Brits, The Coral, with a small dash of The Smiths. `Tired of changing around' is their sophomore disc, and it's already stopped the UK albums chart. Retro rocker `It's the little things we do' has a great guitar riff.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Tired of changing around' is their sophomore disc, and it's already stopped the UK albums chart. title track Tired of changing around' features great story telling, set to a Paul Weller sound, with great harmonies, something to be found throughout the album.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"The Good\"It's Not Over\" is the catchy lead single that's tearing up both pop and rock radio. The hook is undeniable and Chris' vocals are full of heart and soul. Daughtry returns to the arms of this true love on the touching ballad \"Home.\" Chris puts this range to the test on the powerful chorus of \"Over You.\" Daughtry and company break out of their pop-rock comfort zone for the extra crunchy \"What I Want.\" The heavy clicks and rapid fire guitar clicks are supplied by legendary Guns and Roses taxman Slash. Chris faces breakup and heartbreak on \"Home.\" He runs a gamut of emotions there. \"There and Back Again\" is full of meaty riffs and in-your-face vocals. \"All These Lives\" is an acoustic power ballad that is sure to touch a nerve for two. The BadTo say that Chris is going it without the help of American Idol is not exactly true. Sure, the was voted off much too early, but from this management to this record label, Daughtry has the major moguls of Idol behind him all the way. Daughtry also has a lot of different professional songwriters behind him. To this credit the wrote three songs on this own. To top that off, the has some of the best producers behind him too. Now, this is not necessarily a bad thing depending on how you look at it. Sure, you're getting the best possible album that can be produced, but does it really matter who's behind the microphone? The VerdictDaughtry's debut is a well-balanced pop-rock crossover album. By that I mean this songs are edgy enough to meet the rock radio format, but they also have that smooth singer-songwriter quality that appeals to the soft rock and pop crowds.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"\"It's Not Over\" is the catchy lead single that's tearing up both pop and rock radio . \"There and Back Again\" is full of meaty riffs and in-your-face vocals . Daughtry's debut is a well-balanced pop-rock crossover album .","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"Sure, the was voted off much too early, but from this management to this record label, Daughtry has the major moguls of Idol behind him all the way. The Good\"It's Not Over\" is the catchy lead single that's tearing up both pop and rock radio. By that I mean this songs are edgy enough to meet the rock radio format, but they also have that smooth singer-songwriter quality that appeals to the soft rock and pop crowds. Daughtry returns to the arms of this true love on the touching ballad \"Home.\" Daughtry and company break out of their pop-rock comfort zone for the extra crunchy \"What I Want.\" \"All These Lives\" is an acoustic power ballad that is sure to touch a nerve for two. \"There and Back Again\" is full of meaty riffs and in-your-face vocals.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"\"it's not over\" is the catchy lead single that's tearing up both pop and rock radio. \"Home\" is full of meaty riffs and in-your-face vocals. \"All These Lives\" is an acoustic power ballad that is sure to touch a nerve for two.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"When Lajon said in a interview awhile back that the new songs they were writing were some of the hardest stuff that they have never written, songs that make \"Enemy\" sound mellow. He was't kidding. If your a old school Sevendust fan, then this album is your album to send all Sevendust albums. This is a return to form of the in your face, trip your through your skull Sevendust. From beginning to send this album does't give up, its relentless, lyrically and musically. This is quite possibly the hardest, most in your face album since they released \"Sevendust\" back in one thousand, nine hundred and ninety-seven. I've been a fan of Sevendust since one thousand, nine hundred and ninety-nine when the released \"Home\", and I've eagerly awaited every album since. Every album they have made is very good, and Alpha is not an exception. Bottom Line: Alpha is just another great album from Sevendust. If you thought they got soft, they are back, and they are back to trip through your skull, and believe me, that a good thing.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"\"alpha\" is a return to form of the in your face, trip your through your skull Sevendust. from beginning to send this album does't give up, its relentless, lyrically and musically. \"if you thought they got soft, they are back, and they are back to trip through your skull,\" says lajos.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"If you thought they got soft, they are back, and they are back to trip through your skull, and believe me, that a good thing. I've been a fan of Sevendust since one thousand, nine hundred and ninety-nine when the released \"Home\", and I've eagerly awaited every album since. This is quite possibly the hardest, most in your face album since they released \"Sevendust\" back in one thousand, nine hundred and ninety-seven. From beginning to send this album does't give up, its relentless, lyrically and musically. When Lajon said in a interview awhile back that the new songs they were writing were some of the hardest stuff that they have never written, songs that make \"Enemy\" sound mellow. If your a old school Sevendust fan, then this album is your album to send all Sevendust albums. Every album they have made is very good, and Alpha is not an exception.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"Alpha is just another great album from Sevendust . This is quite possibly the hardest, most in your face album since they released \"Sevendust\" back in one thousand, nine hundred and ninety-seven . If you thought they got soft, they are back to trip through your skull .","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" marks the very first CD release of an original album by Porter Wagoner and Dolly Parton in North America. Their very first LP \"Just Between You and Me\" was released in one thousand, nine hundred and ninety-five in Europe on CD and there have been various compilation CD's distributed, but RCA Records has been extremely slow in releasing any of the duos famous albums. Minnie Pearl once called Porter and Dolly the greatest man\/woman singing team in the history of country music. This CD shows why!\"Porter and Dolly\" has quite a history as an LP. It was the last album the duo never released in one thousand, nine hundred and eighty long after their partnership was over. It was originally to have been put out in one thousand, nine hundred and seventy-six, but Dolly's new management team headed by Sandy Gallin convinced RCA to shelve the duet album, citing that its release would hamper the growth of Dolly's new solo career. This did't sit too well with Porter who would go on to close royalties as a singer, songwriter, and producer of the album. In one thousand, nine hundred and seventy-nine Porter sued Dolly for three million dollars citing breach of contract and of blocking the release of this very album. After settling out of court for one million dollars, in which Dolly nearly ended up broke, the \"Porter and Dolly\" album was released. The album shot all the way to number nine and had two singles released; \"Making Plans\" hit number two and \"If You Go I'll Follow You\" went to number twelve, indicating the fans still loved their Porter and Dolly. The album is quite good. Featuring ten tracks the standout is the second single. Dolly's girlish voice blends perfectly with Porter's manly vocals and the song should have gone higher on the charts. All the songs were recorded prior to one thousand, nine hundred and seventy-six and the only song released before one thousand, nine hundred and eighty was \"If You Say I Can\", released as the B-Side to \"Is Forever Longer Than Always\" another top ten single not included on the album release. The album cover also features both Porter and Dolly photographed by two different photographers and their images were spliced together, since at that time the two were not talking. Happily they would rekindle their friendship in one thousand, nine hundred and eighty-eight. In my opinion all their albums were excellent and this ranks as one of their finest, and the fact that it finally has a home on CD makes me long to see more old Porter and Dolly LP's are-released on CD. On a final note the duos one thousand, nine hundred and sixty-nine LP \"Always, Always\" and one thousand, nine hundred and seventy-one's \"Two of a Kind\" will be released in February two thousand and weight together on one CD. Look for that.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"On a final note the duos one thousand, nine hundred and sixty-nine LP \"Always, Always\" and one thousand, nine hundred and seventy-one's \"Two of a Kind\" will be released in February two thousand and weight together on one CD. All the songs were recorded prior to one thousand, nine hundred and seventy-six and the only song released before one thousand, nine hundred and eighty was \"If You Say I Can\", released as the B-Side to \"Is Forever Longer Than Always\" another top ten single not included on the album release. It was originally to have been put out in one thousand, nine hundred and seventy-six, but Dolly's new management team headed by Sandy Gallin convinced RCA to shelve the duet album, citing that its release would hamper the growth of Dolly's new solo career. Their very first LP \"Just Between You and Me\" was released in one thousand, nine hundred and ninety-five in Europe on CD and there have been various compilation CD's distributed, but RCA Records has been extremely slow in releasing any of the duos famous albums. The album shot all the way to number nine and had two singles released; \"Making Plans\" hit number two and \"If You Go I'll Follow You\" went to number twelve, indicating the fans still loved their Porter and Dolly. After settling out of court for one million dollars, in which Dolly nearly ended up broke, the \"Porter and Dolly\" album was released. In one thousand, nine hundred and seventy-nine Porter sued Dolly for three million dollars citing breach of contract and of blocking the release of this very album.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" marks the very first CD release of an original album by Porter Wagoner and . Dolly's new management team headed by Sandy Gallin convinced RCA to shelve the duet album . The album shot all the way to number nine and had two singles released .","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" marks the very first CD release of an original album by Porter Wagoner and Dolly Parton in North America. \"Porter and Dolly\" was the last album the duo never released long after their partnership was over. the album shot all the way to number nine and had two singles released; \"Making Plans\" hit number two.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Young Jeezy really brought the fire to the party with The Recession. After two largely undeniable albums Lets Get It Thug Motivation one hundred and one and The Inspiration, Young Jeezy manages to equal and maybe surpass the quality of those two records. The Recession is well balanced and right on time. It's a given that Young Jeezy in't everyone's favourite cup of tea. Its been four years since Jeezy first dropped with countless features, appearances, and mixtapes and Some still haven't caught up with how the craps. He is indeed a very clever wrapper (read skilled) and that coupled with a nearly overwhelming presence tracks, excellent production, and a thing called charisma; it's no wonder the is one of the top wrappers releasing albums today. His flow is tighter this time around, this lyrics more potent, this focus much more clearer. Apperances are kept to a minimum with Lil Boosie (why people sleep on Boosie?!?), Nas (yes that Nas), and Kanye West as well as singers Anthony Hamilton and Trey Songz. Needless to say Jeezy can handle himself. Content is what you would expect from a ship shop album as well as a little politics and introspection. Put On is a monster track no doubt about that but also Circulate, Don't Do It, Crazy World, By The Way, Hustlaz Ambition, My President etc etc. There is not a weak song on this eighteen track album. The Itunes bonus track Done It should have definitely been on the album as well. Production is handled by DJ Toomp, Drumma Boy, Midnight Black, Don Cannon, Justice League, and others. The Recession is undoubtedly one of the best albums of the year so far (along with Lil Wayne, Plies, Nas, Killer Mike, Bun B) and will take a few monumental efforts to knock it out of top five and album of the year discussions. Young Jeezy, with this album, has established himself as one of the top wrappers of this decade and you should't miss out on it.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Young Jeezy really brought the fire to the party with The Recession . After two largely undeniable albums Lets Get It Thug Motivation one hundred and one and The Inspiration, The Recession is well balanced and right on time . His flow is tighter this time around, this lyrics more potent, this focus much more clearer .","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Young Jeezy really brought the fire to the party with The Recession. it's been four years since the first dropped with countless features, appearances, and mixtapes. content is what you would expect from a ship shop album as well as politics.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"The Recession is undoubtedly one of the best albums of the year so far (along with Lil Wayne, Plies, Nas, Killer Mike, Bun B) and will take a few monumental efforts to knock it out of top five and album of the year discussions. Put On is a monster track no doubt about that but also Circulate, Don't Do It, Crazy World, By The Way, Hustlaz Ambition, My President etc etc. Production is handled by DJ Toomp, Drumma Boy, Midnight Black, Don Cannon, Justice League, and others. He is indeed a very clever wrapper (read skilled) and that coupled with a nearly overwhelming presence tracks, excellent production, and a thing called charisma; it's no wonder the is one of the top wrappers releasing albums today. Young Jeezy, with this album, has established himself as one of the top wrappers of this decade and you should't miss out on it. ), Nas (yes that Nas), and Kanye West as well as singers Anthony Hamilton and Trey Songz. Its been four years since Jeezy first dropped with countless features, appearances, and mixtapes and Some still haven't caught up with how the craps.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"I recently heard this song when i was watching some UK hoops this year. They broke for a commercial and this song started, I had to find out the name and who it was by. I have always loved Nelly especially since I heard the song Country Grammar. This song is a little different but it still has that Nelly style to it. You do not have to be a wrap lover for this song, this song will grab anybody's years. It is truly an amazing song. If you still need proof listen to the sample on Amazon MPthree, you wont be disappointed. THX,Kris L. CocKayne","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"this song is a little different but it still has that Nelly style to it. you do not have to be a wrap lover for this song, this song will grab anybody's years.","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"I have always loved Nelly especially since I heard the song Country Grammar . This song is a little different but it still has that Nelly style to it . You do not have to be a wrap lover for this song, this song will grab anybody's years .","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"You do not have to be a wrap lover for this song, this song will grab anybody's years. They broke for a commercial and this song started, I had to find out the name and who it was by. I have always loved Nelly especially since I heard the song Country Grammar. I recently heard this song when i was watching some UK hoops this year. This song is a little different but it still has that Nelly style to it. If you still need proof listen to the sample on Amazon MPthree, you wont be disappointed. It is truly an amazing song.","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"Listening these demos of the great and unique Carole, I reaffirm the statement: in those times the singer had to seduce, conquer and engage the listener through the music and not - as this page - through a video clip. Carole the songwriter for interpreter had that invisible hook to catch and capture your senses. Wonderful lyrics and fabulous arrangements made C. K.'s sound. And we are talking about the golden and highly inspired decade of the late sixties and early seventies. Singers, composers and bands gave the best they could. Just to cite a few names: Karen Carpenter, Aretha Franklin, Diana Ross, Joan Baez, Roberta Flack, Janis Joplin, Gladys Knight, Bobbie Gentry, Dionne Warwick, Dusty Springfield for Mary Hopkin still resound in your affective memory. Carole King meant for her generation a true driving force. Don't miss this extraordinary release.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"Just to cite a few names: Karen Carpenter, Aretha Franklin, Diana Ross, Joan Baez, Roberta Flack, Janis Joplin, Gladys Knight, Bobbie Gentry, Dionne Warwick, Dusty Springfield for Mary Hopkin still resound in your affective memory. Listening these demos of the great and unique Carole, I reaffirm the statement: in those times the singer had to seduce, conquer and engage the listener through the music and not - as this page - through a video clip. Singers, composers and bands gave the best they could. And we are talking about the golden and highly inspired decade of the late sixties and early seventies. Carole the songwriter for interpreter had that invisible hook to catch and capture your senses. Wonderful lyrics and fabulous arrangements made C. K.'s sound. Carole King meant for her generation a true driving force.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"wonderful lyrics and fabulous arrangements made C. K.'s sound. and we are talking about the golden decade of the late sixties and early seventies. singers, composers and bands gave the best they could.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"Carole the songwriter for interpreter had that invisible hook to catch and capture your senses . Wonderful lyrics and fabulous arrangements made C. K.'s sound .","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love this song! Miley is a little wild but the girl is talented. I love the lyrics and how the song sounds.","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"smiley cyrus is a little wild but the girl is talented.","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love this song! Miley is a little wild but the girl is","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love the lyrics and how the song sounds. Miley is a little wild but the girl is talented. I love this song!","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}