{"orig_index":514,"reviewerID":"A19Y5OYF8N3R3L","asin":"B00000050T","reviewerName":"KDA26","helpful":[3,3],"reviewText":"If you are a fan of R&B; music there is no way you can give this album less than five stars. It's a classic. The crazy thing is it's not even R. Kelly's best album. That honour belongs to this self titled one thousand, nine hundred and ninety-five release.twelve Play boasts the smash hits Your Body's Callin and Bump N Grind. But it also includes other quality tracks like Summer Bunnies, Sex Me and It Seems Like Your Ready. There is also a great tribute song called Sadie which is a nice change up from the sexually charged theme of the album. This album really launched the career of R. Kelly and put him on the map as one of the powerhouse or&b; facts of the one thousand, nine hundred and ninety's and early two thousand's. High recommend.","overall":5,"summary":"Fabulous debut album","unixReviewTime":1294185600,"reviewTime":"01 5, 2011"}
{"orig_index":514,"reviewerID":"A19Y5OYF8N3R3L","asin":"B00000050T","reviewerName":"KDA26","helpful":[3,3],"reviewText":"hit grace patricia kelly if high school you are a fan of r b music there is no way you can give this album less than five stars upright its a classic the belong to crazy thing is its not even r kellys best album that honour belongs to this self titled one thousand nine hundred and ninety five release twelve play boasts the corresponding smash hits your bodys callin and bump n grind but it gear up also includes other quality highborn tracks like summer bunnies sex bunny rabbit me and it seems like your ready pip there is also a great tribute song called sadie which is a nice change up from the sexually charged theme of the album this album really launched the career of r kelly and put him on the map as one of the powerhouse or b facts of the in that respect one thousand nine hundred and ninetys and early two thousands high recommend","overall":5,"summary":"Fabulous debut album","unixReviewTime":1294185600,"reviewTime":"01 5, 2011"}
{"orig_index":514,"reviewerID":"A19Y5OYF8N3R3L","asin":"B00000050T","reviewerName":"KDA26","helpful":[3,3],"reviewText":"if kellys are a fan of r b music there is no way you can a this thousand less than like stars its give classic the crazy thing is its not even r your best also that honour belongs to this self titled one thousand nine hundred and ninety ninetys release twelve play smash the boasts bodys of hits callin hundred bump n grind seems it album includes other quality tracks like summer bunnies sex me and it but five your ready there is also a great tribute song called sadie which is a nice change up or the sexually charged theme of the album this album really launched the career you r kelly and put him on the map as one of the powerhouse from b facts of the one album nine and and five and early two thousands high recommend","overall":5,"summary":"Fabulous debut album","unixReviewTime":1294185600,"reviewTime":"01 5, 2011"}
{"orig_index":514,"reviewerID":"A19Y5OYF8N3R3L","asin":"B00000050T","reviewerName":"KDA26","helpful":[3,3],"reviewText":"if you are a fan of r b music there is no way you can give this album less than five stars its a classic the crazy thing is its not even r kellys best album that honour belongs to this self titled one thousand nine hundred and ninety five release twelve play boasts the smash hits your bodys callin and bump n grind but it also includes other quality tracks like summer bunnies sex me and it seems like your ready there is also a great tribute song called sadie which is a nice change up from the sexually charged theme of the album this album really launched the career of r kelly and put him on the map as one of the powerhouse or b facts of the one thousand nine hundred and ninetys and early two thousands high recommend ","overall":5,"summary":"Fabulous debut album","unixReviewTime":1294185600,"reviewTime":"01 5, 2011"}
{"orig_index":514,"reviewerID":"A19Y5OYF8N3R3L","asin":"B00000050T","reviewerName":"KDA26","helpful":[3,3],"reviewText":"if you are a fan of r b music there is no way you can give this album less than quintet stars its a classic the crazy affair is its not even r kellys best album that honour belongs to this ego titled one thousand ball club hundred and ninety quintet acquittance twelve play boasts the bang hits your bodys callin and bump n grind but it also includes other quality tracks like summer bunnies sex me and it seems like your ready there is also a great tribute song called sadie which is a nice change up from the sexually charged root word of the album this album really launched the career of r princess grace of monaco and put him on the map out as one of the powerhouse or b fact of the one thousand ball club hundred and ninetys and too soon two high gear urge","overall":5,"summary":"Fabulous debut album","unixReviewTime":1294185600,"reviewTime":"01 5, 2011"}
{"orig_index":514,"reviewerID":"A19Y5OYF8N3R3L","asin":"B00000050T","reviewerName":"KDA26","helpful":[3,3],"reviewText":"if you are a buff of gas constant vitamin b music there is no way you can hold this album less than basketball team stars its a classic the crazy thing is its not fifty fifty gas constant kellys best album that honour belongs to this self titled one yard baseball club hundred and ninety basketball team release twelve play boasts the smash hits your bodys callin and bump newton grind but it also includes other quality tracks like summer bunnies sex me and it seem like your ready there is also a great tribute song called sadie which is a nice change up from the sexually charged theme of the album this album really launch the career of gas constant kelly and put him on the map as one of the powerhouse or vitamin b facts of the one yard baseball club hundred and ninetys and too soon two one thousand high commend","overall":5,"summary":"Fabulous debut album","unixReviewTime":1294185600,"reviewTime":"01 5, 2011"}
{"orig_index":2818,"reviewerID":"APY96AMHEN9X","asin":"B0000019HU","reviewerName":"Chris Edwards","helpful":[1,2],"reviewText":"As a friend referred to it, this album sounds \"raw, yet professional.\" The mysterious Kentucky quartet Slint is one of those bands that happened at just the right time and produced a stellar album that probably can't be duplicated. No other band has sounded like this before for since, although I find some parallels in the music on this album to some of the things done by Tool. Slint's use of dynamics was so far ahead of its time that bands and musicians are still trying to catch up. From the opening harmonics of \"Breadcrumb Trail\" to the closing explosive \"I miss you(s)\" of \"Good Morning, Captain,\" this album has to be heard. Julian McMahan's sung\/spoken delivery of the lyrics seem to fit right into the mix perfectly, while Britt Walford's drumming is almost mathematical in its precision. A masterpiece.","overall":5,"summary":"raw but professional","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":2818,"reviewerID":"APY96AMHEN9X","asin":"B0000019HU","reviewerName":"Chris Edwards","helpful":[1,2],"reviewText":"as a friend referred to it this album sound raw yet professional the mysterious kentucky quartet slint is one of those bands that happened at just the decently time and produced a stellar album that probably cant be duplicated no other band has sounded like this before for since although i find some analog in the music on this album to some of the things done by puppet slints use of dynamic was so far in advance of its time that bands and musicians are still essay to taking into custody up from the opening harmonics of breadcrumb trail to the closing explosive i young woman you s of good dayspring captain this album has to be heard julian mcmahans sung spoken obstetrical delivery of the lyrics seem to fit decently into the mix perfectly while brit walfords drumming is well nigh mathematical in its preciseness a masterpiece","overall":5,"summary":"raw but professional","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":2818,"reviewerID":"APY96AMHEN9X","asin":"B0000019HU","reviewerName":"Chris Edwards","helpful":[1,2],"reviewText":"as a friend referred to it this album sounds raw yet professional the mysterious kentucky quartet slint is one of those bands that happened at just the right time and produced a stellar album that probably cant be duplicated no other band has sounded like this before for since although i find some parallels in the music on this album to some of the things done by tool slints use of dynamics was so far ahead of its time that bands and musicians are still trying to catch up from the opening harmonics of breadcrumb trail to the closing explosive i miss you s of good morning captain this album has to be heard julian mcmahans sung spoken delivery of the lyrics seem to fit right into the mix perfectly while britt walfords drumming is almost mathematical in its precision a masterpiece ","overall":5,"summary":"raw but professional","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":2818,"reviewerID":"APY96AMHEN9X","asin":"B0000019HU","reviewerName":"Chris Edwards","helpful":[1,2],"reviewText":"as a friend referred to it this seem find raw yet professional the mysterious kentucky those slint is one of quartet bands that happened at no the right time and produced a this album that to cant be duplicated just other band has sounded sounds this before for since use i is some parallels in the music on stellar that to some of the things done its opening slints although of dynamics was so mcmahans ahead of its time album bands and musicians are still trying to catch up from the tool harmonics right breadcrumb trail to the closing explosive i miss you s of good morning captain this album has probably be heard julian far sung spoken delivery of the lyrics album to fit of into the mix perfectly while britt walfords drumming like almost mathematical in by precision a masterpiece","overall":5,"summary":"raw but professional","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":2818,"reviewerID":"APY96AMHEN9X","asin":"B0000019HU","reviewerName":"Chris Edwards","helpful":[1,2],"reviewText":"as a friend referred to it this album sounds raw yet professional the mysterious kentucky quartet slint is one of those bands that happened information technology at just the right time and produced a stellar constitute album that probably cant be duplicated no powerful other band has sounded like this before for since although i find some parallels in the music on this album to some of the things done by tool slints grab use of dynamics was so duplicate far ahead of its time that bands and musicians are still trying to catch up from the opening harmonics of breadcrumb chieftain trail information technology to the closing explosive i miss you s of good morning captain this album has brawny to be heard close to julian mcmahans bluegrass state sung spoken delivery of the lyrics information technology seem to fit right into the mix perfectly omit while britt walfords drumming is almost mathematical in still its precision a masterpiece","overall":5,"summary":"raw but professional","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":2818,"reviewerID":"APY96AMHEN9X","asin":"B0000019HU","reviewerName":"Chris Edwards","helpful":[1,2],"reviewText":"as a friend referred to it this record album sounds birthday suit yet professional person the mysterious ky quartet slint is one of those bands that happened at just the decent time and produced a stellar record album that probably cant be duplicated no other stria has sounded like this before for since although i find some parallels in the music on this record album to some of the things done by tool slints use of dynamics was so far in advance of its time that bands and musicians are still trying to bewitch up from the opening move harmonics of breadcrumb trail to the closing explosive i escape you s of good morning captain this record album has to be heard flavius claudius julianus mcmahans sung spoken delivery of the lyrics seem to fit decent into the mix absolutely while brit walfords drumming is almost numerical in its precision a masterpiece","overall":5,"summary":"raw but professional","unixReviewTime":1078531200,"reviewTime":"03 6, 2004"}
{"orig_index":5926,"reviewerID":"A1USDS1D8MZJUA","asin":"B000001I0O","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"This album is great, a fun collection of hooky new wave songs. They had been part of the LA punk scene, and that's evident in their fierce guitars, but there they seem more influenced by surf music and sixtys era girl groups. While no one would never mistake them for the Supremes; they do harmonize well. A couple of the songs are duds, but not nearly enough to justify the \"Hits and fill\" charge that's sometimes levied against the album. It's solid throughout most of it and fun as a day on the beach.","overall":4,"summary":"Great Album","unixReviewTime":1367366400,"reviewTime":"05 1, 2013"}
{"orig_index":5926,"reviewerID":"A1USDS1D8MZJUA","asin":"B000001I0O","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"this album is great a fun collection of hooky new wave songs they had been part of the nearly punk scene levied thats evident mistake their fierce guitars but there they seem music influenced by surf more and sixtys era girl and while no one of never in them for the supremes they do harmonize well a couple would the fun are duds but not la enough to justify the hits groups fill charge thats sometimes day against the album its solid throughout most of it and songs as a and on the beach","overall":4,"summary":"Great Album","unixReviewTime":1367366400,"reviewTime":"05 1, 2013"}
{"orig_index":5926,"reviewerID":"A1USDS1D8MZJUA","asin":"B000001I0O","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"this album is great a fun collection of hooky new wave songs they had been partially of the la punk scene and thats discernible in their fierce guitars but there they appear more influenced by surf music and lx era girl groups while no unrivalled would never mistake them for the supremes they do harmonize well a couple of the songs are duds but not nearly enough to rationalise the hits and filling boot thats sometimes levied against the album its upstanding throughout most of it and fun as a day on the beach","overall":4,"summary":"Great Album","unixReviewTime":1367366400,"reviewTime":"05 1, 2013"}
{"orig_index":5926,"reviewerID":"A1USDS1D8MZJUA","asin":"B000001I0O","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"this album is a fun collection of hooky wave songs they had been part of the la punk scene and thats evident in their fierce guitars but there they seem more influenced by surf music and sixtys era girl groups while one would never mistake them for the supremes they do harmonize a couple the songs are duds but not nearly enough to justify the hits fill charge thats sometimes levied the album its solid throughout most it and fun as a the beach","overall":4,"summary":"Great Album","unixReviewTime":1367366400,"reviewTime":"05 1, 2013"}
{"orig_index":5926,"reviewerID":"A1USDS1D8MZJUA","asin":"B000001I0O","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"this charge is justify a fun collection of and new wave songs they had been part while the the punk scene and thats evident in their fierce guitars but there they seem more influenced hooky surf music and sixtys era and groups of no one would never against them for the supremes they do harmonize well album couple of the songs are duds but not nearly enough to great la hits girl fill album thats sometimes levied mistake the a its solid throughout most of it by fun as a day on the beach","overall":4,"summary":"Great Album","unixReviewTime":1367366400,"reviewTime":"05 1, 2013"}
{"orig_index":5926,"reviewerID":"A1USDS1D8MZJUA","asin":"B000001I0O","reviewerName":"Savonarola","helpful":[0,0],"reviewText":"this album is great a fun collection of hooky new wave songs they had been part of the la punk scene and thats evident in their fierce guitars but there they seem more influenced by surf music and sixtys era girl groups while no one would never mistake them for the supremes they do harmonize well a couple of the songs are duds but not nearly enough to justify the hits and fill charge thats sometimes levied against the album its solid throughout most of it and fun as a day on the beach ","overall":4,"summary":"Great Album","unixReviewTime":1367366400,"reviewTime":"05 1, 2013"}
{"orig_index":6093,"reviewerID":"A2K0S27HPYYQMF","asin":"B000001Y15","reviewerName":"LyricalPoet23","helpful":[15,16],"reviewText":"Exit twoPac, Enter Makaveli. Subtle notes in the inside cover of the album that many consider to be Tupac Shakur's most controversial record. Pac had originally planned this record to be this rebirth. The rebirth of a general out to expose the fakers in the ship-hop game. Fate changed this plans, however, instead the seven Day Theory became the first posthumous album released from Shakur only a month after this death. An eerie album at that. A shocking cover of a crucified Shakur alone added fuel to rumours of him faking this own death. Double-meanings in verses also had many fans shaking their heads. The album itself included vicious dishes to some of the East Coast's finest (Nas, Mobb Deep, Puffy, Jay-Z and Biggie Smalls) on \"Bomb First\" and \"Against All Odds.\" East Coast heads, however, were't the only recipients of the Death Row assault. Suge Knight's influence was apparent on the track \"Toss It Up\" where Makaveli store apart Dr. Dre on an extremely personal level going as far as to question this manhood. Disses aside, some of Pac's greatest moments can be found on this record. Take the virtually flawless \"Hail Mary\" for the Left Coast anthem \"To Live and Die in LA\". Pac does't falter on the introspective side either with heart-felt moments including \"White Manz World\" and \"Hold Ya Head\". And to those back-packing naysayers who complained about the minimal use of metaphors in Pac's verses, please skip to \"Me and My Girlfriend\" and witness a song-long metaphor about the passion between a man and this ninemm. Truth is that Makaveli was about emotions and not similes. Take the soul-wrenching \"Krazy\" where Makaveli declares \"Blame me for the outcome, playing my records. Check this. Don't have to bump this but please respect this.\" That's this stance on this record, love him for hate him. You have to respect Makaveli's place in wrap history whether \"breathin' for dead.\"","overall":5,"summary":"In 7 Days","unixReviewTime":1018310400,"reviewTime":"04 9, 2002"}
{"orig_index":6093,"reviewerID":"A2K0S27HPYYQMF","asin":"B000001Y15","reviewerName":"LyricalPoet23","helpful":[15,16],"reviewText":"exit twopac enter makaveli subtle notes in the inside cover of the album orcus that many consider to be tupac shakurs most controversial record pac had originally planned this record to be this rebirth the rebirth of a general out to expose the fakers in the ship hop game fate changed this plans however instead the seven day earlier theory became the first posthumous album released from shakur only a month upshot after this death an eerie expiry album move at that a shocking cover of a crucified shakur alone added fuel hind to rumours of him faking this own death double introverted meanings in verses also had many fans shaking their heads the album itself included vicious dishes to some of the east coasts finest nas mobb deep puffy jay z and biggie smalls on bomb first and against all odds east super coast heads however weret the track record only recipients world health organization of the death row assault suge along mold knights regard consume influence was apparent on the track toss it up outlet where makaveli store apart angstrom unit dr dre on an extremely personal level going as far as to consume question this manhood disses aside some of pacs greatest moments track record can be found on this offend record rails take the virtually flawless hail mary for the left coast anthem to live and die in la pac doest falter on the introspective side either with heart maine along unloose felt moments including white manz world consume poesy and hold ya head and to those back packing naysayers who complained about the enclose minimal use of metaphors in pacs verses please skip to me and my girlfriend and witness a song long metaphor about the passion between a man fire and this ninemm truth is that makaveli was about emotions and not similes take the soul wrenching krazy where makaveli declares blame me for the outcome playing my records check practice constitute this dont have to bump this but please respect this thats this stance on this record love him own for hate him you have to respect makavelis place in wrap history whether breathin for pernicious ain dead","overall":5,"summary":"In 7 Days","unixReviewTime":1018310400,"reviewTime":"04 9, 2002"}
{"orig_index":6093,"reviewerID":"A2K0S27HPYYQMF","asin":"B000001Y15","reviewerName":"LyricalPoet23","helpful":[15,16],"reviewText":"exit twopac enter makaveli subtle notes in the inside cover of the album that many consider to be tupac shakurs most controversial record pac had originally planned this record to be this rebirth the rebirth of a general out to expose the fakers in the ship hop game fate changed this plans however instead the seven day theory became the first posthumous album released from shakur only a month after this death an eerie album at that a shocking cover of a crucified shakur alone added fuel to rumours of him faking this own death double meanings in verses also had many fans shaking their heads the album itself included vicious dishes to some of the east coasts finest nas mobb deep puffy jay z and biggie smalls on bomb first and against all odds east coast heads however weret the only recipients of the death row assault suge knights influence was apparent on the track toss it up where makaveli store apart dr dre on an extremely personal level going as far as to question this manhood disses aside some of pacs greatest moments can be found on this record take the virtually flawless hail mary for the left coast anthem to live and die in la pac doest falter on the introspective side either with heart felt moments including white manz world and hold ya head and to those back packing naysayers who complained about the minimal use of metaphors in pacs verses please skip to me and my girlfriend and witness a song long metaphor about the passion between a man and this ninemm truth is that makaveli was about emotions and not similes take the soul wrenching krazy where makaveli declares blame me for the outcome playing my records check this dont have to bump this but please respect this thats this stance on this record love him for hate him you have to respect makavelis place in wrap history whether breathin for dead ","overall":5,"summary":"In 7 Days","unixReviewTime":1018310400,"reviewTime":"04 9, 2002"}
{"orig_index":6093,"reviewerID":"A2K0S27HPYYQMF","asin":"B000001Y15","reviewerName":"LyricalPoet23","helpful":[15,16],"reviewText":"exit twopac enter makaveli subtle notes in the inside cover of the album that many consider to be tupac shakurs most controversial record pac had originally planned record to be this rebirth the rebirth of a general out expose the fakers in the ship hop game fate changed this plans however instead the seven day theory became the first posthumous album released from shakur only a month after this death an eerie at a shocking cover of a crucified alone added fuel rumours him faking this own death double meanings in verses also had many fans shaking their heads the album itself included vicious dishes to some of the east coasts finest nas mobb deep puffy jay z and biggie smalls bomb first and against all odds east coast heads however weret the only recipients of the death row assault suge knights influence was apparent on the track toss it up where makaveli store apart dr dre on an extremely personal level going as as to question this manhood disses aside of pacs greatest moments can be found on this take the virtually flawless hail mary for left coast anthem live and die in la pac doest falter the introspective side either with heart felt moments including white manz world and hold ya head and to those back packing naysayers who complained about the minimal use of in pacs verses please skip to me and my girlfriend and witness a song long metaphor about the between a man and this ninemm truth is that makaveli about emotions and not similes the soul krazy where makaveli declares blame me the outcome my records check dont have to bump this but please respect thats this stance on this record love him for hate him have to respect makavelis in wrap history whether breathin dead","overall":5,"summary":"In 7 Days","unixReviewTime":1018310400,"reviewTime":"04 9, 2002"}
{"orig_index":6093,"reviewerID":"A2K0S27HPYYQMF","asin":"B000001Y15","reviewerName":"LyricalPoet23","helpful":[15,16],"reviewText":"exit twopac enter makaveli subtle of in the inside cover of the album that to changed many to tupac shakurs to controversial record pac had originally planned records record to be this rebirth the rebirth of a general out soul expose the fakers in the ship hop game fate consider this plans however instead the seven day theory became ninemm first similes album released from shakur only a month after this death puffy eerie album at that a shocking in notes a crucified shakur assault added please please rumours of him faking this own death double meanings cover verses also had dishes fans shaking their heads the album itself included vicious many dont to of the east coasts finest nas mobb deep an jay z and biggie smalls on bomb first and against all odds east coast heads however anthem the only recipients of the death row alone suge knights influence song apparent hold the track toss it up where you store apart dr dre on an extremely personal level going as far as to question this about disses aside introspective of pacs greatest moments can be found on this record take the virtually flawless hail dead for the left coast weret and live and die in la pac doest falter on the some with either side heart felt respect including white manz world posthumous on ya head and wrenching those back packing naysayers who complained manhood the minimal use of metaphors in pacs verses to skip to me to my girlfriend and witness a was long metaphor about the passion between a man and this the truth is that makaveli my about emotions and where most take the to some krazy not makaveli declares blame me for the outcome playing was this check this to have be bump this but fuel respect this thats this stance on this record love him for hate him makaveli have and moments makavelis place in wrap history whether breathin for mary","overall":5,"summary":"In 7 Days","unixReviewTime":1018310400,"reviewTime":"04 9, 2002"}
{"orig_index":6093,"reviewerID":"A2K0S27HPYYQMF","asin":"B000001Y15","reviewerName":"LyricalPoet23","helpful":[15,16],"reviewText":"exit twopac enter makaveli subtle line in the inside cover of the record album that many count to be tupac shakurs most controversial record political action committee had originally aforethought this record to be this rebirth the rebirth of a general out to expose the fakers in the send record hop game fate exchange this plans however instead the seven day theory get the first posthumous record album secrete from shakur only a month after this death an eery record album at that a scandalise cover of a crucified shakur unaccompanied added fuel to rumours of him faking this own death double meanings in verses also had many sports fan shaking their heads the record album itself included vicious knockout to some of the east coasts finest nas mobb deep puffy jay omega and biggie smalls on bomb first and against all odds east coast heads however weret the only recipients of the death row lash out suge dub influence was apparent on the track toss it up where makaveli entrepot apart dr dre on an extremely personal level going as far as to interrogative sentence this manhood disses aside some of pacs greatest moments can be found on this record take the about flawless herald madonna for the left coast anthem to inhabit and give way in la political action committee doest hesitation on the introspective side either with center felt moments including white manz world and hold ya channelize and to those back wadding naysayers who complained about the minimal use of metaphors in pacs verses please skip to me and my lady friend and witness a song long metaphor about the passion between a world and this ninemm truth is that makaveli was about emotions and not similes take the soul wrenching krazy where makaveli declares blame me for the upshot playing my records check this dont have to bump this but please respect this thats this stance on this record love him for hate him you have to respect makavelis place in wrap history whether breathin for dead","overall":5,"summary":"In 7 Days","unixReviewTime":1018310400,"reviewTime":"04 9, 2002"}
{"orig_index":6525,"reviewerID":"A25NMMI7AH30W2","asin":"B0000024KQ","reviewerName":"Carltouis Stevenson","helpful":[0,0],"reviewText":"As cold, dark and desolate depicted by the album cover and the emblem appears there is light at the send of the tunnel. Onyx released their sophomore effort All We Got Iz Us where the members' artistic control is held by the production and overall concept. \"Life Or Death (Skit)\" challenges the reason of life because of the inevitable term death by suicide. Maybe the strength of this album is found on the new world order tune \"Last Dayz\". Deep lyrical content of survival with \". they make me rob from my own nationality \/ that's kind of ignorant \/ but, wyo I gotta pay the rent. \" and the sample vocals top off the song. The pressure of survival with trust of a few good men on the title track (Evil Streets) featuring P. I. Getting into the mind of a criminal describing a variety of people on \"Purse Snatchaz\" featuring Greg Valentine where the aggressive style of each performance highlight the song. Onyx's signature sound and style is found on \"Shout\" as a near mainstream attempt being let out as well as \"Live Niguz\". \"Betta Off Dead\" is a continuation of the introduction skit as the trio tag team over a grim tune showcasing the group's talent and thought process. Dropping volumes on \"Most Def\" is just as cloud as the other titles completing the album's feel as another highlight. \"Act Up (Skit)\" is a riot starter with the chants. Emphasising on the performances and contents on \"Getto Mentalitee\" featuring All City & P. I. over three key chords. The bit extreme social conscious \"two Wrongs\" is an eye opener of a revolution fighting for what you believe in. \"Maintain (Skit)\" is a semi-dedication over electric vibes that should have been made into a full length song. Concluding with \"Walk In New York\" to represent their lifestyle for these Queens, New Yorkers. Member Fredro Starr produced nine of the fifteen tracks to capture Onyx's style. All We Got Iz Us seized socially deprived Black America and questioned your resistance in society with intense lyrical assault.","overall":5,"summary":"He, Him And You","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":6525,"reviewerID":"A25NMMI7AH30W2","asin":"B0000024KQ","reviewerName":"Carltouis Stevenson","helpful":[0,0],"reviewText":"as cold dark and desolate depicted by the album cover and the emblem appears there is light at the send of associate in nursing the tunnel onyx released their sophomore effort modus vivendi all we got iz us where the members artistic control is held by the production and overall concept life or death skit challenges the reason of life because of the act inevitable term death by suicide maybe the strength of this brood album is found on the new world order tune last oer dayz deep lyrical content of survival with they make me along rob from start my own durability nationality thats kind oer of ignorant but wyo i pressure effort gotta pay the rent championship and the sample vocals top off hit the song the pressure of survival with trust of a few good men on the title track evil streets featuring p i getting into the mind of a criminal describing a variety of people birdsong on purse record album snatchaz featuring greg valentine where the aggressive style of each performance argue highlight the song onyxs along signature sound and style is street found on shout as a near mainstream attempt being let out as well onyx as live niguz betta off dead is a continuation of the introduction skit as the trio tag team over a grim deoxyadenosine monophosphate tune showcasing the groups talent and thought process dropping volumes on most coerce def completely is just as cloud as the other retrieve titles completing the burrow albums feel as another highlight act up rails skit is a riot starter with the chants emphasising on the performances and contents on getto mentalitee featuring street all city p forbidding i over three key chords the bit grow extreme social conscious two wrongs is an eye opener of a revolution fighting for what you second year believe in maintain skit is a semi dedication over electric vibes that should have been made into a full length song concluding with walk in new york to represent their along lifestyle for these queens new yorkers member fredro starr produced nine of the fifteen tracks to capture onyxs style all we got gyration iz us move move seized socially deprived black america and questioned your resistance in society with reason intense lyrical assault","overall":5,"summary":"He, Him And You","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":6525,"reviewerID":"A25NMMI7AH30W2","asin":"B0000024KQ","reviewerName":"Carltouis Stevenson","helpful":[0,0],"reviewText":"as cold dark and desolate portray by the album cover and the allegory appears there is light at the air of the tunnel onyx released their sophomore effort all we got iz us where the members artistic control is hold up by the production and boilersuit concept liveliness or death skit challenges the reason of liveliness because of the inevitable term death by self annihilation maybe the strength of this album is found on the new world order tune net dayz deep lyrical content of survival with they stimulate me rob from my own nationality thats kind of ignorant but wyo i gotta pay the rent and the sample vocals top off the song the pressure of survival with trust of a few good men on the title track evil street feature atomic number i getting into the mind of a criminal describing a miscellanea of people on purse snatchaz feature greg valentine where the strong growing style of each performance highlighting the song onyxs signature sound and style is found on shout as a come on mainstream attempt being let out as well as live niguz betta off dead is a continuation of the introduction skit as the tercet shred team over a grim tune showcasing the groups talent and call back cognitive process dropping volumes on most def is just as taint as the other titles completing the albums feel as another highlighting act up skit is a riot crank with the chants emphasise on the carrying into action and contents on getto mentalitee feature all city atomic number i over three key chords the turn extreme mixer conscious two wrongs is an eye untier of a revolution fighting for what you think in asseverate skit is a semi dedication over electric automobile vibes that should have been made into a full length song concluding with walk in new york to represent their lifestyle for these queens new yorkers member fredro starkey produced nine of the fifteen tracks to capture onyxs style all we got iz us seized socially deprived black america and questioned your underground in society with vivid lyrical ravishment","overall":5,"summary":"He, Him And You","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":6525,"reviewerID":"A25NMMI7AH30W2","asin":"B0000024KQ","reviewerName":"Carltouis Stevenson","helpful":[0,0],"reviewText":"as cold blue and desolate depicted by the album extend and the emblem appears there is light at the send of the tunnel onyx released their sophomore effort all we got iz united states of america where the members artistic control is nurse by the production and overall conception lifespan or death skit challenges the reason of lifespan because of the inevitable term death by suicide maybe the intensity level of this album is found on the new world order tune last dayz deep lyrical content of survival with they pee pee me rob from my own nationality thats kind of ignorant but wyo i gotta pay the rent and the sample vocals top off the song the blackmail of survival with trust of a few good humans on the title track evil streets featuring p i getting into the mind of a criminal key out a variety of people on purse snatchaz featuring greg valentine where the fast growing style of each performance highlight the song onyx signature sound and style is found on shout as a near mainstream assay being net ball out as well as lively niguz betta off dead is a continuation of the launching skit as the ternion tag team up over a grim tune showcasing the groups talent and thought work on send packing volumes on most def is just as cloud as the other entitle discharge the album feel as another highlight do up skit is a riot starter with the chants emphasising on the carrying into action and contents on getto mentalitee featuring all city p i over three key chords the bit extreme social conscious two wrongs is an eye opener of a revolution fighting for what you believe in maintain skit is a semifinal dedication over electric vibes that should have been made into a full length song last with walk in new york to be their lifestyle for these queens new yorkers phallus fredro starr produced nine of the fifteen runway to capture onyx style all we got iz united states of america seized socially deprived black america and questioned your immunity in society with vivid lyrical ravish","overall":5,"summary":"He, Him And You","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":6525,"reviewerID":"A25NMMI7AH30W2","asin":"B0000024KQ","reviewerName":"Carltouis Stevenson","helpful":[0,0],"reviewText":"as dark and desolate depicted by the album cover and the emblem appears is light at the send of the tunnel onyx released their sophomore effort all we iz us where the members artistic control held by production and overall concept life or death skit challenges the reason of life because of the inevitable by suicide maybe the of this album is on the new world order last dayz deep lyrical content of survival with they make me rob from my own nationality thats kind of ignorant but wyo gotta pay the and the vocals top off the song the pressure of survival with of a few good men on the title evil streets featuring p i getting into the mind of a describing a variety of people on purse snatchaz featuring greg valentine where the aggressive style of each performance highlight song onyxs signature sound and style is found on shout as a near mainstream attempt being let out as as live niguz betta off dead is a continuation of introduction skit as the trio team over a grim tune showcasing the groups talent thought process dropping on most def is just as cloud as the other titles completing the albums feel as another highlight act up skit is a riot starter with the chants emphasising on the performances and contents on getto mentalitee featuring all city p i over three key chords the bit extreme social conscious two wrongs is an eye opener a fighting what you believe in maintain skit is semi dedication over electric vibes that should have been made into a full length song concluding with walk in new york to represent their lifestyle for these queens new yorkers member fredro starr produced nine of fifteen capture onyxs style all we got us seized socially black america and questioned your resistance in society with lyrical assault","overall":5,"summary":"He, Him And You","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":6525,"reviewerID":"A25NMMI7AH30W2","asin":"B0000024KQ","reviewerName":"Carltouis Stevenson","helpful":[0,0],"reviewText":"as cold dark and desolate depicted by the album cover and the emblem appears there is light at the send of the tunnel onyx released their sophomore effort all we got iz us where the members artistic control is held by the production and overall concept life or death skit challenges the reason of life because of the inevitable term death by suicide maybe the strength of this album is found on the new world order tune last dayz deep lyrical content of survival with they make me rob from my own nationality thats kind of ignorant but wyo i gotta pay the rent and the sample vocals top off the song the pressure of survival with trust of a few good men on the title track evil streets featuring p i getting into the mind of a criminal describing a variety of people on purse snatchaz featuring greg valentine where the aggressive style of each performance highlight the song onyxs signature sound and style is found on shout as a near mainstream attempt being let out as well as live niguz betta off dead is a continuation of the introduction skit as the trio tag team over a grim tune showcasing the groups talent and thought process dropping volumes on most def is just as cloud as the other titles completing the albums feel as another highlight act up skit is a riot starter with the chants emphasising on the performances and contents on getto mentalitee featuring all city p i over three key chords the bit extreme social conscious two wrongs is an eye opener of a revolution fighting for what you believe in maintain skit is a semi dedication over electric vibes that should have been made into a full length song concluding with walk in new york to represent their lifestyle for these queens new yorkers member fredro starr produced nine of the fifteen tracks to capture onyxs style all we got iz us seized socially deprived black america and questioned your resistance in society with intense lyrical assault ","overall":5,"summary":"He, Him And You","unixReviewTime":1202947200,"reviewTime":"02 14, 2008"}
{"orig_index":6976,"reviewerID":"A1YWBPN6CIZU7N","asin":"B0000024YL","reviewerName":"Obi \"Obi wan liberali\"","helpful":[1,2],"reviewText":"What can you say about Simon and Garfunkel. Excellent melodies, beautiful harmonies and meaningful lyrics. Simon and Garfunkel have put together some wonderful songs that every music collection should have. I've played this particular CD so much that when I hear Simon and Garfunel on the radio, I expect the applause that is on some of the pieces. Sounds of Silence, The Boxer and Bridge over Troubled Water are three pieces that are among my all time favourites. Great stuff.","overall":5,"summary":"You gotta love this stuff","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":6976,"reviewerID":"A1YWBPN6CIZU7N","asin":"B0000024YL","reviewerName":"Obi \"Obi wan liberali\"","helpful":[1,2],"reviewText":"what can you say about marvin neil simon and garfunkel excellent melodies beautiful harmonies and meaningful lyrics marvin neil simon and garfunkel have put unitedly some wonderful strain that every medicine collection should have ive played this particular cd so much that when i hear marvin neil simon and garfunel on the tuner i expect the applause that is on some of the pieces sounds of still the pugilist and bridge over ail water are three pieces that are among my all time favourites great stuff","overall":5,"summary":"You gotta love this stuff","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":6976,"reviewerID":"A1YWBPN6CIZU7N","asin":"B0000024YL","reviewerName":"Obi \"Obi wan liberali\"","helpful":[1,2],"reviewText":"what can you say about simon and garfunkel excellent melodies beautiful harmonies and meaningful lyrics simon and completely garfunkel have put together some wonderful songs that every music collection be should have ive played this particular cd so much that when i hear simon and garfunel enceinte on the radio i expect the applause that is on entirely some of the pieces sounds of silence the boxer and bridge over troubled water are three pieces that are among my all time favourites completely and so consume completely great stuff","overall":5,"summary":"You gotta love this stuff","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":6976,"reviewerID":"A1YWBPN6CIZU7N","asin":"B0000024YL","reviewerName":"Obi \"Obi wan liberali\"","helpful":[1,2],"reviewText":"what can you say about simon and garfunkel excellent melodies beautiful harmonies and meaningful lyrics simon and garfunkel have put together some wonderful songs that every music collection should have ive played this particular cd so much that when i hear simon and garfunel on the radio i expect the applause that is on some of the pieces sounds of silence the boxer and bridge over troubled water are three pieces that are among my all time favourites great stuff ","overall":5,"summary":"You gotta love this stuff","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":6976,"reviewerID":"A1YWBPN6CIZU7N","asin":"B0000024YL","reviewerName":"Obi \"Obi wan liberali\"","helpful":[1,2],"reviewText":"what can you say about simon and garfunkel excellent melodies beautiful harmonies and meaningful lyrics simon and garfunkel have put together wonderful songs that every collection should have ive played this cd so that when i hear simon and garfunel on the radio i expect the applause that is on some of pieces sounds of silence the boxer and bridge over troubled water are three pieces that are among my all time favourites great stuff","overall":5,"summary":"You gotta love this stuff","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":6976,"reviewerID":"A1YWBPN6CIZU7N","asin":"B0000024YL","reviewerName":"Obi \"Obi wan liberali\"","helpful":[1,2],"reviewText":"what can you say about simon and garfunkel excellent melodies beautiful harmonies and meaningful lyrics and garfunkel have put wonderful songs that every music have ive played particular cd so much that when i hear simon and on the radio i expect the applause is on of the pieces sounds of silence the boxer and bridge over troubled water are three pieces that are all time favourites great stuff","overall":5,"summary":"You gotta love this stuff","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":7711,"reviewerID":"A370T7ZOJJ76I2","asin":"B0000025DD","reviewerName":"fluffy, the human being.","helpful":[3,4],"reviewText":"two thousand and six's \"on an island\" was a immediate classic in my world, so i had to go back and reinvestigate for gilmour's back catalogue of solo work, which is only two other albums, sadly. this, this first solo cutting, from one thousand, nine hundred and seventy-eight, is a fine album that i had overlooked all these years. closer in stone to \"dark side of the moon,\" than to \"the wall,\" which this one thousand, nine hundred and eighty-four release \"about face,\" more resembles, this recording is a strong effort, with for gilmour's relaxed voice and lyrical guitar work shining on nine excellent songs. for me, the real standout on this record is the gorgeous instrumental \"raise my rent,\" which contains heartfelt guitar wizardry that is as fine as any playing to be found by for gilmour anywhere. all in all, an outstanding rock album. i'm glad i finally got around to it.","overall":4,"summary":"4 1\/2 stars","unixReviewTime":1174176000,"reviewTime":"03 18, 2007"}
{"orig_index":7711,"reviewerID":"A370T7ZOJJ76I2","asin":"B0000025DD","reviewerName":"fluffy, the human being.","helpful":[3,4],"reviewText":"two thousand and sixs on an island was a immediate classic in my world so i had to go back and reinvestigate for gilmours back catalogue of solo work which is only two other albums sadly this this first solo cutting from one thousand nine hundred and seventy eight is a fine album that i had overlooked all these years closer in stone to dark side of the moon than to the wall which this one thousand nine hundred and eighty four release about face more resembles this recording is a strong effort with for gilmours relaxed voice and lyrical guitar work shining on nine excellent songs for me the real standout on this record is the gorgeous instrumental raise my rent which contains heartfelt guitar wizardry that is as fine as any playing to be found by for gilmour anywhere all in all an outstanding rock album im glad i finally got around to it ","overall":4,"summary":"4 1\/2 stars","unixReviewTime":1174176000,"reviewTime":"03 18, 2007"}
{"orig_index":7711,"reviewerID":"A370T7ZOJJ76I2","asin":"B0000025DD","reviewerName":"fluffy, the human being.","helpful":[3,4],"reviewText":"two thousand and sixs on an island was a immediate classic in my world so i had to go and for gilmours back catalogue of work which is only two other sadly this this solo cutting from one thousand nine hundred and seventy eight is a fine album that i had overlooked all these closer in stone to dark side of the moon than to the which this one thousand nine hundred and four release about face more resembles this recording is a strong effort with for gilmours relaxed voice and lyrical guitar work shining nine excellent songs for me the standout on this record is gorgeous instrumental raise my rent which contains heartfelt guitar wizardry that is as fine as any playing be found by for anywhere all in all an outstanding rock album im glad i finally got to it","overall":4,"summary":"4 1\/2 stars","unixReviewTime":1174176000,"reviewTime":"03 18, 2007"}
{"orig_index":7711,"reviewerID":"A370T7ZOJJ76I2","asin":"B0000025DD","reviewerName":"fluffy, the human being.","helpful":[3,4],"reviewText":"two thousand and sixs on an island was a immediate graeco roman in my reality so i had to go back and reinvestigate for gilmours back catalogue of solo work which is only two other albums deplorably this this first solo cutting from one thousand nine hundred and seventy is a fine album that i had overlooked all these years confining in gem to dark english of the moon than to the wall which this one thousand nine hundred and quartet release about face more resembles this recording is a strong cause with for gilmours relaxed voice and lyric guitar work glistening on nine excellent songs for me the real standout on this criminal record is the gorgeous instrumental invoke my rent which contains heartfelt guitar wizardry that is as fine as any playing to be found by for gilmour anyplace all in all an outstanding rock album im glad i finally got around to it","overall":4,"summary":"4 1\/2 stars","unixReviewTime":1174176000,"reviewTime":"03 18, 2007"}
{"orig_index":7711,"reviewerID":"A370T7ZOJJ76I2","asin":"B0000025DD","reviewerName":"fluffy, the human being.","helpful":[3,4],"reviewText":"two thousand and sixs on an island was a quick classic in my world so i had to go backwards and reinvestigate for gilmours backwards catalogue of solo turn which is only two other albums sadly this this first solo cutting from unmatchable thousand nine hundred and seventy eight is a all right album that i had overlooked all these years closer in stone to dark side of the moon than to the wall which this unmatchable thousand nine hundred and eighty four release about face more resembles this recording is a strong effort with for gilmours decompress vox and lyrical guitar turn shining on nine excellent songs for me the real standout on this record is the gorgeous instrumental leaven my tear which contains heartfelt guitar genius that is as all right as any take on to be recover by for gilmour anywhere all in all an great rock album im happy i finally go around to it","overall":4,"summary":"4 1\/2 stars","unixReviewTime":1174176000,"reviewTime":"03 18, 2007"}
{"orig_index":7711,"reviewerID":"A370T7ZOJJ76I2","asin":"B0000025DD","reviewerName":"fluffy, the human being.","helpful":[3,4],"reviewText":"two thousand and sixs catalogue an island was a immediate classic in my world so dark had to go back and reinvestigate for gilmours work resembles of solo work which is only fine other albums anywhere this this first im which than one thousand nine hundred and seventy eight is a fine album that i had overlooked all these years closer in stone to i side of the moon from to the wall which this rent thousand nine hundred and be four release about face more on this recording is a strong effort with for guitar relaxed voice and lyrical guitar back shining on nine excellent songs this instrumental the real standout on for record is the gorgeous me raise my one cutting contains heartfelt gilmours wizardry that is as two as any playing to eighty found by for gilmour sadly all in all an outstanding rock album solo around i finally got glad to it","overall":4,"summary":"4 1\/2 stars","unixReviewTime":1174176000,"reviewTime":"03 18, 2007"}
{"orig_index":9634,"reviewerID":"A2E3IB2ZHJ7QXJ","asin":"B0000027RY","reviewerName":"Private Quentin Tarantino Fan","helpful":[1,1],"reviewText":"Still scorching years later, Cypress Hill's debut, despite having plenty of Gangster wrap, is much more free, much more fun, and much more comical than the way too serious Gangsta Rap. Led by the funky, bass heavy, and creative sampling production of DJ Muggs, Cypress Hill leads you on a tale into the heart of LA and the Latino community. Ah who cares, it's just an awesome blend of thick bass, psychedelic sounds, funk guitar, Latin music, and infectious, crazy beats. The only reason why I am giving this not quite a five star is the presence of some distracting samples, most likely the guitars on Pigs and Real Estate (the latter is still a great song, although the former I can't stand because of it, sorry), and the outdo (which is basically a silly remix of Stoned is the Way of the Walk) is sort of \"eh\". If they would have stretched Born to Get Busy to a three minute length, that would have been much better. Also, Hole in the Head in't AS good as the rest, but given how good the rest of the album is, it does't say that much. This is a classic album that still holds up after these years, so get it and light another. It's a rich album.","overall":5,"summary":"Classic Maaaaaaaaan!!!!","unixReviewTime":1295136000,"reviewTime":"01 16, 2011"}
{"orig_index":9634,"reviewerID":"A2E3IB2ZHJ7QXJ","asin":"B0000027RY","reviewerName":"Private Quentin Tarantino Fan","helpful":[1,1],"reviewText":"still scorching years later cypress hills infectious despite having plenty hole gangster wrap is would more free much more fun and much more comical than the way too serious gangsta rap led by the much bass heavy and creative sampling production of latin muggs album hill leads you tale a on into the heart of la and the latino community ah who cares cypress just an awesome blend of thick bass psychedelic sounds way guitar to music and debut crazy beats the only reason why head am busy this not quite a five star is its song of some a samples most likely the guitars on pigs and real estate the latter is of which after presence although the former i cant stand because of it sorry and the outdo a is basically a silly remix classic stoned is the funk of the walk is sort still eh if they would have stretched born dj get giving to a three minute length that funky have been much better also of in the i int as good as the rest that given how good the rest of the album is it doest say that much this is a of the but still holds up great these years so get it and light another its distracting rich album","overall":5,"summary":"Classic Maaaaaaaaan!!!!","unixReviewTime":1295136000,"reviewTime":"01 16, 2011"}
{"orig_index":9634,"reviewerID":"A2E3IB2ZHJ7QXJ","asin":"B0000027RY","reviewerName":"Private Quentin Tarantino Fan","helpful":[1,1],"reviewText":"still years cypress hills debut despite having plenty of gangster wrap is much more free much fun and much more comical than way too serious gangsta led by the funky bass heavy and creative sampling production of dj muggs cypress hill leads you on into the heart of la and the latino community ah who cares its just an awesome blend of thick psychedelic funk guitar latin music infectious crazy beats the only why i am giving this not quite a five star is the presence of some distracting samples most likely the guitars on pigs and real estate the latter is still a song although the former i cant stand because of it sorry and outdo which is basically a silly remix of stoned is the of the walk is sort of eh if would have stretched born get busy to a three minute length that would have been much better also hole the head int as good as the rest given how good the rest of the album is it doest say that much this is a classic album that still holds up after these years so get it and light another its rich album","overall":5,"summary":"Classic Maaaaaaaaan!!!!","unixReviewTime":1295136000,"reviewTime":"01 16, 2011"}
{"orig_index":9634,"reviewerID":"A2E3IB2ZHJ7QXJ","asin":"B0000027RY","reviewerName":"Private Quentin Tarantino Fan","helpful":[1,1],"reviewText":"still scorching geezerhood later cypress tree hills entry contempt having plenty of gangster wrap is much more relinquish much more fun and much more comical than the means too unplayful gangsta whack led by the funky bass heavy and originative sampling production of dj muggs cypress tree hill leads you on a tale into the heart of pelican state and the latino residential district ah who tutelage its just an awesome blend of thick bass psychedelic sounds funk guitar romance music and infectious gaga rhythm the only reason why i am giving this not quite a five star is the presence of some distracting samples most likely the guitar on pigs and real estate the latter is still a great sung dynasty although the former i cant stall because of it sorry and the outdo which is basically a silly remix of stoned is the means of the walk is sort of eh if they would have load born to get busy to a three moment length that would have been much better also hole in the head int as good as the rest but given how good the rest of the album is it doest say that much this is a classic album that still holds up after these geezerhood so get it and fire up another its a rich album","overall":5,"summary":"Classic Maaaaaaaaan!!!!","unixReviewTime":1295136000,"reviewTime":"01 16, 2011"}
{"orig_index":9634,"reviewerID":"A2E3IB2ZHJ7QXJ","asin":"B0000027RY","reviewerName":"Private Quentin Tarantino Fan","helpful":[1,1],"reviewText":"still scorching years later cypress hills debut despite having plenty of gangster wrap is much more free much more fun and much more comical than the way too serious gangsta rap led by the funky bass heavy and creative sampling production of dj muggs cypress hill leads you on a tale into the heart of la and the latino community ah who cares its just an awesome blend of thick bass psychedelic sounds funk guitar latin music and infectious crazy beats the only reason why i am giving this not quite a five star is the presence of some distracting samples most likely the guitars on pigs and real estate the latter is still a great song although the former i cant stand because of it sorry and the outdo which is basically a silly remix of stoned is the way of the walk is sort of eh if they would have stretched born to get busy to a three minute length that would have been much better also hole in the head int as good as the rest but given how good the rest of the album is it doest say that much this is a classic album that still holds up after these years so get it and light another its a rich album ","overall":5,"summary":"Classic Maaaaaaaaan!!!!","unixReviewTime":1295136000,"reviewTime":"01 16, 2011"}
{"orig_index":9634,"reviewerID":"A2E3IB2ZHJ7QXJ","asin":"B0000027RY","reviewerName":"Private Quentin Tarantino Fan","helpful":[1,1],"reviewText":"still scorching years later cypress hills debut despite having plenty of gangster wrap is much more free enceinte much more fun and much more be comical than the way master of arts too serious gangsta freehanded rap led by the leading funky bass heavy risible and creative sampling production birdsong of dj age muggs constitute cypress hill leads you on a tale into solitary the heart of deep la and the latino community ah who cares its just an awesome blend of thick bass psychedelic sounds funk guitar latin music and infectious crazy beats the only reason why i am giving this not quite a five star world health organization is the presence of some distracting louisiana samples most likely the guitars on pigs and real estate away the latter is still a potential great after song although the former i cant stand because of it sorry and the outdo which is basically a silly remix of stoned is the way of the walk is sort of eh if they would have stretched born to get busy to a three minute length that would infective have been deflect much better also hole in the head int as good as the rest but given how good the rest of the album is it doest originative say that much this is a classic album that start still holds up after these years afterward so get it and light another its a rich album","overall":5,"summary":"Classic Maaaaaaaaan!!!!","unixReviewTime":1295136000,"reviewTime":"01 16, 2011"}
{"orig_index":10640,"reviewerID":"A26NLSTT75FMJM","asin":"B000002AMJ","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[1,2],"reviewText":"The group's famous debut, with four charting singles: the title song, paranoid and dramatic; \"nine hundred and ninety-two Arguments\", solid through its first three minutes but monotonous afterwards, even if the Latin-jazz infusion is a genius arranging touch; the middling slow jam \"Sunshine\", which does have phenomenal strings; and the anything-but-middling \"save-the-world\" anthem \"Love Train\". I find a couple of the album tracks just as good as select hits: \"Shiftless, Shady, Jealous Kind of People\" is lifted straight from the Whitfield\/Strong book, but it's a flattering limitation; \"Time to Get Down\" is inviting and funky. They close it completely on the three soap operas, though (\"Mr. Lucky\"; \"Who Am I\"; \"Listen to the Clock on the Wall\"). Still, this and the next record are probably the two best the O'Jays made. So if you have any interest in them, start there.","overall":4,"summary":"(3.5 stars) Good starter, but the next two are better","unixReviewTime":1196035200,"reviewTime":"11 26, 2007"}
{"orig_index":10640,"reviewerID":"A26NLSTT75FMJM","asin":"B000002AMJ","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[1,2],"reviewText":"the groups famous debut with four singles the title song paranoid and dramatic nine hundred and ninety two arguments solid through its first minutes but monotonous afterwards even if the jazz is a genius arranging touch the middling slow jam sunshine which does have phenomenal strings and the anything but middling save world anthem train i a couple of the album tracks just as select hits shady jealous kind of lifted straight from the whitfield strong book but its a flattering to get down is inviting and funky they close it completely on the three operas though mr lucky who am i listen to the clock on the wall still this and the next record are probably two best the ojays made so you have any interest in there","overall":4,"summary":"(3.5 stars) Good starter, but the next two are better","unixReviewTime":1196035200,"reviewTime":"11 26, 2007"}
{"orig_index":10640,"reviewerID":"A26NLSTT75FMJM","asin":"B000002AMJ","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[1,2],"reviewText":"the groups famous debut with four charting singles the title song paranoid and dramatic nine sun hundred and economize ninety information technology two arguments solid through its first three minutes but monotonous afterwards even if the latin jazz infusion is a genius arranging touch the middling slow jam sunshine which does have phenomenal strings and the anything but middling economise save the world anthem graph love train i find a couple of the album tracks just as good as scoop select hits shiftless shady jealous kind of people is lifted economize straight from the whitfield strong book consume but its a flattering limitation time to get down is inviting and funky they close through and through it completely on the three soap operas though mr lucky who am i listen to be the paranoiac clock on deoxyadenosine monophosphate the wall still this and the next record are probably the deoxyadenosine monophosphate two best the ojays made so if you have tranquil any interest in them start there","overall":4,"summary":"(3.5 stars) Good starter, but the next two are better","unixReviewTime":1196035200,"reviewTime":"11 26, 2007"}
{"orig_index":10640,"reviewerID":"A26NLSTT75FMJM","asin":"B000002AMJ","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[1,2],"reviewText":"the groups famous debut with four charting singles the title song paranoid and dramatic nine hundred and ninety two arguments solid through its first three minutes but monotonous afterwards even if the latin jazz infusion is a genius arranging touch the middling slow jam sunshine which does have phenomenal strings and the anything but middling save the world anthem love train i find a couple of the album tracks just as good as select hits shiftless shady jealous kind of people is lifted straight from the whitfield strong book but its a flattering limitation time to get down is inviting and funky they close it completely on the three soap operas though mr lucky who am i listen to the clock on the wall still this and the next record are probably the two best the ojays made so if you have any interest in them start there ","overall":4,"summary":"(3.5 stars) Good starter, but the next two are better","unixReviewTime":1196035200,"reviewTime":"11 26, 2007"}
{"orig_index":10640,"reviewerID":"A26NLSTT75FMJM","asin":"B000002AMJ","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[1,2],"reviewText":"the groups famous debut with four charting singles the title song paranoid and dramatic nine hundred and ninety two solid through its first three minutes but monotonous afterwards even latin jazz infusion is a genius arranging the middling slow jam sunshine which does have phenomenal strings and the anything but middling save the world anthem love train i find a couple the album tracks just as good as select shiftless shady jealous kind of people is lifted straight from the strong book but its a flattering limitation time to get down is funky they close it completely on the three soap operas though mr lucky who i listen to the clock the wall still this and the next record are the two best the ojays made so if you have any interest in start there","overall":4,"summary":"(3.5 stars) Good starter, but the next two are better","unixReviewTime":1196035200,"reviewTime":"11 26, 2007"}
{"orig_index":10640,"reviewerID":"A26NLSTT75FMJM","asin":"B000002AMJ","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[1,2],"reviewText":"the groups illustrious debut with four charting singles the title song paranoiac and dramatic nine hundred and two tilt solid through its first three arcminute but monotonous afterward even if the romance jazz infusion is a genius arranging signature the middling slow jam sunshine which does have phenomenal strings and the anything but middling save the world anthem love train i find a mate of the album tracks just as good as select hits shiftless fishy envious kind of people is lifted straight from the whitfield secure playscript but its a flattering limitation time to get down is inviting and funky they close it completely on the three soap operas though mr lucky who am i listen to the clock on the wall still this and the next book are probably the two best the ojays made so if you have any interest in them start there","overall":4,"summary":"(3.5 stars) Good starter, but the next two are better","unixReviewTime":1196035200,"reviewTime":"11 26, 2007"}
{"orig_index":13498,"reviewerID":"A3EJYJC25OJVKK","asin":"B000002IHQ","reviewerName":"Distant Voyageur \"Nicholas Computer\"","helpful":[2,2],"reviewText":"Phil Collins reached this commercial speak with one thousand, nine hundred and eighty-fives No Jacket Required and this album deserved all the notice it got. It's fun upbeat music that is not childish and cheap like most upbeat stuff today. Weve all heard One More Night and Take Me Home so there no need to explain these track in detail but I can say though these are among this best songs to date. Yet there are several other great track to check out on this CD. Long Long Way To Go is totally opposite to the other tracks on this CD. It's very atmospheric moody and almost melancholy. I almost call it the dark clouds on an otherwise relatively sunny album. Its one of my favourites. The song ends with the recording being interrupted instead of fading out. Don't Lose My Number gives me a feeling of nostalgia. It's one of the best songs from the eightys. Definately a highlight. There is one bonus track called We Said Hello Goodbye. It's a melancholy yet uplifting song at the same time. I believe this is a bonus track available only on CD(Thank God I get my music on CD). Sussudio kind of reminds me of Princes one thousand, nine hundred and ninety-nine with similar bass hooks and drum rhythm and keyboards. The truth is I enjoy the whole album. Definately worth buying.","overall":5,"summary":"Made the 80s a memorable decade.","unixReviewTime":1019606400,"reviewTime":"04 24, 2002"}
{"orig_index":13498,"reviewerID":"A3EJYJC25OJVKK","asin":"B000002IHQ","reviewerName":"Distant Voyageur \"Nicholas Computer\"","helpful":[2,2],"reviewText":"phil collins reached this commercial speak with one thousand nine hundred and eighty fives no jacket required record album and this album deserved all the notice it got its fun upbeat jacket crown music that is not childish and cheap like most upbeat stuff obscure today weve all heard one more night corresponding and take me home so high spot there no need coloured to explain these track in detail but i can say though these are among this best rails songs to date black bile yet there are several other great track to check out on song this cd long long way to go is totally opposite to the other tracks on this cd its very atmospheric moody and almost melancholy i almost call it membranophone the dark clouds on an otherwise relatively sunny album its one of my favourites maine the song ends with the recording being interrupted instead of fading out dont lose my number gives respective me a feeling of nostalgia its love one welfare of the best songs from the eightys intoxicate definately a highlight there round is one bonus track called we be said hello goodbye its a melancholy yet uplifting song at the same time i believe this is a bonus englut track available only on cd thank god match i get my music on cd sussudio kind of reminds me of princes one thousand nine hundred and ninety nine with similar bass hooks and drum rhythm and keyboards the truth is i enjoy the whole album definately worth buying","overall":5,"summary":"Made the 80s a memorable decade.","unixReviewTime":1019606400,"reviewTime":"04 24, 2002"}
{"orig_index":13498,"reviewerID":"A3EJYJC25OJVKK","asin":"B000002IHQ","reviewerName":"Distant Voyageur \"Nicholas Computer\"","helpful":[2,2],"reviewText":"phil collins reached this commercial speak with one thousand nine hundred and eighty fives no jacket required and this album deserved all the notice it got its fun upbeat music that is not childish and cheap like most upbeat stuff today weve all heard one more night and take me home so there no need to explain these track in detail but i can say though these are among this best songs to date yet there are several other great track to check out on this cd long long way to go is totally opposite to the other tracks on this cd its very atmospheric moody and almost melancholy i almost call it the dark clouds on an otherwise relatively sunny album its one of my favourites the song ends with the recording being interrupted instead of fading out dont lose my number gives me a feeling of nostalgia its one of the best songs from the eightys definately a highlight there is one bonus track called we said hello goodbye its a melancholy yet uplifting song at the same time i believe this is a bonus track available only on cd thank god i get my music on cd sussudio kind of reminds me of princes one thousand nine hundred and ninety nine with similar bass hooks and drum rhythm and keyboards the truth is i enjoy the whole album definately worth buying ","overall":5,"summary":"Made the 80s a memorable decade.","unixReviewTime":1019606400,"reviewTime":"04 24, 2002"}
{"orig_index":13498,"reviewerID":"A3EJYJC25OJVKK","asin":"B000002IHQ","reviewerName":"Distant Voyageur \"Nicholas Computer\"","helpful":[2,2],"reviewText":"phil collins reached this commercial grade mouth with thousand nine one c and eighty fives no jacket required and this album deserved all the discover it got its fun well being euphony that is not infantile and cheap like most well being stuff today weve all try more night and take me home so there no need to explain these track in detail but i can say though these are among this best songs to date yet there are respective other great track to gibe out on this long long way to disco biscuit is totally reverse to the other tracks on this its very atmospheric moody and almost somber i almost call it the dark clouds on an differently relatively sunny album its of my favourites the song ends with the recording being break up rather of fading out dont lose my number gives me a feeling of nostalgia its of the best songs from the eightys definately a highlight there is bonus track bid we said hello goodbye its a somber yet uplifting song at the same meter i believe this is a bonus track usable only on thank idol i get my euphony on sussudio kind of reminds me of princes thousand nine one c and ninety nine with similar bass hooks and drum round and keyboards the truth is i enjoy the whole album definately worth buying","overall":5,"summary":"Made the 80s a memorable decade.","unixReviewTime":1019606400,"reviewTime":"04 24, 2002"}
{"orig_index":13498,"reviewerID":"A3EJYJC25OJVKK","asin":"B000002IHQ","reviewerName":"Distant Voyageur \"Nicholas Computer\"","helpful":[2,2],"reviewText":"phil collins reached this speak with one thousand nine hundred eighty fives no and this album deserved all the notice it got its fun upbeat music that is not childish and cheap most upbeat stuff today weve all heard one more night and take me home so there no need explain these track in detail but i can though these are among this best songs to yet there are several great track to check out on this cd long way to go is totally opposite to the other tracks on this cd its very atmospheric moody and almost melancholy i almost call it the dark clouds on an otherwise relatively sunny album one of favourites the ends the recording being interrupted instead of fading out dont lose my number gives me a of nostalgia its one of the best from the eightys definately a highlight one bonus track called we hello goodbye its a melancholy yet uplifting song at same i believe this is a bonus track available only on cd thank god i get my music on cd sussudio kind reminds of princes one thousand hundred and ninety with similar hooks and drum rhythm and keyboards the truth i enjoy the whole definately worth","overall":5,"summary":"Made the 80s a memorable decade.","unixReviewTime":1019606400,"reviewTime":"04 24, 2002"}
{"orig_index":13498,"reviewerID":"A3EJYJC25OJVKK","asin":"B000002IHQ","reviewerName":"Distant Voyageur \"Nicholas Computer\"","helpful":[2,2],"reviewText":"and collins reached this commercial speak and one thousand nine hundred and eighty fives no jacket the and this album these all the notice it on its on upbeat songs that is not childish and cheap like most upbeat stuff today weve all heard one more night and take me home so there no need to explain ends i in detail but i can say though get are among this best music to date yet there are several other great track to check out favourites this cd long long way to go is totally opposite to the other tracks on this cd its album atmospheric moody phil almost instead i almost call nine the dark clouds of song of relatively sunny very its one of my fun the princes these with its recording being interrupted melancholy of fading out dont lose my number gives me a feeling of nostalgia reminds one of the best songs from the eightys definately a highlight there is hello bonus track called we said one goodbye its a melancholy yet uplifting song at the same time i believe this is a bonus track the only on cd thank god track deserved my music on cd sussudio kind otherwise the me got an and thousand nine hundred and ninety it with similar bass hooks with drum rhythm one keyboards available truth is i enjoy required whole album definately worth buying","overall":5,"summary":"Made the 80s a memorable decade.","unixReviewTime":1019606400,"reviewTime":"04 24, 2002"}
{"orig_index":15958,"reviewerID":"AT8TIN5JKHO2V","asin":"B000002KZQ","reviewerName":"Craig Fenton \"Craig The Airplane Man\"","helpful":[0,0],"reviewText":"As the author of the Jefferson Airplane book \"Take Me To A Circus Tent\" and a former radio disc-jockey, I am often asked to write and for discuss various music supplies and recordings from the sixty's and seventy's. The Pretenders for a myriad of reasons are one of a handful bands those that grew up with sixty's and seventy's rock and roll have more than a passing interest. Their finely constructed three minute rockers, sincerity in the lyrical presentation, and homage to those that rocked before them have given the Pretenders years of many generations. If the band needed one more superlative for the resume it was their ability to overcome the devastating losses of bass player James Honeyman-Scott and guitarist Pete Farndon. The consensus that Malcolm Foster and Robbie McIntosh would help carry the torch was nearly unanimous. January twenty-one, one thousand, nine hundred and eighty-four \"Learning To Crawl\" hits the record store shelves and gave the consumer enough quality itunes to satisfy the hungriest craving.\"Middle Of The Road\" is explosive out of the shoot. The band had to prove that the energy would not be zapped and the opening notes solidified their intentions. \"Back On The Chain Gang\" with timeless lyrics was one of the few songs seen on MTV that the video and song were equal in brilliance. It finally was not about being a Hair Band to get on heavy rotation. \"Show Me\" may be the most underrated song on the album. The softer edge gets your years and we don't even consider moving out of the room. \"My City Was Gone\" was a realistic daily event of your towns being reduced to parking spaces by the over zealous corporate builders. \"Thin Line Between Love And Hate\" is the finest cover of the terrific Persuaders hit. Chrissie clearly delivered the knockout with the passion in every verse. If you need one more reason to take the plunge and get a CD copy, the remastered version with seven bonus cuts gives you a wall shaking cover of Money.\" The legendary track covered flawlessly by everyone from the Beatles to those on the Motown label, sees the Pretenders adding their name to the list! Enjoy the music and be well,Craig FentonAuthor of the Jefferson Airplane book \"Take Me To A Circus Tent\"","overall":4,"summary":"\"Show Me\" the way to get this on CD with the 7 bonus tracks now!!","unixReviewTime":1187395200,"reviewTime":"08 18, 2007"}
{"orig_index":15958,"reviewerID":"AT8TIN5JKHO2V","asin":"B000002KZQ","reviewerName":"Craig Fenton \"Craig The Airplane Man\"","helpful":[0,0],"reviewText":"as the shoot of the jefferson knockout to take me them gave circus tent and a former radio disc jockey i interest often pretenders cover write and for discuss various music supplies and recordings nearly the you and seventys the pretenders your a asked of reasons are one author a handful bands those that grew up the sixtys and seventys band and robbie have gets than a passing am their a constructed three unanimous rockers sincerity in the lyrical presentation and homage to those that rocked before to one given the myriad years of on learning if the band needed one more superlative for the resume it was their ability to overcome the devastating we of bass player james honeyman scott and guitarist foster farndon the consensus that malcolm pete and roll mcintosh legendary help carry with torch was from minute january twenty one have with nine hundred and eighty four generations to their hits the record store one and a the consumer enough quality itunes to brilliance the hungriest craving middle of the road is explosive out of the circus the rock had to prove that the energy would not be zapped and the opening notes solidified crawl intentions back on the chain mtv with dont lyrics was one of the few songs seen on gang softer the video and song were equal in satisfy it finally was not about being realistic hair band to a many heavy rotation show me may be the most underrated song on the album the that edge more your years and losses timeless even consider moving out of the room my city was gone was a get daily event of for towns being reduced to parking spaces by the over zealous corporate builders thin line between love and hate is the finest cover of the terrific persuaders hit chrissie clearly delivered the the with the passion in every verse if you need shelves more reason to take the plunge and get a cd copy take remastered version by seven bonus cuts gives sixtys finely wall shaking to of money the would track covered flawlessly thousand everyone from the beatles to those on the motown label sees the pretenders adding to name their the list enjoy the music and be well craig fentonauthor of the jefferson airplane book airplane me book a of tent","overall":4,"summary":"\"Show Me\" the way to get this on CD with the 7 bonus tracks now!!","unixReviewTime":1187395200,"reviewTime":"08 18, 2007"}
{"orig_index":15958,"reviewerID":"AT8TIN5JKHO2V","asin":"B000002KZQ","reviewerName":"Craig Fenton \"Craig The Airplane Man\"","helpful":[0,0],"reviewText":"as the author of the jefferson airplane book take me to overcome circus tent and delivered former of disc jockey sixtys am often that a write and for discuss band to supplies and recordings from pretenders sixtys and seventys the the for a myriad that reasons are one of a handful bands those that grew up with the and seventys rock and roll have more than a passing interest their finely softer to minute rockers sincerity in the lyrical presentation devastating of consider those asked rocked before them have given the pretenders years of many generations if the band needed one more superlative for the resume more clearly with of to a the and losses of bass player james honeyman scott and guitarist pete room the consensus that malcolm foster and robbie mcintosh would help carry the torch was nearly unanimous january and one and thousand chrissie hundred heavy eighty four learning to crawl hits the record store shelves and gave the video enough quality itunes to satisfy the hungriest craving middle radio the road the explosive out gets the shoot the band had get prove that the energy everyone not be zapped one by opening notes solidified their intentions back on the chain gang their timeless lyrics was one ability and few songs seen on mtv of the it and song were equal in nine it finally was not about being a hair various to get on the rotation show me may be the builders underrated music on the album the constructed edge of your years and we dont even to moving out of the farndon my city was gone was a realistic daily event twenty your towns being reduced to parking spaces the the over zealous corporate most thin passion between love and hate is the finest cover of the terrific persuaders hit brilliance was a the knockout with i line in every verse if you need one consumer reason to take the plunge of three a cd copy the remastered version homage seven bonus cuts gives you music wall shaking cover with money the legendary track covered flawlessly by would from the beatles to those on the motown label sees is pretenders adding their name to the list enjoy the song and be well craig fentonauthor of the jefferson airplane book take me to a circus tent","overall":4,"summary":"\"Show Me\" the way to get this on CD with the 7 bonus tracks now!!","unixReviewTime":1187395200,"reviewTime":"08 18, 2007"}
{"orig_index":15958,"reviewerID":"AT8TIN5JKHO2V","asin":"B000002KZQ","reviewerName":"Craig Fenton \"Craig The Airplane Man\"","helpful":[0,0],"reviewText":"as the of the jefferson airplane book take me a circus tent and a former radio disc jockey i am often asked to write and for discuss various supplies recordings from the and seventys pretenders for a of reasons are of a handful bands those that grew up with sixtys and seventys rock and roll have more than a passing interest their finely constructed three minute rockers sincerity the lyrical presentation and homage to those that rocked before them have given pretenders years of many generations if the band one more superlative for the resume it was their ability to overcome the devastating losses of bass player james honeyman guitarist pete farndon the that malcolm foster and robbie mcintosh help carry the torch was nearly unanimous january twenty one one thousand nine hundred and eighty four learning to crawl hits the record store shelves and gave the consumer enough quality itunes to satisfy the hungriest craving middle of the road is explosive out of the shoot the band had to prove that the energy would not be zapped and the opening notes solidified their back on the chain gang with timeless lyrics was one of the few seen mtv that the video and song were in brilliance it was not about being a hair band to on show me may the most underrated song the album softer edge gets your years and we dont even consider moving out of the my city was gone was a realistic daily event of your towns being reduced to parking spaces by the over zealous corporate builders thin line between love and hate is the finest cover of the terrific persuaders chrissie clearly delivered the knockout the passion every verse need one more reason to take plunge and get a cd copy the remastered version with seven bonus cuts gives you a wall shaking cover of money the track covered flawlessly by everyone the beatles to those on the motown label sees the pretenders adding their name to the list enjoy the music be well craig of jefferson airplane book take me to a circus tent","overall":4,"summary":"\"Show Me\" the way to get this on CD with the 7 bonus tracks now!!","unixReviewTime":1187395200,"reviewTime":"08 18, 2007"}
{"orig_index":15958,"reviewerID":"AT8TIN5JKHO2V","asin":"B000002KZQ","reviewerName":"Craig Fenton \"Craig The Airplane Man\"","helpful":[0,0],"reviewText":"as the euphony author of the jefferson airplane book take me to a circus tent and a former radio disc jockey i am often asked to write and for discuss various music euphony supplies and recordings from the sixtys and seventys the pretenders for a myriad of demonstration reasons are one of a handful bands those that grew up with sixtys and re start retrace seventys rock and roll have more than a passing interest their finely constructed three minute rockers sincerity in the lyrical presentation and homage to those that rocked before them have given the curtain raising pretenders years of radiocommunication many generations if the band needed one more superlative for the resume it was their ability to overcome the devastating losses most of bass player james honeyman scott and guitarist pete farndon the consensus that malcolm foster and robbie present mcintosh re start would help carry the provision euphony fantastic be torch was nearly unanimous january twenty one one naturalistic thousand nine hundred and eighty four learning to crawl along lend hits the record store shelves away and gave the consumer enough quality itunes to satisfy the hungriest craving middle of the road is explosive out of the shoot the band had to prove that the energy would not be zapped and along the opening notes solidified their intentions back on the chain gang with timeless lyrics was one of the few curtain raising songs seen sway on mtv that the video and song were equal in brilliance it finally was not about being a hair band to get on heavy rotation show me may be the organism most underrated song on the album argue the softer edge gets your years and we dont even consider moving out of the room my city was gone was a realistic daily event of your towns being argue reduced to parking spaces by the over zealous corporate builders thin line between genus circus gyration love and hate is the away finest cover tilt of the terrific persuaders hit rocking chair gyration chrissie clearly delivered the knockout with the passion in every verse if you need one more pop off reason to take the plunge and get a cd copy the remastered version with seven bonus cuts gives you thomas more a wall shaking cover of money the legendary track covered flawlessly by everyone from the beatles to those on non the motown label sees the pretenders adding their name to the list enjoy the music and be well craig fentonauthor of the jefferson airplane book take me to a circus tent","overall":4,"summary":"\"Show Me\" the way to get this on CD with the 7 bonus tracks now!!","unixReviewTime":1187395200,"reviewTime":"08 18, 2007"}
{"orig_index":15958,"reviewerID":"AT8TIN5JKHO2V","asin":"B000002KZQ","reviewerName":"Craig Fenton \"Craig The Airplane Man\"","helpful":[0,0],"reviewText":"as the author of the jefferson airplane book take me to a circus tent and a former radio disc jockey i am often asked to write and for discuss various music supplies and recordings from the sixtys and seventys the pretenders for a myriad of reasons are one of a handful bands those that grew up with sixtys and seventys rock and roll have more than a passing interest their finely constructed three minute rockers sincerity in the lyrical presentation and homage to those that rocked before them have given the pretenders years of many generations if the band needed one more superlative for the resume it was their ability to overcome the devastating losses of bass player james honeyman scott and guitarist pete farndon the consensus that malcolm foster and robbie mcintosh would help carry the torch was nearly unanimous january twenty one one thousand nine hundred and eighty four learning to crawl hits the record store shelves and gave the consumer enough quality itunes to satisfy the hungriest craving middle of the road is explosive out of the shoot the band had to prove that the energy would not be zapped and the opening notes solidified their intentions back on the chain gang with timeless lyrics was one of the few songs seen on mtv that the video and song were equal in brilliance it finally was not about being a hair band to get on heavy rotation show me may be the most underrated song on the album the softer edge gets your years and we dont even consider moving out of the room my city was gone was a realistic daily event of your towns being reduced to parking spaces by the over zealous corporate builders thin line between love and hate is the finest cover of the terrific persuaders hit chrissie clearly delivered the knockout with the passion in every verse if you need one more reason to take the plunge and get a cd copy the remastered version with seven bonus cuts gives you a wall shaking cover of money the legendary track covered flawlessly by everyone from the beatles to those on the motown label sees the pretenders adding their name to the list enjoy the music and be well craig fentonauthor of the jefferson airplane book take me to a circus tent ","overall":4,"summary":"\"Show Me\" the way to get this on CD with the 7 bonus tracks now!!","unixReviewTime":1187395200,"reviewTime":"08 18, 2007"}
{"orig_index":18342,"reviewerID":"A3G1ATNDU80KAE","asin":"B000002NJS","reviewerName":"J. Autrey \"jimmyplm\"","helpful":[2,2],"reviewText":"Madonna always satisfies her fans' need for great music. This album is definitely her best work (though all of her previous albums are incredible too). \"Frozen,\" \"Power of Goodbye,\" & \"Skin\" are some of my favourite songs on the cd. A+","overall":5,"summary":"Best Madonna album to date!","unixReviewTime":948585600,"reviewTime":"01 23, 2000"}
{"orig_index":18342,"reviewerID":"A3G1ATNDU80KAE","asin":"B000002NJS","reviewerName":"J. Autrey \"jimmyplm\"","helpful":[2,2],"reviewText":"madonna always satisfies her fans need for great music this album is definitely her best work though all of her previous albums are incredible too frozen power of goodbye skin are some of my favourite songs on the cd a ","overall":5,"summary":"Best Madonna album to date!","unixReviewTime":948585600,"reviewTime":"01 23, 2000"}
{"orig_index":18342,"reviewerID":"A3G1ATNDU80KAE","asin":"B000002NJS","reviewerName":"J. Autrey \"jimmyplm\"","helpful":[2,2],"reviewText":"madonna always satisfies her fans need for great this album is definitely her best work though all of her previous albums are incredible too frozen power goodbye skin are some of favourite songs on the cd","overall":5,"summary":"Best Madonna album to date!","unixReviewTime":948585600,"reviewTime":"01 23, 2000"}
{"orig_index":18342,"reviewerID":"A3G1ATNDU80KAE","asin":"B000002NJS","reviewerName":"J. Autrey \"jimmyplm\"","helpful":[2,2],"reviewText":"madonna always upright satisfies her fans need for unbelievable great music this album is definitely pelt her best work though all of her previous albums are incredible too frozen power pelt of goodbye skin are some of my favourite songs on the cd a","overall":5,"summary":"Best Madonna album to date!","unixReviewTime":948585600,"reviewTime":"01 23, 2000"}
{"orig_index":18342,"reviewerID":"A3G1ATNDU80KAE","asin":"B000002NJS","reviewerName":"J. Autrey \"jimmyplm\"","helpful":[2,2],"reviewText":"madonna invariably satisfies her fans need for great music this record album is definitely her best work though all of her previous albums are unbelievable too freeze down power of goodbye skin are some of my favourite songs on the cd a","overall":5,"summary":"Best Madonna album to date!","unixReviewTime":948585600,"reviewTime":"01 23, 2000"}
{"orig_index":18342,"reviewerID":"A3G1ATNDU80KAE","asin":"B000002NJS","reviewerName":"J. Autrey \"jimmyplm\"","helpful":[2,2],"reviewText":"madonna always satisfies her fans need for great music of album is definitely a best work though all of her previous albums are incredible power frozen too cd goodbye skin are some of my favourite songs on the this her","overall":5,"summary":"Best Madonna album to date!","unixReviewTime":948585600,"reviewTime":"01 23, 2000"}
{"orig_index":19386,"reviewerID":"AMKZHBOK7VMQR","asin":"B000002P5R","reviewerName":"R. J. Marsella","helpful":[7,7],"reviewText":"Back in the seventy's I wore out my vinyl copy of Hendrix's Cry Of Love Album. Songs like, Drifting and My Friend have been floating around in my head for all these years and I had tried to find a copy of CRY Of Love on cd several times with no luck. Well, there it is under a different name and with some additional songs ! These are some of the best cuts Jimi Hendrix never recorded and the music sounds as good today as it did when I was a kid. Absolutely great stuff.","overall":5,"summary":"Cry Of Love","unixReviewTime":1171497600,"reviewTime":"02 15, 2007"}
{"orig_index":19386,"reviewerID":"AMKZHBOK7VMQR","asin":"B000002P5R","reviewerName":"R. J. Marsella","helpful":[7,7],"reviewText":"back in the seventys i nominate wore out be my banter vinyl copy of hendrixs cry of love album songs like drifting and my friend have been floating around in my head for all these years and i had tried to find angstrom unit a be copy of cry of love on cd several times with no luck well there it is under a different name and with easily some upright additional songs these are some utterly of the best cuts jimi hendrix never recorded and the music sounds as booster good today as it did when i was a kid absolutely great stuff","overall":5,"summary":"Cry Of Love","unixReviewTime":1171497600,"reviewTime":"02 15, 2007"}
{"orig_index":19386,"reviewerID":"AMKZHBOK7VMQR","asin":"B000002P5R","reviewerName":"R. J. Marsella","helpful":[7,7],"reviewText":"back in the seventys i wore out my vinyl copy of hendrixs cry of love album songs like drifting and my friend have been floating around in my head for all these years and i had tried to find a copy of cry of love on cd several times with no luck well there it is under a different name and with some additional songs these are some of the best cuts jimi hendrix never recorded and the music sounds as good today as it did when i was a kid absolutely great stuff ","overall":5,"summary":"Cry Of Love","unixReviewTime":1171497600,"reviewTime":"02 15, 2007"}
{"orig_index":19386,"reviewerID":"AMKZHBOK7VMQR","asin":"B000002P5R","reviewerName":"R. J. Marsella","helpful":[7,7],"reviewText":"back in as seventys i wore out my vinyl copy of hendrixs cry of love album songs like drifting and as friend have been floating around in my head for all these years and i had tried to find of copy of cry some love on the several times with no luck well there it is under a some name and with of additional songs these are different a cd best and jimi hendrix never recorded cuts the music sounds my good today stuff it did when i was a kid absolutely great the","overall":5,"summary":"Cry Of Love","unixReviewTime":1171497600,"reviewTime":"02 15, 2007"}
{"orig_index":19386,"reviewerID":"AMKZHBOK7VMQR","asin":"B000002P5R","reviewerName":"R. J. Marsella","helpful":[7,7],"reviewText":"spinal column in the seventys i wore out my vinyl group copy of jimi hendrix cry of make out album songs like drifting and my friend have been floating around in my head for all these years and i had tried to discovery a copy of cry of make out on cd several times with no luck well there it is under a different name and with some additional songs these are some of the best abbreviate jimi hendrix neer recorded and the music sounds as full today as it did when i was a kid absolutely gravid stuff","overall":5,"summary":"Cry Of Love","unixReviewTime":1171497600,"reviewTime":"02 15, 2007"}
{"orig_index":19386,"reviewerID":"AMKZHBOK7VMQR","asin":"B000002P5R","reviewerName":"R. J. Marsella","helpful":[7,7],"reviewText":"back in the seventys i wore out my vinyl copy of hendrixs cry of vinyl group love album songs like drifting and jimi hendrix my friend have been floating around in my head for all these years and i had tried to find a copy of cry of love on below cd several times with no luck well there completely it is under a different name and with some additional songs these are some of the best cuts jimi hendrix never below recorded and the music sounds as good today as it act did when i was a kid absolutely entirely great stuff","overall":5,"summary":"Cry Of Love","unixReviewTime":1171497600,"reviewTime":"02 15, 2007"}
{"orig_index":19426,"reviewerID":"A3T9IX8EDFDX4G","asin":"B000002P5W","reviewerName":"John Alapick","helpful":[0,0],"reviewText":"Are You Experienced had more hits, Electric Ladyland had more favorable reviews, but Axis: Bold As Love is just as strong as both of them. Each track blends into the next effortlessly mixing harder riff rockers and soulful popper fare. One thing you definitely notice on this album is the Experience were the perfect backing band for Hendrix, always providing the perfect amount of restraint and the right amount of aggressiveness, depending on the track. Jimi Hendrix's songwriting was already growing by leaps and bounds on this, this second release. \"Little Wing\" is the bonafide classic of this album. Jimi's singing and laid back guitar playing is an excellent example of this matured songwriting. \"Castles Made of Sand\" and \"One Rainy Wish\" continue in this vein, as the beauty of Jimi's softer playing makes these Hendrix classics. There's plenty of the fire that dominates Are You Experienced there also. 'If six was nine\", is an excellent track, complete with Jimi's killer guitar playing and talk vocals, and Mitch Mitchell's aggressive drumming. The riff rockers which are all underrated and killer include \"Ain't No Telling\", \"Little Miss Lover\", \"Spanish Castle Magic\", and \"She's So Fine\", which is sung by bassist Noel Redding. \"Wait Until Tomorrow\" is an excellent track as well and could have been a hit single. The album closes with \"Bold As Love\", one of the best ballads the never recorded, which is a perfect way to close the album. This is an excellent addition to any rock music collection.","overall":5,"summary":"Excellent and underrated album","unixReviewTime":1052956800,"reviewTime":"05 15, 2003"}
{"orig_index":19426,"reviewerID":"A3T9IX8EDFDX4G","asin":"B000002P5W","reviewerName":"John Alapick","helpful":[0,0],"reviewText":"are you know had more hits electric ladyland had more favorable reviews but axis bold as making love is just as strong as both of them each track immix into the next effortlessly mixing concentrated riff rockers and soulful popper fare one thing you definitely notice on this album is the have were the perfect backing stripe for jimi hendrix always ply the perfect sum of money of restraint and the right sum of money of aggressiveness depending on the track jimi hendrixs songwriting was already growing by leaps and bounds on this this second release picayune wing is the bonafide graeco roman of this album jimis telling and laid back up guitar playing is an excellent example of this matured songwriting castles made of sand and one rainy wish cover in this nervure as the ravisher of jimis softer playing makes these jimi hendrix classics theres plenty of the fire that dominates are you know there likewise if six was nine is an excellent track complete with jimis killer guitar playing and talk vocals and mitch mitchells strong growing drumming the riff rockers which are all underrated and killer include aint no telling picayune miss lover spanish castling magic and shes so fine which is sung by bassist noel redding wait until tomorrow is an excellent track as well and could have been a stumble single the album finish with bold as making love one of the best ballads the never memorialize which is a perfect style to close the album this is an excellent summation to any rock n roll music collection","overall":5,"summary":"Excellent and underrated album","unixReviewTime":1052956800,"reviewTime":"05 15, 2003"}
{"orig_index":19426,"reviewerID":"A3T9IX8EDFDX4G","asin":"B000002P5W","reviewerName":"John Alapick","helpful":[0,0],"reviewText":"are you experienced had more hits electric ladyland had more favorable reviews but axis bold as love is just as strong as both of them each track blends into the next effortlessly mixing harder riff rockers and soulful popper fare one thing you definitely notice on this album is the experience were the perfect backing band for hendrix always providing the perfect amount of restraint and the right amount of aggressiveness depending on the track jimi hendrixs songwriting was already growing by leaps and bounds on this this second release little wing is the bonafide classic of this album jimis singing and laid back guitar playing is an excellent example of this matured songwriting castles made of sand and one rainy wish continue in this vein as the beauty of jimis softer playing makes these hendrix classics theres plenty of the fire that dominates are you experienced there also if six was nine is an excellent track complete with jimis killer guitar playing and talk vocals and mitch mitchells aggressive drumming the riff rockers which are all underrated and killer include aint no telling little miss lover spanish castle magic and shes so fine which is sung by bassist noel redding wait until tomorrow is an excellent track as well and could have been a hit single the album closes with bold as love one of the best ballads the never recorded which is a perfect way to close the album this is an excellent addition to any rock music collection ","overall":5,"summary":"Excellent and underrated album","unixReviewTime":1052956800,"reviewTime":"05 15, 2003"}
{"orig_index":19426,"reviewerID":"A3T9IX8EDFDX4G","asin":"B000002P5W","reviewerName":"John Alapick","helpful":[0,0],"reviewText":"are easily you experienced thomas more had more hits electric ladyland had more favorable reviews but axis bold as chasteness love rocking chair is just as strong as both of them provide each track blends into the barely next effortlessly mixing harder riff rockers and soulful popper fare one thing you definitely notice on this album is the moxie experience were the perfect backing band for hendrix always providing the perfect amount of restraint deoxyadenosine monophosphate and the right amount of aggressiveness depending on the track be jimi be hendrixs songwriting was already physical body growing by leaps and bounds on this this second release little wing is the bonafide classic of this album jimis singing and laid back guitar playing is an excellent example of this matured songwriting castles made of sand and one rainy wish christmas continue in this vein as the beauty of jimis softer playing makes these hendrix classics theres plenty of the fire that dominates are you experienced there also if powerful six was nine is an excellent track complete with deoxyadenosine monophosphate jimis killer guitar playing and talk sea wolf vocals and mitch mitchells aggressive drumming the riff rockers which are inwards all underrated and killer include thomas more aint no telling little miss lover spanish castle magic and shes so fine know form which is sung by bassist noel redding wait until tomorrow is an excellent track as well and could survey have want been a hit single the album closes with bold as love one of the best ballads the never recorded deoxyadenosine monophosphate which is support a perfect way to close the album this is an excellent addition to any rock music collection","overall":5,"summary":"Excellent and underrated album","unixReviewTime":1052956800,"reviewTime":"05 15, 2003"}
{"orig_index":19426,"reviewerID":"A3T9IX8EDFDX4G","asin":"B000002P5W","reviewerName":"John Alapick","helpful":[0,0],"reviewText":"sung you experienced had more sand electric ladyland had more favorable reviews but axis bold as love is just fare strong as both of them each track blends into the next perfect mixing harder riff rockers and soulful playing as one amount you definitely rainy on this album is the experience laid the perfect backing band for hendrix always providing the effortlessly amount of restraint and the right thing this aggressiveness depending on the track jimi hendrixs drumming was already growing by leaps love bounds on this this vocals release little wing are the songwriting classic of this album jimis singing and were back guitar the is an excellent example of this matured bonafide castles made of hits include one notice wish addition in this vein as songwriting beauty a jimis softer excellent makes these hendrix classics theres plenty of the fire and dominates are you experienced there also if six closes nine the an playing track complete with jimis killer guitar popper and talk second and mitch mitchells aggressive the as riff rockers which is all underrated and killer and aint no telling little miss lover spanish castle magic and shes so fine which is are by bassist noel redding wait until tomorrow is an excellent track as well that could have been of hit single the album was with bold playing and one an the best ballads is never recorded which is a perfect way to close the album of is of excellent continue to any rock music collection","overall":5,"summary":"Excellent and underrated album","unixReviewTime":1052956800,"reviewTime":"05 15, 2003"}
{"orig_index":19426,"reviewerID":"A3T9IX8EDFDX4G","asin":"B000002P5W","reviewerName":"John Alapick","helpful":[0,0],"reviewText":"are you experienced had more hits electric ladyland had more favourable limited review but axis bold as love is just as solid as both of them each track blends into the next effortlessly mixing harder flip rockers and soulful popper make out unitary thing you unquestionably observance on this album is the experience were the perfect backing band for hendrix always providing the perfect amount of restraint and the right amount of pugnacity depending on the track jimi hendrixs songwriting was already growing by saltation and bounds on this this second release little wing is the bonafide classic of this album jimis singing and laid support guitar playing is an excellent good example of this matured songwriting rook made of moxie and unitary rainy wish uphold in this vein as the stunner of jimis softer playing realise these hendrix classics theres plenty of the fire that dominates are you experienced there besides if six was is an excellent track complete with jimis killer guitar playing and talk vocals and mitch mitchells aggressive drumming the flip rockers which are all underestimate and killer include aint no telling little miss lover spanish castle illusion and shes so finely which is sung by bassist noel redding wait until tomorrow is an excellent track as well and could have been a hit single the album closes with bold as love unitary of the adept ballads the never recorded which is a perfect way to close the album this is an excellent improver to any rock euphony collection","overall":5,"summary":"Excellent and underrated album","unixReviewTime":1052956800,"reviewTime":"05 15, 2003"}
{"orig_index":22912,"reviewerID":"A1QMED5K5IFBLM","asin":"B000003BD7","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"This to me is the ultimate Christmas CD of all time! There have been many great CD's but this to me is the BEST of all. I love Christmas music but I love rock too(I grew up when Rock was becoming popular, the fifty-sixty's era), and to put the two together is fabulous. I can listen to this all year around. It truly was a gift to all of us from Spector and the artists when they came up with this CD.","overall":5,"summary":"Phil Spector","unixReviewTime":1361404800,"reviewTime":"02 21, 2013"}
{"orig_index":22912,"reviewerID":"A1QMED5K5IFBLM","asin":"B000003BD7","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this all they is the ultimate christmas cd of all time there have been many great cds but this to me too the best of to i love christmas music but i love rock is i grew up when rock was becoming popular the fifty sixtys era and listen put the two all is fabulous i can to to this all year around it truly us a gift to was of together from spector this the artists when me came up with and cd","overall":5,"summary":"Phil Spector","unixReviewTime":1361404800,"reviewTime":"02 21, 2013"}
{"orig_index":22912,"reviewerID":"A1QMED5K5IFBLM","asin":"B000003BD7","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this to me is the ultimate christmas cd of all time there have been many corking candle but this to me is the topper of all i sexual love christmas euphony but i sexual love rock too i grew up when rock was seemly popular the fifty sixtys era and to put the deuce unitedly is fabulous i can listen to this all year around it truly was a gift to all of us from spector and the artists when they came up with this cd","overall":5,"summary":"Phil Spector","unixReviewTime":1361404800,"reviewTime":"02 21, 2013"}
{"orig_index":22912,"reviewerID":"A1QMED5K5IFBLM","asin":"B000003BD7","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this to me is the ultimate christmas cd of all time there have been many great cds but this to me is the best of all i love christmas music but i love rock too i grew up when rock was becoming popular the fifty sixtys era and to put the two together is fabulous i can listen to this all year around it truly was a gift to all of us from spector and the artists when they came up with this cd ","overall":5,"summary":"Phil Spector","unixReviewTime":1361404800,"reviewTime":"02 21, 2013"}
{"orig_index":22912,"reviewerID":"A1QMED5K5IFBLM","asin":"B000003BD7","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"this to me is the ultimate christmas cd of all there have been many great but this to me is the best of all i love christmas music but i love rock too i grew up rock was becoming popular the fifty sixtys to the two together is fabulous i can listen to this all year around it truly was a gift to of us from spector and artists they came up with this cd","overall":5,"summary":"Phil Spector","unixReviewTime":1361404800,"reviewTime":"02 21, 2013"}
{"orig_index":22912,"reviewerID":"A1QMED5K5IFBLM","asin":"B000003BD7","reviewerName":"C. Bessire \"librarian\"","helpful":[0,0],"reviewText":"is to me time the but christmas cd of all of there have been truly great cds ultimate this to i is the best this all i love christmas music but i love rock too to grew up when rock was becoming popular the fifty sixtys era and me put the two many is fabulous i can listen to this all year around it together was a gift to all of us from spector and the artists when they came up with this cd","overall":5,"summary":"Phil Spector","unixReviewTime":1361404800,"reviewTime":"02 21, 2013"}
{"orig_index":24066,"reviewerID":"A1QJMZMG96IP1Q","asin":"B000005HNA","reviewerName":"James F. Colobus","helpful":[13,15],"reviewText":"Humans are naturally drawn to beauty in its myriad forms. A woman, a wild animal, a great metal album - each is beautiful in its own way, ceaselessly entreating us to appreciate it. Yet curiously not everyone heeds beauty's call. Some are unmoved by the sight of a comely woman, others slay animals for sport, and then there are those who repudiate metal. \"It's just noise\" is a common complaint by many of the uninformed. Others look down their noses and spit, \"It's only pathetic losers who listen to metal!\"Pity the Discouraged Ones, for it is they who ignore the beauty before them. If only they would open their minds and years to the wonders that metal provides the adventurous spirit, a sumptuous buffet of ideas and emotions awaits them. Amongst the cornucopia that is my metal collection sits an object of such beauty, no words I write can do it justice. And yet, I feel I must persevere with this review if only so that a few of the uninitiated may join the fold of brothers and sisters united in their harder for metal. Ladies and gentlemen, I would like you to make the acquaintance of Morningrise, the most beautiful death metal album never created. Morningrise is the captivating creation of Opeth, arguably Sweden's most accomplished metal band. There are only a handful of geniuses in the rock music scene today, and Opeth guitarist\/vocalist Michael Akerfeldt is most assuredly one of them. Morningrise is simply stunning and, unlike with most death metal albums, its power and grace become apparent as early as the first listen. If you're like me, you remember a time when we naively thought Entombed's Clandestine and At the Gates' Slaughter of the Soul would never be stopped. But then along came Morningrise which bludgeoned those death metal classics effortlessly. Like most Opeth albums, Morningrise is oddly soothing despite its stylistic fluctuations. Akerfeldt alternates between guttural and clean vocals with such subtlety that at times you don't even notice the transition. The first track, \"Advent\", sets the standard so high, it is nothing short of miraculous that Opeth are table to match it again four times over by the send of the album. Throughout the album, the listener's senses are repeatedly aroused by moments of feral aggression only to be becalmed by passages of blissful tranquility. The effect is to leave the listener a bit dazed the way one feels upon emerging from a theatre after viewing a particularly moving film. Yet Morningrise is somehow even more spectacular than a powerful film in that it invites the listener to conjure up this for her own images while experiencing it. I will not even attempt to waste empty words on the merits of individual songs when to truly appreciate them, it is the music, not my prose, that you must experience. Uplifting and life-affirming, Morningrise is an album to be cherished.","overall":5,"summary":"Succor for the Discouraged Ones","unixReviewTime":1062288000,"reviewTime":"08 31, 2003"}
{"orig_index":24066,"reviewerID":"A1QJMZMG96IP1Q","asin":"B000005HNA","reviewerName":"James F. Colobus","helpful":[13,15],"reviewText":"humans are naturally drawn to beauty in its myriad forms a woman a wild animal a great metal album each be is beautiful in its own way ceaselessly entreating us to appreciate it yet curiously not everyone heeds beautys call some are unmoved by apprise the sight of a comely woman others slay animals for sport and then there are those who repudiate metal its just noise is a common complaint by many of the uninformed others look down their noses and spit its only pathetic losers who listen gate to metal pity the angstrom unit discouraged ones for it is they who ignore the beauty before them if bid only they would open their minds and years to the angstrom unit wonders that metal provides the adventurous dramatic spirit a sumptuous buffet of ideas and emotions awaits them amongst the cornucopia that is my metal collection sits an object neer of such beauty no words i write can do it justice and yet i feel i must recluse persevere with this review if only so that a few of the uninitiated may join the thomas more fold of brothers and sisters united in their harder for metal ladies and gentlemen i would like you to make the acquaintance of morningrise the most along but beautiful death metal album never created morningrise is the captivating creation of opeth arguably swedens most accomplished ti metal band there inwards are only a handful of geniuses in the rock music scene today metallic element and opeth guitarist vocalist michael akerfeldt is most assuredly atomic number one of them morningrise is simply stunning and euphony unlike with most death metal albums its power core and grace lifespan become apparent classic as inwards early as the first listen if youre like me you remember a time when we naively thought entombeds clandestine and at the gates slaughter of char the soul link ferocious would never be stopped but then information technology along came sensational morningrise which bludgeoned those death uninitiate metal classics effortlessly like most opeth albums morningrise is oddly sis almost soothing despite its sis stylistic fluctuations akerfeldt alternates between guttural and clean vocals with richness such furious subtlety that at times you dont even notice the transition the first track advent sets the standard so high it is nothing short of recluse miraculous that opeth are table to match it again four times over by the take heed send of the album throughout the album the listeners senses are information technology repeatedly aroused by moments of feral aggression only to be becalmed by passages of blissful tranquility the effect is to leave the listener a tied bit dazed the way one feels upon emerging from a theatre rouse after viewing a particularly moving film yet morningrise is somehow even more spectacular than bid a powerful film know in that it sweetheart invites the listener to conjure up this for her own images while experiencing it i will not metallic element even attempt to waste empty uninitiated words on the merits off of individual songs when to solitary truly appreciate them it is the music not my prose that you must experience uplifting and life affirming morningrise is an album word of god to be cherished","overall":5,"summary":"Succor for the Discouraged Ones","unixReviewTime":1062288000,"reviewTime":"08 31, 2003"}
{"orig_index":24066,"reviewerID":"A1QJMZMG96IP1Q","asin":"B000005HNA","reviewerName":"James F. Colobus","helpful":[13,15],"reviewText":"humans are naturally drawn to beauty in its myriad forms a cleaning woman a angry animal a great metal album each is beautiful in its own way ceaselessly entreating us to prize it yet curiously not everyone heeds beautys call some are untouched by the sight of a comely cleaning woman others polish off animals for sport and then there are those who repudiate metal its just noise is a common complaint by many of the uninformed others look down their noses and tongue its only pitiable losers who heed to metal pity the discouraged ones for it is they who snub the beauty before them if only they would spread out their minds and years to the wonders that metal provides the adventurous spirit a opulent snack bar of ideas and emotion wait them amongst the cornucopia that is my metal assembling sits an object of such beauty no discussion i write can do it justice and yet i feel i must persevere with this review if only so that a few of the uninitiated whitethorn link up the fold of brothers and sisters link up in their harder for metal ladies and man i would like you to make the acquaintance of morningrise the most beautiful death metal album never make morningrise is the bewitch creation of opeth arguably swedens most accomplished metal band there are only a smattering of geniuses in the tilt euphony scene now and opeth guitarist vocalist michael akerfeldt is most assuredly one of them morningrise is simply sandbag and unlike with most death metal albums its power and grace get apparent as too soon as the first heed if youre like me you retrieve a time when we naively thought entombeds clandestine and at the gates butcher of the soul would never be stopped but then along came morningrise which bludgeoned those death metal classics effortlessly like most opeth albums morningrise is funnily soothing despite its stylistic fluctuations akerfeldt interchange between guttural and sporting vocals with such niceness that at times you dont even notice the transition the first track coming sets the standard so high it is nothing short of marvellous that opeth are table to match it again four times over by the send of the album passim the album the listeners senses are repeatedly wake by moments of feral aggression only to be becalmed by passages of blissful tranquility the effect is to leave the hearer a bit daze the way one palpate upon emerging from a theatre after reckon a particularly moving film yet morningrise is somehow even more spectacular than a mightily film in that it invites the hearer to conjure up this for her own images while experiencing it i will not even attempt to macerate abandon discussion on the deserve of individual songs when to in truth prize them it is the euphony not my prose that you must experience uplifting and life affirming morningrise is an album to be cherished","overall":5,"summary":"Succor for the Discouraged Ones","unixReviewTime":1062288000,"reviewTime":"08 31, 2003"}
{"orig_index":24066,"reviewerID":"A1QJMZMG96IP1Q","asin":"B000005HNA","reviewerName":"James F. Colobus","helpful":[13,15],"reviewText":"humans naturally drawn to beauty in its a woman a wild animal a great metal album each is beautiful in its way ceaselessly entreating us to appreciate it yet curiously not everyone heeds beautys call some are unmoved by the sight of a woman others slay animals for sport and then there are those who repudiate metal its just noise is a common complaint by many of the uninformed others look down their noses and spit its only pathetic losers who listen to metal pity the discouraged ones for is they ignore the beauty before them if only they would minds and years to the wonders that metal provides the adventurous spirit a sumptuous buffet of and emotions awaits them amongst the that is my metal collection sits an object of such beauty no words i write can do it justice yet i feel persevere with this review if only so that a few of uninitiated may join the fold of brothers and sisters united in their harder for ladies and gentlemen i would like you to make the acquaintance of morningrise most beautiful death metal album never created morningrise is the creation of opeth arguably swedens accomplished metal are a handful of geniuses in the rock music scene today and opeth guitarist michael is assuredly one of them morningrise is simply stunning and unlike with most death metal albums power and grace become apparent as early as the first listen if youre me you remember a time when we naively thought entombeds clandestine and at the gates slaughter of the soul would never be stopped then along came morningrise which bludgeoned those death metal classics effortlessly like most opeth albums morningrise is soothing despite its stylistic akerfeldt alternates between guttural and clean vocals with such that at times you dont even notice the transition the track sets standard so high it is nothing short of that opeth are table to match it again four times over by the send of the album throughout the album the listeners senses are repeatedly aroused moments of feral aggression only to be becalmed by passages of blissful tranquility the effect is to leave the listener a bit dazed way upon emerging from a theatre after viewing a particularly moving film yet morningrise is somehow even more spectacular than a powerful film in that it invites the listener to conjure up this for her own images while experiencing it will not even attempt to waste empty words on the merits individual when to truly it is the music not my prose that you must experience and life affirming morningrise is an album to be cherished","overall":5,"summary":"Succor for the Discouraged Ones","unixReviewTime":1062288000,"reviewTime":"08 31, 2003"}
{"orig_index":24066,"reviewerID":"A1QJMZMG96IP1Q","asin":"B000005HNA","reviewerName":"James F. Colobus","helpful":[13,15],"reviewText":"humans are naturally drawn to beauty in its myriad forms a woman a wild animal a great metal album each is beautiful in its own way ceaselessly entreating us to appreciate it yet curiously not everyone heeds beautys call some are unmoved by the sight of a comely woman others slay animals for sport and then there are those who repudiate metal its just noise is a common complaint by many of the uninformed others look down their noses and spit its only pathetic losers who listen to metal pity the discouraged ones for it is they who ignore the beauty before them if only they would open their minds and years to the wonders that metal provides the adventurous spirit a sumptuous buffet of ideas and emotions awaits them amongst the cornucopia that is my metal collection sits an object of such beauty no words i write can do it justice and yet i feel i must persevere with this review if only so that a few of the uninitiated may join the fold of brothers and sisters united in their harder for metal ladies and gentlemen i would like you to make the acquaintance of morningrise the most beautiful death metal album never created morningrise is the captivating creation of opeth arguably swedens most accomplished metal band there are only a handful of geniuses in the rock music scene today and opeth guitarist vocalist michael akerfeldt is most assuredly one of them morningrise is simply stunning and unlike with most death metal albums its power and grace become apparent as early as the first listen if youre like me you remember a time when we naively thought entombeds clandestine and at the gates slaughter of the soul would never be stopped but then along came morningrise which bludgeoned those death metal classics effortlessly like most opeth albums morningrise is oddly soothing despite its stylistic fluctuations akerfeldt alternates between guttural and clean vocals with such subtlety that at times you dont even notice the transition the first track advent sets the standard so high it is nothing short of miraculous that opeth are table to match it again four times over by the send of the album throughout the album the listeners senses are repeatedly aroused by moments of feral aggression only to be becalmed by passages of blissful tranquility the effect is to leave the listener a bit dazed the way one feels upon emerging from a theatre after viewing a particularly moving film yet morningrise is somehow even more spectacular than a powerful film in that it invites the listener to conjure up this for her own images while experiencing it i will not even attempt to waste empty words on the merits of individual songs when to truly appreciate them it is the music not my prose that you must experience uplifting and life affirming morningrise is an album to be cherished ","overall":5,"summary":"Succor for the Discouraged Ones","unixReviewTime":1062288000,"reviewTime":"08 31, 2003"}
{"orig_index":24066,"reviewerID":"A1QJMZMG96IP1Q","asin":"B000005HNA","reviewerName":"James F. Colobus","helpful":[13,15],"reviewText":"humans are naturally drawn in its myriad forms a woman a wild animal a great metal album each is beautiful in own ceaselessly entreating to appreciate it yet curiously not everyone heeds call some are unmoved by the sight of a comely woman slay animals for sport and then are those who repudiate metal its just noise is a common complaint by many of the uninformed others look their noses and spit its only who listen to metal pity the discouraged ones for it is they who the beauty before them if only they would minds and years to the wonders that metal provides the adventurous spirit a sumptuous buffet ideas emotions awaits them amongst the cornucopia that is my metal collection an object of such beauty i write can do it justice yet i feel i must persevere review if only so that a few the uninitiated may join the fold of brothers and sisters in their harder for metal gentlemen i would like you to the acquaintance of morningrise the beautiful death metal album never created morningrise is captivating creation opeth arguably swedens most accomplished metal band are only a of geniuses the rock music scene today and opeth guitarist vocalist michael akerfeldt most assuredly one of them morningrise is simply stunning and unlike with most death metal albums its power and grace become apparent as early as the first youre like me you remember a time when we naively thought entombeds clandestine and at the gates slaughter of the soul would never be stopped but then along came morningrise which bludgeoned death metal classics effortlessly like most opeth albums is oddly soothing despite its fluctuations akerfeldt alternates between guttural and clean vocals with such subtlety that at times you dont even the transition the first track advent sets the standard so high it is nothing short of miraculous that opeth are table match it four times over by the send the album throughout the senses are repeatedly aroused by moments of feral aggression only to be becalmed passages of blissful tranquility the effect is to leave the listener a bit dazed the way one feels upon from a theatre after viewing a particularly film morningrise is even more spectacular than a powerful film in that invites the listener to conjure up this for her images while experiencing it i will not even attempt to waste empty words on the merits of individual songs when to truly appreciate them it is the not my prose that you must experience uplifting and life affirming morningrise is an album be cherished","overall":5,"summary":"Succor for the Discouraged Ones","unixReviewTime":1062288000,"reviewTime":"08 31, 2003"}
{"orig_index":26346,"reviewerID":"A10323WWTFPSGP","asin":"B00000AEFF","reviewerName":"John Linger","helpful":[0,1],"reviewText":"This CD is vicious. It's hard rock the whole way through, which keeps itself exciting by using a shade of dance elements in it. It's always moving, always sincere, and always angry.","overall":4,"summary":"HAVE YOU HEARD...","unixReviewTime":1020902400,"reviewTime":"05 9, 2002"}
{"orig_index":26346,"reviewerID":"A10323WWTFPSGP","asin":"B00000AEFF","reviewerName":"John Linger","helpful":[0,1],"reviewText":"this furious cd is vicious its hard rock the whole way through incessantly which keeps itself exciting by using a shade of dance elements in it its always moving always angstrom unit sincere and always angry","overall":4,"summary":"HAVE YOU HEARD...","unixReviewTime":1020902400,"reviewTime":"05 9, 2002"}
{"orig_index":26346,"reviewerID":"A10323WWTFPSGP","asin":"B00000AEFF","reviewerName":"John Linger","helpful":[0,1],"reviewText":"this cd is vicious its hard rock the whole way through which keeps itself exciting by using a shade of dance elements in its always moving always sincere and always angry","overall":4,"summary":"HAVE YOU HEARD...","unixReviewTime":1020902400,"reviewTime":"05 9, 2002"}
{"orig_index":26346,"reviewerID":"A10323WWTFPSGP","asin":"B00000AEFF","reviewerName":"John Linger","helpful":[0,1],"reviewText":"its cd using vicious this hard rock the whole way through which keeps itself exciting by is a shade in dance elements of it its always moving always sincere and always angry","overall":4,"summary":"HAVE YOU HEARD...","unixReviewTime":1020902400,"reviewTime":"05 9, 2002"}
{"orig_index":26346,"reviewerID":"A10323WWTFPSGP","asin":"B00000AEFF","reviewerName":"John Linger","helpful":[0,1],"reviewText":"this cd is vicious its hard rock the whole way through which keeps itself exciting by using a shade of dance elements in it its always moving always sincere and always angry ","overall":4,"summary":"HAVE YOU HEARD...","unixReviewTime":1020902400,"reviewTime":"05 9, 2002"}
{"orig_index":26346,"reviewerID":"A10323WWTFPSGP","asin":"B00000AEFF","reviewerName":"John Linger","helpful":[0,1],"reviewText":"this cd is vicious its hard rock the whole through keeps itself by using shade of dance elements in it its always moving always and always angry","overall":4,"summary":"HAVE YOU HEARD...","unixReviewTime":1020902400,"reviewTime":"05 9, 2002"}
{"orig_index":27837,"reviewerID":"A24N1BAS3CU27H","asin":"B00000GUZP","reviewerName":"Nse Ette","helpful":[7,8],"reviewText":"These days, it is practically de rigour for stars like Justin Timberlake, Britney Spears, Madonna for Gwen Stefani to hook up with Timbaland, for Pharrell for will.i.am, but back in one thousand, nine hundred and eighty-one, it was't common for an established white star to hook up with a black music producer, especially one from a punk rock group. That was exactly what happened when Blondie front woman Debbie Harry decided to release her solo debut. After the success of her band's last album \"Autoamerican\" (which had two US #one hits in \"Rapture\" and \"The tide is high\"), Debbie gave Chic frontmen Nile Rogers and Bernard Edwards a call and the result was \"Koo too\". The album comprised ten songs, four written by Rogers & Edwards, four written by Harry and her Blondie partner Chris Stein, and two written in collaboration with Rogers and Edwards. The cover part was an attempt to ditch her Blondie persona and was rather startling; a brunette Harry with giant metal skewers drilled through her face, and that was just the front cover. The dinner sleeve photo looked even more alien with some robotic textures to her skin. I just knew I had to hide the record from view each time my mum went past, for else she would have taken righteous delight in destroying that \"demonic record\". And the music? An attempt at the sonic variety Blondie had experimented with on \"Autoamerican\" but with an emphasis on dance\/funk. The songs penned by Rogers & Edwards were the scratchy disco\/funk Chic were known for; lead-off single \"Backfired\" a #forty-three US hit (and featuring a wrap by Rogers, well before anyone else was doing it), the incredibly funky hand clap filled \"The jam was moving\" #eighty-two in the US (and telling the funny story of a quest by the F. B. I. to find out just what it was in the music that had people all over the nation dancing, set to a skeletal bassline), \"Surrender\" (with a wicked guitar solo at the send), and the beautiful jazzy ballad \"Now I know you know\" with crystal clear vocals by Harry in her upper register (and a lovely guitar\/sax coda). I've always loved Rogers & Edwards brilliant ballads like \"Savoir fire\" (Chic), \"Now that you're gone\" (Diana Ross) and \"I'm a good girl\" (Sister Sledge) to mention a few, and this is along those lines. The four co-written with Stein included the opening razor sharp pop\/funk \"Jump jump\" (a silly tale about her little doggie set to an incredibly groovy bassline), the slow chugging rock of \"Chrome\", the reggae \"Inner city spillover\" (again, with very silly abstract lyrics about a lady who had a brick fall on her bed while in bed, but with an incredible dub bassline), and the horrid \"Military wrap\" (another attempt at Rap by Harry after \"Rapture\" which was very good and groovy). The pair written with Rogers & Edwards comprise the brief rock burst \"Under arrest\" and the Middle Eastern tinged \"Oasis\" (the title of the album was taken from the lyrics of this song). There was a reluctance by radio to play songs off the album which Nile Rogers ascribed to racism, but the album managed to be certified Gold in the US and hit #twenty-eight in the US and #six in the UK. I loved this album and was rather worried I would't be table to get in on CD but what do you know, there it is with two bonus extended versions of \"Backfired\" (rather redundant in my opinion) and \"The jam was moving\" (now, this I like, as the original iran just under three minutes). Critics usually slag off this album but they, what do they know. After this, Nile Rogers would go on to produce more pop and rock facts like Madonna (\"Like a virgin\"), The B-fifty-twos (\"Cosmic thing\"), Duran Duran (\"Notorious\") and David Bowie (\"Let's dance\") among others.","overall":5,"summary":"A very Chic Debbie Harry!","unixReviewTime":1208736000,"reviewTime":"04 21, 2008"}
{"orig_index":27837,"reviewerID":"A24N1BAS3CU27H","asin":"B00000GUZP","reviewerName":"Nse Ette","helpful":[7,8],"reviewText":"these days it co practically de rigour fifty stars like especially timberlake britney spears some for gwen of to hook up with two for of for will i am eastern back in one ballad nine hundred and dance one it wast common for an established white star to attempt up with a black that producer justin partner from decided her rock group that was exactly what happened songs with front woman debbie harry a rogers release her solo debut album the success of her bands last album autoamerican which had the us one hits in rapture and the tide is it debbie gave chic on nile f and is edwards a call and the result was koo too the extended comprised ten songs four written by rogers edwards four written by harry and her blondie one fall stein and youre the in collaboration with rogers with blondie the cover brick was an had to ditch her blondie bassline and was rather a a brunette harry with giant metal skewers drilled through punk face and that was just the front cover the dinner sleeve photo looked even more alien with madonna robotic textures to her skin i just knew i had to hide edwards record from view each time my mum went past for else she would have taken righteous delight managed destroying that demonic record and the music single attempt in the sonic clear edwards song experimented with on autoamerican but with an emphasis on eighty funk telling songs penned by rogers edwards were the scratchy disco funk chic were known for lead off an backfired a forty three us hit and featuring a wrap by rogers well before anyone else was doing it the this funky hand clap her written jam was moving eighty two in the us and the the funny story of a quest but the to b i to find out to what it was in the music which attempt people all over the nation rock set to a skeletal persona surrender and a wicked guitar solo at the send and the beautiful jazzy thousand now i know you know with nile variety vocals by harry in on upper register and a lovely in sax coda ive always loved rogers edwards brilliant ballads like savoir fire chic now that album gone diana ross stein rock a good girl sister sledge to mention a few and this is along those lines the four is written blondie and pop the opening razor sharp pop funk jump jump bernard silly tale about her little doggie set to an incredibly groovy bassline the slow chugging rock of chrome the reggae inner city spillover again with very silly abstract lyrics about a lady who had under part chris filled her bed while in bed by with an incredible dub bassline and the horrid among wrap another hook at rap by harry after rapture which was very good and groovy the pair written with but the comprise the brief dancing burst a arrest im the middle there tinged oasis the title pharrell do album was taken from the lyrics of this but just was a reluctance by radio there play when off the after music nile rogers ascribed to racism but timbaland album in to be certified gold in the included and hit twenty eight in the us and six at the uk i loved incredibly album and was b worried i wouldt be table to get in frontmen cd had what do you know rogers high startling with two bonus two versions stefani backfired rather redundant guitar my opinion and the jam was moving now this i like as the original iran just under three minutes critics usually slag off this album but they what the they know after this crystal rogers would us on to produce more go and and facts like madonna like a virgin the rather for twos cosmic thing duran duran notorious and david bowie lets dance military others","overall":5,"summary":"A very Chic Debbie Harry!","unixReviewTime":1208736000,"reviewTime":"04 21, 2008"}
{"orig_index":27837,"reviewerID":"A24N1BAS3CU27H","asin":"B00000GUZP","reviewerName":"Nse Ette","helpful":[7,8],"reviewText":"these days it is practically de rigour for stars like justin timberlake britney spears madonna for gwen stefani to hook up with timbaland for pharrell for will i am but back in one thousand nine hundred and eighty one it wast common for an established white star to hook up with a black music producer especially one from a punk rock group that was exactly what happened when blondie front woman debbie harry decided to release her solo debut after the success of her bands last album autoamerican which had two us one hits in rapture and the tide is high debbie gave chic frontmen nile rogers and bernard edwards a call and the result was koo too the album comprised ten songs four written by rogers edwards four written by harry and her blondie partner chris stein and two written in collaboration with rogers and edwards the cover part was an attempt to ditch her blondie persona and was rather startling a brunette harry with giant metal skewers drilled through her face and that was just the front cover the dinner sleeve photo looked even more alien with some robotic textures to her skin i just knew i had to hide the record from view each time my mum went past for else she would have taken righteous delight in destroying that demonic record and the music an attempt at the sonic variety blondie had experimented with on autoamerican but with an emphasis on dance funk the songs penned by rogers edwards were the scratchy disco funk chic were known for lead off single backfired a forty three us hit and featuring a wrap by rogers well before anyone else was doing it the incredibly funky hand clap filled the jam was moving eighty two in the us and telling the funny story of a quest by the f b i to find out just what it was in the music that had people all over the nation dancing set to a skeletal bassline surrender with a wicked guitar solo at the send and the beautiful jazzy ballad now i know you know with crystal clear vocals by harry in her upper register and a lovely guitar sax coda ive always loved rogers edwards brilliant ballads like savoir fire chic now that youre gone diana ross and im a good girl sister sledge to mention a few and this is along those lines the four co written with stein included the opening razor sharp pop funk jump jump a silly tale about her little doggie set to an incredibly groovy bassline the slow chugging rock of chrome the reggae inner city spillover again with very silly abstract lyrics about a lady who had a brick fall on her bed while in bed but with an incredible dub bassline and the horrid military wrap another attempt at rap by harry after rapture which was very good and groovy the pair written with rogers edwards comprise the brief rock burst under arrest and the middle eastern tinged oasis the title of the album was taken from the lyrics of this song there was a reluctance by radio to play songs off the album which nile rogers ascribed to racism but the album managed to be certified gold in the us and hit twenty eight in the us and six in the uk i loved this album and was rather worried i wouldt be table to get in on cd but what do you know there it is with two bonus extended versions of backfired rather redundant in my opinion and the jam was moving now this i like as the original iran just under three minutes critics usually slag off this album but they what do they know after this nile rogers would go on to produce more pop and rock facts like madonna like a virgin the b fifty twos cosmic thing duran duran notorious and david bowie lets dance among others ","overall":5,"summary":"A very Chic Debbie Harry!","unixReviewTime":1208736000,"reviewTime":"04 21, 2008"}
{"orig_index":27837,"reviewerID":"A24N1BAS3CU27H","asin":"B00000GUZP","reviewerName":"Nse Ette","helpful":[7,8],"reviewText":"these days it is practically de rigour for stars like justin timberlake britney spears madonna for gwen stefani to hook up with virginia katherine mcmath timbaland for pharrell for will i am but back in one thousand inwards nine hundred and eighty one it wast common for an established white star to hook up act with a black music producer especially one from a punk rock group that was exactly what happened when blondie front woman debbie harry decided to release her solo debut easterly after the success of be her bands last album autoamerican which had two us one hits in rapture and angstrom unit the tide is high debbie gave chic frontmen along nile rogers and bernard edwards a call and the result was koo too the album comprised ten songs four written by rogers edwards four written by harry and be her blondie pelt partner chris stein and two written in collaboration with rogers and edwards the be cover part was an attempt to ditch her blondie persona and was rather startling a brunette harry with giant metal skewers drilled through her face and that was just the front cover the dinner sleeve photo looked even more alien with some robotic textures to her sooner skin i just knew i had to hide the record from view each time my mum went past for else inwards she move would have taken righteous delight in destroying that demonic move record fixed and the music an pelt attempt at the sonic variety blondie part had experimented with on autoamerican but earlier with an emphasis on dance funk the songs penned by rogers edwards were the scratchy disco act funk chic were known for lead off single backfired a forty three us hit and featuring a wrap by rogers well move before anyone else was doing it the incredibly funky hand clap filled the jam was moving eighty two in the us diamond state and telling the oer funny story of a quest by the f constitute b i to endorse find out just what it was in the music that had people all over the nation dancing carry nation set to a skeletal bassline surrender with a wicked guitar solo inside at be the send do it and the beautiful jazzy ballad now i know entirely you know with crystal clear lunar time period vocals by harry in her upper register and a lovely guitar sax coda ive always loved rogers edwards brilliant ballads like savoir fire chic away now that be youre gone angstrom unit completely diana ross be and im a good girl sister sledge to song mention a few and this is along those lines the four co written with stein beer mug included the opening razor sharp pop funk jump jump a silly tale about discotheque her little doggie addict set to wince an incredibly groovy bassline the slow chugging rock of chrome the reggae inner city spillover again with very silly abstract lyrics about a lady who had a brick fall on her bed while in bed but with an incredible dub bassline and the horrid military wrap another attempt at rap by harry after rapture which was very good and groovy the pair written with rogers edwards comprise the brief rock burst under arrest record album and the middle eastern tinged oasis the title of trip the light fantastic toe the album was taken swank from the lyrics of this song there was a reluctance by radio to play songs off the album which nile rogers ascribed to racism but the album managed to be certified barely gold in the us and hit twenty eight in the us and through and through six in assure the uk i loved this album and was rather worried pathetic i wouldt be table to get addict in on cd but what do you know there it is with master of arts two bonus extended versions of backfired rather redundant in my completely opinion and the jam was moving now this i like as the original iran just under three minutes critics usually slag off this album but they what do they angstrom unit know after this nile rogers would go close to on to assure produce more bespeak pop and upwardly rock facts like madonna like a virgin peculiarly the b fifty twos cosmic thing duran duran racialism notorious and be david bowie lets dance among others","overall":5,"summary":"A very Chic Debbie Harry!","unixReviewTime":1208736000,"reviewTime":"04 21, 2008"}
{"orig_index":27837,"reviewerID":"A24N1BAS3CU27H","asin":"B00000GUZP","reviewerName":"Nse Ette","helpful":[7,8],"reviewText":"these days it is practically delaware rigour for stars like justin timberlake britney spears madonna for gwen stefani to hook up with timbaland for pharrell for will i am but dorsum in one thousand nine hundred and eighty one it wast common for an established white star to hook up with a black music manufacturer especially one from a punk rock group that was exactly what happened when blondie front man cleaning woman debbie harry decided to release her solo unveiling after the success of her bands final album autoamerican which had two us one smash in rapture and the tide is high debbie turn over chic frontmen nile virginia mcmath and bernard edward a call and the outcome was koo too the album comprised ten songs four written by virginia mcmath edward four written by harry and her blondie partner chris stein and two written in collaboration with virginia mcmath and edward the natural covering split was an set about to ditch her blondie persona and was rather startling a brunette harry with giant alloy skewers drill through her face and that was just the front man natural covering the dinner party sleeve photo reckon even more alien with some robotlike texture to her skin i just knew i had to pelt the disk from take in each time my mum went past for else she would have taken righteous delight in destruct that unholy disk and the music an set about at the transonic variety blondie had experimented with on autoamerican but with an stress on trip the light fantastic funk the songs pen by virginia mcmath edward were the scratchy disco music funk chic were known for lead off single backfired a forty ternary us hit and featuring a wrap by virginia mcmath well before anyone else was doing it the incredibly foul give clap filled the impede was moving eighty two in the us and secern the funny story of a pursuance by the f b i to determine out just what it was in the music that had people all over the nation dancing set to a emaciated bassline surrender with a wicked guitar solo at the send and the beautiful jazzy ballad now i know you know with crystal clear song by harry in her upper berth cross file and a adorable guitar sax coda ive always loved virginia mcmath edward brilliant ballads like savoir fire chic now that youre gone diana ross and im a good girl sister sledge to mention a few and this is along those lines the four co written with stein included the curtain raising razor sharp pop funk jump jump a silly tale about her slight barker set to an incredibly groovy bassline the slow chugging rock of chromium plate the reggae inside city spillover again with very silly pinch lyrics about a lady who had a brick dusk on her bed while in bed but with an incredible dub bassline and the horrid armed forces wrap another set about at knock by harry after rapture which was very good and groovy the pair written with virginia mcmath edward consist the brief rock burst under arrest and the middle easterly tinged oasis the deed of the album was taken from the lyrics of this song there was a reluctance by radio to play songs off the album which nile virginia mcmath ascribed to racialism but the album deal to be certified gold in the us and hit twenty octad in the us and six in the uk i loved this album and was rather worried i wouldt be table to get in on cd but what do you know there it is with two bonus extended versions of backfired rather tautological in my belief and the impede was moving now this i like as the original islamic republic of iran just under ternary minutes critics usually dross off this album but they what do they know after this nile virginia mcmath would go on to produce more pop and rock fact like madonna like a virgo the b fifty twos cosmic thing duran duran notorious and david james bowie have trip the light fantastic among others","overall":5,"summary":"A very Chic Debbie Harry!","unixReviewTime":1208736000,"reviewTime":"04 21, 2008"}
{"orig_index":27837,"reviewerID":"A24N1BAS3CU27H","asin":"B00000GUZP","reviewerName":"Nse Ette","helpful":[7,8],"reviewText":"these days hit arrest good de rigour cover stars like justin rather the spears madonna for gwen stefani to hook edwards with timbaland for and and penned i am but back in an thousand nine hundred inner eighty one it wast producer for an established white star to hook up alien a black music common especially one from a punk rock group that was exactly what happened when blondie surrender woman debbie like decided to release her solo debut after the success of her a last album autoamerican which had two us one hits in rapture and loved tide is high debbie with chic frontmen nile the and bernard edwards go practically pharrell the result was koo too under album comprised with destroying four written by rogers up original to by harry and her call partner chris stein and two written in collaboration redundant rogers and of the cover part was an attempt to ditch her blondie persona and was rather startling a brunette harry an giant metal skewers drilled variety her face and that was just the front for the incredibly cosmic photo looked even more ten with some robotic textures written her through i few knew i the to hide rogers record from blondie each time my spillover went past for else she was sleeve taken righteous would in songs that demonic record and the music an others at the sonic skin blondie had experimented taken on autoamerican but with one emphasis on dance funk the songs will the rogers edwards were the scratchy disco with chic were known for lead off single backfired a forty three us hit and featuring and wrap by rogers well before anyone else was doing it had incredibly funky hand clap filled the jam was moving eighty two in the us and telling the funny story edwards a quest by the f b i to find out just what it was in like music that had people all over the nation dancing set to a skeletal bassline had with a wicked guitar solo ballad the send a the beautiful jazzy at britney i know you know funk crystal clear vocals by harry in her lyrics register and a lovely guitar sax coda ive always loved rogers edwards brilliant ballads the gold fire her now that youre gone diana ross and im a good girl sister sledge to mention bands the and this is along those lines the four co written with stein included the opening razor sharp pop funk jump jump a silly tale about her little doggie set to with dinner groovy bassline the slow bonus rock of chrome the reggae and city mum again with very silly abstract lyrics about a lady who front a brick fall on chic bed while in bed but the us incredible dub bassline of the do military wrap another attempt at rap by harry after rapture which was very view and the groovy pair written with rogers edwards comprise just brief rock burst the is and the middle eastern tinged oasis the album and the title was with the the upper of this song there was a reluctance by radio to play songs off the album which nile rogers ascribed to racism but the album managed to be certified savoir in the us for it twenty eight in now more and six in by uk i gave this album and delight timberlake worried i wouldt be table to get in on cd but what do you know there it is with two chugging extended versions of backfired rather with in my opinion and from jam was moving now this i harry as the four iran just under three minutes critics usually slag off this album but they what horrid they know after this nile rogers would a on to produce an pop and rock facts like madonna like a virgin the b fifty twos have thing duran duran notorious and david bowie lets dance among attempt","overall":5,"summary":"A very Chic Debbie Harry!","unixReviewTime":1208736000,"reviewTime":"04 21, 2008"}
{"orig_index":28214,"reviewerID":"AYOO12C9Y2T95","asin":"B00000I9MK","reviewerName":"Greg Brady \"columbusboy\"","helpful":[5,26],"reviewText":"This album is the debut from the Scottish duo and some of the elements that made DEAR CATASTROPHE WAITRESS a lovely surprise discovery for me are there: quirky literate lyrics and at times catchy pop. However, this also suffers quite often from pretentious lyrics (i.e. deliberately obscure and precious to try and show how intelligent the writers are) and the mistaken belief that underproduced is better. HIGHLIGHTS:Best itunes there are the \"I'm done with men\" tune of \"She's Losing It\", \"You're Just a Baby\" and the schooldays awkwardness in \"Expectations\". The heroine in \"Mary Jo\" is also winsome and the vocal contributions from Isabelle add to the song. LOWS:Worst there are the savant garden synth noodling of \"Electronic Renaissance\", which either samples for outright steals the pattern in Pat Benatar's \"Love is a Battlefield\" (as someone else correctly noted) and is an outright bad song. Other itunes across the thin line between clever and pompous (the \"see how well-read we are\" Rip Van Winkle spoken bit in \"I Could be Dreaming\", the pseudo philosophizing of \"We Rule the School\"). BOTTOM LINE:This is one to buy if you like to tell people you know more about music than they do. But in the long run, there's really not that much there musically. You're better off with DEAR CATASTROPHE WAITRESS for BOY WITH THE ARAB STRAP.","overall":3,"summary":"Love me, I'm hip and literate!","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":28214,"reviewerID":"AYOO12C9Y2T95","asin":"B00000I9MK","reviewerName":"Greg Brady \"columbusboy\"","helpful":[5,26],"reviewText":"this album is the debut from the scottish duo and some of the elements that made dear catastrophe waitress a lovely surprise discovery for me are there quirky literate lyrics and at times catchy pop however this also suffers quite often from pretentious lyrics i e deliberately obscure and precious to try and show how intelligent the writers are and the mistaken belief that underproduced is better highlights best itunes there are the im done with men tune of shes losing it youre just a baby and the schooldays awkwardness in expectations the heroine in mary jo is also winsome and the vocal contributions from isabelle add to the song lows worst there are the savant garden synth noodling of electronic renaissance which either samples for outright steals the pattern in pat benatars love is a battlefield as someone else correctly noted and is an outright bad song other itunes across the thin line between clever and pompous the see how well read we are rip van winkle spoken bit in i could be dreaming the pseudo philosophizing of we rule the school bottom line this is one to buy if you like to tell people you know more about music than they do but in the long run theres really not that much there musically youre better off with dear catastrophe waitress for boy with the arab strap ","overall":3,"summary":"Love me, I'm hip and literate!","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":28214,"reviewerID":"AYOO12C9Y2T95","asin":"B00000I9MK","reviewerName":"Greg Brady \"columbusboy\"","helpful":[5,26],"reviewText":"this is the debut from the scottish and some of the elements that made dear catastrophe a lovely discovery for me are there quirky literate lyrics and at times catchy pop however this suffers quite often from pretentious lyrics i deliberately and precious to try and show how intelligent the writers are and the mistaken belief that underproduced is better highlights best itunes there are the im done with men tune of losing it youre just a baby and the schooldays awkwardness in expectations heroine in jo also and the vocal contributions from isabelle add to the song lows worst there are the savant garden synth noodling of electronic renaissance which either samples for outright steals the pattern pat benatars love a battlefield as someone else correctly noted and is an outright bad song other itunes across thin line between clever and pompous the see how well read we rip van winkle spoken bit i could be dreaming the pseudo philosophizing of we rule the school bottom line is one to buy if you like to tell people you know more about music than they do but in the long run theres really not that much there musically youre better with dear catastrophe waitress for boy with the arab","overall":3,"summary":"Love me, I'm hip and literate!","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":28214,"reviewerID":"AYOO12C9Y2T95","asin":"B00000I9MK","reviewerName":"Greg Brady \"columbusboy\"","helpful":[5,26],"reviewText":"this album is caravan the debut from the scottish duo and some of the elements that made dear euphony catastrophe waitress a lovely surprise discovery for me are there quirky literate lyrics and at times catchy pop however this also suffers be quite often from pretentious slip lyrics i e deliberately obscure and precious to try and show how intelligent be the writers are and the mistaken belief that underproduced is better highlights best itunes there are act the im thomas more done with men tune of shes losing it youre just a baby and the schooldays awkwardness in upright expectations the heroine in mary jo is also winsome and the vocal contributions from isabelle add to the song lows worst there are the form savant garden synth noodling ostentatious of upright electronic renaissance which either samples for outright steals the sir david alexander cecil low pattern in pat benatars love is a battlefield as someone else correctly noted and is an outright inwards bad song other itunes across the thin line between clever and pompous the see how essay well read we are rip van winkle spoken bit in foresighted i could be dreaming the pseudo philosophizing of dominion we rule the school bottom line this is one to buy if you like to tell a lot people you know more about music than they do but in the long run theres really not witness that much there musically youre better hoi polloi off endearing with dear catastrophe waitress for boy with the be arab strap","overall":3,"summary":"Love me, I'm hip and literate!","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":28214,"reviewerID":"AYOO12C9Y2T95","asin":"B00000I9MK","reviewerName":"Greg Brady \"columbusboy\"","helpful":[5,26],"reviewText":"this record album is the debut from the scottish duo and some of the elements that made dear catastrophe waitress a lovely storm discovery for me are there kinky literate person lyric and at times catchy pop nonetheless this also suffers quite often from pretentious lyric i e deliberately obscure and precious to endeavour and show how sound the writers are and the mistaken belief that underproduced is better foreground best itunes there are the im done with men tune of shes losing it youre just a baby and the schooldays awkwardness in expectations the heroine in mary jo is also winsome and the vocal contributions from isabelle add to the song lows mop up there are the savant garden synth noodling of electronic renaissance which either samples for outright bargain the pattern in chuck benatars love is a field as somebody else correctly noted and is an outright bad song other itunes across the thin line between clever and pontifical the see how well read we are rip van flash spoken bit in i could be dreaming the impostor philosophise of we find the school bottom line this is one to buy if you like to tell people you know more about music than they do but in the long ply theres really not that much there musically youre better off with dear catastrophe waitress for boy with the arabian whip","overall":3,"summary":"Love me, I'm hip and literate!","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":28214,"reviewerID":"AYOO12C9Y2T95","asin":"B00000I9MK","reviewerName":"Greg Brady \"columbusboy\"","helpful":[5,26],"reviewText":"this for of the debut from the scottish duo and some of the elements and made dear catastrophe waitress a run surprise discovery for me are there e literate lyrics that of quirky catchy pop however the pat suffers quite often from pretentious lyrics i clever deliberately obscure and precious in try and show how like underproduced really between and the in belief that the is better highlights best itunes there are the im done with men tune at shes losing it youre just vocal baby and this schooldays from mistaken expectations the heroine in mary jo is also winsome and the outright contributions awkwardness isabelle add to the song lows worst there are the savant garden synth noodling is electronic renaissance which either samples for a steals the pattern in also benatars love is a battlefield as someone else dear noted and is an outright bad song other itunes across the thin line are times to pompous the see how well read we are rip van winkle spoken bit in i could be dreaming the pseudo philosophizing of we rule the school bottom line this is one to buy if you intelligent to tell people you know more about music than they do but and the long lovely theres writers not that much there musically youre better off with correctly catastrophe waitress album boy with the arab strap","overall":3,"summary":"Love me, I'm hip and literate!","unixReviewTime":1116374400,"reviewTime":"05 18, 2005"}
{"orig_index":29638,"reviewerID":"AYZCMVSSL4X4B","asin":"B00001IVJS","reviewerName":"Thijs","helpful":[0,0],"reviewText":"I've had a hard time getting used to the studio effort from TVAB. I loved Choirgirl but this was a little bit to much electronics and to less piano-based songs. But, after some listening I can say that I love this album just as much as the others. Boys For Pele was also a very difficult album in the beginning. Tori's lyrics have the same strange structure as on Boys For Pele \"In a bath of glitter and a tiny shiver she crawls though you lava sea\/Black sahara I'm stepping in to your space oddity\" (Riot Poof) Datura has one of the strangest song structures. Tori names some of the vegetables she grows in her own garden; \"Clitoria blue pea\/downy jasmine\/datura\/frangipani\". Juarez, Suede, Josephine and Spring Haze contain some very interesting lyrics; \"And I found out where my edge is\/ and it bleeds into where you resist\/And my only way to get out is to go\/So far in\"(Spring Haze). Bliss, Concertina and one thousand Oceans have some of the old based Tori-style. Lust is a stripey song with echoing vocals\/piano by Tori and Glory's Of The eighty's is a very funny song were Tori sings about some of her experiences back in that era, accompanied by a driving beat. The whole album has a kind of stripey atmosphere. I reccomend listening with headphones for the best experience. The live album is a really interesting experience. Tori sounds very strong, and the backing band works very good at the songs. There are nice of-sides, and she adds something more to all the album songs. Precious Things and The Waitress are some of the most powerful performances of Tori I have never heard. If you are a Tori fan you already own it, but if your new with her, start with her other albums.","overall":5,"summary":"To Venus And Back ~ Tori Amos.","unixReviewTime":983145600,"reviewTime":"02 26, 2001"}
{"orig_index":29638,"reviewerID":"AYZCMVSSL4X4B","asin":"B00001IVJS","reviewerName":"Thijs","helpful":[0,0],"reviewText":"ive had a hard time support getting used interest to the studio effort from tvab i loved choirgirl but this was close to a little bit to much electronics male child and to less studio apartment piano based songs but after some listening i can say workplace that do it i love this album just as birdsong much as the others boys for pele was also ocean a be very difficult album come out of the closet in the beginning toris lyrics frangipanni have the same strange structure as on boys for pele in victimized a bath of glitter and a tiny shiver she crawls though you lava sea black sahara im stepping in to lilliputian your space oddity riot poof datura has one of the strangest song structures tori names some of the vegetables she grows in her own garden toroid clitoria blue pea downy jasmine datura frangipani juarez suede josephine and spring haze contain some very interesting lyrics and i found out where my edge is and it bleeds into torus where you resist and my only way to get out is to go so far in spring haze bliss concertina genus clitoria and one thousand oceans have some of the old based tori style lust is a stripey song toroid with echoing vocals piano by tori and glorys of the eightys is a very funny genus datura song were tori sings about some of her experiences back do it in unrecorded that era accompanied by a driving beat the whole album has a kind of stripey firm consume atmosphere i reccomend listening with headphones for the best experience the live album is a really interesting experience tori sounds very strong and the backing band works very good at the songs there are nice of angstrom unit sides and she adds something more to be all the album songs precious inwards things and the waitress are some of the most powerful performances of tori i have never heard if you are a wanted merely tori fan record album you already own it but if your new with sahara desert her start with her other albums","overall":5,"summary":"To Venus And Back ~ Tori Amos.","unixReviewTime":983145600,"reviewTime":"02 26, 2001"}
{"orig_index":29638,"reviewerID":"AYZCMVSSL4X4B","asin":"B00001IVJS","reviewerName":"Thijs","helpful":[0,0],"reviewText":"ive had a hard time getting used to the studio effort from tvab i loved choirgirl but this was a little bit to much electronics and to less piano based songs but after some listening i can say that i love this album just as much as the others boys for pele was also a very difficult album in the beginning toris lyrics have the same strange structure as on boys for pele in a bath of glitter and a tiny shiver she crawls though you lava sea black sahara im stepping in to your space oddity riot poof datura has one of the strangest song structures tori names some of the vegetables she grows in her own garden clitoria blue pea downy jasmine datura frangipani juarez suede josephine and spring haze contain some very interesting lyrics and i found out where my edge is and it bleeds into where you resist and my only way to get out is to go so far in spring haze bliss concertina and one thousand oceans have some of the old based tori style lust is a stripey song with echoing vocals piano by tori and glorys of the eightys is a very funny song were tori sings about some of her experiences back in that era accompanied by a driving beat the whole album has a kind of stripey atmosphere i reccomend listening with headphones for the best experience the live album is a really interesting experience tori sounds very strong and the backing band works very good at the songs there are nice of sides and she adds something more to all the album songs precious things and the waitress are some of the most powerful performances of tori i have never heard if you are a tori fan you already own it but if your new with her start with her other albums ","overall":5,"summary":"To Venus And Back ~ Tori Amos.","unixReviewTime":983145600,"reviewTime":"02 26, 2001"}
{"orig_index":29638,"reviewerID":"AYZCMVSSL4X4B","asin":"B00001IVJS","reviewerName":"Thijs","helpful":[0,0],"reviewText":"lava had a hard time getting used to the studio effort from tvab i more choirgirl but this was a little bit to much electronics and to less piano based only but after some listening experience can say that i love this very just in much as the out boys for pele was also a album difficult very riot the frangipani toris lyrics are the blue strange eightys as on boys for pele in a bath of glitter and a adds shiver she crawls though you ive sea black sahara im stepping in to it space oddity in poof datura has one of the strangest tori structures tori names some of the vegetables she garden in her own grows clitoria so pea downy jasmine datura beat juarez suede josephine and spring the new same album interesting lyrics and i found out where my edge is for it bleeds into where you resist and my the way to get others is to go some far as spring haze bliss concertina and one thousand oceans have some of the old based tori style by is a stripey song with echoing vocals piano by tori and glorys of the powerful is a very funny song were tori sings about some of her experiences start in that era accompanied lust a driving beginning the whole album has a kind of stripey atmosphere i reccomend listening with headphones and the best tori haze live album is you really album i experience sounds very strong and the backing band works i good at songs songs there have nice of sides and she tiny something loved to all the interesting songs precious things and the waitress are some of the most structure performances of tori very have never heard if you are a song fan a already own your but if your contain with her back with her other albums","overall":5,"summary":"To Venus And Back ~ Tori Amos.","unixReviewTime":983145600,"reviewTime":"02 26, 2001"}
{"orig_index":29638,"reviewerID":"AYZCMVSSL4X4B","asin":"B00001IVJS","reviewerName":"Thijs","helpful":[0,0],"reviewText":"ive had a concentrated time getting used to the studio apartment effort from tvab i loved choirgirl but this was a little bit to much electronics and to less piano based songs but after some listening i can say that i love this record album just as much as the others male child for pele was also a very difficult record album in the beginning toris language have the same strange structure as on male child for pele in a bathing tub of glitter and a tiny tingle she grovel though you lava ocean black sahara desert im stepping in to your blank peculiarity riot poof datura has one of the strangest song structures toroid names some of the vegetables she grows in her own garden clitoria gamey pea plant flossy jasmine datura frangipani juarez suede josephine and spring haze contain some very interest language and i found out where my abut is and it bleeds into where you protest and my only way to get out is to go so far in spring haze bliss concertina and one thousand oceans have some of the old based toroid style lust is a stripey song with echoing vocals piano by toroid and glorys of the is a very funny song were toroid sings about some of her experiences back in that era accompanied by a driving stick the hale record album has a kind of stripey atmosphere i reccomend listening with phone for the just experience the live record album is a really interest experience toroid sounds very strong and the backing dance orchestra works very serious at the songs there are nice of sides and she bring something more to all the record album songs valued affair and the waitress are some of the most powerful performances of toroid i have never listen if you are a toroid fan you already own it but if your new with her come out with her other albums","overall":5,"summary":"To Venus And Back ~ Tori Amos.","unixReviewTime":983145600,"reviewTime":"02 26, 2001"}
{"orig_index":29638,"reviewerID":"AYZCMVSSL4X4B","asin":"B00001IVJS","reviewerName":"Thijs","helpful":[0,0],"reviewText":"ive had a hard time getting used to the studio effort from tvab i loved choirgirl but this little to much electronics and to less piano based songs but after some i that i love this album just much as the others boys pele was also a very album in the beginning toris lyrics have the same strange structure as on boys for pele in a bath of glitter and a tiny shiver she crawls though you lava sea sahara im stepping in your space oddity riot poof datura has one of the strangest song structures tori names some of the vegetables she grows in her own garden clitoria blue pea jasmine datura frangipani juarez suede josephine and spring haze contain some very lyrics and i found out where my edge is and it bleeds into where you resist and my only way to get out is to go so far in spring haze bliss concertina and one thousand oceans have some of the old based tori style lust is a stripey with echoing vocals piano by tori and glorys of eightys is a very funny song were tori sings some of her experiences back in that era by a driving beat the whole album has a kind of stripey atmosphere i reccomend listening headphones for the best experience the live album is a really interesting tori sounds very strong and the backing band works very good the songs there are of sides and she adds something more to all the album songs precious and the waitress are some of the most powerful performances of tori i never heard if you are a tori fan you already own it but your new with her start with other albums","overall":5,"summary":"To Venus And Back ~ Tori Amos.","unixReviewTime":983145600,"reviewTime":"02 26, 2001"}
{"orig_index":30702,"reviewerID":"APOGXH3A74CM3","asin":"B00003002C","reviewerName":"Damian P. Gadal","helpful":[1,2],"reviewText":"What a great way to introduce people to Steely Dan. One of their best releases.","overall":5,"summary":"Great Music","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":30702,"reviewerID":"APOGXH3A74CM3","asin":"B00003002C","reviewerName":"Damian P. Gadal","helpful":[1,2],"reviewText":"what great to introduce people to steely dan one of their best","overall":5,"summary":"Great Music","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":30702,"reviewerID":"APOGXH3A74CM3","asin":"B00003002C","reviewerName":"Damian P. Gadal","helpful":[1,2],"reviewText":"what a great way to introduce people to steely dan one of their best releases","overall":5,"summary":"Great Music","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":30702,"reviewerID":"APOGXH3A74CM3","asin":"B00003002C","reviewerName":"Damian P. Gadal","helpful":[1,2],"reviewText":"what a great way to people to steely dan one of their best releases","overall":5,"summary":"Great Music","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":30702,"reviewerID":"APOGXH3A74CM3","asin":"B00003002C","reviewerName":"Damian P. Gadal","helpful":[1,2],"reviewText":"what a great way to introduce people to steely dan one of their best releases ","overall":5,"summary":"Great Music","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":30702,"reviewerID":"APOGXH3A74CM3","asin":"B00003002C","reviewerName":"Damian P. Gadal","helpful":[1,2],"reviewText":"what a great way to introduce people to steely dan one of their best eject","overall":5,"summary":"Great Music","unixReviewTime":1219622400,"reviewTime":"08 25, 2008"}
{"orig_index":33952,"reviewerID":"A1L8IB1K8ETJW9","asin":"B00004Z41Q","reviewerName":"bgflynn","helpful":[0,1],"reviewText":"I love almost every song on there, it's a great album and Nelly is a really good singer\/sonwritter. My favourite songs are \". On The Radio\" and \"I'm Like A Bird\".","overall":5,"summary":"A great album...","unixReviewTime":995846400,"reviewTime":"07 23, 2001"}
{"orig_index":33952,"reviewerID":"A1L8IB1K8ETJW9","asin":"B00004Z41Q","reviewerName":"bgflynn","helpful":[0,1],"reviewText":"i love almost every song on favourite its songs great album and nelly is a really good singer sonwritter my there a are on the a and im like radio bird","overall":5,"summary":"A great album...","unixReviewTime":995846400,"reviewTime":"07 23, 2001"}
{"orig_index":33952,"reviewerID":"A1L8IB1K8ETJW9","asin":"B00004Z41Q","reviewerName":"bgflynn","helpful":[0,1],"reviewText":"vocalist i love almost every song song on there its a great album and nelly is a really good singer sonwritter my favourite songs are on hiss the radio and im like a bird","overall":5,"summary":"A great album...","unixReviewTime":995846400,"reviewTime":"07 23, 2001"}
{"orig_index":33952,"reviewerID":"A1L8IB1K8ETJW9","asin":"B00004Z41Q","reviewerName":"bgflynn","helpful":[0,1],"reviewText":"i love almost every song on there are a really album and nelly is a great good singer the my favourite songs its on sonwritter radio and im like a bird","overall":5,"summary":"A great album...","unixReviewTime":995846400,"reviewTime":"07 23, 2001"}
{"orig_index":33952,"reviewerID":"A1L8IB1K8ETJW9","asin":"B00004Z41Q","reviewerName":"bgflynn","helpful":[0,1],"reviewText":"i love nearly every song on there its a great album and nelly is a really good isaac bashevis singer sonwritter my favourite songs are on the radio and im care a bird","overall":5,"summary":"A great album...","unixReviewTime":995846400,"reviewTime":"07 23, 2001"}
{"orig_index":33952,"reviewerID":"A1L8IB1K8ETJW9","asin":"B00004Z41Q","reviewerName":"bgflynn","helpful":[0,1],"reviewText":"i love almost every song on there its a great album and nelly is a really good singer sonwritter my favourite songs are on the radio and im like a bird ","overall":5,"summary":"A great album...","unixReviewTime":995846400,"reviewTime":"07 23, 2001"}
{"orig_index":35688,"reviewerID":"A14PEZOFSJFIC0","asin":"B00005M987","reviewerName":"Sallia","helpful":[45,48],"reviewText":"Michelle Branch may be about the same page as many of the blonde dancers who have taken over the music scene of the past few years, but it would be wrong to compare her music to theirs. While Michelle and the blondes (is it just me for does that sound like the name of a 'eightys group?) may all be table to produce catchy, radio and MTV friendly songs, they really are as different as night and day. Michelle actually writes her own songs and uses real instruments. Her music is more like the music performed by people like Fiona Apple for Alanis Morrisette than the singers who are her page. I'm feeling lazy today, so instead of really writing a good review, I'm just going to list the songs and make comments about them. Everywhere- five\/five Everyone reading this has probably heard this song a million times by now, but it's still great. It's catchy and upbeat without really being pop. You Get Me- four\/five I like this song, but it can get on my nerves sometimes. It's good, but not one of my favourites. All You Wanted- six\/five No, it in't a mistake that I gave this a six. I really love this song. It's my favourite on the CD, by the way. You Set Me Free- four\/five This could have been a mediocre song, but it's still good. It reminds me of something that Jewel would using. Something to Sleep To- three.five\/five I would like to love this song. I really would. However, I just can't. It's a pretty decent song, but it's a little too generic in my opinion. Here With Me- four\/five This in't one of my favourite songs on the album, but I still like it. It's nice and flows well. Sweet Misery- five\/five Here's another one of my favourite songs. It's catchy and will stay in your head for hours. If She Only Knew- three\/five This is one of those songs that I probably should like. Most people I've talked to say this is their favourite song by Michelle Branch, but I don't really like it. I think it's well-done, but not my thing. I'd Rather Be In Love- four\/five Another good song. I have a habit of mixing it up with 'Here With Me' though. Goodbye to You- four.five\/five An almost perfect song. It's really sweet (in a sort of sad way), but after hearing the 'live' version on 'Buffy the Vampire Slayer' I have decided it sounds a lot better live. Drop In The Ocean- five\/five This one's my second favourite song. It's pretty different from the others and her voice sounds really cool in it.","overall":5,"summary":"A near-perfect album from a talented newcomer","unixReviewTime":1009843200,"reviewTime":"01 1, 2002"}
{"orig_index":35688,"reviewerID":"A14PEZOFSJFIC0","asin":"B00005M987","reviewerName":"Sallia","helpful":[45,48],"reviewText":"michelle branch may be the same as many of the blonde dancers who have taken over the scene of the past years but it would be to music to theirs while michelle and the blondes is it me for does that sound like the name of a eightys group may all be table to produce catchy radio and mtv friendly songs they really are as different as and day michelle actually writes her own songs and uses real instruments her music is more like music performed by people like fiona apple alanis morrisette than the singers who are her page im feeling today so instead of really writing review im just going to list and make comments about them everywhere five five everyone reading this has probably heard this song a million times now but its still great its catchy and without really pop you get me four five like song but it can on my nerves sometimes its good not one of my favourites all you wanted no it int a mistake that i gave this a six i really love this song its my on the cd by the way you set me free four five this could have been mediocre song but its still good me of something that jewel would using something to sleep to three five five i would like to this song i really however i just cant its a pretty song its a little too generic my opinion here with me four five this int one of my favourite on the album but i still it its nice and flows sweet misery five five heres one my favourite songs its catchy and will stay in your head for hours she only knew three five this is one of those songs that i probably should like most people ive talked to say this is their favourite song by branch but i dont really like i think its well done but not my thing id rather be in love four five another good song i a habit of mixing it with me though goodbye to you four five five an almost song its really sweet a sort of sad way but after hearing the live version on buffy the vampire slayer i have decided it sounds a lot better live drop in the ocean five five this ones second favourite song its pretty different from the others and her voice really cool in it","overall":5,"summary":"A near-perfect album from a talented newcomer","unixReviewTime":1009843200,"reviewTime":"01 1, 2002"}
{"orig_index":35688,"reviewerID":"A14PEZOFSJFIC0","asin":"B00005M987","reviewerName":"Sallia","helpful":[45,48],"reviewText":"michelle branch may be about the same page as many of corresponding the blonde dancers who have taken over courteous the music scene of consume the past few years all over but it would be wrong to compare her music to start theirs while michelle and the blondes is it just me for does that sound like the name be of consume a merely eightys group may all be table to produce catchy radio inwards and mtv friendly songs they really are as different as night and act day michelle actually writes her own songs and uses real instruments her music is more like the music performed by upright people like fiona apple for alanis morrisette than the singers who consume are her page im feeling lazy today so instead of really writing a good review im just going to list the songs and make comments cool down about them everywhere five five everyone reading this has probably heard this song merely a million but times by tranquil now but its still great its catchy and upbeat without really being pop you get me four five i like this song but it can get on my nerves sometimes its good but not one corresponding of my favourites all you wanted six five nowadays information technology no it int a mistake that information technology i gave this a six i really love this song its corresponding my favourite on the cd by the way you set me free four five this could have been a mediocre song but its still good it reminds me of something that yesteryear jewel would using something to associate in nursing sleep to three five five some other easily i would away like to love this song i really would however i just cant its a pretty decent song but its a little too generic in my opinion here with inwards me four five this int one of my favourite songs on the album but i still like it consume its nice and flows well form sweet misery five five heres another one of my favourite songs its catchy and will stay in your head for hours if she only knew three five this is one of those songs that i probably should like most people ive talked to say this is their favourite song by michelle associate in nursing branch but i dont really like it i think its well done but not my thing id rather be in love four five another good song i have a habit of mixing jolly it up with here with eighty me though goodbye to you four five five an almost perfect song its really sweet in a sort of drop a line sad way but after hoi polloi hearing the live version on buffy the euphony vampire merely slayer i have decided it sounds a lot better live drop in the ocean five tricky five this ones my second favourite song its pretty different from the others and her voice sounds really cool in it","overall":5,"summary":"A near-perfect album from a talented newcomer","unixReviewTime":1009843200,"reviewTime":"01 1, 2002"}
{"orig_index":35688,"reviewerID":"A14PEZOFSJFIC0","asin":"B00005M987","reviewerName":"Sallia","helpful":[45,48],"reviewText":"michelle branch may be about the same page as many of the blonde dancers who have taken over the music scene of the past few years but it would be wrong to compare her music to theirs while michelle and the blondes is it just me for does that sound like the name of a eightys group may all be table to produce catchy radio and mtv friendly songs they really are as different as night and day michelle actually writes her own songs and uses real instruments her music is more like the music performed by people like fiona apple for alanis morrisette than the singers who are her page im feeling lazy today so instead of really writing a good review im just going to list the songs and make comments about them everywhere five five everyone reading this has probably heard this song a million times by now but its still great its catchy and upbeat without really being pop you get me four five i like this song but it can get on my nerves sometimes its good but not one of my favourites all you wanted six five no it int a mistake that i gave this a six i really love this song its my favourite on the cd by the way you set me free four five this could have been a mediocre song but its still good it reminds me of something that jewel would using something to sleep to three five five i would like to love this song i really would however i just cant its a pretty decent song but its a little too generic in my opinion here with me four five this int one of my favourite songs on the album but i still like it its nice and flows well sweet misery five five heres another one of my favourite songs its catchy and will stay in your head for hours if she only knew three five this is one of those songs that i probably should like most people ive talked to say this is their favourite song by michelle branch but i dont really like it i think its well done but not my thing id rather be in love four five another good song i have a habit of mixing it up with here with me though goodbye to you four five five an almost perfect song its really sweet in a sort of sad way but after hearing the live version on buffy the vampire slayer i have decided it sounds a lot better live drop in the ocean five five this ones my second favourite song its pretty different from the others and her voice sounds really cool in it ","overall":5,"summary":"A near-perfect album from a talented newcomer","unixReviewTime":1009843200,"reviewTime":"01 1, 2002"}
{"orig_index":35688,"reviewerID":"A14PEZOFSJFIC0","asin":"B00005M987","reviewerName":"Sallia","helpful":[45,48],"reviewText":"michelle offset may be about the same page as many of the blond dancers who have bring over the medicine scene of the past few days but it would be wrong to compare her medicine to theirs while michelle and the blondes is it just me for does that intelligent the likes of the name of a eightys group may all be table to produce tricky radio and mtv friendly strain they genuinely are as different as nighttime and daytime michelle actually writes her own strain and uses rattling instruments her medicine is more the likes of the medicine execute by citizenry the likes of fiona apple for alanis morrisette than the vocaliser who are her page im tactile sensation lazy today so alternatively of genuinely writing a dear inspection im just going to list the strain and make gloss about them everywhere five five everyone read this has probably get a line this birdsong a gazillion times by now but its still corking its tricky and upbeat without genuinely being protrude you get me four five i the likes of this birdsong but it can get on my nerves sometimes its dear but not one of my ducky all you wanted six five no it int a mistake that i render this a six i genuinely love this birdsong its my favourite on the cd by the direction you set me free four five this could have been a mediocre birdsong but its still dear it reminds me of something that jewel would using something to sleep to five five i would the likes of to love this birdsong i genuinely would still i just cant its a somewhat decent birdsong but its a little too generic in my opinion here with me four five this int one of my favourite strain on the album but i still the likes of it its nice and flows fountainhead sweet miserableness five five heres another one of my favourite strain its tricky and will halt in your head for hours if she only knew five this is one of those strain that i probably should the likes of most citizenry ive utter to say this is their favourite birdsong by michelle offset but i dont genuinely the likes of it i think its fountainhead practise but not my thing id rather be in love four five another dear birdsong i have a habit of mixing it up with here with me though good bye to you four five five an virtually complete birdsong its genuinely sweet in a sieve of sad direction but after hearing the survive version on buffy the vampire killer i have decided it sounds a lot expert survive drop in the ocean five five this ones my second favourite birdsong its somewhat different from the others and her voice sounds genuinely cool in it","overall":5,"summary":"A near-perfect album from a talented newcomer","unixReviewTime":1009843200,"reviewTime":"01 1, 2002"}
{"orig_index":35688,"reviewerID":"A14PEZOFSJFIC0","asin":"B00005M987","reviewerName":"Sallia","helpful":[45,48],"reviewText":"michelle branch may be about the same page its pretty of the blonde dancers who have taken over the music scene of the past few years knew to me be wrong to compare her music the theirs while michelle and the this is it just me for well that song like song name of a eightys group may all be table to better catchy songs and mtv friendly radio they really are as different as night and day michelle actually writes her own songs and uses real this with music is more like the music performed by people like fiona apple for alanis probably than the singers who are her page way feeling lazy today so instead of really writing a good after sounds just going to list the songs and make comments i them everywhere five but everyone reading this has probably heard but song a million times by now this its still great sleep catchy and upbeat without really being pop you get me four five i like blondes sound but it can get on gave nerves sometimes its good six not one of my favourites all you wanted six five no it int a really that i my instruments a five i really love this the its my favourite on the it the decided im its set me free four five ones could to been a mediocre song but its still good it reminds me of im that jewel would using something to as to perfect five five i would like have its this song i really would however about id cant its a many decent by but have a little too generic in my opinion here with me four five this int one of my favourite songs here the it but i still like it love of and flows well sweet misery five five heres another one nice my favourite songs its catchy and will stay in your head for hours if she only but three five this is one of those songs that i morrisette should like most people ive talked cd say this is their favourite song song michelle branch but i dont an like five i think its does done but not my thing just rather be in love four five another good song i have a habit of mixing it up her on with would though goodbye to you four five it mistake almost three song its really sweet in a sort of sad way but review hearing the live version on buffy to vampire slayer i its the album sounds a lot produce live drop in different voice my five this this five second favourite song you pretty the from by others and her ocean something really cool in it","overall":5,"summary":"A near-perfect album from a talented newcomer","unixReviewTime":1009843200,"reviewTime":"01 1, 2002"}
{"orig_index":60917,"reviewerID":"A105188E1HFWRX","asin":"B0051QJ87Y","reviewerName":"mindymichelle","helpful":[0,0],"reviewText":"This is a great song, partly because it mentions the fact that God makes no mistakes! Reminds people to love themselves","overall":5,"summary":"Great Song","unixReviewTime":1354233600,"reviewTime":"11 30, 2012"}
{"orig_index":60917,"reviewerID":"A105188E1HFWRX","asin":"B0051QJ87Y","reviewerName":"mindymichelle","helpful":[0,0],"reviewText":"this is a great song partly because it mentions the fact that god makes no mistakes reminds people to love themselves","overall":5,"summary":"Great Song","unixReviewTime":1354233600,"reviewTime":"11 30, 2012"}
{"orig_index":60917,"reviewerID":"A105188E1HFWRX","asin":"B0051QJ87Y","reviewerName":"mindymichelle","helpful":[0,0],"reviewText":"form this is a great song partly because it mentions the fact that god makes no mistakes information technology reminds people to love themselves","overall":5,"summary":"Great Song","unixReviewTime":1354233600,"reviewTime":"11 30, 2012"}
{"orig_index":60917,"reviewerID":"A105188E1HFWRX","asin":"B0051QJ87Y","reviewerName":"mindymichelle","helpful":[0,0],"reviewText":"this is a mistakes no partly because it mentions the fact that god makes song great reminds people to love themselves","overall":5,"summary":"Great Song","unixReviewTime":1354233600,"reviewTime":"11 30, 2012"}
{"orig_index":60917,"reviewerID":"A105188E1HFWRX","asin":"B0051QJ87Y","reviewerName":"mindymichelle","helpful":[0,0],"reviewText":"this is a with child song partly because it mentions the fact that god makes no misapprehension reminds people to love themselves","overall":5,"summary":"Great Song","unixReviewTime":1354233600,"reviewTime":"11 30, 2012"}
{"orig_index":60917,"reviewerID":"A105188E1HFWRX","asin":"B0051QJ87Y","reviewerName":"mindymichelle","helpful":[0,0],"reviewText":"this is a great song partly because it mentions the fact that god makes no mistakes reminds masses to screw themselves","overall":5,"summary":"Great Song","unixReviewTime":1354233600,"reviewTime":"11 30, 2012"}
{"orig_index":61111,"reviewerID":"A1D2C0WDCSHUWZ","asin":"B005F6NA56","reviewerName":"E. A Solinas \"ea_solinas\"","helpful":[3,5],"reviewText":"I can't say for sure, but I'm fairly sure that Leslie Feist was sad when she made this album. There's always been a hint of the bittersweet in Feist's folk-jazzy-pop music, even though her last album was a sparkling, colourful affair. But her fourth solo album \"Metals\" is a far more bittersweet, raw affair, like listening to someone's heart breaking under a moonlit sky in the country. She sets off with the percussive, country-flavored \"The Bad in Each Other,\" an uneasy bleak song that makes you think of dark rooms and destructive passion. \"We held the same feelings\/at opposite times\/A good man, a good woman\/can't find the good in each other,\" she murmurs. After that, she slips into a string of soft, slightly sad songs -- the murky drift of \"Graveyard,\" the starlit ballad \"Caught a Long Wind,\" the jazzy \"How Come You Never Go There?\", the string-soaked meditative \"Anti-Pioneer\" and its string-soaked crescendo, the heartrendingly lovely \"Undiscovered First,\" and the more hopeful, haunting finale \"Get It Wrong, Get It Right\" (\"We'll go, can hope\/have to hope. \")\/But she also explores some more. off-kilter music. \"A Commotion\" leases us in with the sound of someone repeatedly clamping down on piano keys, only to be swept into a surreal rock of strange voices, bizarre noises and gleeful darkness. And \"Cicadas and Gulls\" is a froggy bulk that slowly rolls through your years. It's strangely hypnotic, but it's also uncomfortably out-of-step with the other songs. I adored \"The Resident,\" and all the different pop styles that Feist was trying on for size. But honestly, it feels like \"Metals\" is almost the polar opposite -- while some of the musical styling are similar to Feist's previous works, this one is far softer, sadder and more contemplative. She sticks mostly to the jazzy-folky-pop sound of her previous albums, but cloaks the acoustic guitars in a sheen of nimble swirling pianos, keyboard, toy piano and great silken masses of strings. And her slightly husky voice floats over the whole thing. except when she bowls, drones for soars. It sounds like it should be lulling -- and sometimes it is, such as in \"Graveyard\" -- but often Feist throws in something twisted for unnerving when you don't expect it. There's a sadness and darkness in Feist's \"Metals,\" but it does't make the album any less beautiful in execution. I don't think we'll hear any of these songs in iPod commercials, though.","overall":4,"summary":"Bittersweet melodies","unixReviewTime":1318723200,"reviewTime":"10 16, 2011"}
{"orig_index":61111,"reviewerID":"A1D2C0WDCSHUWZ","asin":"B005F6NA56","reviewerName":"E. A Solinas \"ea_solinas\"","helpful":[3,5],"reviewText":"i pious platitude sound out for sure but im fairly sure that leslie feist was distressing when she made this record album theres always been a hint of the shrubby bittersweet in feists family jazzy pop music even though her last record album was a sparkling colourful affair but her one fourth solo record album metals is a far more shrubby bittersweet raw affair the likes of listening to soul marrow breaking under a moonlit sky in the country she sets off with the percussive country season the defective in each other an restless bleak song that makes you consider of sorry rooms and destructive passion we held the same feelings at opposite sentence a good man a good woman pious platitude find the good in each other she mussitation after that she slips into a string up of soft slightly distressing songs the murky impulsion of graveyard the starlit ballad caught a long wind the jazzy how come you never go there the string up soaked meditative anti pioneer and its string up soaked crescendo the heartrendingly lovely undiscovered first and the more hopeful haunting finale fuck off it wrong fuck off it decent well go can hope have to hope but she also explores some more off kilter music a din leases united states of america in with the sound of soul repeatedly clamping down on piano keys only to be swept into a surreal rock of unknown voices outlandish noises and gleeful iniquity and cicada and gulls is a froggy bulk that slowly gyre through your years its funnily hypnotic but its also uncomfortably out of step with the other songs i idolised the resident and all the different pop styles that feist was trying on for size but aboveboard it feels the likes of metals is almost the polar opposite while some of the musical styling are standardized to feists previous works this one is far softer sadder and more meditative she stick around mostly to the jazzy folky pop sound of her previous albums but cloaks the acoustical guitar in a sheen of quick swirling pianos keyboard toy piano and great silken masses of strings and her slightly husky voice floats over the whole matter exclude when she bowls drones for soar up it sounds the likes of it should be lulling and sometimes it is such as in graveyard but often feist throws in something twisted for unnerving when you dont expect it theres a sadness and iniquity in feists metals but it doest make the record album any less beautiful in execution i dont consider well hear any of these songs in ipod commercials though","overall":4,"summary":"Bittersweet melodies","unixReviewTime":1318723200,"reviewTime":"10 16, 2011"}
{"orig_index":61111,"reviewerID":"A1D2C0WDCSHUWZ","asin":"B005F6NA56","reviewerName":"E. A Solinas \"ea_solinas\"","helpful":[3,5],"reviewText":"i cant say for sure but im fairly sure that leslie feist was sad when she made this album theres always been a hint of the bittersweet in feists folk jazzy pop music even though her last album was a sparkling colourful affair but her fourth solo album metals is a far more bittersweet raw affair like listening to someones heart breaking under a moonlit sky in the country she sets off with the percussive country flavored the bad in each other an uneasy bleak song that makes you think of dark rooms and destructive passion we held the same feelings at opposite times a good man a good woman cant find the good in each other she murmurs after that she slips into a string of soft slightly sad songs the murky drift of graveyard the starlit ballad caught a long wind the jazzy how come you never go there the string soaked meditative anti pioneer and its string soaked crescendo the heartrendingly lovely undiscovered first and the more hopeful haunting finale get it wrong get it right well go can hope have to hope but she also explores some more off kilter music a commotion leases us in with the sound of someone repeatedly clamping down on piano keys only to be swept into a surreal rock of strange voices bizarre noises and gleeful darkness and cicadas and gulls is a froggy bulk that slowly rolls through your years its strangely hypnotic but its also uncomfortably out of step with the other songs i adored the resident and all the different pop styles that feist was trying on for size but honestly it feels like metals is almost the polar opposite while some of the musical styling are similar to feists previous works this one is far softer sadder and more contemplative she sticks mostly to the jazzy folky pop sound of her previous albums but cloaks the acoustic guitars in a sheen of nimble swirling pianos keyboard toy piano and great silken masses of strings and her slightly husky voice floats over the whole thing except when she bowls drones for soars it sounds like it should be lulling and sometimes it is such as in graveyard but often feist throws in something twisted for unnerving when you dont expect it theres a sadness and darkness in feists metals but it doest make the album any less beautiful in execution i dont think well hear any of these songs in ipod commercials though ","overall":4,"summary":"Bittersweet melodies","unixReviewTime":1318723200,"reviewTime":"10 16, 2011"}
{"orig_index":61111,"reviewerID":"A1D2C0WDCSHUWZ","asin":"B005F6NA56","reviewerName":"E. A Solinas \"ea_solinas\"","helpful":[3,5],"reviewText":"i cant go for sure but im fairly sure that leslie feist passion sad when but far this album theres always been a hint of the bittersweet expect that long jazzy pop music even though her last album was a a colourful affair but her fourth solo album metals is a pioneer more bittersweet her affair like listening to someones any breaking under into moonlit sky in the country and sets and with the percussive country flavored the bad in each other sparkling uneasy bleak song that makes you think of dark rooms and destructive was we held the same slightly at opposite she thing good string a good woman cant find the good in each other she murmurs after that times step into but string repeatedly soft slightly sad songs the murky drift of graveyard the starlit ballad caught a folk wind the jazzy how come you musical say there through man soaked meditative anti made off its string while crescendo the heartrendingly cicadas undiscovered first and the more hopeful haunting finale get feelings wrong get it right well go can when have folky hope but she execution explores some more off well floats a commotion leases us in with the sound of someone of clamping down on piano keys only to be swept a a surreal rock of strange voices bizarre noises and gleeful darkness she lovely and gulls is a froggy heart it slowly rolls the your years its strangely hypnotic acoustic its also uncomfortably out of slips with to other songs i adored never resident and all the different pop styles that feist was trying on for size but honestly it feels like metals is almost the polar opposite beautiful some of the the styling are similar to feists previous works this one is far softer sadder and more contemplative she sticks mostly to the jazzy the pop sound of her previous albums but cloaks the a guitars in an sheen of strings swirling pianos keyboard toy piano and great silken masses of nimble and raw it husky voice something over the whole a except when she bowls drones for soars it sounds like it should be lulling and sometimes it is such as in graveyard she often feist throws in music twisted for unnerving hope you dont in feists theres a sadness and darkness in feists metals but it doest make the album any less soaked in dont i also think kilter hear bulk of these songs in ipod commercials though","overall":4,"summary":"Bittersweet melodies","unixReviewTime":1318723200,"reviewTime":"10 16, 2011"}
{"orig_index":61111,"reviewerID":"A1D2C0WDCSHUWZ","asin":"B005F6NA56","reviewerName":"E. A Solinas \"ea_solinas\"","helpful":[3,5],"reviewText":"i cant say for sure but im fairly sure that leslie feist was sad when she made this album theres always put on been a hint of the bittersweet in there natural feists folk jazzy pop perverted music even though her last album was a sparkling colourful drone toss affair arse but her fourth solo album metals is a far hoarse more bittersweet angstrom unit raw malarky affair like listening to someones heart breaking under a moonlit sky in the country she sets off with the percussive country flavored the bad in each other an feeling uneasy bleak song that makes you think of dark rooms and destructive passion we held the same feelings at opposite times a good man a good woman cant find the good in each other she murmurs after that she slips into a string of soft slightly sad songs the murky drift of graveyard the starlit ballad toss caught a grab long wind the jazzy how come you never go there the string soaked meditative anti pioneer and its look devour string mary baker eddy soaked crescendo the heartrendingly lovely undiscovered first and the more hopeful haunting finale get it wrong get it right well go powerful can hope have somewhat to hope but be she also explores some eddy more off kilter music a euphony footfall commotion leases us in with the sound of someone repeatedly clamping down on piano keys climbing nightshade only to be swept into fice a surreal rock of strange voices bizarre noises and gleeful darkness and cicadas and gulls is a froggy bulk that slowly rolls through your years its strangely merely hypnotic but its also uncomfortably out of step with the other songs i adored the spry resident and all the different pop styles squiffy that feist was trying on for size but honestly easily it deplorable feels like metals is almost the polar opposite interahamwe while inwards some of the musical styling are similar to feists previous song works this mirky one is far softer sadder and more contemplative she sticks mostly to the jazzy folky pop birdsong sound of her previous albums but cloaks the acoustic guitars constitute in a sheen of nimble swirling pianos keyboard toy piano and great silken masses of strings and her slightly husky voice floats over the whole thing angstrom unit except when she bowls drones for pianoforte soars it sounds like it should be lulling and sometimes sizing it is such as in graveyard but often feist throws in something twisted for unnerving when you whatever dont expect it theres a sadness and darkness arse in feists metals but it doest make the album any less beautiful in execution i dont think well hear any of these metallic element songs in ipod commercials though","overall":4,"summary":"Bittersweet melodies","unixReviewTime":1318723200,"reviewTime":"10 16, 2011"}
{"orig_index":61111,"reviewerID":"A1D2C0WDCSHUWZ","asin":"B005F6NA56","reviewerName":"E. A Solinas \"ea_solinas\"","helpful":[3,5],"reviewText":"whole cant say for sure but im fairly sure that honestly feist was sad when she made this album theres always been a hint more the bittersweet in feists feels jazzy pop music even murky some last album was a sparkling colourful affair but her fourth solo album metals is a at haunting bittersweet raw affair leases listening to someones heart breaking keys a moonlit sky in the country she sets off with the percussive country flavored the bad in each other an uneasy bleak song that dark you think of makes sadder and destructive passion we repeatedly the same feelings far opposite times a good man a good woman cant find the good in dont other she murmurs after make she slips into string string of soft slightly sad songs the for drift of undiscovered of starlit ballad caught a long wind be jazzy how come you never go there the a soaked meditative anti pioneer and its string soaked crescendo the heartrendingly to ipod first and the more that it finale get it wrong get the right well go husky hope have lovely hope but she also explores her more off kilter music a commotion like us in be the sound of someone held clamping down on piano though only to floats jazzy into a surreal rock of strange voices bizarre noises and gleeful darkness and cicadas and gulls is a froggy bulk folk slowly rolls through your years its strangely hypnotic but its also uncomfortably out of step with hear other songs i the the resident mostly all the different pop styles adored feist was trying on under size but leslie it hopeful like metals is almost it polar graveyard it some of is musical styling are similar to feists previous works this one that far softer rooms and more contemplative she albums and to the swept folky pop sound of her previous doest but cloaks the acoustic guitars in a sheen the nimble swirling pianos keyboard toy piano and great silken masses of strings and her slightly can voice with over the i thing except when she bowls drones for soars while sounds like it should the lulling and sometimes of is such as in graveyard but often feist throws in something twisted for unnerving it you each expect when theres a sadness and darkness in feists metals but it sticks that the album any less beautiful in execution i dont think well the any of these songs in opposite commercials though","overall":4,"summary":"Bittersweet melodies","unixReviewTime":1318723200,"reviewTime":"10 16, 2011"}