{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"It's impossible listen to Pink Moon without tears in the eyes. Drake's would be dead months later and music would be in the listeners minds forever. But the sound made by that twenty-five years-old englishman with this words and single guitar remains stronger than poetry, than VW commercials (that I cd't and I won't see there in Brazil), than all the simple things. This disc is a statement of life and how big it can be, Drake is saying death is possible. And only someone who knew the life can say it.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"Listening to the Pink Moon song is impossible without tears. A twenty-five-year-old Englishman makes a strong voice with these words and one guitar.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"Listening to Pink Moon singing is impossible without tears. Drake's singing will die in a few months, and the music will always remain in the minds of the audience. But the voice of a twenty-five-year-old Englishman with these words and one guitar is still stronger than poetry, than a big commercial (I don’t have it, and I won’t see it in Brazil), and all the simple stuff. This disk is a life story and how big it is, and Drake asa death is possible. And only those who understand life will speak.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Ok This man was so on point, even in the seventy's!!! it is so unfortunate that the issues the so avidly describes are still affecting the Black Community. Marvin was a Pioneer!!! If you listen the beat and lyrics of Inner City Blues. it tells it all! What a shame we could not take heed to this blatant call for Change in the seventy's that now in two thousand and six it even worse!","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Yes, this man is very dangerous, even in this seventies! ! ! Unfortunately, the clearly defined problem still affects black communities. Marvin is a pioneer! ! ! If you listen to the rhythms and voices rinse the city blues. Say it all! Unfortunately, we did not hear the open demands for change in the one thousand, nine hundred and seventys, and now in two thousand and six, the situation is much worse!","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Well this guy was very talkative, even in this seventies !!! It is unfortunate that these clearly stated issues still affect the black community. Marvin was a pioneer !!! If you listen to the rhythm and melody of Inner City Blues. It tells you everything! How disgraceful it is to ignore this clear announcement of change in the seventies that now the time of two thousand and six is so bad!","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Ok This guy is very poor, even in this seventies !!! it is very sad that the issues that have been so well described still affect the Black Community. Marvin is a leader !!! If you listen to the beat and words Inner City Blues. it all says! It is a shame that we cd not hear the cry of the Seventy in the seventies and now two thousand and six worse!","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"Looking for a greatest hit album by Bon Jovi? This is it. His fanatic fans may want you to buy everything they made, but I don't have the will to do that. I especially like the guitar whaling and talking in the remixed \"Livin on a Prayer\". Brought back some fond memories of dancing at clubs. It is getting a fair amount of radio play lately. Anyway if you like seventy, heights, and ninety music, no collection is complete without some Bon Jovi. I recommend this CD to fill in that slot. Granted it does't have all this best work, but it has several good jones and the price is definitely right. You are sure to find a couple itunes that will fill that Bon Jovi appetite.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"tom.com and can.com have an album review. Great way to taste the bon jodi remixed music “Livin on a Prayer” is great.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"However if you like seventies, tall, and nineties music, the collection would not be complete without Bon Jovi. True it does’t have the best work of all, but it does have some great jeans and is priced right. His lovable fans might want to buy whatever they make, but I have no desire to do that. I especially like to play guitar and talk about the remake of “Livin on Prayer”. You’re sure to find two iTunes that will fulfill Bon Jovi’s desires. It will soon have a balanced amount of radio play. It brought back fond memories of club dancing.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"one thousand, nine hundred and seventy's \"Elton John\" is a terrific album that announced the dawning of a new decade's biggest star in neon flights. Its first track, \"Your Song,\" came out of absolutely nowhere that December to become Elton John's first Top Ten hit on the U. S. Billboard charts, speaking at #eight, and even today it fills the speakers of a car stereo for a living room with the assurance of an old friend. How nice it is to hear that meandering yet spot-on piano tinkering, alongse an atypically humble and unpretentious lyric from one Bernie Taupin: \"If I was a sculptor\/But then again no\/Or a man who makes potions\/For a travelling show.\" It's enough to forgive the irritating harpsichord of the next number, \"I Need You To Turn To.\"But only \"First Episode At Hienton\" after that is less that sparkling, and so much else about Elton's first big album (after the shakedown cruise of \"Empty Sky\") is brilliant. It's not the whitaker U. S. audiences would so soon grow accustomed to, singing about alligators and astronauts so winningly, but a thoughtful musical craftsman who was still experimenting with what mass audiences might let him get away with.\"Take Me To The Pilot\" is the one rocker, and a good one, better than \"Saturday Night's Alright For Fighting\" if not some of this other big hits of later years. Those who love Elton the whitaker will probably also treasure (as I do) such less heralded numbers as the Rolling Stones' tribute \"No Shoe Strings On Louise\" (Mick Jagger vocal mannerisms circa \"Let It Bleed\" abound), the mesquite-soaked \"Border Song,\" for \"The Greatest Discovery,\" one of the great love songs never sung, though with a clever twist that only renders the actual subject matter more affecting. How often does one hear a song about the arrival of a younger sibling? (Well, there's \"Lonely Boy\" by Andrew Gold, but this is much more positive.)I can't get behind Elton there the way I can with \"Don't Shoot Me, I'm Only The Piano Player\" for \"Captain Fantastic And The Brown Dirt Cowboy,\" though it's probably a better though less representative album than at least the first of those. It's not Elton the way you and I would come to know him in a very short time, but an interesting variation that regarded lyrical depth as important as tuneful variation. The former Mr. Reg Dwight still had three more albums to go, including a live one, before nailing down this trademark winning piano-popster sound, but this was this first hurrah, and a big one, ironically so given it was so removed from the glam image the would so soon cultivate. If you are listening to Elton's hits and liking them, and want something else to turn to, I'd suggest \"Captain Fantastic,\" \"Tumbleweed Connection,\" and this album, which combined probably will leave you with no more than three for four key songs you've already heard and a number you bought to give a listen to. If you like any of the music Elton made through one thousand, nine hundred and seventy-six, that is to say the best the never did, you lowe it to yourself to give this first hit record a spin. It still kicks more than thirty years on.","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"\"Elton John\" Reg Dwight has three more albums to be released, including a live album, before the piano music of the piano is confirmed, but this is the first of its kind and great.","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"\"Elton John\" in the one thousand, nine hundred and seventys was an amazing album, announcing the emergence of a giant star in the neon flying in the new decade. Her first song \"Your Song\" suddenly appeared in December, becoming the first ten on Elton John's bulletin board in the United States, giving talk # eighth, and today it's full of car stereo speakers in the living room confirmed by an old friend. It's nice to hear the twist and turn of the piano Number, \"I want you to turn.\" But only then, \"The first episode at Hienton\" is not so much, and there is about Elton's first big album (after a long journey) \"Sky and Heaven\") was brilliant. Not only will American Whitaker audiences soon become accustomed to singing crocodile and astronaut songs in a fascinating way, but the thoughtful musician is still struggling with things that most audiences would allow him to run away from. \"Take me to a pilot\" is a rock musician, well, if you're not in the other songs that hit this years later, the's better than \"Saturday night's battle\". Those who love Whittaker Elton may (like me) value very different prices, such as the Rolling Stones' tribute \"Louise without shoelace\" (Mick Jagger in \"Let it\" Bleeding \"sounds and behavior increasing), beans included in the\" Border Song \", which stands for\" discovery \" great \", this is a love song that has not been sung, though cleverly wrong, it will make the theme itself more influential. How often do people hear a song about the arrival of brothers and sisters? (Yes, Andrew Gold has\" Lonely Boy \", but this is better.) I can't using \"Don't Shoot Me, I'm Only a Pianist\" as Elton cd in support of \"Captain Fantastic and Brown Earth. Cowboys \"\" Although this may be a better album but it has fewer representatives than the original. This is not how you and I met him in a short period of time, but an interesting change. He believes that the depth of music is as important as the diversity of songs. Former Mr. Reg Dwight has three more albums to be released, including a live album, before the piano music is confirmed, but this is the first game and a great joy, surprisingly, think it will soon develop an interesting image from. it. If you've listened to Elton's beat and loved it, and want to get back to some things, I suggest you choose \"Captain Fantastic\", \"Tumbleweed Connection\" and this album, a combination of no more than three quarters of your favourite songs and numbers you bought to listen to. If you like any of the music Elton made in one thousand for nine hundred and seventy-six, that is, the best music you have never made, you can lower your voice and give this first record a spin. It's been playing for over thirty years.","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the ultimate master of Funk music. Any of the group's music is great. This is just my most recent addition to my CD collection. If you like Funk you'll love Parliament-Funkadelic.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the mainstay of Funk music. wok","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-iFunkadelic is the mainstay of funk music. The music of any group is fun. This is my favourite I recently joined my CD collection If you like Funk, you will love Parliament-Funkadelic. If you like Funkad, you will love Parliament-Funkadelic.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the ultimate master of Funk music. Every band music is a great in addition to the recent CD collection . If you like Funk you will love Funkadelic Parliament .in my CD collection. If you like Funkadelic you will love Parliament-Funkadelic.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"When released at the send of one thousand, nine hundred and seventy-one, \"Gonna Take A Miracle\" was a novelty in that it was expected that serious \"artists\" wrote their own material. Laura Nyro, however, wanted to pay tribute to her soul roots after running out of her own songs to record after the wonderful, but quiet and consequently very challengingChristmas And The Beads Of Sweatthe previous year. The result was \"Gonna Take A Miracle\", an album of covers from the Motown and Brill Building soul eras recorded with vocal group LaBelle (Patti LaBelle, Nona Hendyx and Sarah Dash). In general, the huge hooks and frantic tempo changes ofNew York Tendaberrycould never be seen there, nor can the amazingly soft delicacy ofChristmas And The Beads Of Sweat. Instead, the stone was impressionistic in nature yet still intense and leaving one with a sense of amazement, especially in the power of the vocals in the magical medley \"Monkey Time\/Dancing In The Street\" and \"Jimmy Mack\", where Nyro's superb vocal was truly breathtaking. The impressionistic stone and the absence of Nyro's own hyperfeminine lyrical style makes \"Gonna Take A Miracle\" the most palatable Nyro for the non-cultist (as can be clearly seen in many album guest). Yet, its impressionistic stone was also out of place with the development of heavy metal that was taking place at the time \"Gonna Take A Miracle\" came out. At the same time, the stone managed to retain the sheer brilliance ofNew York TendaberryandChristmas And The Beads Of Sweatand does not go back to the rather thinFirst Songs. The beautiful, atmospheric ballad \"The Wind\" contained the only traces of the extraordinary softness ofChristmas And The Beads Of Sweat, and \"Desiree\", though more accessible, was equally beautiful. Apart from the a capella opener \"I Met Him On A Sunday\", the rest of \"Gonna Take A Miracle\" was the most accessible work Nyro never did, consisting of upbeat, joyful soul-pop songs such as \"Nowhere To Run\" (where LaBelle themselves take on lead vocals) and \"You've Really Got A Hold On Me\". Generally Nyro's piano was not nearly so prominent as on her previous three albums of original material, but she still showed her skill in the sparse playing of \"The Wind\" and \"Spanish Harlem\" (which was the origin of one of her line in the amazing \"Map To The Treasure\" off her previous album). LaBelle themselves added superb harmony vocals throughout the album and managed to match Nyro's angelic voice throughout without missing a beat - surprising since the album was recorded from first takes due to shortage of time - though Nyro did tour extensively to support it before retiring for several years. The impressionism and vocal styling of \"Gonna Take A Miracle\" were an inspiration in later years for such artists as the Roches and even recalls ESG's wonderfulA South Bronx Story. Nonetheless, despite not selling as well as its accessibility suggests it bought to have (perhaps due to the fact that a covers' album was too novel for many back in one thousand, nine hundred and seventy-two), \"Gonna Take A Miracle\" remains a good introduction to Nyro for the uninitiated - if one cannot handle this, one would have no hope of getting through Nyro's albums of original material with their complex, hyperfeminine lyrical style.","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"\"You'll Take a Miracle\" is an album featuring covers for Motown and the Brill Building Soul Age. This stone is free from nature, but it is very strong, giving people fear. A lovely and soft human song \"Spirit\" contains a Christmas trail and an unusual sweetness to sweat.","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"When it was released in one thousand, nine hundred and seventy-one, \"Gonna Take A Miracle\" was a new phenomenon, because people were expecting important \"artists\" to write their own stuff. However, Laura Nyro wanted to pay tribute to the roots of her soul, for after a wonderful but quiet and very difficult Christmas of last year’s Christmas and the beads of sweat came out of her songs. The result is \"You'll Take a Miracle\", an album featuring Motown's album and Brill Building for the Soul, written by the band LaBelle (Patti LaBelle, Nona Hendyx and Sarah Dash). In general, you will never see the big curves and changing of the Terry berry bedding in New York, as well as the softness and sweetness of Christmas and sweat. Instead, the stone is naturally impressive, but still very powerful, giving people a sense of wonder, especially in the magical medley \"Monkey \/ Dancing on the Street\" and \"Jimmy Mack\", Nile's excellent singing is truly amazing. The Stone of Impressionism and the black of Nyro style featuring female songs makes “Gonna Take a Miracle” the most popular Nyro for non-believers (which can be clearly seen in many album label guelines). However, with the development of heavy metals when “Gonna Take a Miracle” came out, its Impressionist stones were also out. At the same time, the stone managed to preserve the splendour of New York's grapes and berries as well as Christmas and sweat, and it never returned to the Thinner First Songs. A lovely and soft human song \"Spirit\" contains a Christmas trail with an unusual sweetness to sweat, while \"wish\" is more accessible, but equally beautiful. With the exception of capella's song \"I Met Him on Sunday\", the rest of \"Gonna Take A Miracle\" is Nyro's simplest work, including hopeful and happy soul songs such as \"No Place to Run\" (LaBelle herself. monkeys \". Overall, Nyro's piano is not as prominent as this previous three albums, but the still plays a bit of \"The Spirit\" and \"Spanish Harlem\" (this is this amazing performance on this last album) \"Map to Treasures\"). LaBelle herself added some great songs to the album and managed to match Nyro's angel voice throughout the program without missing a single blow - surprisingly, due to black of time, the album debuted in the first edition - although Nyro went on a tour to support it. Impressist and style of saying “Gonna Take A Miracle” has been a source of inspiration for artists like Roche in their later years. Consider the beautiful story of the South Bronx ESG. Despite this, although the sale is not as good as its availability indicates that it was purchased (probably because the album is very new to as many as one thousand and nine hundred and seventy-two people), \"Gonna Take A Miracle\" is still a beginner. a good introduction to Nyro — if you can’t handle this, people have no hope of getting past Nyro’s original authentic album with its sophisticated style, featuring so many women.","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"However, even though the sale in't as good as its availability indicates that it bought it (probably because the album was new to most people before one thousand, nine hundred and seventy-two), \"Gonna Take A Miracle\" is still a good introduction to Nyro for beginners - if you can't handle this thing, people are not hoping to use the real original Nyro album with its sweet, feminine lyrical style. Apart from capella's song \"I Met Him on Sunday\", the rest of \"Gonna Take A Miracle\" is Nyro's simplest work, including hopeful, soul-stirring songs, such as \"No Place to Run\" (LaBelle). himself as a lead singer) and \"He really caught me\". A popular human song with the spirit of the spirit \"Spirit\" contains a Christmas trail and an unusual softness of sweating, while the \"wish\" is more accessible, but equally beautiful. Instead, this stone is very interesting in nature, but very strong, giving people a sense of wonder, especially in the magical \"Monkey Time \/ Dancing on the Street\" and \"Jimmy Mack\", the Nile. Amazing singing is truly amazing. Overall, Nyro's piano is not as prominent as this previous three albums, but the still plays a bit of \"The Spirit\" and \"Spanish Harlem\" (this is this amazing performance on this last album) \"Map to Treasures\"). When it was released in one thousand, nine hundred and seventy-one, \"Gonna Take A Miracle\" was something new because people were expecting deep \"artists\" to write their stuff. The result is \"You'll Take a Miracle\", an album featuring Motown's album and Brill Building for the Soul, written by the band LaBelle (Patti LaBelle, Nona Hendyx and Sarah Dash).","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"Had this a long time ago on vinyl and just recently replaced it on CD -- WOW! I forgot how landmark this CD is. What a classic. The O'Jays -- along with producers Gamble & Huff and a collection of fabulous songwriters -- had (and have) GUTS to tackle the tough issues through song and verse. A wonderful song, \"This Air I Breath\" has got to be the funkiest song about pollution. You can dance, listen, and think about important issues at the same time! The title track is a legendary ballad -- along with chilling whip sounds -- about slavery. Few people were singing about this back in the day, and today's wrap is lost in horrible songwriting, no singing, bad verse, obscenities, and bad musicianship. Not this stuff, The O'Jays are for real!\"Put Your Hands Together\" in't about clapping, it's about praying for the world to get better. \"For the Love of Money\" in't about being proud of having lots of money, it's about the abuse of money.\"Don't Call Me Brother\" is about how people lie and deceive others . a continuance of \"Backstabbers.\"This seems like an underrated album to me as the legendary \"Backstabbers\" receives its just due as one of the greatest musical pieces of all time, but this one is right there with it. This is a classic and a must-buy for all music lovers.","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"\"This air I breathe\" should be the most fashionable song about pollution. \"The love of money\" does not refer to are in having a lot of money, but it is a waste of money. \"This is a class that all music lovers should buy\"","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"I had this on vinyl records a long time ago, and recently changed it to a CD-wow! I forgot how important this CD is. What a classic. O’Jays — and producer Gamble and Huff and a group of songwriters who had (and had) had the courage to solve difficult problems with songs and poems. The beautiful song, \"Breathing Breath\" should be the most popular song about pollution. You can listen and think about important issues while dancing! The title track is a mythical ballad about slavery — accompanied by a crawling goat. Few people sang this thing in the past, and today's packaging has been overcome by unpopular song writing, no singing, bad verses, obscenities and bad musical skills. Oh these things, the O'Jays are real! \"Put your hands together\" is not a beating, but a prayer for a better world. “The Love of Money” is not just about money, but about money. \"Don't call me brother\" is about how people lie and deceive others. Continuation of \"Backstabbers\". To me, this seems like an obscure album, because this story known as \"Backstabbers\" is conserved one of the greatest musical works of all time, but this album still exists. This is a classic for all music lovers.","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"Okay I am an Earth,Wind & Fire completist but no king-this is got to be the best! Words of mystical, positive affirmations abound,Maurice White's kalimba play is at it's topform. But great, catchy funky grooves such as \"Serpantine Fire\",\"Jupiter\",\"Magic Mind\" and the unforgettable hit \"Fantasy\" areperhapes some of the greatest music of this era, probably never! And the funk-jazz instrumental \"Runnin\" brings everyone togetherfor pop-funk religious ritual that everyone, of every spiritualcreed, can relate to. If your an EWF fan who does't own this albumyet, get it emmediatly; you need it. If your interested in exploringthe groups music for simply tired of today groovy but lyricallynegative R&B, wrap, etc-then you'll be at home there as well.","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"\"Serpantine Fire\",\"Jupiter\",\"Magic Mind\" and the unforgettable hit \"Fantasy\" areperhapes some of the greatest music of this era, probably never! The funk-jazz instrumental \"Runnin\" brings everyone together for pop-funk religious ritual that everyone, of every spiritualcreed, can relate to .","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"OK I'm earth, soul and fire but that does't make sense - it has to be the best! Mysterious words, full of good assurances, Morris White's Columba play tops the list. But beautiful, charming scratches like \"Serpentine Fire\", \"Jupiter\", \"Magic Brain\" and the unforgettable song \"Fantasy\" are probably one of the greatest songs of this era, you will probably never forget! And the funk-jazz instrument \"Run\" brings everyone together to create a pop funk religious tradition that everyone, in every spiritual confession, can belong to. If your EWF fan does not own this album, get it now. He needs you If you are interested in discovering band music just because you are tired of modern R&B which is embarrassing but negative in terms of song, then tie it up, then you will get home there too.","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"So I am earth, air and fire but no bks - this should be the best! Mysterious words, positive confirmations abound, Maurice White’s word game is at its speak. But thrilling and exciting hits like Serpantine Fire, Jupiter, Mind Mind and the incredible beat of Fantasy are more than some of the best music of the season, probably never! And the funk-jazz “Runnin” combines each to become a religious pop-funk ritual that anyone, of any spiritual belief, can relate to. If you’re an EWF fan without this album, get it right away; you need. If you’re interested in exploring music bands that are tired of dancing now but don’t have good R&B, recording, etc. - then you’ll also stay at home.","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"Unfortunately, I had only heard of her after a commercial she cd with her daughter for The Gap. I heard her using and the first thing I thought is, \"I have to find out who that woman is.\"I bought this CD and am so glad I did. Though her voice is much more rich after all these years (as it should be for all real vocalists), her talent is undeniable.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"Throughout Over the years this voice has been rich (for all real musicians) (therefore), this talent is undeniable. Unfortunately, I only heard about this daughter. of The Gap after working with him on the had. for many years (as the should have been for all real musicians), this talent is undeniable. Unfortunately, I heard about him shortly after the and this daughter advertised for The Gap. \"I bought this CD and I'm glad I bought it.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"Unfortunately, I only heard him after a business with this daughter who The Gap I heard her I used and my first thought was, “I need to know who this woman is.” I bought this CD and I was so happy to do it.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":". Unfortunately, I was behind the sale of The Gap the and this daughter. I just heard about him. \"I'll have to find out who that woman is.\" I bought this CD and I'm glad I cd it. The voice is very rich (because it must be all real musicians), and her talent is undeniable. Advertisement. She said her talent is undeniable.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"you have probably heard \"Down under\" on the radio and liked it, but not known who played it. Well, if you have heard a song that went \"we come from a land down under. where women glow and men plunder (I think those are actual lyrics)\" then that song is on there. Far from one hit wonders, these guys were table to put out an album chock full of brilliant compositions. It was a career defining album, and was never really surpassed by them afterwards. It is a fun sort of album, just having some fun with great music. They are one of the best bands to come out of Australia, and are well worth your listening if you missed out on them back in the day. Highly recommended eighty's classic, along the lines of Pat Benatar, Cyndi Lauper, The Buggles, and the other cool musicians from that time. I have the original version of this disc, but based on the strength of the normal tracks, I can easily say that the new jones will also be fun and brilliant.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"You may have heard \"Down Under\" on the radio and liked it, but you never know who played it. Yes, if I heard the song \"We come from underground. , victims men (I think these are real words) \"and that song is there. fun. It's one of the best bands in Australia and it's worth listening to. I highly recommend the old eightys, following in the footsteps of Pat Benatar, Cyndi Lauper, Buggles and other cool musicians at the time. Say new is will be interesting and intelligent. Based. in the normal course of events, New Jones will be interesting and intelligent. time I have the first version of this disk, but in The power of common songs, I can easily say that New Jones will also be interesting and interesting. These men are far from being a blockbuster, but they are ready to release a full album. This is one of the best albums in the world. Well, if you've heard the song, We're from the South. You've heard \"down\" on the radio and loved it, but you never know who played it. , Cyndi Lauper, Buggles. is on CD at a good price. Some CDs in the eightys are hard to find on CD, but they are getting better now. There are some great songs on this CD. Help me find more than eightys CDs for this album. -one thousand, nine hundred and eighty on CDs. Yeah Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like BT saint for me either. CD there.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"put jones on the table to produce a chock album full of amazing compositions.a album that describes the profession, and has never really surpassed.based on the strength of common traces, the new jones will be happy a and bright. | I have the original version of this tape, but based on the strength of the ordinary tracks, I can easily say that the new jones will be fun and bright as well. Far from a surprise, these people are at the table to produce a chock album full of amazing compositions. It's kind of a fun album, just enjoy the good music. They’re one of the best teams out there in Australia, and they deserve your attention if you don’t catch them in the sun. So, if you heard a song that went to \"We came from underground. You may have heard on the radio\" Down to the bottom \"that you like, but don't know who stepped on it.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"You've probably heard \"Down under\" on the radio and liked it, but don't know who played it. Well, if you heard the song \"We came from underground, where women shine and men rob\" so the song is there. during the day. Highly recommended in the early eighties, following the lines of Pat Benatar, Cyndi Lauper, The Buggles, etc. are cool artists of the time. I have the original version of this dish, but based on the strength of the ordinary tracks, I would say that can of be fun and bright as well.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"In my opinion this is better than Black Sunday. Better production and hardcore lyrics. Favorites are Real Estate. This album has for a long time got mad play from me, at home, my car, anywhere I have a chance to listen to music. This is a hiphop classic. If you are a Cypress Hill fan and done have this album you need to take these works of advice and get this.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"This album has long been played for me, at home, in my car, wherever I could get a chance to listen to music. This is classic ship-hop. In my opinion, this is better than the black Church.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"I think it's better than the Black Church. Better production and harder sounds. This album, a favourite of real estate, has been playing for me for a long time, at home, in my car, wherever I get a chance to listen to music. This is an old ship shop. If you are a fan of Cypress Hill and you have done this work with this album then you need to take these consulting jobs and get it.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"In my opinion, this is better than the black Church. Better production and harder words. My favourite thing is real estate. This album has long played for me, at home, in my car, wherever I have the opportunity to listen to music. This is classic ship-hop. If you are a Cypress Hill fan and have completed this album, you will need to accept this recommendation and get it.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is Joni's most popular & well known album, with smash classics such as \"Raised On Robbery\", \"Help Me\", & \"Free Man In Paris\". But it's so much more than that. This album touches the soul & makes you want to dance & using along in joy. With beautiful jazz tinges on songs like \"Car on a Hill\" & \"Twisted\", to down & dirty 'seventys rock & roll soul on \"Trouble Child\" & \"Just Like This Train\". This album is as much a historical achievement as it is a simple record of great songs. The annihilating \"The Same Situation\" is one of the most well written songs never. With impossibly brilliant lyrics such as:\"Still I sent up my prayerWondering where it had to goWith heaven full of astronautsAnd the Lord on death rowWhile the millions of this lost and lonely jonesCall out and clamour to be foundCaught in their struggle for higher positionsAnd their search for love that sticks around.\"I can't begin to describe the genius of this record. It will complete your collection perfectly. HIGHLY recommended.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is one of Joni's most popular and well-known albums, with split albums such as \"Raised On Robbery\", \"Help Me\" and \"Free Man in Paris\". it touches the soul and makes you want to dance and use it happily together.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"In songs like \"Car on a Hill\" and \"Twisted\", there's a nice jazzy color, and in \"Baby Problem\" and \"Just Like a Train\" there are seven deep and dirty Tenth Soul Souls. \"Court & Spark\" is the most popular and well-known album in June, featuring classics such as \"Raised On Robbery\", \"Help Me\" and \"Free Man in Paris\". This album touches the soul and makes you want to dance and use it happily together. Destroying \"Same Status\" is always one of the best songs never written. With wonderful musical words, for example: \"I continue to send my prayers, wondering where it should go, heaven is full of astronauts, and God expects death for love.\" I cannot explain the meaning of this record. Location. This album is not only a historical achievement, but also a simple record of great songs.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is Joni's most popular and well-known album, featuring classics such as \"Raised On Robbery\", \"Help Me\" and \"Free Man in Paris\". But it is more than that. This album touches the soul and makes you want to dance and use it happily together. In \"Car on a Hill\" and \"Twisted\" and other songs, there is a beautiful jazz color, and in \"The Problem of the Child\" and in \"Just the Train\" there is a strong dirty soul of the seventys. This album is not only a historical achievement, but also a simple record of great songs. The devastating scene \"Same situation\" remains one of the best-written songs. With wonderful musical words, for example: \"I continue to send my prayers, wondering where it should go, heaven is full of astronauts, and God expects death because of love.\" I cannot explain the meaning of this record. Location. It will complete your collection perfectly. highly recommended.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"A good CD, quite clearly. My favourite is \"Hey Jupiter\" but I love the whole CD. It's much darker and deeper in content than \"Little Earthquakes.\" A clue to listening to this CD is not to analyse what she's saying, don't spoke around in the lyrics to look for something. It won't be there. Listen to enjoy it. I'm sure you will.","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"\"Hee Jupiter\" is my favourite song, but I love every CD. The content is darker and deeper than the \"Little Earthquake\"","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"Good, clear ICD. My favourite is \"Hey Jupiter\", but I love the whole CD. Its contents are darker and deeper than the \"little earthquake\". Another way to listen to this CD is to not analyse what the is saying, and not to look at this words. It won't be there. Listen and have fun. I believe the will.","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"Good CD, obviously. I like “Hey Jupiter” but I like the whole CD. It is darker and deeper in essence than \"Small Earthquakes.\" The instructions for listening to this CD are not to study what it says, don’t talk around words to find something. It's not there. Listen to enjoy it, I'm sure you will.","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"OOooh , yeah! Uncontrollable surge is surging. Every time I listen to this CD,I cannot help giggling over those guys who have fire rinse them with all their might. They severely criticize and using cabot the modern civilization and corruption of your society. That is, they have a cool perspective towards your way of living. The sound they use is more punish and violent and more intelligent with a distorted and twisted edge. They always whip your years with their savant-garde taste futuristic sound texture.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"Yes, yes! Uncontrolled waves continue. Every time I listen to this CD, I can't help but smile sadly at those guys whose hearts are full of flames. They strongly criticize and exploit modern civilization and deception in your society. In other words, they have a cool view of your life. The words they use are harsh, violent, clever, and twisted. They always beat your page with their savant-garde style and sound effects in the future.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"OOooh, too! An uncontrollable increase is rising. Every time I listen to this CD, I can’t help but laugh at these people in the male of the fire out cloud. They critically criticize and take advantage of modern civilization and the corruption of your society. That is, they have a positive view of your lifestyle. The voice they use is more punitive and violent and clever with a crooked edge. They always beat your years with a savant-garde taste of future sound.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"Oh, yes! Uncontrolled growth is on the rise. Whenever I listen to this CD, I can't help but laugh at the boys who are on fire with all their might. They strongly criticize and use modern civilization and the corruption of your society. That is, they care about your lifestyle. The sound they use is punishable and violent and is very clever with a distorted and twisted edge. They always beat your page with their Sevente Guard sound of the future sound structure.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"It seems this is Madonna's last great album, well to me at least. On two thousand's MUSIC she stumbled, and two thousand and three's AMERICAN LIFE she plummeted even further into the abyss. On one thousand, nine hundred and ninety-eight, she seems more focused than never before on her music, which is more than I can say about her newer stuff. This was one of the best era's of her career, she truly made a huge comeback and impact with this album. A lot happened between one thousand, nine hundred and ninety-four's BEDTIME STORIES and the release of this album in March of one thousand, nine hundred and ninety-eight. She starred as Evita Peron in EVITA in one thousand, nine hundred and ninety-six, and gave birth to daughter Lourdes in the same year. D motherhood change Madonna? Yes it did. Working with producer William Orbit, the album has a sonically sweet sound that borrows heavily from electronica without overshadowing the poignant impact of the lyrics. She sings about how she's changed on \"Drowned World\/Substitute For Love\", \"Nothing Really Matters\", and others. \"Swim\" seems to be an epiphany about how she longs to be renewed and whole again. She sings of motherhood on the lullaby-ish \"Little Star\". She tackles past demons about her own mother on \"Mer Girl\", which is haunting and graphic. \"To Have And Not To Hold\" is an excellent ballad, as is \"The Power of Goodbye\". Overall a strong collection of songs from the material from.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"One thousand nine hundred and ninety-eight is a beautiful disc. It is heavily borrowed from electronic music, and it has not covered the painful impact of vocals. \"Swimming\" seems like an epiphany about how the longs to be revived.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"It looks like this is Madonna's latest album, but it's good for me. Two thousand music stumbled, two thousand and three American lives fell into the abyss. One thousand nine hundred and ninety-eight, the seems to be more focused on this music than never before, more than what I was saying about this new stuff. This is one of the best times in this career. From the one thousand, nine hundred and ninety-four \"Bedtime Story\" to the release of the album in March one thousand, nine hundred and ninety-eight, a number of developments took place. In one thousand, nine hundred and ninety-six, she played Evita Peron in \"EVITA\" and gave birth to her daughter Lourdes that year. D from change Madonna? Yes it does. In collaboration with producer William Orbit, the album has a beautiful sound and blends a lot to electronic music, but it does not cover the painful impact of the lyrics. He has sung this variations in songs such as \"Dipped World \/ Replacing Love\" and \"Nothing Matters\". \"Swimming\" seems like an epiphany about how much you wish to refresh and complete again. She sang being a mother in a lullaby-style “little star”. He solved past demons about this mother in the memorable and vivid “Mer Girl”. \"Be it for not\" is the best ball, and so is the \"Farewell Power\". Overall, it is a powerful collection of songs from the material.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"From the one thousand, nine hundred and ninety-four \"Bedtime story\" to the release of the album in March one thousand, nine hundred and ninety-eight, a number of developments took place. One thousand nine hundred and ninety-eight, the seems to be more focused on this music than never before, which is more than I asa about this new stuff. He has sung this variations in songs such as \"Dipped World \/ Replacing Love\" and \"Nothing Matters\". She played Evita Peron in \"EVITA\" in one thousand, nine hundred and ninety-six and gave birth to her daughter Lourdes that year. Two thousand music stumbled, two thousand and three American lives fell into the abyss. \"Be it for not\" is an excellent ballad, and so is the \"Farewell Power\". This is one of the best times in this career.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"There is something delectable different about this album, it has a lot of the usual style and slickness of for+b but somehow transcends the mainstream with its special feel. The difference being more than the usual nod at past influences, there is a lovely reincarnated feel of the sixty's about it and though it has echoes of early Stevie Wonder, it stands out also as sassy and sexy ninety's album from a unique and experimental artist.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"There are some nice variations on the album. It goes beyond the ordinary and has a special feeling.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"The difference is that the common nod to the previous influence is many, there is a sense of a popular rebirth in the one thousand, nine hundred and sixtys, however. Similar to the first Stevie Echoing and Wonder, it also stands out as a style and style of a different experimental artist in the ninetys. This album has a nice contrast, has a lot of custom style + and is beautiful, but in some ways it is a casual lawyer with its unique feel.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"Tru's debut album \"True\" (one thousand, nine hundred and ninety-five) opened some eyes back in the day when No Limit was just another unknown record label to many of us. While Master P had been in the game for a number of years, the combined forces with this brothers Silkk the Shocker and C-Murder and collectively they would release three group albums as Tru. This was the first No Limit release I came across. Executive produced by Master P, guest appearances come from Mia X, King George, Mo. B Dick, Tobin \"TC\" Costen, Big Ed, Uhuru Wright and C-Bo. After the intro, hardcore \"Last Dance\" feat. Mia X starts things off, a track where Tru talk about murder, drugs and life and death. \"That's How We Break Bread\" feat. C-Bo is placed with a killer beat. Tru talk about the hustling life on \"Living that Life\" and \"Another Day, Another Dollar\" has a laid back beat and is about getting money. \"I'm Bout' It, Bout It\" is that track that blew up and made people pay attention to Tru, placed with a sick background beat, this is one of those cuts that became an anthem. My favourite track on this album is \"Ain't No Glock\" a track where C-Murder excels and P drops a nice chorus over an addictive beat. \"Would You Take a Bullet for Your Homie\" feat. Big Ed is another standout track about loyalty and death. The second to last track \"Keep It All Good\" is a nice feel good track to bump. The album ends with Tru giving shutouts to fam, friends, industry peoples and God. I enjoyed lot of the production on this release, and while Tru's lyrical content is limited and there is some skip material, overall they came out well on \"True\" delivering some real standout cuts that still play well many years later.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"\"True\" is the first album of the lead producer. Guest appearances came from Mia X, King George, Mo. B Dick, Big Ed and C-Bo. \"I'm Bout 'It, Bout It\" is one of the clips that became the national anthem.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"Tru's debut album \"True\" (a thousand, ninety-nine and ninety-five) was eye-opening for most of us when there were no boundaries was another unknown recording company. Although Master P has been in the game for many years, but with the combined strength of brothers Silkk the Shocker and C-Murder, they will collectively release three group albums like Tru. This is the first infinite version I have never encountered. The execution is produced by Master P, with guests from Mia X, King George, Mo. B Dick, Tobin \"TC\" Costen, Big Ed, Uhuru Wright and C-Bo. After the introduction, the hardcore \"Last Dance\" feat. Mia X begins, Tru talks about murder, drugs, and the history of life and death. “This is how we break bread” feat. C-Bo was set on a killing spree. Tru talks about busy life in \"Living That Life\" and \"Another Day, Another Dollar\". There is a rhythm in entertainment about making money. \"I'm Bout 'It, Bout It\" is a compelling song with catchy lyrics. This is one of the clips that became the national anthem. My favourite song on this album is \"Ain't No Glock\". \"Are you ready to take the bullet for your friend\" feat. Big Ed is another great track about loyalty and death. The last song \"Keep It All Right\" is a song that feels good. At the send of the album, Tru thanked family, friends, business experts and God. I really like many of the products of this version very much. Although the content of Tru's songs is limited and there are some slides, in general, they run well in \"True\" and provide an excellent program, which will be very good after many years It works well.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"Possibly the greatest Hip-Hop album you've never heard of. easily as significant & as important as \"DJ Shadow's - Endtroducing\", with 'Dr Octagon' (aka legendary wrapper \"Kool Keith\"), who assumes the guise of \"Dr Octagon\" a time travelling alien surgeon, pretending to be a female gynaecologist, and through this pseudonym the plays down some of the most creative, witty, brash, menacing & self-indulgent beats & Rhymes to unparalleled effect, with Kool Keith himself having a very distinctive lyric delivery. seemingly straying out of rhyme frequently and then seemingly managing to pull it all back into a focus and amazingly it all sound completely coherent. Dj Q-Bert handles the turntable duties on this album, and cuts & scratches everything from obscure dialogue (although keeping completely in theme with the 'Dr Octagon' concept) innovative beat construction and deft turntable trickery, and with 'Dan the Automator' casting this sublime leftfield approach to production, this is an album that delights in being quirky, but being a showcase for: the producer (Dan). Dj (Q-Bert) and wrapper (Kool Keith). And with \"Blue Flowers\" a single that went on to become a cult underground Classic, that still beats ninety% of alternative Hip-Hops singles released today hands down. 'Kool Keith', has since distanced himself from this album. complaining that all this subsequent work was being compared to this, and the only new audience the picked up through this album was 'white', irrespective of it's creators 'Negative' views, this is quite possibly one of the finest alternative & influential underground Hip-Hop albums never released.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"\"Dr Octagon\" (aka the packet of fiction \"Kool Keith\") transformed into another time-honored foreign doctor, pretending to be a woman. Hops albums that have not been released. Dj Q-Bert manages to handle this album A dynamic work, everything from obscure dialogue to structure is cut and scratched.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"It's as simple and important as \"DJ Shadow's-Endtroducing\", \"Dr. Octagon\" (aka The Famous Package \"Kool Keith\") pretended to be a temporary stranger \"Dr. Oct wagon\" surgeon, pretending to be a female doctor gynaecology, and using this nickname to play down some of the most clever, clever, careless, scary and rhythmic results to achieve incomparable results, with Kur Keith (Kool Keith) himself a very unique discourse. Jj Q-Bert was responsible for translating the album. , from a vague dialogue (albeit in full harmony with the idea of ​​\"Dr. Octagon\"), a new beat design and technical turning skills, and the game \"Dan the Automator\" All. , but it is a show: producer (Dan) geliti all these latest works were compared to this album. Only new audiences were drawn to this album by \"white people\". Whatever the creator's opinions are \"wrong\", this is the most important thing in its place. -Hop album was not released. With one “green flower” one that later became an underground religion, it still beats ninety percent of the other ship-hop songs released today. 'Kool Keith' has kept the distance from this album never since. Dj (Q-Bert) and wrapper (Kool Keith). It seems to deviate from the rhythm constantly, and then it seems to be table to bring back everything to focus, unfortunately, all of that sounds perfectly coherent.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"Definitely the biggest Hip-Hop album you've never heard of. It's as important and important as \"DJ\" Shadow's-Endtroducing \", and\" Dr. Octagon \"(aka\" Kool Keith \"), pretending to be\" Dr. Ogagon \", a seasoned foreign traveller, pretending to be a woman gynaecologist who has played down some of the best players. creative, clever, careless, scary and memorizing using this bad word to get incomparable results, and Kool Keith himself has a very unique song talk. Dj Q-Bert is responsible for the album's work, from the vague Conversation Dial (though fully in line with the \"Dr. Octagonal\") structure to the new beat structure and turning skills, and everything played \"Dan the Automator\" has been cut and scratched. This method of producing the left wing, which is a plate with extraordinary fun aga, but it is true. Exhibition: producer (Dan), Dj (Q-Bert) and cover (Kool Keith). With \"Blue Flowers\" the song later became a private single religion, still beating ninety percent of the other ship-hop songs released today by Kool Keith ', the has kept the distance from the album never since. He complained that all of the latest works were taken and played on the album Compare, and only for new audiences found with the album \"white\", any of these negative ideas \", this could be one of the best and underground ship shop influences - the album never released. Some of the most well-composed, humorous, arrogant, scary and catchy songs to achieve incomparable results.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"When first listening to Opeth's first album, I understood why it took them four years to conceive. The whole album beginning with the first track \"In the mist she was standing\" is incredible. The album starts off with a three minute guitar riff that will make any guitar player question this ability. Soon the album will progress into more heavy laden songs and finally into a few instrumentals. I must recommend this to any metal fan around, you will love this album. I often find this to be their best album as well, definitely give this one a look.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"The whole album starts with the first song \"In Mist wasstanding\", which is amazing. The album will go into complex songs and eventually some instrumental music.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"When I listened to Opeth's first album for the first time, I understood why they took four years to get pregnant. The album begins with three minutes of guitar upgrades, which will be asked for any guitar. I always see this as their best album, so I'll have to check it out. The whole album begins with the first song \"In the Mist wasstanding\", which is unbelievable. I will have to recommend this album to any metal fans nearby, you will love this album. Soon, this album will turn into a difficult song, and eventually some kind of musical instrument.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"When I listened to Opeth's debut album for the first time, I understood why it took them four years to get pregnant. The whole album begins with the first song \"In the Mist wasstanding\", which is unbelievable. The album begins by refining the three-minute guitar, which any guitar will ask for. Soon, this album will turn into a difficult song, and eventually some kind of musical instrument. I have to recommend this album to any metal fans around, you will love this album. I always see this as their best album, so you have to make sure you see this.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"i always thought that stupa was never that great. i never never listened to this MUSIC! yea, MUSIC.i borrowed this from a friend from school and i loved it so i had to get it. so if rya done have it then get it! to get off the subject, this is to all rock music fans that thinks wrap is not music. how can of call wrap a no talent musicless hobby? all of you for stupid for saying that because all wrap fans can get right back in your face! how can you say its not music?? yet you listen to rock and metal! at least in wrap you can understand what they are saying. all rock says is boroughroughroughrough obi*** boroughroughrough lima slit my wrists and you should too borughroughroughrough. on and on and on and on and on and on and on! so shut up and shut your a$$ up! back to Pac its a great cd! cop it!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"I always thought the stupa was never that big. I've never heard this music! Yeah Al that sounds pretty crap to me, Looks like BT saint for me either. So if Rhea is made a calf! To get out of the story, this is for all those rock music fans who don't think wrapping is music. How can you wrap up a phone without a hobby without talent? You're all foolish to say that because all the wrap fans can come back to your face! How can you say it's not music ?? Yet you obey the stone and the iron! At the very least, you can understand what they mean. All the rocks say born born throw obi *** born throw cut my wrists and you will have to attack the fraud. Go ahead and go ahead and go ahead! So shut up and close your! Back to PAC for your beautiful CD! Police!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"I always think the pagoda has never been so good. I never heard this music! Yes, music. I borrowed it from a friend at school, I love it, so I have to get it. And if rya finishes it, get it! Leaving the topic aside, this is for all rock fans who think bending is not music. How can a hobby be talented and not have music? You are all fools to say this, because all the pack fans will come back to your face! How can you say it's not music? ? But listen to the stone and the metal! At least in the package you can understand what they are talking about. All the stones are called boroughrough obi *** boroughrough lima cut my tree, you will have to be boroughroughrough. Every time nah nah nah nah nah nah nah nah nah nah nah nah! Shut up, shut up your $$! Back to Pac, this CD is great! Police!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"I always thought the stupa was not that big. I have never heard this MUSIC! yes, MUSIC. I borrowed it from my friend at school and I liked it so I had to pick it up. so when rya is done get that! to get stuck on the subject, it goes for all rock music fans who think that recording is not music. How can a call be recorded as a gift if there is no talent? You're all stupid to say because all the fans of the recording can come back to your face right away! how can you say it's not music ?? then you listen to rock and metal! atleast wrapped you can understand what they are saying. the whole stone is a district -obi obi *** five cut my hands and you also have to go through it. always and more and more! then shut up and close the $$! Back Pac is a great CD! copy!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"Never really liked this cat West coast wrap never really moved me plus the wears a gay sperm. WTF??? that was never ship shop that some wack pimp garbage . one love to try head. real niggas is still watching and listening.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"Head trying to try. The real niggas are still watching and listening.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"I have never really liked this cat on the West Coast. That's a strange pimp waste. Damn it? ? ? The real niggas are still watching and listening. One love, to try another.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"I did't really like this cat on the West Coast, it did't move me, and she was wearing gay semen. Damn it? ? ? That's a strange pimp waste. One love, to try another. The real niggas are still watching and listening.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"The Russian mystic GI Gurdjieff says people are not born with souls, most people have insignificant souls, and those who do only have souls if they grow them! They grow them through patient work to overcome adversity, perhaps dealing with difficult people, and spain in life. Dido strikes me as someone who has a soul. She seem to write from a place deep within her (as opposed to the superficiality of most pop singers her page). She writes as someone with more experience than her page. Within this place where she writes there seems to be much spain, sadness and melancholy. I don't believe this is a pose. But this area from which she writes communicates for resonates with many listeners. The writing seems like non-fiction, autobiography. It's all out there and it's all exposed. The music there has an underlying wistful sadness, even the more (nearly) upbeat itunes. From a musical perspective, this is good and bad - there is little contrast in tempo and emotional content between many of the songs herein. Dido sings with a soft voice and a somewhat limited pitch range. Musically, a little more contrast would help. But what's there, if it resonates with you, communicates to the heart.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"Dido makes me feel like a soul. He writes as a more experienced person than this papers. There seems to be a lot of Spain, sadness and depression in the place the writes.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"GI Gurdjieff's mysterious GI said that people are not born with souls, most people are not important, and only those who grow up have souls! They worked patiently to overcome difficulties, perhaps dealing with black people, and Spain in life. Dao makes me feel like a soulful person. He seems to be writing from the bottom of this heart (rather than most of the pop artists' above this pages). He writes as a more experienced person than this papers. There seems to be a lot of Spain, sadness and depression in the place the writes. I don't believe this is a sign. But this section of this writing has touched the hearts of many. Writing seems to be a non-fiction, human story. Everything is there, everything is revealed. The music there has the last taste of being sad, and even more so (almost) in the hope of iTunes. From a musical point of view, this is both good and bad - most of the songs there are not very similar to the rhythm and emotional content. Dido sings in a soft voice with a limited range of sounds. In music, a little resistance will help. But what is there, if it suits you, convey it to your heart.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"They work patiently to overcome difficulties, perhaps dealing with black people, and Spain in real life. Gurdjieff, a mysterious Russian soldier, said that humans are born with souls. Most human souls are not important, and those who grow up have souls! But what is there, if it suits you, pass it on to your heart. From a musical point of view, this is both good and bad — many of the songs there make little difference in rhythm and emotional content. There seems to be a lot of Spain, sadness and depression in the place the writes. The music there has the last taste of being sad, and even more so (almost) in the hope of iTunes. Writing seems to be a non-fiction, human story.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"I bought four hundred and eleven and I really loved it. However there were a few albums before SHARE MY WORLD AND MARY I did not purchase. I was't really feeling them. This is a dynamic cd from beginning to send. All that I can say*,Sexy,Deep Inside***,Beautiful One*** should be enough to get you hooked. Mary has definitely matured as an artist. This cd is memorable and she takes you on a journey.\"Your Child\" is a true but sad statement of what's going on in lives. \"Give me you** a gem of a song. This cd goes through a myriad of emotions she was going through and the follow up \"No more Drama is evident she was making her peace. Find strength in your moments of weakness. Deep Inside I wish everyone could listen to Rascal Flatts's I'M MOVING ON.***God Bless you Mary, Keep your head up","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"As a singer, Mary has grown up. \"Your baby\" is true but sadly something is happening in life. \"Give me a ** song gem\"","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"I bought a four hundred and eleven and I really like it. But before I SHARED MY COUNTRY WITH MARY, there were a few albums I than’t bought. I did not hear them. This is a CD that changes from start to finish. All I can say is *, sexy, deep in my heart ***, beautiful people *** should be enough to accompany you. As an artist, Mary has grown up. This CD is unforgettable and takes you on a journey. \"Your Child\" is a true but sad story of what happened in life. \"Give me a collection of songs. This CD has received countless emotions and follow-ups.\" No more drama. Clearly, she is calming him. Gain strength when you are weak. Down below, I hope everyone hears Rascal Flatts ’GO. of things in life. \"Inside ***, Beautiful *** should be enough to attract your attention\" \"God bless you, Mary, look up, look up\"","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"I can only say *, sexy, deep in the ***, the *** good should be enough to make you hook. \"I gave you a ** song. God bless you Mary, keep your mind. This CD has gained countless emotions and its following.\" There is no longer any drama that seems to make peace. \"Your baby\" is true but sadly something is happening in life. I bought four hundred and eleven and I really like it. This is a CD that changes from start to finish.","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"I was a little bit sceptical before buying this cd last week. I was't too much of a fan of 'Sugar' which was a big hit a couple years ago, so I at first dismissed System as another [. ] MTV band. Hearing 'Chop Suey!' on the radio over the summer gave me second thoughts. I'm going to give the first cd a well-deserved second chance now. I bought the cd, put it in, then 'Prison Song' hit right away. The opener is probably one of the best, if not the best song on the cd. It's a very hard, upbeat song dealing with the drug war and prison systems. This cd has its fast parts (Prison Song, Deer Dance, X), its slow parts (Chop Suey! ATWA, Aerials), and its weird and kooky parts (Bounce, Shimmy, Psycho) that made them what they were before, and made the fast faster, the slow slower, and the kooky kookier. They experiment a lot of different time signatures and tempo changes, as well as using different levels of guitar distortion. From heavy distortion to clean electric, to acoustic. Serj Tankian switches this vocal setting many times during the cd. often many times during one song. From crooning, to screaming, to singing very very quick (first couple verses of 'Prison Song', chorus of 'Psycho'. He's also penned some very good lyrics which have some truth behind them and are fun to using along with. About every instrument is noteworthy from Daron's guitar, and Shavo's bass, to John's hard and fast drumming. The use of keyboards is also evident on a couple songs ('Chop Suey!', 'Aerials'). The bonus disc includes footage from live shows and backstage. Also a \"Making Of\" feature with more behind the scenes stuff. This is a very diverse cd full of lots of different sounds and tempos. It's refreshing in this sad \"verse, chorus, verse\" to have some different stuff. I'd recommend this to just about anyone who is looking for a break from wrap metal and manufactured \"nu-metal\".","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"cd might be one of the best songs on CD, if not the best. very reliable including the fight against drugs and the Prison System. The bonus CD includes continuous play and after-play games.","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"Before I bought this CD last week, I was sceptical. I did’t like the “Sugar” that was so popular a few years ago, so at first I took the Program as another [.] MTV team. Hearing the words “Cp!” radio like that made me think again. Now I want to give the first CD the second chance I deserved. I bought a CD, put it on, and the \"Prison Song\" immediately became popular. If it in't the best song on CD, the resolution might be one of the best. This is a very difficult and hopeful song about the war on drugs and the prison system. This CD has quick members (Prison Song, Deer Dance, X), slow venues (Variety! Fast, slow, and even more unusual. Serj Tankian changed the sound system several times during the CD. It appears several times in the song. He has also written some very interesting, authentic lyrics behind it, and it is interesting to almost every instrument to note, from Daron's guitar and Shavo bass, to John's heavy and fast songs. The use of the keyboard is evident in many songs (\"Chop Suey! \",\" Aerials \") The bonus CD includes live performance and backstage. There is also a \"production\" work with background lyrics. This is a different CD, full of different sounds and rhythms. In this poem, in the \"Chorus, Poetry\", there are different things. Best CD on CD From Dalong's Guitar, Shavor's Bass to John's Drums, all the instruments are worth mentioning Wu","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"For their third album, The Fifth Dimension made a bit of a departure from their previous two \"conceptional pop\" albums, having more of a commercial feel to it. The album spawned the hit singles \"Sweet Blindness\", \"California Soul\" and \"Stoned Soul Picnic\" and also features many other fine moments. Most notable of the album tracks is \"The Sailboat Song\" which is beautiful in it's simplicity. The flow of the chord changes and vocal harmony add for a definite \"take you away\" feel. This song is probably one of my favourites right up there with \"Never Gonna Be The Same\" from 'Up Up And Away' and \"The Magic Garden\" from 'The Magic Garden'. Other notable mentions are the ballads \"Broken Wing Bird\", and \"Bobbie's Blues\"; the funky \"Lovin' Stew\", and Billy's triumphant \"It'll Never Be The Same Again\".","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"Fifth Dimension is different from their previous albums of \"pop idea\" and has a more commercial atmosphere. The album spawned the popular singles \"Sweet Sweet\", \"The Soul of California\" and \"Picnic of the Stone Soul\", among many other sweet moments.","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"Some notable ballads are \"Broken Wing Bird\" and \"Bobbie's Blues\"; the fashion is \"Lovin 'Stew\", and Billy prides himself on \"Never Again\". The album featured the hit songs \"Blind Blind\", \"California Soul\" and \"Stoneed Soul Picnic\", as well as other fun moments. This song could be one of my favourite songs, including \"Never Be the Same\" in \"Up Up And Away\" and \"The Magic Garden\" in \"The Magic Garden\". On their third album, Fifth Dimension is different from their previous “pop” albums and more commercials. The best way to catch the eye is the album \"Sailboat Song\", which is simple and beautiful. The movement of the chord changes and the harmony of the voice adds a clear sense of “take”.","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"Three albums Fifth Dimension is different from their previous two albums \"concept pop\" and are for sale more. The album spawned the popular songs \"Sweet Sweet\", \"The Soul of California\" and \"Picnic of the Stone Soul\", and other sweet moments. The best way to catch the eye is the album \"Sailboat Song\", which is simple and beautiful. The movement of the chord changes and the harmony of the voice adds a clear sense of “take”. This song could be one of my favourite songs, including \"Never Be the Same\" in \"Up Up And Away\" and \"The Magic Garden\" in \"The Magic Garden\". Some of the highlights are the mythical songs \"Broken Bird\" and \"Bobbie's Blues\"; the fashion \"Lovin 'Stew\", and the proud Billy \"Never Again\".","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"When Eminem first arrived on the scene, I, like many, did't take him seriously. When I first heard \"My Name Is\", I thought that Vanilla Ice had been resurrected, but that was far from the truth. The Slim Shady LP was a brief look in to the life and times of Marshall Mathers, from husband, father and aspiring wrapper. Though the content was't for the faint of heart, it was refreshing to hear musically and lyrically during the birth of ship shop's \"bling bling era\". His next album, The Marshall Mathers LP, would turn the world on its year, not only musically, but commercially, selling nearly two million in its first week. This is easily Dr. Dre's best production work since Snoop Dogg's undeniable classic, Doggystyle. If you did't like what Em had to say on this first album, stop reading now. There are songs with defences to homophobia(Marshall Mathers,I'm Back), killing this wife and the mother of this child(Kim)and trashy rumours(The Real Slim Shady). Some of pop's music's top dogs get trashed on I'm Back and The Real Slim Shady. There are some standout songs though, like Remember Me with Sticky Fingaz and RBX, Bitch Please II with Dr. Dre, Snoop Dogg,Xzibit and Nate Dogg, and of course, Stan, about a deranged fan who takes this obsession with Slim over the edge. Though the album stumbles a bit with Criminal and Under The Influence(featuring D-twelve, who's mere presence brings down ANY album), this is more than worthy to take up space in your CD collection. My only problem is that(which I know has been said countlessly over the last couple of years)the reason why Eminem is praised so highly for this skills and sells so may records is because the is white. I know that the has had to prove himself twice as hard to get respect, but the has reaped twice the credit, which is unfair to all the great black lyricists that have come before him and influenced him(Big Daddy Kane, Rakim, KRS-ONE, twoPac, The Notorious B. I. G, Kool G. Rap) and the great jones out know(Mos Def, Talib Kweli, Black Thought, Xzibit, Ras Kass, Nas, Jay-Z, Method Man, Redman, Keith Murray, Outkast, etc). It's hilarious to me to hear white rock and pop fans that proclaim this as the greatest wrap album of all time, yet know jack about the music; if they than't already known, ship shop had been around for twenty years before Eminem arrived on the scene; go do your homework.","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"This is simply a great job by Dr. Some of the best in popular music have been slandered in \"I'm Back\" and \"The Real Slim Shady\". This album has offended \"Criminal\" and \"Under The Impluence\".","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"I know the has to work hard to be respected, but the gets double the respect, which is bad for all the black artists who preceded and influenced him (Big Daddy Kane, Rakim, KRS-ONE, TwoPac, The Notorious BI G, Kool G. Rap) and big jones (Mos Def, Talib True, Black Thought, Xzibit, Ras Kass, Nas, Jay-Z, Method people, Redman, Keith Murray, Outkast, etc.). But there are also some great songs, such as You Remember Me with Sticky Fingaz and RBX, Bitch Please II and Dr. Fat Slim. His next album, Marshall Mathers LP, will change the world this year, not only in music, but also in the industry, selling nearly two million copies in the first week. When Eminem first arrived on the scene, I, like most people, did not take her seriously. It’s interesting to hear white stone fans and popes say it’s the biggest album never, but it’s interesting to know Jack through music; if they did not know, the ship's shop existed for twenty years before Eminem appeared. and do your homework. Some of the songs have a protective effect on homophobia (Marshall Mathers, I'm back), killing the woman and the baby's mother (Kim) and trivial rumours (The Real Slim Shady). Although this album has stumbling blocks to \"Criminal\" and \"Under The Impluence\" (featuring D-twelve, this appearance eliminates any album), it does deserve to have a place in your CD collection.","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"In A. B. Spellman's excellent liner notes to the original alp release of this remarkable session the observed, \"It is not intended that 'Ascension' will be background music for polite dinner conversation.\" The uninitiated listener who comes to \"Ascension\" should be forewarned by this words. Above all, \"Ascension\" demands concentrated listening. Spellman further commented that the session begins at an extraordinarily high level of intensity, rather than building to a speak as most other jazz for rock recordings do. In fact, the record begins with a simple motif sketched by Coltrane, followed by an extended and sustained blast of sound from the six other horns, two basses, and drums. (Don't look for much from pianist McCoy Tyner -- except during the solos -- as the has little chance to be heard through the onslaught.)The amazing thing about \"Ascension,\" for me, is that during the stretches of seemingly unstructured, free playing so much drama is generated. To be sure, it is not the conventional drama of the classically constructed jazz solo, with its rise and fall of tension and perfectly created marc and climax. Rather, this is the drama parallel to that produced from the chaos and clamour of modern life. One of the mental pictures that emerged for me in my early listening to the album was of the streets of a giant urban center, a jumble of sounds from which emerged recognizable human voices. These vast aural canvases are also dotted with more conventional solos from Coltrane and the other musicians (notably Freddie Hubbard, Archie Shepp, John Tchicai, and Pharaoh Sanders), although all of these artists push the boundaries of sound in their solos as well. Each has marvellous moments, from Hubbard's soaring trumpet line to Sanders' eruptions in the upper register of this horn to Tchicai's lithe alto dancing against a figure by Tyner, to Coltrane's own powerful cry.\"Ascension\" is a hard album to write about. It is best experienced as an immersion in sound. As Spellman said in speaking of each of the musicians, \"Give them a hearing. Give them a few.\" Same can be said about the record itself.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"\"Climbing\" begins with a simple theme described by Coltrane. In an seemingly unplanned expansion program, the free game produced a lot of drama. \"Ascension\" is an album that is hard to write; the best time is to dive into the sound.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"Considering AB Spellman's outstanding notes in the alp version of this extraordinary meeting, \"'Ascension' is not meant to be the background music for dinner.\" This sentence should warn those who come to the Audience in \"Ascension\". Most importantly, “escalation” requires targeted listening. Spellman also noted that the depth at the beginning of the meeting was much higher, than they started to talk like many other jazz rock albums. In fact, the record began with a simple theme described by Coltrane, followed by a continuous sound and a roar from the other six horns, two buses and drums. (Don't look too much at pianist McCoy Tyner — except when you're alone — because there's no chance of hearing about the violence.) To me, the amazing thing about \"Ascension\" is that it looks so unstoppable and relaxed. the play produced a lot of drama. Of course, this is not a Jazz solo drama. Their pressure rises beautifully, perfectly creating the climax and the climax. On the contrary, it is a theatrical representation of the drama produced by the chaos and hustle and bustle of modern life. As I listened to this album from ancient times, one of the images that came to my mind was the main street in the center of the city, where the voices of people were visible in the sounds of chaos. These great hearing aids also feature dots of other Coltrane traditional dances and other musicians (especially Freddie Hubbard, Archie Shepp, John Tchicai, and Pharaoh Sanders), though all of these artists have pushed the boundaries of sound into their scenes. There are great moments for everyone, from Hubbard's high-pitched line to Sanders' high-profile explosion at the highest point in the province, to the wizard's cool midrange dancing with Tyner characters, to Ke Chuan's powerful Shout. \"Ascension\" is a difficult album to record. The best experience is immersion in sound. As Spelman said of each singer, \"Give them a chance to listen. Give them some.\" The same is true of the record itself.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"These great masterpieces also feature traditional solos from Coltrane and other musicians (especially Freddie Hubbard, Archie Shepp, John Tchicai and Pharaoh Sanders), though all of these artists pierce the voice in their solo. Moreover, the record began with a simple theme described by Coltrane, followed by a continuous sound with six horns, two buses, and a drum. ) For me, the amazing thing about \"Ascension\" is that there is a lot of drama in a free game that seems unresolved. There are amazing moments for everyone, from Hubbard's long trumpet blast to Sanders' explosion on the top list of the province, to the soft midrange wizard dancing with Tyner's characters, to Coltrane's own Strong Cry. Certainly, it is not a traditional jazz game. Its pressure goes up and down, creating a climax and a perfect climax. B. Spellman published the class's excellent notes on the original alp version of this extraordinary meeting, noting that \"the 'Ascension' was not intended to be the backbone of a solemn dinner.\" When I listened to this album for the first few days, it came. in my mind One of the images is a main street in the center of the city, where the understandable voices of the people emanate from confused sounds.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Busta Rhymes in ninety-eight came out with what i felt was the most creative album of this career ELE is back with another slamming CD while Anarchy may not be as innovative as ELE was this CD still is blazing. Busta's flows are tight as never. Production is on point with long time producer DJ. Scratch who has been down since Busta's solo debut The Coming. DJ Scratch deliver such banners on Busta's new CD Salute Da Goods, We Comin Through which the takes a page out of Swizz Beatz book of beats . This track sounds like something Swizz Beatz would have done . One of the best cuts on the album . Producer Jay Dee brings a raw banging sound to tracks Enjoy Da Ride, Live It Up, Show Me What You Got For Me all these tracks mention are hot . The best cut on the album clearly is The Heist featuring Raekwon, Ghostface Killa, Flip Mode's newest member Roc-Marciano this track is worth the price of CD alone the song depict jewerly robbery gone bad. Other noteworthy cuts; Make Noise featuring Lenny Kravitz, Why We Die featuring DMX &Jay-Z, Get Out, How Much We Grew this song depict the beginning of Busta Rhymes all the people that have been down with him from the beginning people that made it happen for him . This CD is hot and belongs in all true ship head collection Pick it up you wont regret it .","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"ninety-eight-year-old Busta Rhymes has released a record that I think is the best at this work. ELE is back with another great CD. Produced with long-time DJ. The weapon has been under luck since Busta first came on the scene. The best clip on the album is clearly The Heist featuring Raekwon, Ghostface Killa, the newest Flip Mode member Roc-Marciano. This song is worth the money. I think this is the best album in the industry. Although Anarchy may not be as new as ELE, this CD is still very popular. Busta's traffic is congested. Producer Jay Dee introduced the first pop sound to the songs \"Enjoy Da Ride\", \"Live It Up\", and \"Show Me What You Found\".","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Some notable cuts; Make a noise with Lenny Kravitz as the protagonist, Why We Die, DMX and Jay-Z as the lead, Exit, How much of this song we show Busta Rhymes in the beginning, all the people who were disappointed in him from the beginning were born for him. The best album is The Heist, which includes Raekwon, Ghostface Killa, and the newest Flip Mode member, Roc-Marciano. This playlist values ​​the value of a CD. bad. Producer Jay Dee introduced original bangs on \"Enjoy Da Ride\", \"Live It Up\", \"Show Me What You Have For Me\" and other songs, all of which are very popular. DJ Scratch sent this banner to Busta's new CD Salute Da Goods, and we used it to take a paper from Swizz Beatz's hit book. Busta Rhymes released what I think is the most artistic record of this work in one thousand, nine hundred and ninety-eight. ELE has released another exciting CD, and Chaos may not be as new as ELE, because this CD is still very popular. This CD is very popular and belongs to all the real bow collection. Lift it up and you won’t regret it. Busta's journey is stronger than never.","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Busta Rhymes released in one thousand, nine hundred and ninety-eight I think is the most talented album in the industry. ELE has released another great CD, and Anarchy may not be as innovative as ELE, but this CD is still very popular. it has never been more ruthless than never. Produced with long-time DJ. The scratch has been in bad shape never since Busta was introduced by The Coming. DJ Scratch sent this banner to Busta's new CD Salute Da Goods, and we used it to take a paper from Swizz Beatz's hit book. This song sounds like Swizz Beatz was going to do it. One of the best clips on the album. Producer Jay Dee introduced the original bangs \"Enjoy Da Ride\", \"Live It Up\", \"Show Me What You Found\" and other songs, all of which are mentioned very popular. The best album is The Heist, which includes Raekwon, Ghostface Killa, and the newest Flip Mode member, Roc-Marciano. This playlist values ​​the value of a CD. bad. Another important tradition; Make a noise using Lenny Kravitz as the lead character, Why We Die, DMX and Jay-Z as the lead, Exit, How Much This song marks the beginning of the Busta Rhymes, from the beginning people were disappointed they were all born for him. This CD is very popular and belongs to all the bow collections. You will not regret picking it up.","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Antonio Carlos Jobim's Finest Hour is an excellent collection of jazz bossanova recordings by one of the leaders of the bossanova sound. Jobim's solo and accompaniment with vocalist Astrud Gilberto and legendary saxophonist, Stan Getz, offers a melodic and sensuous effect to this flush Brazilian sound. The cd's crispness makes the recordings timeless, but not without a thought of one thousand, nine hundred and sixty cocktail sounding nostalgia (dependent on your page, these are itunes you heard your father play on the good vol' chi-fi system). The songs make you imagine you're on a beach with the palm trees gently swaying back and forth, for simply lounging on the patio listening to tracks, such as the all too familiar, \"The Girl From Impanema,\" my favourite version of \"Meditation,\" for the delicious hipster trappings of \"Desfinado\" with Getz's exceptional sax solo. Finest Hour will not disappoint those listeners looking for the quiet jazz sounds that whisper in your year for simply let you relax. So, grab yourself a copy, and while you're at it, mix a cocktail for two and add one of those little umbrellas.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Alexander Carlos Jobim \"The Best Time\" (Best Time) by Jazz Bossano produced by one of the leaders of the Word of Bossnova A large collection of Watt Records. Jobim’s solo and accompaniment with singer Astrud Gilberto and the famous saxophone player Stan Getz brought a sense of song and feel to this brilliant Brazilian sound. The ingenuity of the CD makes the recording last, but it's no surprise that one, nine hundred and sixty cocktails sound unhealthy (depending on your page, these are the iTunes you hear your dad playing on a good chi-fi-chi program). These songs make you think you're on the beach with palm trees swaying from side to side, just flying on the ground listening to popular songs, such as \"Girl from Impanema\", my favourite type of meditation \", enjoy the Getz saxophone. Desfinado\" is fun and fashionable . A Good Hour will not disappoint those looking for a quiet coat, working in the middle of the year to relax. So, get yourself some food and while you're at it, mix two cocktails and add a small umbrella. the idea of ​​a cocktail that sounds like nothing. An impanema from a girl is my favourite version of \"meditation\", because the fun and fashionable elements of \"Desfinado\" complement the perfect solo saxophone. CD dripping makes recording permanent, but it is not expected that one, nine hundred and sixty cocktails will sound unmistakable (depending on your page, these are the iTunes you hear your dad playing in a good chi-fi-chi program). So, get the service, and while you do, mix the two cocktails and add a little umbrella. Alone Job and accompanied by singer Astrud Gilberto and the famous saxophone player Stan Getz brought a sense of melody and emotion to this brilliant Brazilian sound. Antonio Carlos Jobim's \"Best Hour\" (Best Hour) is an outstanding collection of Jazz Bossa Nova Records, leader of the Voice of Bossa Nova. Finest Hour will not disappoint audiences looking for quiet jazz, whispered in the middle of your year to entertain you.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Antonio Carlos Jobim \"Hour in the Finest\" (Hour in the Finest), one of the leaders of the voice of Bossa Nova, was written by Jazz Bossa Nova Records. The crispness of the CD makes the recording permanent, but it is not expected that the one, nine hundred and sixty cocktails sound like nostalgic.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"The Best Time Antonio Carlos Jobim is a great collection of bossanova jazz recordings of one of the bossanova voice leaders. Soloim of Jobim and partner of vocalist Astrud Gilberto and legendary saxophonist Stan Getz, provide a rhythm and emotional impact to this voice in Brazil. The hardness of the CD makes recording timeless, but not without thinking of a thousand, nine hundred and sixty cumulative sounds of nostalgia (depending on your page, these are the iTunes you heard from your father playing in the beautiful ‘chi-fi system). The songs make you think you’re on a beach with palm trees gently swaying back and forth, to sleep in the courtyard listening to clues, like the well-known, “The Girl From Impanema,” the my favourite genre. “Meditation,” in the sweet hipster strap “Desfinado” with Getz’s unique solo rights. Best Time won’t stop listeners looking for the quiet jazz sounds of your year to easily relax you. Then, get a copy of yourself, and while you’re there, combine the two cocktails and add one of these little umbrellas.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is the best and my favourite R. Kelly's album. Nuff said.","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is the best album and the best album of R. My dear Kelly. Said Naf.","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is my best and most favourite","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is the best album and my favourite by R. Kelly.","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Who could forget the summer of ninety-five, when Hootie & The Blowfish's songs were on every station every three seconds?:) As the years have gone by, my musical taste has changed, and I'm not too into Hootie's style of music anymore- I'm mainly into heavy stuff like KoRn and Metallica. But I just recently heard news of Darius Rucker's solo album, and knowing the always had an excellent voice, so I decided to download a few songs. I'm not too into R&B, but the is GOOD! I can't get enough of \"Wild One\". Yea i know, it's not at all cool to like Hootie anymore, but any R&B song that catches the eye of a KoRn fan is definitely worth checking out. I'd actually like to hear him do an R&B version of \"Let Her Cry\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Who can forget that in the summer of one thousand, nine hundred and ninety-five, Hootie and Blowfish songs will be played on a radio station every three seconds? :) Over the years, my love of music has changed, I no longer like Hootie's music - I love hard music like KoRn and Metallica. But I only heard about Darius Rucker's solo album recently, and knowing that this voice was always good, I decided to download some songs. I don't really like R&B, but it's great! I'm tired of \"Wild\". Yes, I know, it’s not cool to stop loving Hootie, but any R&B song that appeals to KoRn fans is definitely worth a try. I really want to hear him do an R&B version of \"Let Him Cry\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Who can forget the ninety-fifth summer, when Hootie and The Blowfish songs were on every channel every three seconds? :) Over the years, my love of music has changed, and I no longer follow Hootie's style of music - I'm surrounded by things like KoRn and Metallica. But I just heard about Derris Ricker's solo album, and knowing that it sounds great, so I decided to download a few songs. I don't know much about R&B, but it's good! I can't find enough \"in the weld\". Yeah Al that sounds pretty crap to me, Looks like Hootie saint for me either. I would love to hear him do the R&B show \"Let Him Cry\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Who can forget summer ninety-five, when Hootie & The Blowfish songs were on the station every three seconds? I also did’t get into the Hootie style of music- I’m mostly into heavy stuff like KoRn and Metallica. But recently I heard news about Darius Rucker’s single door, knowing that the always has a very good voice, so I decided to download a few songs. I don’t have R&B, but it’s BEAUTIFUL! I can’t be bothered with “Wild One”. Yeah I know, it’s really not good to love Hootie, but any R&B song that attracts a KoRn fan is definitely worth a look. I wanted to hear that the performed an R&B version of “Let It Cry”.","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"Who cares it's the rhcps , strong album i can listen to it anytime.","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"Who cares if it is a rhcps >","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"Who cares if they are rhcps, I can listen to a powerful album at any time.","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"The rhcps compound is very powerful, I can listen to it anytime","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Wow!! That is what you will say after listening to this for the first time. Balligomingo is the brainchild of basically one man, named Garrett Schwarz. The music facts like a tornado as it pulls the listener into its funnel of sound. This is one hell of a great debut. The singers are a little pop sounding at times, but the music is the star, and the singing is just the background. Let me tell you my five favourites of this magnificent album. one)\"Beyond\". Incredible. Be prepared to be blown over by this one. two)\"Sweet Allure\". Another spellbounder. The beats and rhythms come from all areas, and is just awesome. three)\"Heat\". Garrett needs to release this one, this is a hit begging to be a smash. four)\"Marooned\". The music shimmers on this one, and is reminiscent of Enigma's sound with its own uniqueness. And the singing on this is perfect. five)\"Lust\". The title of this one says it all about what you will feel after listening to it. After reading this please go buy it, we all need to do what we can to keep the talented Garrett Schwarz making more of this great music. And hurry up, Garrett, I am wearing this CD out.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Wow! ! You will say this after listening to it for the first time. Balligomingo is the foundation of a man named Garrett Schwarz. Music is like a hurricane, which draws the audience to the sound. This is a great start. Singers sometimes sound like they are popular, but music is a star, and singing is the only source. Let me tell you five of my favourite songs about this beautiful album. A) \"Beyond\". very nice. Be prepared to be beaten down by this. B) \"The sweet temptation\". Another spelling. Rhythms and rhythms come from a variety of, beautiful aspects. Three) \"Hot\". Garrett needs to let go of this, it's a plague that begs to be crushed. Fourth) \"Alone and helpless\". The music is vibrant in this song, reminding us of Enigma's special sound. And the singing of this song is perfect. five) \"Desire\". This article explains how you feel after listening. Please buy it after reading it We all need to do your best to allow the talented Garrett Schwarz to continue making more fun music. Hurry up, Garrett, I want to get this CD out.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Oops !! This is what you will say after hearing it for the first time. Baligomingo is a concept of a man named Garrett Schwarz. The realities of music are like a storm because it draws the listener to its sound. It's a hell of a big debut. Singers sometimes have a little pop noise, but music is a star, and the song is very modern. Let me tell you about my five favourite songs from this wonderful album. A) \"Outside\". Be incredibly prepared for it. Two) \"Sweet desire\". Another magician. Rhythm and rhythm come from all sides, and they are so beautiful. Three) \"heat\". Garrett needs to release it, it's a song that is about to break. Four) \"Marund\". The music shines on it, and its diversity is reminiscent of Enigma's voice. And the song is the best. Five) \"lust\". The title of this post says it all. After reading this, please buy it, we all need the talented Garrett Schwartz to do whatever the can to do more with this great music. And hurry up, Garrett, I'm wearing this CD.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Wow !! That’s what you say when you listen to it for the first time. Balligomingo is a creative one-man initiative, named after Garrett Schwarz. The facts in music are like a storm when it pulls the listener to the rhythm of the sound. It was a hell first. The singers are sometimes a bit pop, but the music is the star, and the songs are original. Let me tell you my five favourite good album albums. middle) \"More\". Amazing. Be prepared to blow this one up. two) \"Sweet dessert\". Another quote. The beats and rhythm came from all directions, and it was surprising. three) \"Heat\". Garrett had to let go of it, it was a beating begging to be destructive. far) \"Marooned\". The music shines on this one, and it reminds me of Enigma’s voice that has its own uniqueness. And the songs about it are perfect. five) \"Lust\". The title of this one tells you all about how you feel after listening. After reading this please go and buy it, we all need to do your best to maintain Garrett Schwarz’s ability to continue to make this beautiful music. And soon, Garrett, I closed this CD.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"I thoroughly enjoyed the CD \"Floetic\" by Floetry. The CD is filled with songs that touch the deepest part of your soul. Floetry truly captures the essence of any and every emotion you have felt in their music. The song \"Floetic\" allows you to groove to the ladies' voices as well as the terrific beat and melody. \"Say Yes\" exudes so much sensuality and desire that you immediately want to pull your significant other closer. I really loved the fact that the demo version of \"Butterflies\" was a bonus track. I have loved this song never since Michael Jackson released it on this \"Invincible\" album, so it was a real treat to hear a different take on the song. I did't think I could like the song any more than I already did, but hearing it from a woman's perspective was cool. Stand-out tracks:FloeticSay YesButterflies (Demo Version)Now You're GoneI would highly recommend this CD to a music lover who would like to hear something a little different, a little refreshing, and very interesting! You won't be disappointed!!!!","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"Floetry captures the essence of any emotion you feel in their music. \"Floetic\" allows you to listen to women's voices and beautiful songs and music. \"Say yes\" signifies sex and desire, soon you will want to draw your most important one.","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"Ever since Michael Jackson released this song from the album \"You Can't Defeat\", I've never liked this song again, so it's great to hear different opinions about this song. Highlighted song: FloeticSay Yes Butterflies (Demo Version) Now You're Gone I strongly recommend this CD to music lovers who like to listen to something different, refreshing, and very interesting! The song \"Floetic\" allows you to enter the game with the voices of ladies and sweet beats and music. \"Yes yeah\" exclaims sex and with great desire, you will immediately want to draw some of your most important jones. I don’t think I’d love this song more than I do now, but it’s cool to listen to it from a women’s perspective. I really like that the demo version of \"Butterfly\" is an additional song. I really like Floetry's CD \"Floetic\" very much.","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"I love Floetry's \"Floetic\" CD so much. The CD is full of songs that touch the deepest parts of your soul. Floetry really captures what you feel most about their music. The song \"Floetic\" allows you to follow the voice of ladies with beautiful songs and music. \"Yes yeah\" exclaims sex and with great desire, you will immediately want to draw some of your most important jones. I really like that the demo version of \"Butterfly\" is an additional song. Since Michael Jackson released this song from the album \"It Will Never Be Defeated\", I never liked this song again, so it's very exciting to hear different opinions about this song. I don't think I would like this song more than I do, but it's cool to listen to from a women's point of view. Highlights: FloeticSay Yes Butterflies (Demo version) Now gone I highly recommend this CD to music lovers who like to listen to something different, refreshing, and very interesting! You will not be disappointed! ! ! !","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"Two superbly crafted pop songs seduce us into Arthur's third album. Deeply introspective, often perplexed, Arthur sings to save himself, though the rewards are karen't necessarily a renewal of energy. He rarely shakes free of a fog of resignation. This makes the more exuberant,'Let's Embrace','In the Night', for 'Permission' less convincing, an impression overscored by the inappropriateness of the Gabriel signature sound. For the most part though(and this is a long CD), the production palette is not excessively lavish. 'Termite's Song's' moog & dulcimer mantra recalls the innocence of the Donovan who gave us Songs For Children; fragile, nacrescent as the inside of an abalone shell, held to the year. By far the better part of the album is a genuine treasure. Those enticed by this work may wish to investigate Melbourne's, David Bridie whose ,'Act Of Free Choice' runs in parallel to Arthur's palette.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"Two great pop songs draw us to Arthur's third album. The spell of the \"Song of the Ants\" moog & dulcimer reminds me of Donovan's innocence.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"This makes \"Welcome\" and \"Night\" happier, because \"Permission\" is less pleasing, and the inadequacy of Gabriel's visual stone makes this picture more appealing. The spelling \"Song of the Ants\" moog & dulcimer reminds us of Donovan's innocence. He has given us children's songs; fragile, reborn as an abalone shell, which can be stored for years. Those interested in the project may wish to investigate David Bridy in Melbourne, whose \"free behavior\" is in line with Arthur's palette. Arthur thought deeply and was always confused. However, in most cases (this is a long CD), the product palette is not uncommon. Two well-crafted pop songs draw us to Arthur's third album. So far, much of the content of the disc is a real treasure.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"Two well-done pop songs drew us to Arthur's third album. Arthur thought deeply and was always confused. He rarely parted from the fog of retreat. This makes \"Let's Go\" and \"Night\" even happier, because \"Permission\" is less convincing, and the inadequacies of Gabriel's voice with the image make the picture more visible. However, in most cases (this is a long CD), the product palette is not very good. The spell of the \"Song of the Termite\" moog & dulcimer reminds us of Donovan's innocence. So far, much of the album's content is a real treasure. Those interested in the project may want to investigate David Bridy in Melbourne, this \"free behavior\" that goes hand in hand with Arthur's palette.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"For all Flip it is game over. Because cd sucks. One good songs out of two discs. That is bad. two out of five","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"A good song on two discs. Because the CD is hard. For all the flips, the game is over. That's not right. Second-fifth","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"In all the flips, the game is over. A good song on two discs","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"For all the flips, the game is over. Because the CD is hard. Good song on two discs. That's not right. Two-fifth","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"i like this crew but the disc is lacking.peep afroman and wrap with a live funk band. prepping the streetteam","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"Mike fell down: I love this group, but the CD is gone. bottom: I like this band, but the record","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"I like this band, but I don't have a record, I think","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"I like the staff, but the CD is missing. Take the peek out of the afroman and wrap it with a living funk ribbon. For a street party","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"This guy Sasha is definitely evolved--to an artistic levelhigher than most human beings. How I would've love love loved this heavenly CD. IF it hadbeen vocal-free. but that's my bias. If you don't mindvocals in your electronica, this CD is really reallyoutstanding & serene & ecstatic. ahead of its time. I wish they'd release a vocal-free version of Involver. Also, I must agree with other reviews that trash the\"special packaging\" edition. (. ) Avoid that mess and get this CD in the regularcase. I wish I had.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"If you have no problem with electronic music lyrics, this CD is really good.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"This guy Sasha has definitely changed - the reached a higher level of part than most people. I will love this heavenly CD so much. If it does not have a human voice. But this is my prejudice. If you don't mind songs in electronic music, this CD is great, peaceful and fun. Before the times. I hope they can release a quiet version of Involver. In addition, I will have to agree with some of the comments, \"special packaging\" version. (.) Avoid this confusion and get this CD under normal circumstances. I hope I have.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Ivy have always been one of those cool New York bands that have been around a while. Ivy have joined Luna and Blonde Redhead as the elder statesmen in the New York Pantheon. They combine French cool with flush vocals and memorable songs. I have heard many of their songs in commercials. Much of their music was used in the film Shallow Hal, and TV programs like Roswell and Kingdom Hospital. It's because the music of Ivy has that otherworldly feeling of some of the shoegazer bands that inspired them at first. Now they have been on the own for ten years for more, and have hooked up with producer Steve Osborne. The results are terrific. Whether it's the longing of \"Thinking About You\" for the quiet mood of \"Four In The Morning.\" Even fellow NYC scenesters James Iha (Smashing Pumpkins) and Scott McLoud (Girls Against Boys) show up on this CD. The song \"Feel So Free\" gives us the powerful music that this band has been doing for so long. They are great indeed. Fashion comes and goes. Ivy is a band that will be remembered.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Ivy is one of the coolest bands in New York. They combine French cooling with beautiful singing and memorable songs. Most of their music is used in the movie \"Shallow Hal\" and on TV programs.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Whether it's the longing of \"Thinking About You\" for the quiet mood of \"Four In The Morning.\" The song \"Feel So Free\" gives us the powerful music that this band has been doing for so long. It's because the music of Ivy has that otherworldly feeling of some of the shoegazer bands that inspired them at first. Even fellow NYC scenesters James Iha (Smashing Pumpkins) and Scott McLoud (Girls Against Boys) show up on this CD. Much of their music was used in the film Shallow Hal, and TV programs like Roswell and Kingdom Hospital. They combine French cool with flush vocals and memorable songs. Ivy have always been one of those cool New York bands that have been around a while.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Is \"Thinking of You\" wishing a calm atmosphere of \"Four AM\". The song \"Feel So Free\" has given us powerful music performed by the band for a long time. It is because Ivy's music has a foreign feeling that inspires them at first. New York factors James Iha (Smashing Pumpkins) and Scott McLoud (Girls Against Boys) also appeared on the CD. Most of their music is used in the \"Shallow Hal\" movie and television programs such as \"Roswell\" and \"Kingdom Hospital\". They combine French cooling with beautiful singing and memorable songs. Ivy has always been one of the coolest bands in New York.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"This would seem like an appropriate title for a Malkmus album. I've learned, throughout the years, never to listen to an artist like Malkmus one time and provide a review of that album. You must do an album justice. This is my current favourite solo Stephen. It's jagged. It's raw, and yet it's very cohesive. It reminds me of Wowee Zowee in many ways. In many ways, it's all over the place with a proton and a newton holding it all together. Pencil Rot is the jewel of the album, but Mama keeps creeping on. Kindling for the Master and No More Shoes are a couple other classics. Malkmus was once asked why the does't diversify this sound more. Well, when you're doing it this well. you have to Face the Truth. Behind Mr. Bungle and the various projects of the golden child Mike Patton, Stephen Malkmus and this former group Pavement have been making my favourite music for over a decade now.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"Can's john defterios has a new album for mallkmus. This is my only favourite album. It is said to be jagged and original, but very mixed.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"This seems like an appropriate title for a Malkmus album. I’ve learned, over the years, I’ve never listened to an artist like Malkmus once I give a review on that album. You need to make a fair album. This is my favourite now Stephen. It's a part It's raw, but it's highly coherent. It reminds me of Wowee Zowee in many ways. Kindling for the Master and No More Shoes is another great couple. Malkmus was once asked why this does’t sound different, when you do it well you have to face the truth. After Mr. Bungle and various golden baby projects Mike Patton, Stephen Malkmus and this former Pavement team have been making my favourite music for over a decade now.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"This seems to be the right title for the Malkmus album. Information about the album, Report. You should make a fair record. This is my only favourite Stephen at the moment. In many ways, on the other hand, it's everywhere, proton and Newton hold them together. Ask why you don't make this word so different, when you do it right, you have to face the truth. I've been making my favourite music for over a decade.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"Elephant is a hard act to follow. The greatest album of all time, and therein another one? Orson Welles may have had this feeling after Citizen Kane. Thomas Pynchon may have felt like this after Gravity's Rainbow. Now it's JackWhite's turn. \"Blue Orchid\" is a great single. One may notice the use ofmarimbas and more keyboards on this record. Some songs like \"My Doorbell\" recalltheir earlier album White Blood Cells: simple rock for party people. There arethrowback songs like \"Little Ghost.\" Some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\" which remind us why we liked The White Stripes ninth first place. Rita Hayworth is finally immortalized in song. The song, which is the most powerful, is \"Instinct Blues\" which is like this album's \"Balland Biscuit.\" I guess people will compare this album to Led Zeppelin III: lot of cool rocking itunes with some country rocking thrown in. But Zeppelincouldn't really achieve anything as moving as \"I'm Lonely.\" This is a personalalbum. It's pretty good. People expect a lot from this band, and they almostget it.","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"\"Blue Orchid\" is one great thing. Some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\"","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"Elephants are a difficult habit to follow. The best record of all time, is there one? After \"Citizen Kane\", Orson Wells may feel this way. After \"Gravity Rainbow\", Thomas Pynchon can feel this way. Now is Jack White's turn. \"Blue Orchid\" is another great thing. People may notice the use of many marbles and keyboards in this record. Songs like \"My Doorbell\" remind us of their debut album White Blood Cells: The Simple Rock of the Group. There are retro songs like \"Little Ghost\". Some of the most popular songs of \"The DenialTwist\" and \"Take, Take, Take\", remind us why we love White Stripes at number nine. Rita Hayworth finally dies in this song. The best song is \"Instinct Blues\", just like the album \"Balland Biscuit\". I think people will compare this album with Led Zeppelin III: iTunes of cool rock and country rock. But Zeppelin does't really realize that the movie works like \"I'm bored\". This is a personal photo album. This is awesome. People had high hopes for this group, and they almost got it.","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"What can I say that has not already been said. This is an EXCELLENT album! BUY IT!!!!!","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"Buy it! ! ! ! This is a beautiful album! ! What I say, I have not yet said.","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"This is the best album! BUY","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"I have not said what I can do yet. This is a beautiful album! Buy it! ! ! !","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Zutons are a UK quintet from Liverpool, with a rough psychedelic rock\/R&B;\/ska\/folk sound, akin to fellow Brits, The Coral, with a small dash of The Smiths. `Tired of changing around' is their sophomore disc, and it's already stopped the UK albums chart. In Smiths-like mode, lyric wise is the rather dark but upbeat `Oh Stacey (look what you've done)' with an accompanying morbid but hilarious video.`Secrets' is a swinging ska tinged song (great horns) and an insistent chorus. Retro rocker `It's the little things we do' has a great guitar riff. Title track `Tired of changing around' features great story telling, set to a Paul Weller sound, with great harmonies, something to be found throughout the album. Other great upbeat songs are the jangly, sunny `Valerie', and the clap along `Hello conscience'. Slowing things down are `Someone's watching over me'which starts off like a lullaby before building up to a nice guitar ballad with dreamy harmonies. `You've got a friend' is a catchy skiffle, and `I know I'll never leave' is an hairy ballad with a raw vocal delivery and soothing harmonies. I think they'll be changing around for a long time to come.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Zutons is a British quintet from Liverpool, with rough psychedelic rock \/ R & B; \/ ska \/ folk, similar to the British people Coral. Their second record is left on the British album chart.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"The title track \"Tired of Translation\" features an amazing story, set in the voice of Paul Weller, and the beautiful harmony, which can be found throughout the album. In a model like Smith, the song is dark but hopeful \"Oh Stacey (see what you do)\", accompanied by a pathological but humorous video. \"Secrets\" is a ska stone of stone (big horns) and a continuous chorus. Some of the most hopeful songs are the hot and sunny \"Valerie\" and the chorus accompanied by \"Hello Conscience\". “You Have a Friend” is a light dance, and “I know I will never go” is a furry ballad with original words and harmony. The Zutons are a British quintet from Liverpool, with rough psychedelic rock \/ R & B; \/ ska \/ folk, similar to the British people Coral, and a bit of Smith. \"I'm Tired of Change\" is their second record, which has set the British album charts. Rock singer \"This is the little thing we do\" guitar upgrades are good.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Zutons is a British quintet from Liverpool, enerock psychedelic rock \/ R & B; \/ ska \/ folk, similar to the British people Coral, and the little Smiths. \"I'm Tired of Change\" is their second record, which has set the British album charts. In a model similar to Smith's, the ornate songs are black but hopeful \"Oh Stacey (see what you do)\", accompanied by a disease video but funny. \"Secrets\" is a ska stone of stone (big horns) and a continuous chorus. The retro rock singer “This is the little thing we do” guitar upgrades are okay. The title track \"Tired of Change\" features an amazing story, set in the voice of Paul Weller, and the beautiful harmony, which can be found throughout the album. Some of the most hopeful songs are the hot and sunny \"Valerie\" and the chorus accompanied by \"Hello Conscience\". The slow thing is that \"Someone is watching me\", it starts to look like a lullaby, then an amazing guitar ballad with amazing harmony. “You Have a Friend” is a light dance, and “I know I will never go” is a furry ballad with original words and harmony. I think they will change in the long run.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"The Good\"It's Not Over\" is the catchy lead single that's tearing up both pop and rock radio. The hook is undeniable and Chris' vocals are full of heart and soul. Daughtry returns to the arms of this true love on the touching ballad \"Home.\" Chris puts this range to the test on the powerful chorus of \"Over You.\" Daughtry and company break out of their pop-rock comfort zone for the extra crunchy \"What I Want.\" The heavy clicks and rapid fire guitar clicks are supplied by legendary Guns and Roses taxman Slash. Chris faces breakup and heartbreak on \"Home.\" He runs a gamut of emotions there. \"There and Back Again\" is full of meaty riffs and in-your-face vocals. \"All These Lives\" is an acoustic power ballad that is sure to touch a nerve for two. The BadTo say that Chris is going it without the help of American Idol is not exactly true. Sure, the was voted off much too early, but from this management to this record label, Daughtry has the major moguls of Idol behind him all the way. Daughtry also has a lot of different professional songwriters behind him. To this credit the wrote three songs on this own. To top that off, the has some of the best producers behind him too. Now, this is not necessarily a bad thing depending on how you look at it. Sure, you're getting the best possible album that can be produced, but does it really matter who's behind the microphone? The VerdictDaughtry's debut is a well-balanced pop-rock crossover album. By that I mean this songs are edgy enough to meet the rock radio format, but they also have that smooth singer-songwriter quality that appeals to the soft rock and pop crowds.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"\"It's Not Over\" is an interesting single theme that trips apart pop and rock radio stations simultaneously. \"Where and back again\" is full of richness of refinement and a face-to-face voice. Daughtry's first album is the equivalent of a pop rock crossover.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"Good \"It's Not Over\" is an david lead artist who breaks into pop and rock radio stations. The chicken is undeniable, Chris's singing is full of heart and soul. The girl returned to the reception of this true love in the touching ballad \"Home\". Chris used this list to test the powerful song \"Over You\". The girl and the company broke into their pop comfort zone to get the extra crunch \"something I wanted.\" Heavy click and quick guitar play are provided by the mythical gun and rose tax collector Slash. Chris is dealing with separation and the heart \"at home\". There are a variety of emotions that flow through her. \"Where and Return\" is full of rich refinements and facial expressions. \"All This Is Life\" is an acoustic music song that will surely touch the nerves of two people. It’s bad to say that what Chris did without the help of American Idol is totally wrong. Yes, the ticket ended very soon, but from management to record company, Daughtry was behind him to support the big Idol tycoon. There are many different songwriters after Girl. As a result, they wrote three songs for themselves. Most importantly, there are excellent producers behind him. Now, this is not a bad thing, it depends on how you look at it. Of course, you get the best album you can make, but does it matter who is behind the microphone? VerdictDaughtry's debut album is a decent rock crossover album. I mean this song is savant-garde enough to meet the format of the radio station, but it also has the quality of an interesting songwriter who can appeal to the soft stones and pop crowds.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"Yes, it was too early to be removed, but from this administration to this recording company, Daughtry has always been supporting the great Idol tycoon. Good \"Not Finished\" is an exciting lead game that breaks up pop and rock radio stations. I mean this song is savant-garde enough to meet the format of a rock radio station, but they also have the smooth quality of a singer-songwriter who can appeal to the soft rock and pop rock. The girl returned to the reception of this true love in the touching ballad \"Home\". The girlfriend and the company broke into their pop comfort zone to further their \"what I wanted.\" \"All This Is Life\" is an acoustic music song that will surely touch the nerves of two people. \"Where and Return\" is full of rich refinements and facial expressions.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"When Lajon said in a interview awhile back that the new songs they were writing were some of the hardest stuff that they have never written, songs that make \"Enemy\" sound mellow. He was't kidding. If your a old school Sevendust fan, then this album is your album to send all Sevendust albums. This is a return to form of the in your face, trip your through your skull Sevendust. From beginning to send this album does't give up, its relentless, lyrically and musically. This is quite possibly the hardest, most in your face album since they released \"Sevendust\" back in one thousand, nine hundred and ninety-seven. I've been a fan of Sevendust since one thousand, nine hundred and ninety-nine when the released \"Home\", and I've eagerly awaited every album since. Every album they have made is very good, and Alpha is not an exception. Bottom Line: Alpha is just another great album from Sevendust. If you thought they got soft, they are back, and they are back to trip through your skull, and believe me, that a good thing.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"\"Alpha\" is the return of form to your face, passing through the seven dust of your skull. This album did not give up in the first place, it is corrupt, it has songs and music. \"If you think they are soft, they are back, they are back, on your skull,\" said Rajos.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"If you think they are soft, they are back, they are back, they will pass through your skull, I hope, this is good. Since the release of \"Home\" in one thousand, nine hundred and ninety-nine, I have been a fan of Quichen, and have been looking forward to the entire album never since. This is probably the hardest and toughest album since they released \"Seven Dust\" in one thousand, nine hundred and ninety-seven. This album did not give up in the first place, it is corrupt, it has songs and music. When Lajon said in a recent interview that the new song they were creating was the hardest thing they had never written, the songs that made the \"enemy\" sound cool. If you are a fan of an old school, then this album is the album you are sending all Sevendust albums to. Each album they produce is very beautiful, and neither is Alpha.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"When Lajon spoke in a recent interview that a new song they were writing was done by them . He is not joking. If you are a fan of an old school, then this album is the album you are sending all Sevendust albums to. This is a return to the form on your face, with the seventh dust of your head. This album is not original, it is not cruel, it has a song and it sings. This is the hardest and toughest album since they released \"Seven Dust\" in one thousand, nine hundred and ninety-seven. Since the release of \"Home\" in one thousand, nine hundred and ninety-nine, I have been a fan of Quichen, and have been looking forward to the entire album never since. Each album they produce is very good, and Alpha is not. Bottom line: Alpha is just another beautiful album from Sevendust. If you think they've softened back, come back with your skull, trust me, this is good.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" marks the very first CD release of an original album by Porter Wagoner and Dolly Parton in North America. Their very first LP \"Just Between You and Me\" was released in one thousand, nine hundred and ninety-five in Europe on CD and there have been various compilation CD's distributed, but RCA Records has been extremely slow in releasing any of the duos famous albums. Minnie Pearl once called Porter and Dolly the greatest man\/woman singing team in the history of country music. This CD shows why!\"Porter and Dolly\" has quite a history as an LP. It was the last album the duo never released in one thousand, nine hundred and eighty long after their partnership was over. It was originally to have been put out in one thousand, nine hundred and seventy-six, but Dolly's new management team headed by Sandy Gallin convinced RCA to shelve the duet album, citing that its release would hamper the growth of Dolly's new solo career. This did't sit too well with Porter who would go on to close royalties as a singer, songwriter, and producer of the album. In one thousand, nine hundred and seventy-nine Porter sued Dolly for three million dollars citing breach of contract and of blocking the release of this very album. After settling out of court for one million dollars, in which Dolly nearly ended up broke, the \"Porter and Dolly\" album was released. The album shot all the way to number nine and had two singles released; \"Making Plans\" hit number two and \"If You Go I'll Follow You\" went to number twelve, indicating the fans still loved their Porter and Dolly. The album is quite good. Featuring ten tracks the standout is the second single. Dolly's girlish voice blends perfectly with Porter's manly vocals and the song should have gone higher on the charts. All the songs were recorded prior to one thousand, nine hundred and seventy-six and the only song released before one thousand, nine hundred and eighty was \"If You Say I Can\", released as the B-Side to \"Is Forever Longer Than Always\" another top ten single not included on the album release. The album cover also features both Porter and Dolly photographed by two different photographers and their images were spliced together, since at that time the two were not talking. Happily they would rekindle their friendship in one thousand, nine hundred and eighty-eight. In my opinion all their albums were excellent and this ranks as one of their finest, and the fact that it finally has a home on CD makes me long to see more old Porter and Dolly LP's are-released on CD. On a final note the duos one thousand, nine hundred and sixty-nine LP \"Always, Always\" and one thousand, nine hundred and seventy-one's \"Two of a Kind\" will be released in February two thousand and weight together on one CD. Look for that.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" marks the new management team of Porter Wagoner and Dolly, led by Sandy Garlin, urging RCA to file a duet. The album was shot to ninth place, and two singles were released.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" marks the first CD album released by Porter Wagoner and Dolly Parton in North America. Their first LP \"Inside You and Me\" was released in Europe for one, zero years, and was released as a CD in nine hundred and ninety-five, and various compilation CDs were released, but RCA Records is very slow to release any famous duo. Minnie Pearl once named Porter and Dolly the best singing men and women in the history of country music. This CD explains why! \"Porter and Dolly\" has a long history like LP. This is the last album that the two did not release in the one thousand, nine hundred and eightys after the collaboration. It was originally founded in one thousand, nine hundred and seventy-six, but Dolly's new management team led by Sandy Garlin persuaded the RCA to include a CD player on the grounds that its release could hinder the development of Dolly's new work. This is not good for Porter. He will continue to raise royal finances as a singer, songwriter and album producer. In one thousand, nine hundred and seventy-nine, Porter sued Dolly for breach of contract and blocked the release of the album, seeking damages for US $ three million. After one million dollars, Dolly almost lost the album \"Potter and Dolly\". The disc went up to ninth place and released two songs; “Make a plan” in second place, and “if you go, I'll follow you” in twelveth place, which shows that fans still love each other. The album is very beautiful. The best ten-song work is the second single. Dolly's voice for girls and Potter's masculine voice blend perfectly, and this song should be at the top of the charts. All the songs were recorded before one thousand, nine hundred and seventy-six, and the only song released before one thousand, nine hundred and eighty was the song \"If You Say I Can\", which was released as a B-Side on the album \"Could It Be More Than Ever\" One of the top ten excluded. The album cover also shows photos of Porter and Dolly taken by two different photographers. Their photos were put together because they both did't speak at the time. Happily, in one thousand, eight hundred and ninety-eight they renewed their friendship. In my opinion, all their great albums This is one of their best albums, and the fact that they finally have a home on CD makes me look forward to seeing more Old Porter and Dolly LP CDs released. Finally, the nineteen hundred and ninety-nine albums \"Always, All the Time\" and the one thousand seventy-one \"Two Classes\" will be released in February two thousand and will be released on CD. Look at that.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"Finally, the duo's one, nine hundred and sixty-nine album \"Regular, Regular\" and one, nine hundred and seventy-one \"two genres\" will be released in February. Thousands and weights are put together on CD. All the songs were recorded before one thousand, nine hundred and seventy-six, and the only song released before one thousand, nine hundred and eighty was the song \"If You Say I Can\", which was released as a B-Side on the album \"Could It Be More Than Ever\" One of the top ten excluded. It was first founded in one thousand, nine hundred and seventy-six, but Dolly's new governing body led by Sandy Garlin persuaded the RCA to play down a duet on the grounds that its release could hinder the development of Dolly's new career. Their first LP \"Just In You and Me\" released CDs in Europe in one thousand and nine hundred and ninety-five, and released various CDs, but RCA Records is very slow in releasing any popular couple. The album moved up to the ninth and released two singles; After one million dollars, Dolly almost iran out, and the album \"Potter and Dolly\" was released. In one thousand, nine hundred and seventy-nine, Porter sued Dolly for breach of contract and blocked the release of the album, seeking damages of US $ three million.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Young Jeezy really brought the fire to the party with The Recession. After two largely undeniable albums Lets Get It Thug Motivation one hundred and one and The Inspiration, Young Jeezy manages to equal and maybe surpass the quality of those two records. The Recession is well balanced and right on time. It's a given that Young Jeezy in't everyone's favourite cup of tea. Its been four years since Jeezy first dropped with countless features, appearances, and mixtapes and Some still haven't caught up with how the craps. He is indeed a very clever wrapper (read skilled) and that coupled with a nearly overwhelming presence tracks, excellent production, and a thing called charisma; it's no wonder the is one of the top wrappers releasing albums today. His flow is tighter this time around, this lyrics more potent, this focus much more clearer. Apperances are kept to a minimum with Lil Boosie (why people sleep on Boosie?!?), Nas (yes that Nas), and Kanye West as well as singers Anthony Hamilton and Trey Songz. Needless to say Jeezy can handle himself. Content is what you would expect from a ship shop album as well as a little politics and introspection. Put On is a monster track no doubt about that but also Circulate, Don't Do It, Crazy World, By The Way, Hustlaz Ambition, My President etc etc. There is not a weak song on this eighteen track album. The Itunes bonus track Done It should have definitely been on the album as well. Production is handled by DJ Toomp, Drumma Boy, Midnight Black, Don Cannon, Justice League, and others. The Recession is undoubtedly one of the best albums of the year so far (along with Lil Wayne, Plies, Nas, Killer Mike, Bun B) and will take a few monumental efforts to knock it out of top five and album of the year discussions. Young Jeezy, with this album, has established himself as one of the top wrappers of this decade and you should't miss out on it.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Little Jeezy brought fire to the Recession party. It's been four years since the first release of countless items, viewing and assembling tapes. The theme is what you expect from an album-keeping album and politics.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Young Jeezy brought fire to the Recession party. After two undisputed albums Let's Get It Thug Motivation and inspiration, Young Jeezy was table to achieve for surpass the quality of these two records. The economic downturn is balanced, and timely. As we all know, Young Jeezy is not everyone's favourite tea. It's been four years since Jeezy introduced a lot of stuff, looks, and mixing tapes, and some people haven't even dice yet. It really is a very good package (read well), with a disturbing repertoire, a decent product and something called charm; it’s no surprise that one of the top packages is releasing an album today. While this rhythm is strong, the voices are strong, and the emphasis is clear. With Lil Boosie (why do people sleep in Boosie?!?), Nas (yes, Nas) and Kanye West, and singers Anthony Hamilton and Trey Songz, the number of appearances kept small. Needless to say, Jeezy can control himself. The theme is what you expect from a store store album with certain politics and visibility. There is no doubt that Put On is a monster song, but there is Curculate, Do Not Do It, Crazy World, by Way, Hustlaz Ambition, My President, etc. There is not a single weak song on this album for eighteen. The iTunes bonus song Done Must definitely appear on the album. The production features DJ Toomp, Drum Boy, Midnight Black, Don Cannon, Justice League, etc. Recession is undoubtedly one of the best albums of the year so far (with Lil Wayne, Plies, Nas, Killer Mike, Bun B), and it takes a lot of effort to get it on the album of the year with the top five. conversations With this album, Young Jeezy has made it into one of the top packs of the decade, you should’t miss it.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"I recently heard this song when i was watching some UK hoops this year. They broke for a commercial and this song started, I had to find out the name and who it was by. I have always loved Nelly especially since I heard the song Country Grammar. This song is a little different but it still has that Nelly style to it. You do not have to be a wrap lover for this song, this song will grab anybody's years. It is truly an amazing song. If you still need proof listen to the sample on Amazon MPthree, you wont be disappointed. THX,Kris L. CocKayne","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"this song is a bit weird but still has Nelly's style. year per person.","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"This song is different, but it still has Nelly's style. You don't have to be a fan of this song, this song. > I've always loved Nelly especially after hearing Country Grammar songs this song is different but it's still Nelly's style you don't have to be Packing a lover of this song, this song will hold anyone for years.","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"I recently heard this song while watching some UK hoops this year they broke the had that started this song i need to know the name and who it is, i have always loved nelly especially i heard the gram song of this country is a bit weird but still there. You don’t have to be in love to record this song, this song will take all many years. This is really an amazing song. THX, Kris L. CocKayne","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"Listening these demos of the great and unique Carole, I reaffirm the statement: in those times the singer had to seduce, conquer and engage the listener through the music and not - as this page - through a video clip. Carole the songwriter for interpreter had that invisible hook to catch and capture your senses. Wonderful lyrics and fabulous arrangements made C. K.'s sound. And we are talking about the golden and highly inspired decade of the late sixties and early seventies. Singers, composers and bands gave the best they could. Just to cite a few names: Karen Carpenter, Aretha Franklin, Diana Ross, Joan Baez, Roberta Flack, Janis Joplin, Gladys Knight, Bobbie Gentry, Dionne Warwick, Dusty Springfield for Mary Hopkin still resound in your affective memory. Carole King meant for her generation a true driving force. Don't miss this extraordinary release.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"The beautiful lyrics of the song and the wonderful arrangement that makes the voice of C. K . We are talking about the golden decade of the one thousand, nine hundred and sixtys and early one thousand, nine hundred and seventys. The singer, composer and band are doing their best.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"Just to name a few: Karen Carpenter, Aretha Franklin, Diana Ross, Joan Baez, Roberta Flack, Janis Joplin, Gladys Knight, Bobbie Gentry, Dionne Warwick, Mary Hopkin's Dusty Springfield are still emotionally disturbing. memory. Listening to these great and famous Carol's speeches, I repeated this sentence: At that time, musicians had to use music to seduce, conquer and attract an audience, not with a video program like this page. The singer, composer and band are doing their best. We are talking about a decade of gold in the one thousand, nine hundred and sixtys and early one thousand, nine hundred and seventys. Designer Carol has an invisible link to capture and capture your emotions. Nice words and good alignment made the voice of C. Carole King speaks of true encouragement for her generation.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"I listened to Carole's great and great speeches, and I repeated this: At that time, the musicians had to tempt, conquer and attract the audience with music, not with video clips like this page. Version designer Carol has an invisible key to grabbing and grabbing your senses. Nice words and good alignment made the voice of C. We are talking about the golden decade of the one thousand, nine hundred and sixtys and early one thousand, nine hundred and seventys. The singer, composer and band are doing their best. To name just a few: Karen Carpenter, Aretha Franklin, Diana Ross, Joan Baez, Roberta Flack, Janis Joplin, Gladys Knight, Bobby Gentry, Dion Warwick, and Springfield silent Mary Hopkin are back in your emotional memory. Carole King speaks of a real influence on her generation. Don't miss this unusual version.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love this song! Miley is a little wild but the girl is talented. I love the lyrics and how the song sounds.","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"Miley cyrus is a wild thing, but this girl is very talented.","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love this song! Miley hesitates, but girl","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love this song! Miley is an uncontrollable person, but this girl is talented. I love the lyrics and the sound of this song.","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}