{"orig_index":1386,"reviewerID":"A1BJJVV2B5VLUQ","asin":"B000000OMB","reviewerName":"R. Gorham \"RCG2\"","helpful":[21,23],"reviewText":"THE BAND: John Wetton (lead vocals, bass), Geoff Downes (keyboards), Steve Howe (guitars), Carl Palmer (drums & percussion). THE DISC: (one thousand, nine hundred and eighty-two) nine tracks clocking in at approximately forty-four minutes. Included with the disc is a minimal two-page fold out including song titles\/credits\/times, and musicians. All songs written by Asia members. Album cover part by Roger Dean. Recorded at Townhouse Studio, London, England. Label - Geffen. COMMENTS: I had mixed feelings about Asia's debut album when it first came out in 'eighty-two. One of the first true supergroups that I can recall - Wetton (most notably from King Crimson and UK), Howe (Yes), Palmer (ELP), and Downes (Buggles and Yes). Steve Howe and Carl Palmer were ungodly superstars in their perspective bands during the seventy's. I remember buying the vinyl based on the strength of \"Sole Survivor\". I remember thinking with these progressive musicians at the helm, there'd have to be some ten-twelve minute spacey head trips. That's where the mixed feelings came in. All the songs were in the four to five minute range (\"Here Comes The Feeling\" is the longest track at five:forty-two). Wetton and Downes were the main writers there. and Downes prior catalog with the Buggles was \"pop\" to the max. In retrospect, I now know why Asia had that pop feel - it was Geoff Downes all along. Not that it's a bad thing. Asia's sound just was't what I was expecting. This album is heavy on keyboards. Steve Howe's guitar remains mostly in the background outside of a few shining guitar solos. The bass work is great. Carl Palmer's drumming is steady, but it's nothing flashy like this days with ELP. Wetton's vocals are top notch. It's the songs that eventually made me come around, as it did for so many listeners (and radio stations). Asia's debut spent nine weeks at #one on the U. S. album chart. \"Heat Of The Moment\" (reaching #four), \"Sole Survivor\" (#ten), and \"Only Time Will Tell\" (#seventeen) were huge Top forty hits. Billboard named the Asia debut as album of the year. Compilations are saturated with songs from their onest album - \"The Very Best Of Asia: Heat Of The Moment one thousand, nine hundred and eighty-two-ninety\" has six of the nine songs from it's debut, and \"Asia - Gold\" (two thousand and five) incredibly contains all nine songs. A commercial success to say the least, and fans of its members former bands cried \"sell out\". All I can say is - you can't please everyone. There's no denying the songs are catchy. with my favourites being \"Sole Survivor\", \"Only Time Will Tell\" and the heaviest song \"Time Again\". One of the top rock debuts from the past several decades. If you want to own one studio album of theirs - this is the one! As of two thousand and six, I still look forward to a digitally remastered version with extensive liner notes to be released. This is a classic album from the eighty's (five stars).","overall":5,"summary":"More rock & pop despite its band member's progressive roots","unixReviewTime":1158192000,"reviewTime":"09 14, 2006"}
{"orig_index":1386,"reviewerID":"A1BJJVV2B5VLUQ","asin":"B000000OMB","reviewerName":"R. Gorham \"RCG2\"","helpful":[21,23],"reviewText":" Asia's debut album spent nine weeks at #7 on the fm charts. it's the first true supergroup that i can remember - Wetton and Downes.<\/s>","overall":5,"summary":"More rock & pop despite its band member's progressive roots","unixReviewTime":1158192000,"reviewTime":"09 14, 2006"}
{"orig_index":1386,"reviewerID":"A1BJJVV2B5VLUQ","asin":"B000000OMB","reviewerName":"R. Gorham \"RCG2\"","helpful":[21,23],"reviewText":"Compilations are saturated with songs from their onest album - \"The Very Best Of Asia: Heat Of The Moment one thousand, nine hundred and eighty-two-ninety\" has six of the nine songs from it's debut, and \"Asia - Gold\" (two thousand and five) incredibly contains all nine songs. \"Heat Of The Moment\" (reaching #four), \"Sole Survivor\" (#ten), and \"Only Time Will Tell\" (#seventeen) were huge Top forty hits. THE BAND: John Wetton (lead vocals, bass), Geoff Downes (keyboards), Steve Howe (guitars), Carl Palmer (drums & percussion). One of the first true supergroups that I can recall - Wetton (most notably from King Crimson and UK), Howe (Yes), Palmer (ELP), and Downes (Buggles and Yes). with my favourites being \"Sole Survivor\", \"Only Time Will Tell\" and the heaviest song \"Time Again\". THE DISC: (one thousand, nine hundred and eighty-two) nine tracks clocking in at approximately forty-four minutes. All the songs were in the four to five minute range (\"Here Comes The Feeling\" is the longest track at five:forty-two).","overall":5,"summary":"More rock & pop despite its band member's progressive roots","unixReviewTime":1158192000,"reviewTime":"09 14, 2006"}
{"orig_index":1406,"reviewerID":"A26NLSTT75FMJM","asin":"B000000OME","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,7],"reviewText":"It's really tough for me to come to terms with hearing 'eightys distorted guitar on this album's title track, the cover of \"(You're So Square) Baby I Don't Care\", where she honestly sounds like Sting on vocals, and \"You Dream Flat Tires\". Did Joni think she was some sort of 'eightys hair metal star? Similarly, it's tough for me to hear all that 'eightys production stuff on \"Ladies' Man\" (ooh! That's my theme song!), \"Man to Man\", \"Under the Streetlight\" (which has 'eightys guitar and 'eightys synthesizers) and \"Solid Love\". Now, when she does the Hejira-era jazz thing, as on \"Moon in the Window\" and \"Love\", it can be nice, but when she does it again on \"Be Cool\", it turns out awful. The album's alone classic is \"Chinese Café\/Unchained Melody\", which is a killer folk-jazz song with great lyrics about the passage of time and a lot of bass playing (presumably by Jaco Pastorious). Arguably my favourite Joni Mitchell song, on one of her worst albums. Is that irony for what? For the most part though, this is a boring record with a lot of unwise 'eightys production trends, saved only by Joni's voice. It's better than what would come next, though.","overall":2,"summary":"Joni the '80s pop star?","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":1406,"reviewerID":"A26NLSTT75FMJM","asin":"B000000OME","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,7],"reviewText":" the album's alone classic is \"Chinese Café\/Unchained Melody\" for the most part though, this is a boring record with a lot of unwise 'eightys production trends.<\/s>","overall":2,"summary":"Joni the '80s pop star?","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":1406,"reviewerID":"A26NLSTT75FMJM","asin":"B000000OME","reviewerName":"finulanu \"&#34;the mysterious&#34;\"","helpful":[2,7],"reviewText":"Now, when she does the Hejira-era jazz thing, as on \"Moon in the Window\" and \"Love\", it can be nice, but when she does it again on \"Be Cool\", it turns out awful. It's really tough for me to come to terms with hearing 'eightys distorted guitar on this album's title track, the cover of \"(You're So Square) Baby I Don't Care\", where she honestly sounds like Sting on vocals, and \"You Dream Flat Tires\". ), \"Man to Man\", \"Under the Streetlight\" (which has 'eightys guitar and 'eightys synthesizers) and \"Solid Love\". The album's alone classic is \"Chinese Café\/Unchained Melody\", which is a killer folk-jazz song with great lyrics about the passage of time and a lot of bass playing (presumably by Jaco Pastorious). For the most part though, this is a boring record with a lot of unwise 'eightys production trends, saved only by Joni's voice. Similarly, it's tough for me to hear all that 'eightys production stuff on \"Ladies' Man\" (ooh! It's better than what would come next, though.","overall":2,"summary":"Joni the '80s pop star?","unixReviewTime":1195689600,"reviewTime":"11 22, 2007"}
{"orig_index":2430,"reviewerID":"A23IOPI0D1OG7V","asin":"B0000012T3","reviewerName":"WILLIE A YOUNG II \"willow\"","helpful":[12,12],"reviewText":"With the demise of true musicianship amongst black artists blooming on the horizon, we absolutely NEEDED this. To me Mint Condition has always straddled the fence between artistry and clawing out a niche' on the commercial landscape. Listening to \"Definition of. \" one gets the feeling that these men recorded this material without giving a damn what the general public thinks, and THATS what distinguishes good music from great music! While there are a few nods to conventional\/mainstream tastes, this is gonzo music making, without fear for boundaries. This is Mint Condition at their most excessive, overblown, artsy, meandering and pompous, and I enjoy every minute of it. The fast material is funky as hell ('Change Your Mind', 'Ain't Hooking Me Up Enough', 'I Want It Again', 'Funky Weekend', 'Raise Up' & 'Missing'), the ballads soar ('On and On', 'The Never That You'll Never Know', 'What Kind of Man Would I Be' & You Don't Have To Hurt No More), even the slighter selections are standouts ('Let Me Be The One', Gettin' It On' and 'Missing') but the best number found there is the stunning 'Sometimes' penned by bassist Ricky Kinchen. Building from hushed, tension-filled verses to thundering, heavy metallic choruses and climaxing with virtuosic solos from guitarist Homer O'Dell and drummer Chris \"Daddy\" Dave and finally fading into a quiet coda inspired by Teena Marie's \"Portuguese Love\", this is the best rock song they have never recorded, and rightfully points the finger at women who tease men into being unwitting victims to their feminine charms and demands the attention we deserve (\"won't you spend the night, stop playing with me! ) The whole CD is worth the price for this one track, but the songs surrounding it only enhance it's power. Buy this immediately. Black music should return to this type of creativity before it's too late, soul music is dying but these agents might just have a shot at saving it.","overall":5,"summary":"The Title Says It All.","unixReviewTime":966729600,"reviewTime":"08 20, 2000"}
{"orig_index":2430,"reviewerID":"A23IOPI0D1OG7V","asin":"B0000012T3","reviewerName":"WILLIE A YOUNG II \"willow\"","helpful":[12,12],"reviewText":" \"Definition of. \" is gonzo music making, without fear for boundaries. the best number found there is the stunning 'Sometimes' penned by bassist Ricky Kinchen.<\/s>","overall":5,"summary":"The Title Says It All.","unixReviewTime":966729600,"reviewTime":"08 20, 2000"}
{"orig_index":2430,"reviewerID":"A23IOPI0D1OG7V","asin":"B0000012T3","reviewerName":"WILLIE A YOUNG II \"willow\"","helpful":[12,12],"reviewText":"The fast material is funky as hell ('Change Your Mind', 'Ain't Hooking Me Up Enough', 'I Want It Again', 'Funky Weekend', 'Raise Up' & 'Missing'), the ballads soar ('On and On', 'The Never That You'll Never Know', 'What Kind of Man Would I Be' & You Don't Have To Hurt No More), even the slighter selections are standouts ('Let Me Be The One', Gettin' It On' and 'Missing') but the best number found there is the stunning 'Sometimes' penned by bassist Ricky Kinchen. Building from hushed, tension-filled verses to thundering, heavy metallic choruses and climaxing with virtuosic solos from guitarist Homer O'Dell and drummer Chris \"Daddy\" Dave and finally fading into a quiet coda inspired by Teena Marie's \"Portuguese Love\", this is the best rock song they have never recorded, and rightfully points the finger at women who tease men into being unwitting victims to their feminine charms and demands the attention we deserve (\"won't you spend the night, stop playing with me! ) This is Mint Condition at their most excessive, overblown, artsy, meandering and pompous, and I enjoy every minute of it. While there are a few nods to conventional\/mainstream tastes, this is gonzo music making, without fear for boundaries. one gets the feeling that these men recorded this material without giving a damn what the general public thinks, and THATS what distinguishes good music from great music! Black music should return to this type of creativity before it's too late, soul music is dying but these agents might just have a shot at saving it. The whole CD is worth the price for this one track, but the songs surrounding it only enhance it's power.","overall":5,"summary":"The Title Says It All.","unixReviewTime":966729600,"reviewTime":"08 20, 2000"}
{"orig_index":5048,"reviewerID":"A1PGC1GEBY9CZU","asin":"B000001F6G","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":"After a six year hiatus of releasing their music, and with the team members of the Moody Blues showing up in their original line-up, keyboardist Mike Pinder says farewell in this album. Released in June of seventy-eight, Octave, the MB's eighth album was a departure from the Moodies earlier styles. With Pinder winding up this connection to the group the music would have to evolve. Set during the time of punk and disco, the album, which a somewhat commercial success, was't given to widespread appeal. Hardcore fans, however, loved it and were saddened by Pinder's departure. Stepping In A Slide Zone and Driftwood both broke into the top one hundred on Billboard's charts. Stepping In A Slide Zone reached thirty-nineth while Driftwood reached fifty-nineth. The album reached #six in the UK and #thirteen in the US charts. Pinder's One Step Into the Light speaks of this love affair with the mellotron which would't be heard from him after this album.","overall":5,"summary":"Octave Breaks the Hiatus","unixReviewTime":1402444800,"reviewTime":"06 11, 2014"}
{"orig_index":5048,"reviewerID":"A1PGC1GEBY9CZU","asin":"B000001F6G","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":" Octave, the MB's eighth album, was released in June of seventy-eight . The album reached #six in the UK and #thirteen in the US charts .","overall":5,"summary":"Octave Breaks the Hiatus","unixReviewTime":1402444800,"reviewTime":"06 11, 2014"}
{"orig_index":5048,"reviewerID":"A1PGC1GEBY9CZU","asin":"B000001F6G","reviewerName":"Happy Camper","helpful":[1,1],"reviewText":"Set during the time of punk and disco, the album, which a somewhat commercial success, was't given to widespread appeal. After a six year hiatus of releasing their music, and with the team members of the Moody Blues showing up in their original line-up, keyboardist Mike Pinder says farewell in this album. Released in June of seventy-eight, Octave, the MB's eighth album was a departure from the Moodies earlier styles. Hardcore fans, however, loved it and were saddened by Pinder's departure. The album reached #six in the UK and #thirteen in the US charts. Pinder's One Step Into the Light speaks of this love affair with the mellotron which would't be heard from him after this album. Stepping In A Slide Zone and Driftwood both broke into the top one hundred on Billboard's charts.","overall":5,"summary":"Octave Breaks the Hiatus","unixReviewTime":1402444800,"reviewTime":"06 11, 2014"}
{"orig_index":5295,"reviewerID":"AG43PX9SLGXP2","asin":"B000001FCM","reviewerName":"BKenny \"BK\"","helpful":[4,4],"reviewText":"Make my funk the P funk I STILL wants to get funked up! It has been thirty years since that fateful day in Grandma's back yard where a chubby ten year old got slammed by some funk! I want the Bomb I want the P Funk! I can't get enough. Bootsy, Bernie, George and don't forget Jerome \"Big Foot\" Brailey took me out of the back yard into the Mothership and I became a clone of the good Dr. Funkenstein. This is a must have CD! \"Handcuffs\" the ultimate \"keep it real song\". Parliament is having fun, making rhythm and funking your mind with \"Tear The Roof Off The Sucker\" and \"Night Of The Thumpasaurus Peoples\" You have to be from another world to come up with Fun Like That! \"Supergrovalistipro---(well you know) is what it is, Give the people what they want, when they want and they want it all the time!! I WANT MY FUNK UNCUT!!","overall":5,"summary":"Five Stars and Then Some!","unixReviewTime":1157500800,"reviewTime":"09 6, 2006"}
{"orig_index":5295,"reviewerID":"AG43PX9SLGXP2","asin":"B000001FCM","reviewerName":"BKenny \"BK\"","helpful":[4,4],"reviewText":" thirty years since the day a chubby ten year old got slammed by some funk. Parliament is having fun, making rhythm and funking your mind with \"Tear The Roof Off The Sucker\" and \"Night Of The Thumpasaurus Peoples\"<\/s>","overall":5,"summary":"Five Stars and Then Some!","unixReviewTime":1157500800,"reviewTime":"09 6, 2006"}
{"orig_index":5295,"reviewerID":"AG43PX9SLGXP2","asin":"B000001FCM","reviewerName":"BKenny \"BK\"","helpful":[4,4],"reviewText":"\"Supergrovalistipro---(well you know) is what it is, Give the people what they want, when they want and they want it all the time!! Parliament is having fun, making rhythm and funking your mind with \"Tear The Roof Off The Sucker\" and \"Night Of The Thumpasaurus Peoples\" You have to be from another world to come up with Fun Like That! Bootsy, Bernie, George and don't forget Jerome \"Big Foot\" Brailey took me out of the back yard into the Mothership and I became a clone of the good Dr. Funkenstein. \"Handcuffs\" the ultimate \"keep it real song\". It has been thirty years since that fateful day in Grandma's back yard where a chubby ten year old got slammed by some funk! I want the Bomb I want the P Funk! Make my funk the P funk I STILL wants to get funked up!","overall":5,"summary":"Five Stars and Then Some!","unixReviewTime":1157500800,"reviewTime":"09 6, 2006"}
{"orig_index":5409,"reviewerID":"A1JIEKHJ735566","asin":"B000001FJV","reviewerName":"David W. Coleman \"Sportside Books\"","helpful":[0,0],"reviewText":"It's only fitting that this compilation should have been the first issued on The Godfather in the CD era. Yes, some of its content has been since included in later collections, but if you are new to James Brown, there is no better place to begin. By the time of the first track on this set (It's A New Day, one thousand, nine hundred and sixty-nine), JB was doing what no one else could. Virtually everything the put out went straight to the top of the charts. James would assemble this players, in some cases in the empty auditorium where the show had just ended, and play down a mutha track in just one take. Listen as the rhymes come non-stop. The interplay between James and the original JB's (when they were young and hungry) is astounding. Just check out James' social commentaries on \"Talking Loud and Saying Nothin'\", \"Get Up, Get Into It, Get Involved\", and \"Soul Power\". And dig this, the version of \"Funky Drummer\" included there is the funkiest of all the issued versions! This cut of \"I Got To Move\" is superior in all ways to that included on \"Funk Power\". And let's not forget the over-the-top are-recording of \"Hot Pants\", with the tambourine helping James to seek out your mind and not let it go. Both versions are great. If you have some of that new software, try making a omega-mix of the two! If you THOUGHT you did't have soul, you'll think again after getting into this album. Once you've had this Intro to the Funk, you'll be ready to get deeper into James Brown! UPDATE: In The Jungle Groove has been are-issued (two thousand and three) in a are-mastered version, featuring an extended cut of \"Blind Man Can See It,\" the jazzy-hip instrumental from the Black Caesar soundtrack.","overall":5,"summary":"An Intro To The Funk","unixReviewTime":958348800,"reviewTime":"05 15, 2000"}
{"orig_index":5409,"reviewerID":"A1JIEKHJ735566","asin":"B000001FJV","reviewerName":"David W. Coleman \"Sportside Books\"","helpful":[0,0],"reviewText":" if you are new to James Brown, there is no better place to start. the interplay between James and the original JB's is astounding. \"I Got To Move\" is superior in all ways to that included on \"Funk Power\"<\/s>","overall":5,"summary":"An Intro To The Funk","unixReviewTime":958348800,"reviewTime":"05 15, 2000"}
{"orig_index":5409,"reviewerID":"A1JIEKHJ735566","asin":"B000001FJV","reviewerName":"David W. Coleman \"Sportside Books\"","helpful":[0,0],"reviewText":"Just check out James' social commentaries on \"Talking Loud and Saying Nothin'\", \"Get Up, Get Into It, Get Involved\", and \"Soul Power\". By the time of the first track on this set (It's A New Day, one thousand, nine hundred and sixty-nine), JB was doing what no one else could. UPDATE: In The Jungle Groove has been are-issued (two thousand and three) in a are-mastered version, featuring an extended cut of \"Blind Man Can See It,\" the jazzy-hip instrumental from the Black Caesar soundtrack. Yes, some of its content has been since included in later collections, but if you are new to James Brown, there is no better place to begin. James would assemble this players, in some cases in the empty auditorium where the show had just ended, and play down a mutha track in just one take. And let's not forget the over-the-top are-recording of \"Hot Pants\", with the tambourine helping James to seek out your mind and not let it go. This cut of \"I Got To Move\" is superior in all ways to that included on \"Funk Power\".","overall":5,"summary":"An Intro To The Funk","unixReviewTime":958348800,"reviewTime":"05 15, 2000"}
{"orig_index":7014,"reviewerID":"AE42JLYPXUI45","asin":"B0000024ZL","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[0,1],"reviewText":"In October of one thousand, nine hundred and seventy-two, Barbra Streisand released her sixteenth album entitled, LIVE CONCERT AT THE FORUM, Barbra's second live concert album. This album is just as great as A HAPPENING IN CENTRAL PARK, and I'll explain to you why that is. Medley: SING A SONG\/MAKE YOUR OWN KIND OF MUSICNew song. Great. STARTING HERE, STARTING NOWFrom the album MY NAME IS BARBRA (one thousand, nine hundred and sixty-five). Great song. DON'T RAIN ON MY PARADEFrom the original motion picture & motion picture soundtrack FUNNY GIRL (one thousand, nine hundred and sixty-eight). Great job there. ON A CLEAR DAY (YOU CAN SEE FOREVER)From the original motion picture & motion picture soundtrack ON A CLEAR DAY YOU CAN SEE FOREVER (one thousand, nine hundred and seventy). This is a great song and is done very well live. This song and film was another one of Barbra's major movie roles. Medley: SWEET INSPIRATION\/WHERE YOU LEAD\"Sweet Inspiration\": New Song. \"Where You Lead\": From the album BARBRA JOAN STREISAND (one thousand, nine hundred and seventy-one). Great medley. DIDN'T WENew song. Great. MY MANFrom the album MY NAME IS BARBRA (one thousand, nine hundred and sixty-five). Great song. STONEY ENDFrom the album STONEY END (one thousand, nine hundred and seventy-one). Great song. Medley: SING\/HAPPY DAYS ARE HERE AGAIN\"Sing\": New song. \"Happy Days Are Here Again\": From the album THE BARBA STREISAND ALBUM (one thousand, nine hundred and sixty-three). Great medley. PEOPLEFrom the album PEOPLE (one thousand, nine hundred and sixty-four). Still beautiful. Barbra is still a classic live act and still a powerful Diva with a great voice. LIVE CONCERT AT THE FORUM is the album for anyone who is still striving to get all of her albums.","overall":5,"summary":"Barbra Streisand: Live Concert At The Forum (1972)","unixReviewTime":1124236800,"reviewTime":"08 17, 2005"}
{"orig_index":7014,"reviewerID":"AE42JLYPXUI45","asin":"B0000024ZL","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[0,1],"reviewText":" Barbra Streisand released her sixteenth album in October of one thousand, nine hundred and seventy-two . This album is just as great as A HAPPENING IN CENTRAL PARK, and I'll explain to you why .","overall":5,"summary":"Barbra Streisand: Live Concert At The Forum (1972)","unixReviewTime":1124236800,"reviewTime":"08 17, 2005"}
{"orig_index":7014,"reviewerID":"AE42JLYPXUI45","asin":"B0000024ZL","reviewerName":"Chad DeFeo \"(ChandlerBingFan)\"","helpful":[0,1],"reviewText":"In October of one thousand, nine hundred and seventy-two, Barbra Streisand released her sixteenth album entitled, LIVE CONCERT AT THE FORUM, Barbra's second live concert album. ON A CLEAR DAY (YOU CAN SEE FOREVER)From the original motion picture & motion picture soundtrack ON A CLEAR DAY YOU CAN SEE FOREVER (one thousand, nine hundred and seventy). \"Happy Days Are Here Again\": From the album THE BARBA STREISAND ALBUM (one thousand, nine hundred and sixty-three). \"Where You Lead\": From the album BARBRA JOAN STREISAND (one thousand, nine hundred and seventy-one). STARTING HERE, STARTING NOWFrom the album MY NAME IS BARBRA (one thousand, nine hundred and sixty-five). DON'T RAIN ON MY PARADEFrom the original motion picture & motion picture soundtrack FUNNY GIRL (one thousand, nine hundred and sixty-eight). Great song.","overall":5,"summary":"Barbra Streisand: Live Concert At The Forum (1972)","unixReviewTime":1124236800,"reviewTime":"08 17, 2005"}
{"orig_index":7220,"reviewerID":"A3292YLTWMNLSG","asin":"B00000253N","reviewerName":"\"rockrollmusicislife\"","helpful":[0,0],"reviewText":"You could debate for hours on the topic of what is the greatest Dylan album. Is it Highway sixty-one? Is it Blonde on Blonde? Is it Bringing it All Back Home? Though they are all brilliant albums the best of Dylan's thirty plus studio albums would have to be Blood on the Tracks. This is Dylan's most personal albums. For this first three classics the explored the problems of the world. He explores the difficulties of this own life. He explores love being won and love being lost. He sings of being \"Tangled Up in Blue\", looking out for a \"Simple Twist of Fate\", and of a woman giving him \"Shelter From the Storm.\" He sings of kindness and generosity. All is done with this brilliant acoustic guitar and a fine backing group. In conclusion Blood on the Tracks is Dylan's most listenable and appealing album. It is a folk rock classic. Dylan's Greatest Achievement. No fan of real music should be without it! GET IT NOW!","overall":5,"summary":"Dylan's Greatest Achievement!","unixReviewTime":1000598400,"reviewTime":"09 16, 2001"}
{"orig_index":7220,"reviewerID":"A3292YLTWMNLSG","asin":"B00000253N","reviewerName":"\"rockrollmusicislife\"","helpful":[0,0],"reviewText":" the best of Dylan's thirty plus studio albums would have to be Blood on the Tracks. this is Dylan's most listenable and appealing album. it is a folk rock classic.<\/s>","overall":5,"summary":"Dylan's Greatest Achievement!","unixReviewTime":1000598400,"reviewTime":"09 16, 2001"}
{"orig_index":7220,"reviewerID":"A3292YLTWMNLSG","asin":"B00000253N","reviewerName":"\"rockrollmusicislife\"","helpful":[0,0],"reviewText":"He sings of being \"Tangled Up in Blue\", looking out for a \"Simple Twist of Fate\", and of a woman giving him \"Shelter From the Storm.\" Though they are all brilliant albums the best of Dylan's thirty plus studio albums would have to be Blood on the Tracks. In conclusion Blood on the Tracks is Dylan's most listenable and appealing album. This is Dylan's most personal albums. All is done with this brilliant acoustic guitar and a fine backing group. He explores love being won and love being lost. You could debate for hours on the topic of what is the greatest Dylan album.","overall":5,"summary":"Dylan's Greatest Achievement!","unixReviewTime":1000598400,"reviewTime":"09 16, 2001"}
{"orig_index":8414,"reviewerID":"A633NIAR4JJAR","asin":"B0000025RI","reviewerName":"Dr. Marc Axelrod \"PM\"","helpful":[2,16],"reviewText":"It's hard to be neutral about this album, because it's been played to death over the radio, for to be neutral about this artist, who has been hyped to death by himself and others. So judging strictly the music, I'd have to say that the album is very good. \"Beat It\" and \"Billie Jean\" are the best songs on the album and probably the best songs Michael never recorded as a solo artist. The title track is fun, and it was great to see it reprised in the movie \"thirteen Going on thirty.\" \"Wanna Be Startin' Something is good, if you could figure out what the check the's singing about. The rest of the itunes don't quite hit the high standards of the previous compositions. \"Human Nature\" is a nice kiddie sounding ballad. \"The Girl is Mine\" is a dopey duet between Paul McCartney and Jackson. And the last two songs on the album are forgettable. And since all of the great songs on this cd are available on Michael's HIStory Hits collection, I'd go with the latter.","overall":4,"summary":"A love it or hate it CD","unixReviewTime":944697600,"reviewTime":"12 9, 1999"}
{"orig_index":8414,"reviewerID":"A633NIAR4JJAR","asin":"B0000025RI","reviewerName":"Dr. Marc Axelrod \"PM\"","helpful":[2,16],"reviewText":" \"Beat It\" and \"Billie Jean\" are the best songs on the album . The title track is fun, and it was great to see it reprised in the movie \"thirteen Going on 30\" The rest of the itunes don't quite hit the high standards of the previous compositions .","overall":4,"summary":"A love it or hate it CD","unixReviewTime":944697600,"reviewTime":"12 9, 1999"}
{"orig_index":8414,"reviewerID":"A633NIAR4JJAR","asin":"B0000025RI","reviewerName":"Dr. Marc Axelrod \"PM\"","helpful":[2,16],"reviewText":"It's hard to be neutral about this album, because it's been played to death over the radio, for to be neutral about this artist, who has been hyped to death by himself and others. \"Beat It\" and \"Billie Jean\" are the best songs on the album and probably the best songs Michael never recorded as a solo artist. The title track is fun, and it was great to see it reprised in the movie \"thirteen Going on thirty.\" And since all of the great songs on this cd are available on Michael's HIStory Hits collection, I'd go with the latter. \"Wanna Be Startin' Something is good, if you could figure out what the check the's singing about. So judging strictly the music, I'd have to say that the album is very good. \"Human Nature\" is a nice kiddie sounding ballad.","overall":4,"summary":"A love it or hate it CD","unixReviewTime":944697600,"reviewTime":"12 9, 1999"}
{"orig_index":10646,"reviewerID":"A31U2QT7SAL7K","asin":"B000002AMJ","reviewerName":"Reginald D. Garrard \"the G-man\"","helpful":[1,1],"reviewText":"Though the guys had been around for a while, it was't until the release of \"Backstabbers\" that the trio - formerly a quintet - of Eddie Levert, Walter Williams, and the late William Powell took the musical world by storm.\"Backstabbers\" was released in a time when an album was filled with a collection of singles, not so much filler as is so common today. In addition to the hits \"Love Train,\" and the title cut, other strong tracks include \"When the World's At Peace,\" \"Listen to the Clock on the Wall,\" and \"Shiftless, Shady Jealous Kind of People,\" a song that's almost like a \"sequel\" to \"Backstabbers.\"This is one of the seminal R & B albums of the seventy's!","overall":5,"summary":"The smash that made the O'Jays a household name!","unixReviewTime":1348963200,"reviewTime":"09 30, 2012"}
{"orig_index":10646,"reviewerID":"A31U2QT7SAL7K","asin":"B000002AMJ","reviewerName":"Reginald D. Garrard \"the G-man\"","helpful":[1,1],"reviewText":" Eddie Levert, Walter Williams, and the late William Powell took the musical world by storm . \"Backstabbers\" was released in a time when an album was filled with a collection of singles .","overall":5,"summary":"The smash that made the O'Jays a household name!","unixReviewTime":1348963200,"reviewTime":"09 30, 2012"}
{"orig_index":10646,"reviewerID":"A31U2QT7SAL7K","asin":"B000002AMJ","reviewerName":"Reginald D. Garrard \"the G-man\"","helpful":[1,1],"reviewText":"In addition to the hits \"Love Train,\" and the title cut, other strong tracks include \"When the World's At Peace,\" \"Listen to the Clock on the Wall,\" and \"Shiftless, Shady Jealous Kind of People,\" a song that's almost like a \"sequel\" to \"Backstabbers. Though the guys had been around for a while, it was't until the release of \"Backstabbers\" that the trio - formerly a quintet - of Eddie Levert, Walter Williams, and the late William Powell took the musical world by storm. \"Backstabbers\" was released in a time when an album was filled with a collection of singles, not so much filler as is so common today. \"This is one of the seminal R & B albums of the seventy's!","overall":5,"summary":"The smash that made the O'Jays a household name!","unixReviewTime":1348963200,"reviewTime":"09 30, 2012"}
{"orig_index":11378,"reviewerID":"A1N2L9A6I686G5","asin":"B000002G3A","reviewerName":"Katie \"book worm\"","helpful":[6,7],"reviewText":"I purchased this CD about five years ago, after hearing the song \"Insensitive\" on the radio. I had figured that, although I probably would't like her other songs (as this happens so often), just to have that one song would be worth the money - I was going through a breakup at that time, and this particular song spoke to me (If you've heard this song, I'm sure you'll know what I mean). However, I was really surprised when I listened to the CD for the first time - I actually loved every single song! I'm still listening to it now, five years later, and I still love it.","overall":5,"summary":"An All-Time Favorite","unixReviewTime":1116115200,"reviewTime":"05 15, 2005"}
{"orig_index":11378,"reviewerID":"A1N2L9A6I686G5","asin":"B000002G3A","reviewerName":"Katie \"book worm\"","helpful":[6,7],"reviewText":" i purchased this CD about five years ago, after hearing the song \"Insensitive\" on the radio. i was really surprised when i listened to the CD for the first time - i actually loved every single song!<\/s>","overall":5,"summary":"An All-Time Favorite","unixReviewTime":1116115200,"reviewTime":"05 15, 2005"}
{"orig_index":11378,"reviewerID":"A1N2L9A6I686G5","asin":"B000002G3A","reviewerName":"Katie \"book worm\"","helpful":[6,7],"reviewText":"I had figured that, although I probably would't like her other songs (as this happens so often), just to have that one song would be worth the money - I was going through a breakup at that time, and this particular song spoke to me (If you've heard this song, I'm sure you'll know what I mean). I'm still listening to it now, five years later, and I still love it. I purchased this CD about five years ago, after hearing the song \"Insensitive\" on the radio. However, I was really surprised when I listened to the CD for the first time - I actually loved every single song!","overall":5,"summary":"An All-Time Favorite","unixReviewTime":1116115200,"reviewTime":"05 15, 2005"}
{"orig_index":11572,"reviewerID":"AH91ZJ8W8NCLR","asin":"B000002GAG","reviewerName":"Yes Fan","helpful":[0,0],"reviewText":"Simply one of the BEST albums from the late seventys! Streetwave absolutely RAWKS! Buy this, you won't be disappointed. A+++++!","overall":5,"summary":"Excellent production and musicianship!","unixReviewTime":1384041600,"reviewTime":"11 10, 2013"}
{"orig_index":11572,"reviewerID":"AH91ZJ8W8NCLR","asin":"B000002GAG","reviewerName":"Yes Fan","helpful":[0,0],"reviewText":" Streetwave is one of the BEST albums from the late seventys.<\/s>","overall":5,"summary":"Excellent production and musicianship!","unixReviewTime":1384041600,"reviewTime":"11 10, 2013"}
{"orig_index":11572,"reviewerID":"AH91ZJ8W8NCLR","asin":"B000002GAG","reviewerName":"Yes Fan","helpful":[0,0],"reviewText":"Simply one of the BEST albums from the late seventys! Buy this, you won't be disappointed. Streetwave absolutely RAWKS! A+++++!","overall":5,"summary":"Excellent production and musicianship!","unixReviewTime":1384041600,"reviewTime":"11 10, 2013"}
{"orig_index":11572,"reviewerID":"AH91ZJ8W8NCLR","asin":"B000002GAG","reviewerName":"Yes Fan","helpful":[0,0],"reviewText":" Streetwave absolutely RAWKS! Buy this, you won't be","overall":5,"summary":"Excellent production and musicianship!","unixReviewTime":1384041600,"reviewTime":"11 10, 2013"}
{"orig_index":12821,"reviewerID":"A84UFSF2SZS2W","asin":"B000002H72","reviewerName":"EriKa \"E\"","helpful":[48,56],"reviewText":"If the late one thousand, nine hundred and eightys had some really contrived, horrendous garbage some people called music, there were certainly the alternatives who displayed scorching guitars, interesting and unexpected arrangements, clever lyrics, and great albums. One band who exemplified this alternative was the Pixies, disbanding in the early ninetys creating their own side projects, but not before creating a few brilliant records, Doolittle being the most brilliant of them all. The vocals of Black Francis coupled with the softer and distinctive voice of Kim Deal was purely delightful, with some truly exceptional and memorable songs like \"Debaser\", \"Wave of Mutilation\", \"Here Comes Your Man\" (which is quite melodic!), \"Monkey Gone to Heaven\" and several other remarkable songs. This is a solid, superb album which any serious music lover must have. It is a little unconventional and might take some getting used to, but it is infinitely worth it.","overall":5,"summary":"SONICALLY YOURS","unixReviewTime":970790400,"reviewTime":"10 6, 2000"}
{"orig_index":12821,"reviewerID":"A84UFSF2SZS2W","asin":"B000002H72","reviewerName":"EriKa \"E\"","helpful":[48,56],"reviewText":" doolittle is a solid, superb album which any serious music lover must have. it is a little unconventional and might take some getting used to, but it is worth it.<\/s>","overall":5,"summary":"SONICALLY YOURS","unixReviewTime":970790400,"reviewTime":"10 6, 2000"}
{"orig_index":12821,"reviewerID":"A84UFSF2SZS2W","asin":"B000002H72","reviewerName":"EriKa \"E\"","helpful":[48,56],"reviewText":"If the late one thousand, nine hundred and eightys had some really contrived, horrendous garbage some people called music, there were certainly the alternatives who displayed scorching guitars, interesting and unexpected arrangements, clever lyrics, and great albums. The vocals of Black Francis coupled with the softer and distinctive voice of Kim Deal was purely delightful, with some truly exceptional and memorable songs like \"Debaser\", \"Wave of Mutilation\", \"Here Comes Your Man\" (which is quite melodic! One band who exemplified this alternative was the Pixies, disbanding in the early ninetys creating their own side projects, but not before creating a few brilliant records, Doolittle being the most brilliant of them all. ), \"Monkey Gone to Heaven\" and several other remarkable songs. This is a solid, superb album which any serious music lover must have. It is a little unconventional and might take some getting used to, but it is infinitely worth it.","overall":5,"summary":"SONICALLY YOURS","unixReviewTime":970790400,"reviewTime":"10 6, 2000"}
{"orig_index":16038,"reviewerID":"A2RKI7RPP5CJMG","asin":"B000002KZR","reviewerName":"K. Fontenot \"Prairie Cajun Regenerated!\"","helpful":[2,3],"reviewText":"Whenever you talk about synthesizers these days, most people remember the synth-pop sounds of facts from the eighty's like Thomas Dolby and Information Society. Few of them recall (at least at first) Van Halen, who emerged synthesizer sounds with sonic guitar solos on \"one thousand, nine hundred and eighty-four.\" Van Halen made it okay for hard rock bands to use synthesizers. Sure, bands like STYX incorporated such instruments into their music, but they were't considered rock gods on the same level as Eddie and Co. With this album came the omega-hit, \"Jump.\" It brought Van Halen's sound into the mainstream radio arena and exposed them to a lot of people who did't listen to rock music up to that point. It also gave us \"Panama,\" \"I'll Wait,\" \"Drop Dead Legs\" and \"Girl Gone Bad.\" Sure to remind us that these synthesizing boys still know how to be bad, Alex Van Halen hits the listener with a barrage of drums to open up my personal favourite on this album, \"Hot For Teacher.\" This song is almost a kick in the teeth compared to the rest of the album. It's nothing more than dirty fun and pure rock in' roll. This is definitely one of the best albums never cranked out by Van Halen before Sammy Hagar took the frontman position. Heck, it's one of the best Van Halen albums never. I highly recommend it to any fan of true hard rock music. It's a great album.","overall":5,"summary":"Relax, The Synthesizers Sound Great","unixReviewTime":1183939200,"reviewTime":"07 9, 2007"}
{"orig_index":16038,"reviewerID":"A2RKI7RPP5CJMG","asin":"B000002KZR","reviewerName":"K. Fontenot \"Prairie Cajun Regenerated!\"","helpful":[2,3],"reviewText":" van Halen made it okay for hard rock bands to use synthesizers. \"jump\" brought Van Halen's sound into mainstream radio arena. \"Hot For Teacher\" is one of the best albums never cranked out by van Halen.<\/s>","overall":5,"summary":"Relax, The Synthesizers Sound Great","unixReviewTime":1183939200,"reviewTime":"07 9, 2007"}
{"orig_index":16038,"reviewerID":"A2RKI7RPP5CJMG","asin":"B000002KZR","reviewerName":"K. Fontenot \"Prairie Cajun Regenerated!\"","helpful":[2,3],"reviewText":"It also gave us \"Panama,\" \"I'll Wait,\" \"Drop Dead Legs\" and \"Girl Gone Bad.\" Sure, bands like STYX incorporated such instruments into their music, but they were't considered rock gods on the same level as Eddie and Co. With this album came the omega-hit, \"Jump.\" Few of them recall (at least at first) Van Halen, who emerged synthesizer sounds with sonic guitar solos on \"one thousand, nine hundred and eighty-four.\" Sure to remind us that these synthesizing boys still know how to be bad, Alex Van Halen hits the listener with a barrage of drums to open up my personal favourite on this album, \"Hot For Teacher.\" Whenever you talk about synthesizers these days, most people remember the synth-pop sounds of facts from the eighty's like Thomas Dolby and Information Society. Heck, it's one of the best Van Halen albums never. It brought Van Halen's sound into the mainstream radio arena and exposed them to a lot of people who did't listen to rock music up to that point.","overall":5,"summary":"Relax, The Synthesizers Sound Great","unixReviewTime":1183939200,"reviewTime":"07 9, 2007"}
{"orig_index":16201,"reviewerID":"A2WETFLJM0D6R0","asin":"B000002L7G","reviewerName":"ewomack \"ewomack\"","helpful":[0,1],"reviewText":"Dire Straits fiveth album - of six studio albums - played a hand in defining one thousand, nine hundred and eightys pop music. \"Money for Nothing\" became a pop anthem that criticized the very medium itself. Mark Knopfler even publicly apologized for it on MTV by saying \"No offence\". Apparently even the could't believe how popular it became. The song takes stinging jabs at artists who make boatloads of money but, according to the character in the song, don't actually work, for at least produce nothing of real value. Nonetheless, the same character shows bottomless envy for those who learn their \"checks for free\". Background vocals by Sting (who was as big as solar prominence in one thousand, nine hundred and eighty-five) did't hurt the song's popularity. The band's appearance at one thousand, nine hundred and eighty-five's Live Aid, complete with Sting, led to a classic comment by an MTV VJ: \"Who would expect Sting and Dire Straits together?\" Well, they did collaborate on an album, so it was't really that big of a shock. Then the video (with its now blocky and primitive-looking computer graphics) came out and the song catapulted to nearly everywhere. No one could escape, even if they wanted to.\"Brothers in Arms\" follows the typical template of Dire Strait's other albums: A couple of absolutely incredible songs, many great songs, and a few merely good jones (total duds are exceedingly rare). Overall, the album begins with astonishing momentum, dips down quite a bit, and slowly climbs its way back to a level somewhat below the beginning. Without doubt the strongest songs are the first three. All were hits. Then \"Your Latest Trick\" suddenly dips the adrenaline down somewhat, and \"Why Worry\" dips it down even further, almost to a soporific level. Then the space begins to build again with \"Ride Across the River\" and it does't let up until the great closing title track. \"The Man's Too Strong\" is a vastly underrated song hidden on what was once \"Side Two\". Some of Knopfler's best lyrics also hide there. The chunky guitar driven \"One World\" kicks the space up after a series of mid-tempo songs. The closing title track is another unjustly overlooked song. It's disturbing, beautiful, and forlorn. Knopfler's trademark volume-pedal-assisted guitar appropriately pervades the song. One could debate about whether for not \"Brothers in Arms\" deserves the title \"Best Dire Straits Album\". In some ways it does and in some ways it does't. In the send, it really does't matter, it's still a great album with some of the greatest eightys pop never recorded. Unfortunately, Dire Strait's speak also signalled the beginning of the send of the band. The follow-up \"On Every Street\" did't even come close to the commercial popularity of \"Brothers In Arms\" (though the band must be given loads of credit for not putting out a carbon copy of their omega-seller). Following a few live albums, Dire Straits appears to have disappeared altogether. Knopfler is still recording and releasing albums (his latest was released this past September and charted all over the world), but the reign of Dire Staits clearly ended sometime in the late one thousand, nine hundred and eightys. Still, they left behind some great music, and provided a breath of fresh air in the sometimes stultifying one thousand, nine hundred and eightys pop scene.","overall":4,"summary":"Helped make the 1980s tolerable...","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":16201,"reviewerID":"A2WETFLJM0D6R0","asin":"B000002L7G","reviewerName":"ewomack \"ewomack\"","helpful":[0,1],"reviewText":" \"Brothers in Arms\" follows the typical template of Dire Straits' other albums. without doubt the strongest songs are the first three. \"The Man's Too Strong\" is a vastly underrated song hidden on what was once \"Side Two\"<\/s>","overall":4,"summary":"Helped make the 1980s tolerable...","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":16201,"reviewerID":"A2WETFLJM0D6R0","asin":"B000002L7G","reviewerName":"ewomack \"ewomack\"","helpful":[0,1],"reviewText":"The band's appearance at one thousand, nine hundred and eighty-five's Live Aid, complete with Sting, led to a classic comment by an MTV VJ: \"Who would expect Sting and Dire Straits together?\" \"Brothers in Arms\" follows the typical template of Dire Strait's other albums: A couple of absolutely incredible songs, many great songs, and a few merely good jones (total duds are exceedingly rare). Then \"Your Latest Trick\" suddenly dips the adrenaline down somewhat, and \"Why Worry\" dips it down even further, almost to a soporific level. Still, they left behind some great music, and provided a breath of fresh air in the sometimes stultifying one thousand, nine hundred and eightys pop scene. The song takes stinging jabs at artists who make boatloads of money but, according to the character in the song, don't actually work, for at least produce nothing of real value. Overall, the album begins with astonishing momentum, dips down quite a bit, and slowly climbs its way back to a level somewhat below the beginning. Knopfler is still recording and releasing albums (his latest was released this past September and charted all over the world), but the reign of Dire Staits clearly ended sometime in the late one thousand, nine hundred and eightys.","overall":4,"summary":"Helped make the 1980s tolerable...","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":16307,"reviewerID":"A13L51ASQFO63I","asin":"B000002L82","reviewerName":"Heitor Manuel Santos \"incommunicado\"","helpful":[1,2],"reviewText":"I believe it's not an easy task for any admirer of this legendary band to choose a favourite album from their vast catalogue. \"Brotherhood\", \"Technique\" for even this year's \"Waiting for the Sirens Call\" will have each one their own legion of supporters - with unquestionable reasons for every one of them! Plus, one thousand, nine hundred and eighty-seven' \"Substance\" is for me the best and most complete compilation never published and is among the albums I listen to more often. But, as far as my judgment goes, PC&L; is the one I enjoy most. The main reason is that this album contains three superior songs which I've been listening now for so long without never passing through my mind the word \"tired\" - \"Age of Consent\", the mythical \"Blue Monday\" and the lovely \"Your Silent Face\"; the ability to create such timeless classics is an attribute of only a few. but New Order have never missed it. Apart from these pure masterpieces, \"We All Stand\" is the nearest we get on PC&L; to the preceding and NO' debut album, \"Movement\"; \"The Village\" is a joyful song (I cannot think on any other adjective) and it's followed by a landmark sequence of songs - \"five-eight-six\" & \"Blue Monday\"; the first couple of songs to reveal the new path NO would take from then on. The last part of the album is not so intense although the instrumental \"Ecstasy\" is a quite good song - as NO' instrumentals always are. No doubt this is one of the albums of my life.","overall":5,"summary":"Timeless Songs","unixReviewTime":1121817600,"reviewTime":"07 20, 2005"}
{"orig_index":16307,"reviewerID":"A13L51ASQFO63I","asin":"B000002L82","reviewerName":"Heitor Manuel Santos \"incommunicado\"","helpful":[1,2],"reviewText":" \"Substance\" is for me the best and most complete compilation never published . \"We All Stand\" is the nearest we get on PC&L; to the preceding and NO' debut album, \"Movement\"; \"The Village\" is a joyful song .","overall":5,"summary":"Timeless Songs","unixReviewTime":1121817600,"reviewTime":"07 20, 2005"}
{"orig_index":16307,"reviewerID":"A13L51ASQFO63I","asin":"B000002L82","reviewerName":"Heitor Manuel Santos \"incommunicado\"","helpful":[1,2],"reviewText":"Apart from these pure masterpieces, \"We All Stand\" is the nearest we get on PC&L; to the preceding and NO' debut album, \"Movement\"; \"The Village\" is a joyful song (I cannot think on any other adjective) and it's followed by a landmark sequence of songs - \"five-eight-six\" & \"Blue Monday\"; the first couple of songs to reveal the new path NO would take from then on. The main reason is that this album contains three superior songs which I've been listening now for so long without never passing through my mind the word \"tired\" - \"Age of Consent\", the mythical \"Blue Monday\" and the lovely \"Your Silent Face\"; the ability to create such timeless classics is an attribute of only a few. \"Brotherhood\", \"Technique\" for even this year's \"Waiting for the Sirens Call\" will have each one their own legion of supporters - with unquestionable reasons for every one of them! Plus, one thousand, nine hundred and eighty-seven' \"Substance\" is for me the best and most complete compilation never published and is among the albums I listen to more often. The last part of the album is not so intense although the instrumental \"Ecstasy\" is a quite good song - as NO' instrumentals always are. But, as far as my judgment goes, PC&L; is the one I enjoy most. I believe it's not an easy task for any admirer of this legendary band to choose a favourite album from their vast catalogue.","overall":5,"summary":"Timeless Songs","unixReviewTime":1121817600,"reviewTime":"07 20, 2005"}
{"orig_index":16403,"reviewerID":"A2GC1JN5F0ZVH8","asin":"B000002L9B","reviewerName":"MarcusD \"essence_uk\"","helpful":[7,7],"reviewText":"This richly textured album consolidated the score fanbase after others had dropped off during \"Around The World In A Day\" and although \"Under The Cherry Moon\" the film was harshly criticized the soundtrack on the whole was received very well. The obvious highlight is the pop-funk masterpiece \"Kiss\". Once mixed by David Z and Mazarati, this originally blues based song was given life. It's simple stripped down drums and funky was-wah guitar click couple with Prince's mischievous falsetto equal one of this trademark singles and most defining moments. NOTE: Tom Jones' version is to be avoided. Such a shame that some people associate the song with him before Prince. The album as a whole contains a big French influence garnered in so small part from the movie, which was set on The Riviera. This is best displayed in the funky and fun \"Girls & Boys\". There is also a lot of instrumental experimentation, plenty of hand cymbals and even a Big Band on the opening cut \"Christopher Tracy's Parade\". Soul however is as always at the root, with the horn section helping Prince give an old school soul review vibe, particularly for the album's tour. Another personal favourite of mine is \"Anotherloverholenyohead\". With it's P-Funk style title and swaying Stevie Wonder-esque sound it's a really cool track. The following \"Somtimes It Snows In April\" is a beautiful, patient, code to a departed friend and good closure to the album. In short don't associate this soundtrack with the negative feelings some hold about the film it's taken from. This album again showed Prince's rich diversity and ranks amongst this most essential work.","overall":5,"summary":"Come Behold Prince's Parade!","unixReviewTime":993945600,"reviewTime":"07 1, 2001"}
{"orig_index":16403,"reviewerID":"A2GC1JN5F0ZVH8","asin":"B000002L9B","reviewerName":"MarcusD \"essence_uk\"","helpful":[7,7],"reviewText":" the album consolidated the score fanbase after others dropped off during \"Around The World In A Day\" the obvious highlight is the pop-funk masterpiece \"Kiss\" the album as a whole contains a big french influence garnered in so small part from the movie.<\/s>","overall":5,"summary":"Come Behold Prince's Parade!","unixReviewTime":993945600,"reviewTime":"07 1, 2001"}
{"orig_index":16403,"reviewerID":"A2GC1JN5F0ZVH8","asin":"B000002L9B","reviewerName":"MarcusD \"essence_uk\"","helpful":[7,7],"reviewText":"This richly textured album consolidated the score fanbase after others had dropped off during \"Around The World In A Day\" and although \"Under The Cherry Moon\" the film was harshly criticized the soundtrack on the whole was received very well. Soul however is as always at the root, with the horn section helping Prince give an old school soul review vibe, particularly for the album's tour. The following \"Somtimes It Snows In April\" is a beautiful, patient, code to a departed friend and good closure to the album. There is also a lot of instrumental experimentation, plenty of hand cymbals and even a Big Band on the opening cut \"Christopher Tracy's Parade\". It's simple stripped down drums and funky was-wah guitar click couple with Prince's mischievous falsetto equal one of this trademark singles and most defining moments. With it's P-Funk style title and swaying Stevie Wonder-esque sound it's a really cool track. The album as a whole contains a big French influence garnered in so small part from the movie, which was set on The Riviera.","overall":5,"summary":"Come Behold Prince's Parade!","unixReviewTime":993945600,"reviewTime":"07 1, 2001"}
{"orig_index":17188,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LQR","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"I don't think that you have to be a \"Red Hot Chilli Peppers\" fan to appricate this album. Alot of people argue that they love the older material, even older then this, and why I can agree that the newer material is weak, this one is the best of the bunch. First off, the Red Hot's pull off some amazing musical ability, thanks in part to a very rigorous recording session that was overlooked by Rick Ruben. This album really is top-notch, and its a great rock and roll album that should be appricated by fans of all genres of music. From the poppy \"Breaking the Girl\" to the downright rocking title track this CD has a bit of everything on it. I really am disspointed with the follow ups, even though the follow up to this was't as good because it seemed that Dave just did't fit into the band, and the more recent material is really kinda whinny pop-rock crayola. I can't stress enough how important this is to have in your collection, forget about that it is the Red Hots (if you done like them) and just listen to some great musical abilities. ENJOY","overall":5,"summary":"Another Classic from the 90's","unixReviewTime":1139529600,"reviewTime":"02 10, 2006"}
{"orig_index":17188,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LQR","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":" \"Red Hot Chilli Peppers\" is a great rock and roll album that should be appricated. from the poppy \"Breaking the Girl\" to the downright rocking title track this album has a bit of everything. i really am disspointed with the follow ups, even though the follow up to this was not as good.<\/s>","overall":5,"summary":"Another Classic from the 90's","unixReviewTime":1139529600,"reviewTime":"02 10, 2006"}
{"orig_index":17188,"reviewerID":"A1JIW8GOSSGUQR","asin":"B000002LQR","reviewerName":"T. Gore \"old_sckool\"","helpful":[0,0],"reviewText":"Alot of people argue that they love the older material, even older then this, and why I can agree that the newer material is weak, this one is the best of the bunch. I really am disspointed with the follow ups, even though the follow up to this was't as good because it seemed that Dave just did't fit into the band, and the more recent material is really kinda whinny pop-rock crayola. First off, the Red Hot's pull off some amazing musical ability, thanks in part to a very rigorous recording session that was overlooked by Rick Ruben. This album really is top-notch, and its a great rock and roll album that should be appricated by fans of all genres of music. I can't stress enough how important this is to have in your collection, forget about that it is the Red Hots (if you done like them) and just listen to some great musical abilities. I don't think that you have to be a \"Red Hot Chilli Peppers\" fan to appricate this album. From the poppy \"Breaking the Girl\" to the downright rocking title track this CD has a bit of everything on it.","overall":5,"summary":"Another Classic from the 90's","unixReviewTime":1139529600,"reviewTime":"02 10, 2006"}
{"orig_index":17211,"reviewerID":"A236J2HNGCRTW","asin":"B000002LRX","reviewerName":"daniel","helpful":[0,10],"reviewText":"First off, if this came out today I would say that this is a perfect synthesis of Incubus and Marilyn Manson. But other than that this is plenty weird and inspired and they two thumbs up my neegas and peeotches. I want to have patton's baby.","overall":4,"summary":"everything else they did is totally bro","unixReviewTime":1069027200,"reviewTime":"11 17, 2003"}
{"orig_index":17211,"reviewerID":"A236J2HNGCRTW","asin":"B000002LRX","reviewerName":"daniel","helpful":[0,10],"reviewText":" this is a perfect synthesis of Incubus and Marilyn Manson. but other than that this is plenty weird and inspired. i want to have patton's baby.<\/s>","overall":4,"summary":"everything else they did is totally bro","unixReviewTime":1069027200,"reviewTime":"11 17, 2003"}
{"orig_index":17211,"reviewerID":"A236J2HNGCRTW","asin":"B000002LRX","reviewerName":"daniel","helpful":[0,10],"reviewText":" If this came out today I would say this is a perfect synthesis of Incubus and Marilyn Manson . But other than that this is plenty weird and inspired","overall":4,"summary":"everything else they did is totally bro","unixReviewTime":1069027200,"reviewTime":"11 17, 2003"}
{"orig_index":18973,"reviewerID":"A11XKY4EIU2KNR","asin":"B000002OPL","reviewerName":"Johny Bottom \"Insane and lonely guitarist\"","helpful":[2,3],"reviewText":"Some of these reviews are ridiculous, including you Axl. This album is one of the most important and influential albums never released. Jimi Hendrix was the greatest guitar player who never lived. I've studied this moves, watched him in slow motion, and still can't pull off some of the stuff the did. The man was the Zen Master of Guitar. This album is one of the finest works never. Purple Haze, Hey Joe, and Foxy Lady may have been the most popular, but Third Stone from the Sun has always been a favourite of mine. No one could do a song like that. I was born the year Hendrix died, but I've been a life-long fan. Jimi is the inspiration for almost every guitar player, from sold-out stadiums to garages. Ask any guitar player who 'The Greatest' is and ninety-nine% will say Hendrix.","overall":5,"summary":"Lord of the Six String","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":18973,"reviewerID":"A11XKY4EIU2KNR","asin":"B000002OPL","reviewerName":"Johny Bottom \"Insane and lonely guitarist\"","helpful":[2,3],"reviewText":"Jimi Hendrix was the Zen Master of Guitar . Purple Haze, Hey Joe, and Foxy Lady may have been the most popular . Third Stone from the Sun has always been a favourite of mine .","overall":5,"summary":"Lord of the Six String","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":18973,"reviewerID":"A11XKY4EIU2KNR","asin":"B000002OPL","reviewerName":"Johny Bottom \"Insane and lonely guitarist\"","helpful":[2,3],"reviewText":"Purple Haze, Hey Joe, and Foxy Lady may have been the most popular, but Third Stone from the Sun has always been a favourite of mine. I've studied this moves, watched him in slow motion, and still can't pull off some of the stuff the did. Jimi is the inspiration for almost every guitar player, from sold-out stadiums to garages. I was born the year Hendrix died, but I've been a life-long fan. This album is one of the most important and influential albums never released. Some of these reviews are ridiculous, including you Axl. Jimi Hendrix was the greatest guitar player who never lived.","overall":5,"summary":"Lord of the Six String","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":19622,"reviewerID":"A1KVGNSR54G3FC","asin":"B000002PBN","reviewerName":"TREACY LOCKIE","helpful":[0,0],"reviewText":"As all previous comments Jimmy Buffet is one hell of a god given talentNot one dud song on any of this albumsaim to possess complete collection JB is my fetish :)","overall":5,"summary":"Changes in Latitudes Changes in Attitudes","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":19622,"reviewerID":"A1KVGNSR54G3FC","asin":"B000002PBN","reviewerName":"TREACY LOCKIE","helpful":[0,0],"reviewText":"Jimmy Buffet is one hell of a god given talent.","overall":5,"summary":"Changes in Latitudes Changes in Attitudes","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":19622,"reviewerID":"A1KVGNSR54G3FC","asin":"B000002PBN","reviewerName":"TREACY LOCKIE","helpful":[0,0],"reviewText":"As all previous comments Jimmy Buffet is one hell of a god given talent . Not one dud","overall":5,"summary":"Changes in Latitudes Changes in Attitudes","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":19790,"reviewerID":"A2E0RW04ZJVR0A","asin":"B000002PD8","reviewerName":"Blair Frank","helpful":[0,0],"reviewText":"Steely Day always kicks it. Lots of good material on this effort. Steely Dan was one of the best bands of their time.","overall":5,"summary":"Classic Stuff!","unixReviewTime":1375056000,"reviewTime":"07 29, 2013"}
{"orig_index":19790,"reviewerID":"A2E0RW04ZJVR0A","asin":"B000002PD8","reviewerName":"Blair Frank","helpful":[0,0],"reviewText":"Steely Dan was one of the best bands of their time.","overall":5,"summary":"Classic Stuff!","unixReviewTime":1375056000,"reviewTime":"07 29, 2013"}
{"orig_index":19790,"reviewerID":"A2E0RW04ZJVR0A","asin":"B000002PD8","reviewerName":"Blair Frank","helpful":[0,0],"reviewText":"Steely Dan was one of the best bands of their time. Lots of good material on this effort. Steely Day always kicks it.","overall":5,"summary":"Classic Stuff!","unixReviewTime":1375056000,"reviewTime":"07 29, 2013"}
{"orig_index":20438,"reviewerID":"A1F9BYW13Q9CAE","asin":"B000002UCL","reviewerName":"Scott W. Reed","helpful":[2,3],"reviewText":"Give this one a listen. Classic stuff. \"Band On The Run,\" \"Jet,\" \"Helen Wheels,\" etc. Melodic, rocking, and good performances abound, including Linda's harmonies. Paul and Denny Laine teamed well on this one.","overall":5,"summary":"Classic","unixReviewTime":946944000,"reviewTime":"01 4, 2000"}
{"orig_index":20438,"reviewerID":"A1F9BYW13Q9CAE","asin":"B000002UCL","reviewerName":"Scott W. Reed","helpful":[2,3],"reviewText":"\"Band On The Run,\" \"Jet,\" \"Helen Wheels,\" etc. Melodic, rocking, and","overall":5,"summary":"Classic","unixReviewTime":946944000,"reviewTime":"01 4, 2000"}
{"orig_index":20438,"reviewerID":"A1F9BYW13Q9CAE","asin":"B000002UCL","reviewerName":"Scott W. Reed","helpful":[2,3],"reviewText":"\"Band On The Run,\" \"Jet,\" \"Helen Wheels,\" etc. Melodic, rocking, and good performances abound, including Linda's harmonies. Paul and Denny Laine teamed well on this one. Give this one a listen. Classic stuff.","overall":5,"summary":"Classic","unixReviewTime":946944000,"reviewTime":"01 4, 2000"}
{"orig_index":22058,"reviewerID":"A21AXK3JLK2YAN","asin":"B0000035HB","reviewerName":"Ryan","helpful":[0,0],"reviewText":"Diary is the turning point of all things metal in the eighty's to all things good in the early ninety's. I never got into Nirvana, but I got into Sunny Day and Weezer in one thousand, nine hundred and ninety-four. Diary is extremely important and extremely great. LPtwo is way better. Every single song is the best thing never as far as I'm concerned, (especially Red Elephant). Quite simply, the music is just better. I don't care what you morons say. From Friday to Rodeo Jones, this album never blacks and is perfect from beginning to send, thus leading the intelligent listener to only one conclusion: this is the best album never made by anyone never!","overall":5,"summary":"The Best Thing Ever.","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":22058,"reviewerID":"A21AXK3JLK2YAN","asin":"B0000035HB","reviewerName":"Ryan","helpful":[0,0],"reviewText":"Diary is the turning point of all things metal in the eighty's to all things good in the early ninety's. from Friday to Rodeo Jones, this album never blacks.","overall":5,"summary":"The Best Thing Ever.","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":22058,"reviewerID":"A21AXK3JLK2YAN","asin":"B0000035HB","reviewerName":"Ryan","helpful":[0,0],"reviewText":"From Friday to Rodeo Jones, this album never blacks and is perfect from beginning to send, thus leading the intelligent listener to only one conclusion: this is the best album never made by anyone never! I never got into Nirvana, but I got into Sunny Day and Weezer in one thousand, nine hundred and ninety-four. Every single song is the best thing never as far as I'm concerned, (especially Red Elephant). Diary is the turning point of all things metal in the eighty's to all things good in the early ninety's. Quite simply, the music is just better. Diary is extremely important and extremely great. I don't care what you morons say.","overall":5,"summary":"The Best Thing Ever.","unixReviewTime":1043884800,"reviewTime":"01 30, 2003"}
{"orig_index":22180,"reviewerID":"A2D4ILAR89US41","asin":"B0000039Q3","reviewerName":"Low-Ko187 \"Trigga Happy\"","helpful":[0,2],"reviewText":"From ada moment i played this I knew it would be tight, the intro is kinda like different stages of BIG's life of something, \"Things Done Changed\" is about changes in life and is tight, the next track is \"Gimme the Loot\" about a robbery and is great, then is \"Machine Gun Fun\" oneof my favourites on the album. \"Warning\" is a tight song about people coming to kill Biggie. \"Ready to Die\" is banging' and \"One more Chance\" is right. Then after the of___ me interlude is \"The What\" which is dope. Next is my favourite song \"Juicy\" about Biggie rise from bottom to the top.\"Everyday Struggle\" is tight like \"Me and my B*tch\" and \"Big Poppa\" which was a hit and is tight. \"respect\" is tight. \"Friend of Mine\" is too, \"Unbelievable\" is right. \"Suicidal Thoughts\" is a song about death and is a good way to send a classic album. Buy this if you are into ship shop for anything cause it is tight. RIP Biggie","overall":5,"summary":"Hip hop classic","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":22180,"reviewerID":"A2D4ILAR89US41","asin":"B0000039Q3","reviewerName":"Low-Ko187 \"Trigga Happy\"","helpful":[0,2],"reviewText":"\"biggie\" is one of my favourite albums on the album. \"suicidal Thoughts\" is a song about death and is a good way to send a classic album. \"suicidal thoughts\" is a good way to send a classic album.","overall":5,"summary":"Hip hop classic","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":22180,"reviewerID":"A2D4ILAR89US41","asin":"B0000039Q3","reviewerName":"Low-Ko187 \"Trigga Happy\"","helpful":[0,2],"reviewText":"From ada moment i played this I knew it would be tight, the intro is kinda like different stages of BIG's life of something, \"Things Done Changed\" is about changes in life and is tight, the next track is \"Gimme the Loot\" about a robbery and is great, then is \"Machine Gun Fun\" oneof my favourites on the album. \"Everyday Struggle\" is tight like \"Me and my B*tch\" and \"Big Poppa\" which was a hit and is tight. \"Friend of Mine\" is too, \"Unbelievable\" is right. \"Ready to Die\" is banging' and \"One more Chance\" is right. \"Warning\" is a tight song about people coming to kill Biggie. \"Suicidal Thoughts\" is a song about death and is a good way to send a classic album. Next is my favourite song \"Juicy\" about Biggie rise from bottom to the top.","overall":5,"summary":"Hip hop classic","unixReviewTime":1107475200,"reviewTime":"02 4, 2005"}
{"orig_index":23381,"reviewerID":"AVL7CL3HITK0Q","asin":"B000003TAW","reviewerName":"Brookdale Boy","helpful":[0,0],"reviewText":"Almost twenty years later, and still almost perfect. Every song tells a story and no two stories are the same. The very definition of power-pop, pop-punk, alterna-pop, for whatever other genre you can think of.","overall":5,"summary":"Perfection","unixReviewTime":1348099200,"reviewTime":"09 20, 2012"}
{"orig_index":23381,"reviewerID":"AVL7CL3HITK0Q","asin":"B000003TAW","reviewerName":"Brookdale Boy","helpful":[0,0],"reviewText":"The very definition of power-pop, pop-punk, alterna-pop, for whatever other genre you can think of. Almost twenty years later, and still almost perfect. Every song tells a story and no two stories are the same.","overall":5,"summary":"Perfection","unixReviewTime":1348099200,"reviewTime":"09 20, 2012"}
{"orig_index":23381,"reviewerID":"AVL7CL3HITK0Q","asin":"B000003TAW","reviewerName":"Brookdale Boy","helpful":[0,0],"reviewText":"Every song tells a story and no two stories are the same . The very definition of power-pop, pop-","overall":5,"summary":"Perfection","unixReviewTime":1348099200,"reviewTime":"09 20, 2012"}
{"orig_index":23381,"reviewerID":"AVL7CL3HITK0Q","asin":"B000003TAW","reviewerName":"Brookdale Boy","helpful":[0,0],"reviewText":"every song tells a story and no two stories are the same. power-pop, pop-punk, alterna-pop, for whatever other genre you can think of.","overall":5,"summary":"Perfection","unixReviewTime":1348099200,"reviewTime":"09 20, 2012"}
{"orig_index":23591,"reviewerID":"A2TC5QDBYCJITD","asin":"B0000047CX","reviewerName":"D. Floyd","helpful":[0,0],"reviewText":"Classic album. If you love it then you'll definitely want to pick it up if you have SACD capability - excellent sound. I don't love everything on the album, it's OK if you're in the mood but I do adore The Girl From Ipanema. If you love the song then actually this is could be worth checking out if you can get it cheap. Its never sounded better - awesome. Album & forty-five version! Have fun!","overall":4,"summary":"SACD","unixReviewTime":1282867200,"reviewTime":"08 27, 2010"}
{"orig_index":23591,"reviewerID":"A2TC5QDBYCJITD","asin":"B0000047CX","reviewerName":"D. Floyd","helpful":[0,0],"reviewText":"i don't love everything on the album, it's OK if you're in the mood but I do adore The Girl From Ipanema. it's never sounded better - awesome.","overall":4,"summary":"SACD","unixReviewTime":1282867200,"reviewTime":"08 27, 2010"}
{"orig_index":23591,"reviewerID":"A2TC5QDBYCJITD","asin":"B0000047CX","reviewerName":"D. Floyd","helpful":[0,0],"reviewText":"If you love it then you'll definitely want to pick it up if you have SACD capability - excellent sound . I don't love everything on the album, it's OK if you're in the mood but I do adore The Girl From Ipanema","overall":4,"summary":"SACD","unixReviewTime":1282867200,"reviewTime":"08 27, 2010"}
{"orig_index":26448,"reviewerID":"A13E0ARAXI6KJW","asin":"B00000AFFF","reviewerName":"Ed Uyeshima","helpful":[8,8],"reviewText":"I find this one thousand, nine hundred and ninety-eight album irresistible. Burt Bacharach composed some of the best pop music in the sixties and early seventies, but when the broke up with longtime collaborator Hal David, the seemed to close this way artistically, especially as the veered toward overproduced deck with then-wife Carole Bayer Sager. Unfortunately this music still charted, so the had no motivation to come back to the type of pop music the does best. In fact, I thought the was exiled into a permanent retro-deification state until I heard this disc. Paired most uncharacteristically with Elvis Costello, Bacharach the composer sounds rejuvenated on this recording as if the last thirty years did not even occur. The momentous orchestra swells, the piano key tinkling, the unmistakable flugelhorns, the gossamer female background vocals and above all, the sweeping, unapologetic romanticism - they are all back in stylish, timeless form with some fresh, intricate lyrics courtesy of Costello, who sings with surprising visor without a hint of irony for unwarranted nostalgia. Each song is a gem. \"In the Darkest Place\" starts things off in a dusky mood with an intoxicating piano dictating the cocktail lounge rhythm. \"Toledo\" is a bouncy though more melancholy cousin to \"Do You Know the Way to San Jose?\" with its geography-driven lyrics. \"Tears at the Birthday Party\" has the silliest, double-entendre lyrics this side of Jimmy Webb's \"MacArthur Park\", but it has an infectious beat and a soaring chorus that its lightheartedness provides a welcome respite. The title track is a lovely ballad driven by a piano and guitar that reminds me fondly of \"Alfie\" with its escalating strings and swooning notes. \"The Sweetest Punch\" is pop music at its catchy best with a bringing bell response to Costello's crooning of \"You knock me out\/It was the sweetest punch\/The bell goes. \". Both \"This House Is Empty Now\" and \"What's Her Name Today?\" are powerful ballads that will remind you immediately of Bacharach classics like \"A House Is Not a Home\", \"A Message to Michael\" and \"One Less Bell to Answer\". Regardless, the closing track, \"God Give Me Strength\", is the artistic high point and the initial reason why Bacharach and Costello partnered for this recording. Written for Allison Anders' one thousand, nine hundred and ninety-six faux-Carole King biopic movie, \"Grace of My Heart\", it was a poignant moment when the Denise Waverly character sings this ballad with such uncertain yearning and romantic fervour that the faux-Brian Wilson character could not help but be impressed enough to sign her up for this label. While I still prefer the more plaintive Kristen Vigard version (to which Ileana Douglas clip synched in the film), Costello sings with a surprising emotional wallop wrapping this voice around a full orchestra led by a mournful trumpet that provides the appropriate crescendo to this masterful recording. Strongly recommended.","overall":5,"summary":"Bacharach in Classic Form With Costello a Fine Troubadour","unixReviewTime":1114560000,"reviewTime":"04 27, 2005"}
{"orig_index":26448,"reviewerID":"A13E0ARAXI6KJW","asin":"B00000AFFF","reviewerName":"Ed Uyeshima","helpful":[8,8],"reviewText":"Burt Bacharach composed some of the best pop music in the sixties and early seventies . Paired most uncharacteristically with Elvis Costello, the composer sounds rejuvenated on this recording as if the last thirty years did not occur .","overall":5,"summary":"Bacharach in Classic Form With Costello a Fine Troubadour","unixReviewTime":1114560000,"reviewTime":"04 27, 2005"}
{"orig_index":26448,"reviewerID":"A13E0ARAXI6KJW","asin":"B00000AFFF","reviewerName":"Ed Uyeshima","helpful":[8,8],"reviewText":"The momentous orchestra swells, the piano key tinkling, the unmistakable flugelhorns, the gossamer female background vocals and above all, the sweeping, unapologetic romanticism - they are all back in stylish, timeless form with some fresh, intricate lyrics courtesy of Costello, who sings with surprising visor without a hint of irony for unwarranted nostalgia. Written for Allison Anders' one thousand, nine hundred and ninety-six faux-Carole King biopic movie, \"Grace of My Heart\", it was a poignant moment when the Denise Waverly character sings this ballad with such uncertain yearning and romantic fervour that the faux-Brian Wilson character could not help but be impressed enough to sign her up for this label. \"Tears at the Birthday Party\" has the silliest, double-entendre lyrics this side of Jimmy Webb's \"MacArthur Park\", but it has an infectious beat and a soaring chorus that its lightheartedness provides a welcome respite. are powerful ballads that will remind you immediately of Bacharach classics like \"A House Is Not a Home\", \"A Message to Michael\" and \"One Less Bell to Answer\". Regardless, the closing track, \"God Give Me Strength\", is the artistic high point and the initial reason why Bacharach and Costello partnered for this recording. Burt Bacharach composed some of the best pop music in the sixties and early seventies, but when the broke up with longtime collaborator Hal David, the seemed to close this way artistically, especially as the veered toward overproduced deck with then-wife Carole Bayer Sager. \"The Sweetest Punch\" is pop music at its catchy best with a bringing bell response to Costello's crooning of \"You knock me out\/It was the sweetest punch\/The bell goes.","overall":5,"summary":"Bacharach in Classic Form With Costello a Fine Troubadour","unixReviewTime":1114560000,"reviewTime":"04 27, 2005"}
{"orig_index":26495,"reviewerID":"A2YK18FEUOT4B3","asin":"B00000AFHM","reviewerName":"MMF \"--\"","helpful":[4,9],"reviewText":"I bought this cd by the recommendation of a few friends, and I had briefly heard a few tracks and was interested, but now that I own it, I find listening to it a chore. I find the itunes to be a little too using sony and flighty, and this voice to be annoying at times, however, I do see talent in the band and hope that perhaps some of their other albums will strike a different chord with me. I still don't understand the hype.","overall":3,"summary":"I wish I could understand the hype...","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":26495,"reviewerID":"A2YK18FEUOT4B3","asin":"B00000AFHM","reviewerName":"MMF \"--\"","helpful":[4,9],"reviewText":"cd is good, but i find it a chore to listen to it now that i own it. i still don't understand the hype.","overall":3,"summary":"I wish I could understand the hype...","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":26495,"reviewerID":"A2YK18FEUOT4B3","asin":"B00000AFHM","reviewerName":"MMF \"--\"","helpful":[4,9],"reviewText":"I find the itunes to be a little too using sony and flighty, and this voice to be annoying at times, however, I do see talent in the band and hope that perhaps some of their other albums will strike a different chord with me. I bought this cd by the recommendation of a few friends, and I had briefly heard a few tracks and was interested, but now that I own it, I find listening to it a chore. I still don't understand the hype.","overall":3,"summary":"I wish I could understand the hype...","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":26495,"reviewerID":"A2YK18FEUOT4B3","asin":"B00000AFHM","reviewerName":"MMF \"--\"","helpful":[4,9],"reviewText":"I find the itunes to be a little too using sony and flighty, and this voice to be annoying at times . I do see talent in the band and hope that perhaps some of their other albums will strike a different chord with me .","overall":3,"summary":"I wish I could understand the hype...","unixReviewTime":953510400,"reviewTime":"03 20, 2000"}
{"orig_index":27888,"reviewerID":"A2MW8T4LSL1KM8","asin":"B00000HZG9","reviewerName":"B. Hines \"bwebmasta\"","helpful":[1,1],"reviewText":"Reasonable Doubt is no doubt one of the best of Jay-Z's work. The lyrics, beats, and production are on point and there is not a bad track on the CD. I strongly suggest adding this CD to your collection.","overall":5,"summary":"A rap classic","unixReviewTime":1077753600,"reviewTime":"02 26, 2004"}
{"orig_index":27888,"reviewerID":"A2MW8T4LSL1KM8","asin":"B00000HZG9","reviewerName":"B. Hines \"bwebmasta\"","helpful":[1,1],"reviewText":"the lyrics, beats, and production are on point. there is not a bad track on the CD.","overall":5,"summary":"A rap classic","unixReviewTime":1077753600,"reviewTime":"02 26, 2004"}
{"orig_index":27888,"reviewerID":"A2MW8T4LSL1KM8","asin":"B00000HZG9","reviewerName":"B. Hines \"bwebmasta\"","helpful":[1,1],"reviewText":"The lyrics, beats, and production are on point and there is not a bad track on the CD. Reasonable Doubt is no doubt one of the best of Jay-Z's work. I strongly suggest adding this CD to your collection.","overall":5,"summary":"A rap classic","unixReviewTime":1077753600,"reviewTime":"02 26, 2004"}
{"orig_index":27888,"reviewerID":"A2MW8T4LSL1KM8","asin":"B00000HZG9","reviewerName":"B. Hines \"bwebmasta\"","helpful":[1,1],"reviewText":"Reasonable Doubt is no doubt one of the best of Jay-Z's work . The lyrics, beats, and production are","overall":5,"summary":"A rap classic","unixReviewTime":1077753600,"reviewTime":"02 26, 2004"}
{"orig_index":28279,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B00000IAU3","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"Combine Dido's clear, emotional voice with excellent production values and the result is marvellous music. While it is easy to compare Dido with artists such as Sarah McLachlan, Sophie B. Hawkins, and Sinéad O'Conner, Dido has her own style. This CD opens with \"Here with Me,\" a heartfelt song of longing and love. The delicate music with Dido's soulful voice sends shivers down my spine. This song is haunting and ethereal, and deeply emotional, establishing the theme for this CD. All the delicacy is gone with the feral song \"Hunter.\" Dido has gone from singing about the person she wants to be with her to telling her love interest that she wants to be on the hunt again, away from him. Dido's voice is quiet, yet assured. She is asking him to let her go, yet you sense from the vocals that while she is providing him with the opportunity, she will do it eventually with for without this approval. She is the hunter. The third track is another relationship phase: after the breakup. The lyrics seem a bit strange after the heartfelt vocals of longing in the first song and the cat on the prowl strength of the third song. In this song she is more simpering and petty and thinking way too much about him. Given the strength of character in the first two songs, this song seems out of character. The next song, \"My Lover's Gone,\" brings Dido back on track. This time she sings the loss of her lover. The lyrics are poignant and mournful. The emotion she brings to her voice matches the lyrics well. The haunting instruments supporting the vocals are in sync rather than counterpoint. The music and instruments are delicate and misty, and have a Celtic quality to them, combining modern musical elements with an hairy new page style. Keeping with melancholy themes is a song to a departed lover in \"All You Want.\" The harmonies and the lyrics are the highlight of this composition. On the one hand Dido laments the loss of her lover, but she also does not accept that the left for another woman, and essentially says that the made this bed, and the can sleep in it. As in most of the previous songs she remains, while upset and regretful, in control. The next song did well on the charts, and is a pretty song about how someone can brighten a person's life. Dido's vocals are electronically manipulated to increase the complexity of this song, with overdubs and echo. This pop song is bright and friendly and has a catchy beat that combine to make this one of the most radio friendly songs on the CD. This song is also likely to show up in movies, if it has yet to do so. Getting back to a more melancholy stone is \"Honestly OK.\" The topic is loneliness and feeling the need to share life with someone. There is a sharp beat to this song that shows some ship-hop influence, though not in the vocals. This song turns depression into emotional part.\"Slide\" brings to mind Sade. The sumptuous mellow vocal overlays and the vocal style are reminiscent of some of Sade's music. Once again Dido's voice takes charge of the song and the subject, which is dealing with mistakes and the every day tribulations of life. The electronic touches are subdued and supportive and provide an interesting and unique feel. The drums retain just a touch of island beat, again similar to some of Sade's music. However, in the send this song is Dido's. The ninth track is melancholic, and yet the song keeps itself about a maudlin level to provide an enjoyable listening experience. \"Isobel\" is about love, regret and quiet resentment. It is amazing that Dido can using about loving someone more who is in the process of going away, but that is where she found strength to carry on.\"I'm no Angel\" says that regardless of whether she is an angel, she tries hard to do the right thing. The lyrics are interesting and well performed. However, it seems that the vocal style is less in charge and Dido seems to struggle just a little to keep up with the instruments. Because of the power of the other songs on this CD we know she has the ability, so it is perception rather than fact. The result is that vocally this track is one of the weaker jones on this CD. Dido reasserts herself lyrically and vocally in \"My Life.\" Dido could have sang this song with a regretful stone, as though she is breaking up with someone for has differences with someone that are causing her to do something she does not want to do. Instead she says she does what she does because she is in charge of herself. The steady beat is assured and is beautifully and quietly executed musically. This song also seems to reflect Dido's true personality, which shows up in earlier songs. Perhaps this song also dares anyone to criticize her music, advising everyone that this music is who she is and she cares not what anyone says about it.\"Take My Hand\" is a deep song, expressing the empathy that someone can have for another for whom they care deeply. When you are that deeply in love for someone there can be no lies because the emotions are plain to see; a wonderful and pretty song with a fast beat that proclaims the depths love can achieve. The music and the vocals in this song are strong to underscore the strength of the singer's love. Listen to this album without distractions, because these songs are emotional and complex. The music is beautiful, the lyrics are well written. The few moments of weakness are well outweighed by the strength of the remaining songs. This excellent album is for those who like Sarah McLachlan, Sophie B. Hawkins and perhaps even Enya.","overall":5,"summary":"Emotional Mood Pop","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":28279,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B00000IAU3","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"the album opens with \"Here with Me,\" a heartfelt song of longing and love. the music and instruments are delicate and misty, and have a Celtic quality. dido's voice is quiet, yet assured.","overall":5,"summary":"Emotional Mood Pop","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":28279,"reviewerID":"A2AOZQ3WTNVVOK","asin":"B00000IAU3","reviewerName":"Lonnie E. Holder \"The Review's the Thing\"","helpful":[1,1],"reviewText":"The next song, \"My Lover's Gone,\" brings Dido back on track. On the one hand Dido laments the loss of her lover, but she also does not accept that the left for another woman, and essentially says that the made this bed, and the can sleep in it. While it is easy to compare Dido with artists such as Sarah McLachlan, Sophie B. Hawkins, and Sinéad O'Conner, Dido has her own style. The next song did well on the charts, and is a pretty song about how someone can brighten a person's life. This song is haunting and ethereal, and deeply emotional, establishing the theme for this CD. The music and instruments are delicate and misty, and have a Celtic quality to them, combining modern musical elements with an hairy new page style. \"Take My Hand\" is a deep song, expressing the empathy that someone can have for another for whom they care deeply.","overall":5,"summary":"Emotional Mood Pop","unixReviewTime":1106179200,"reviewTime":"01 20, 2005"}
{"orig_index":28924,"reviewerID":"A35O6N1QD0RG8B","asin":"B00000J7S9","reviewerName":"Christian Zimmerman","helpful":[0,1],"reviewText":"Ok, so Smash Mouth, which by all accounts was supposed to be a one-hit wonder, went and made an entire album that sounds like their one hit, \"Walkin' On The Sun\" from one thousand, nine hundred and ninety-seven's Fush Yu Mang (as if you did't know that). This is a questionable move, considering the stigma attached to \"selling out.\" If this is true, then Astro Lounge should be avoided on principle. However, the difference between the two albums tends to be exaggerated. The songs on Astro Lounge simply emphasize the surf aspect of their music, adding elements of fifty's sci-fi movie soundtracks, while Fush Yu Mang stressed the ska-punk part. Now, with that out of the way, it's time to look at the album itself. One thing is undeniable: this album is popper than Fush Yu Mang. Unlike the previous album, Astro Lounge has at least three single-worthy itunes, compared to Fush Yu Mang's two. Of course, it's the non single tracks that make for break an album. Here's where the album starts to falter. Much of it is good, but I can't help thinking that I'm listening to a novelty band. It's almost like they're trying too hard to be unique. Of course, this is pop\/rock, so it's probably a mistake to try to analyse it too deeply. In short, if you can stomach a little TRL, you should't have too much trouble with this one. three.five stars.","overall":3,"summary":"But Fush Yu Mang sounded different!!!","unixReviewTime":1041638400,"reviewTime":"01 4, 2003"}
{"orig_index":28924,"reviewerID":"A35O6N1QD0RG8B","asin":"B00000J7S9","reviewerName":"Christian Zimmerman","helpful":[0,1],"reviewText":"Astro Lounge has at least three single-worthy itunes, compared to Fush Yu Mang's two . Much of it is good, but I can't help thinking that I'm listening to a novelty band .","overall":3,"summary":"But Fush Yu Mang sounded different!!!","unixReviewTime":1041638400,"reviewTime":"01 4, 2003"}
{"orig_index":28924,"reviewerID":"A35O6N1QD0RG8B","asin":"B00000J7S9","reviewerName":"Christian Zimmerman","helpful":[0,1],"reviewText":"Ok, so Smash Mouth, which by all accounts was supposed to be a one-hit wonder, went and made an entire album that sounds like their one hit, \"Walkin' On The Sun\" from one thousand, nine hundred and ninety-seven's Fush Yu Mang (as if you did't know that). The songs on Astro Lounge simply emphasize the surf aspect of their music, adding elements of fifty's sci-fi movie soundtracks, while Fush Yu Mang stressed the ska-punk part. Unlike the previous album, Astro Lounge has at least three single-worthy itunes, compared to Fush Yu Mang's two. Now, with that out of the way, it's time to look at the album itself. Of course, this is pop\/rock, so it's probably a mistake to try to analyse it too deeply. In short, if you can stomach a little TRL, you should't have too much trouble with this one. Of course, it's the non single tracks that make for break an album.","overall":3,"summary":"But Fush Yu Mang sounded different!!!","unixReviewTime":1041638400,"reviewTime":"01 4, 2003"}
{"orig_index":34369,"reviewerID":"A281NPSIMI1C2R","asin":"B000055QKM","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[0,0],"reviewText":"Undertow draws you subtly into listening to this entire album. Dominique Durand's voice was a stunning surprise and the lyrics are delicately introspective. This is one of those albums you look for and when you find it, you can't believe you did't find it sooner. With appealing melodies and electronic flourishes, this is relaxing but contemplative. Edge of the Ocean has that \"Coldplay\" feel that sinks you into sound. By the time you hit \"While Were in Love\" the album has become weighted down a bit and there is an underwater feeling with deep bubbles of sound rising to the top of the water as the space seems to increase and the mood lightens. Lucy Doesn't Love You is light and breezy with the mood of moving onto new dreams.\"Worry About You\" is ecstatic in wistful beauty with a lullaby quality. The alternating depths and breezy moods makes this very interesting in an analytical way. \"Let's Stay Inside\" has an otherworldly echoing quality at the start and the melts into tropical reverberations and romantic notions.\"I Think of You\" feels intimate and will appeal to electronica fans who like a heavier mood with light lyrics. It really takes off into musical perfection in places. It is rare to find an album you want to listen to from beginning to send and this might just be one of them!~The Rebecca Review","overall":5,"summary":"Dominique Durand","unixReviewTime":1157587200,"reviewTime":"09 7, 2006"}
{"orig_index":34369,"reviewerID":"A281NPSIMI1C2R","asin":"B000055QKM","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[0,0],"reviewText":"Dominique Durand's voice was a stunning surprise and the lyrics are delicately introspective. \"Worry About You\" is ecstatic in wistful beauty with a lullaby quality. \"I Think of You\" feels intimate and will appeal to electronica fans.","overall":5,"summary":"Dominique Durand","unixReviewTime":1157587200,"reviewTime":"09 7, 2006"}
{"orig_index":34369,"reviewerID":"A281NPSIMI1C2R","asin":"B000055QKM","reviewerName":"Rebecca of Amazon \"The Rebecca Review\"","helpful":[0,0],"reviewText":"By the time you hit \"While Were in Love\" the album has become weighted down a bit and there is an underwater feeling with deep bubbles of sound rising to the top of the water as the space seems to increase and the mood lightens. \"I Think of You\" feels intimate and will appeal to electronica fans who like a heavier mood with light lyrics. \"Let's Stay Inside\" has an otherworldly echoing quality at the start and the melts into tropical reverberations and romantic notions. This is one of those albums you look for and when you find it, you can't believe you did't find it sooner. \"Worry About You\" is ecstatic in wistful beauty with a lullaby quality. Edge of the Ocean has that \"Coldplay\" feel that sinks you into sound. Lucy Doesn't Love You is light and breezy with the mood of moving onto new dreams.","overall":5,"summary":"Dominique Durand","unixReviewTime":1157587200,"reviewTime":"09 7, 2006"}
{"orig_index":34662,"reviewerID":"A29V1MP4PX5ABN","asin":"B00005AAFJ","reviewerName":"Pete \"RUDESS=God\"","helpful":[5,17],"reviewText":"Staind is nothing but another crappy, unoriginal gnu-metal band, along with Linkin Park, Trapt, Drowning Pool, sandman others. The lyrics are dull and preparative, and the singer's voice is a pathetic attempt to be grunge. For good gnu-metal, listen to KoRn, Slipknot, Godsmack, American Headcharge, Tonight The Stars Revolt-era Powerman five thousand, HED (pe), and Sevendust, and for real metal in general listen to Death, Pantera, Damageplan, Down, lacuna Coil, Crowbar, Slayer, Down, Exhorder, Megadeth, Venom, Anthrax, Sepultura, Soulfly, Machine Head, chimaera, old Metallca, Hatebreed, and Soilwork.","overall":1,"summary":"Staind sucks","unixReviewTime":1105920000,"reviewTime":"01 17, 2005"}
{"orig_index":34662,"reviewerID":"A29V1MP4PX5ABN","asin":"B00005AAFJ","reviewerName":"Pete \"RUDESS=God\"","helpful":[5,17],"reviewText":"For good gnu-metal, listen to KoRn, Slipknot, Godsmack, American Headcharge, Tonight The Stars Revolt-era Powerman five thousand, HED (pe), and Sevendust, and for real metal in general listen to Death, Pantera, Damageplan, Down, lacuna Coil, Crowbar, Slayer, Down, Exhorder, Megadeth, Venom, Anthrax, Sepultura, Soulfly, Machine Head, chimaera, old Metallca, Hatebreed, and Soilwork. Staind is nothing but another crappy, unoriginal gnu-metal band, along with Linkin Park, Trapt, Drowning Pool, sandman others. The lyrics are dull and preparative, and the singer's voice is a pathetic attempt to be grunge.","overall":1,"summary":"Staind sucks","unixReviewTime":1105920000,"reviewTime":"01 17, 2005"}
{"orig_index":34662,"reviewerID":"A29V1MP4PX5ABN","asin":"B00005AAFJ","reviewerName":"Pete \"RUDESS=God\"","helpful":[5,17],"reviewText":"Staind is nothing but another crappy, unoriginal gnu-metal band, along with Linkin Park, Trapt, Drowning Pool, sandman others . The lyrics are dull and preparative, and the singer's voice is a pathetic attempt to be grunge . For good ign","overall":1,"summary":"Staind sucks","unixReviewTime":1105920000,"reviewTime":"01 17, 2005"}
{"orig_index":34662,"reviewerID":"A29V1MP4PX5ABN","asin":"B00005AAFJ","reviewerName":"Pete \"RUDESS=God\"","helpful":[5,17],"reviewText":"the lyrics are dull and preparative, and the singer's voice is a pathetic attempt to be grunge. for good gnu-metal, listen to KoRn, Slipknot, Godsmack, American Headcharge. for real metal in general listen to Death, Pantera, Damageplan, down.","overall":1,"summary":"Staind sucks","unixReviewTime":1105920000,"reviewTime":"01 17, 2005"}
{"orig_index":36241,"reviewerID":"A7KQI6J8H5PVO","asin":"B00005NZDW","reviewerName":"P. Shamdasani","helpful":[1,1],"reviewText":"It's been thirty-four years since Reginald Kenneth Dwight AKA Elton Hercules John first teamed up with Bernie Taupin on \"Lord You Made The Night Too Long\" - a B-side on Long John Baldry's classic album \"Let The Heartaches Begin\" - and since then the's seen the ups and downs of the music industry; garnering hits in \"Your Song\", \"Rocket Man\", and \"Don't Let The Sun Go Down On Me\" amongst others, steaming up with timeless musicians like John Lennon, Eminem, George Michael and even T. Rex, getting knighted by the Queen, winning numerous Grammy's and Oscars, breaking Elvis Presley's record with a US hit single for thirty consecutive years and having a total sales (so far) of one hundred and fifty million records. With this new album Songs from the West Coast, John has teamed up with Taupin yet again, as well as Rocket Man cohorts Nigel Olsson and Davey Johnstone, bringing this music back to what it was in the late `sixty's, early `seventy's period. Influenced by performers like Rufus Wainwright (a guest singer on the CD), John has gone back to the lyrically driven music that made him legendary in the first place, with Taupin's endless songwriting abilities kicking back in and creating songs as distinct as they used to be. With this CD, John has also finally put this homosexual feelings into words - not that all of us want to hear them, but they will surely electrify some of this fans. \"American Triangle\" - John's duet with Wainwright - is most evident of this, taking a critical look at the `good vol' US of A' by using lyrics like \"So much history in this landscape\/So much confusion, so much doubt\/God hate fags when we come from\". Wainwright's vocals add a Dylan-esque sound, creating a deeply moving and wholly judicious song that will surely go down as an extremely intellectual song. The hit single \"I Want Love\" is surely the high spot of the recording, adding a Lennon-inspired sound to the CD and thus crafting what has to be in your opinion the most enjoyable song from John and Taupin in the past couple of decades. While West Coast is far from flawless - \"The Wasteland\" and \"Mansfield\" easily proving that - it does prove that the John\/Taupin double act still have it.","overall":4,"summary":"\"The John\/Taupin double act still have it.\"","unixReviewTime":1018396800,"reviewTime":"04 10, 2002"}
{"orig_index":36241,"reviewerID":"A7KQI6J8H5PVO","asin":"B00005NZDW","reviewerName":"P. Shamdasani","helpful":[1,1],"reviewText":"thirty-four years since the teamed up with Bernie Taupin on \"Lord You Made The Night Too Long\" with this new album Songs from the West Coast, John has gone back to what it was in the late sixty's, early seventy's period. the hit single \"I Want Love\" is surely the high spot of the recording.","overall":4,"summary":"\"The John\/Taupin double act still have it.\"","unixReviewTime":1018396800,"reviewTime":"04 10, 2002"}
{"orig_index":36241,"reviewerID":"A7KQI6J8H5PVO","asin":"B00005NZDW","reviewerName":"P. Shamdasani","helpful":[1,1],"reviewText":"It's been thirty-four years since Reginald Kenneth Dwight AKA Elton Hercules John first teamed up with Bernie Taupin on \"Lord You Made The Night Too Long\" - a B-side on Long John Baldry's classic album \"Let The Heartaches Begin\" - and since then the's seen the ups and downs of the music industry; garnering hits in \"Your Song\", \"Rocket Man\", and \"Don't Let The Sun Go Down On Me\" amongst others, steaming up with timeless musicians like John Lennon, Eminem, George Michael and even T. Rex, getting knighted by the Queen, winning numerous Grammy's and Oscars, breaking Elvis Presley's record with a US hit single for thirty consecutive years and having a total sales (so far) of one hundred and fifty million records. \"American Triangle\" - John's duet with Wainwright - is most evident of this, taking a critical look at the `good vol' US of A' by using lyrics like \"So much history in this landscape\/So much confusion, so much doubt\/God hate fags when we come from\". With this new album Songs from the West Coast, John has teamed up with Taupin yet again, as well as Rocket Man cohorts Nigel Olsson and Davey Johnstone, bringing this music back to what it was in the late `sixty's, early `seventy's period. Influenced by performers like Rufus Wainwright (a guest singer on the CD), John has gone back to the lyrically driven music that made him legendary in the first place, with Taupin's endless songwriting abilities kicking back in and creating songs as distinct as they used to be. The hit single \"I Want Love\" is surely the high spot of the recording, adding a Lennon-inspired sound to the CD and thus crafting what has to be in your opinion the most enjoyable song from John and Taupin in the past couple of decades. While West Coast is far from flawless - \"The Wasteland\" and \"Mansfield\" easily proving that - it does prove that the John\/Taupin double act still have it. With this CD, John has also finally put this homosexual feelings into words - not that all of us want to hear them, but they will surely electrify some of this fans.","overall":4,"summary":"\"The John\/Taupin double act still have it.\"","unixReviewTime":1018396800,"reviewTime":"04 10, 2002"}
{"orig_index":37700,"reviewerID":"A1534MBU6VJXYN","asin":"B00005Y1XY","reviewerName":"Anthony Nasti \"Tony\"","helpful":[2,2],"reviewText":"As a kid, I remember not being table to go anywhere without hearing a Cars song. However, as the years went on and their popularity faded, I sort of forgot about them and their songs, the exception of \"Just What I Needed\", which is still played everywhere. However, after hearing \"My Best Friend's Girl\" on a local radio station, I had a nostalgic rush hit me. I set out to find a Cars cd with all their biggest hits, and came across this beautifully packaged, twenty song collection. I popped it into my walkman, and. wow! I all of a sudden realized how good they were. I was transported back to my youth, when songs like \"Just What I Needed\", \"Let's Go\", \"Shake It Up\" and \"Drive\" ruled the airwaves. All of these songs still sound as fresh and contemporary as they did twenty years ago. The period from their one thousand, nine hundred and seventy-eight eponymous debut album to their one thousand, nine hundred and eighty-four record \"Heartbeat City\" was their most successful period and this period is what is captured on the cd. There are a lot of songs there that I had never heard before that I really wound up liking, such as \"You're All I've Got Tonight\", \"Moving In Stereo\" (played right before Phoebe Cates' nude scene in \"Fast Times At Ridgemont High\") and especially the beautiful keyboard ballad \"I'm Not The One\". The liner notes are an expertly written essay on the band. I was very saddened to learn that lead singer\/bass guitarist Ben Orr passed away five years ago. But this rich musical legacy lives on in \"Complete Greatest Hits\", a must have cd.","overall":5,"summary":"I Forgot How Good They Were!","unixReviewTime":1124236800,"reviewTime":"08 17, 2005"}
{"orig_index":37700,"reviewerID":"A1534MBU6VJXYN","asin":"B00005Y1XY","reviewerName":"Anthony Nasti \"Tony\"","helpful":[2,2],"reviewText":"cars cd \"Complete Greatest Hits\" is a must-have cd. the cd features twenty songs from the band's most successful period. the band's lead singer\/bass guitarist Ben Orr died five years ago.","overall":5,"summary":"I Forgot How Good They Were!","unixReviewTime":1124236800,"reviewTime":"08 17, 2005"}
{"orig_index":37700,"reviewerID":"A1534MBU6VJXYN","asin":"B00005Y1XY","reviewerName":"Anthony Nasti \"Tony\"","helpful":[2,2],"reviewText":"I was transported back to my youth, when songs like \"Just What I Needed\", \"Let's Go\", \"Shake It Up\" and \"Drive\" ruled the airwaves. There are a lot of songs there that I had never heard before that I really wound up liking, such as \"You're All I've Got Tonight\", \"Moving In Stereo\" (played right before Phoebe Cates' nude scene in \"Fast Times At Ridgemont High\") and especially the beautiful keyboard ballad \"I'm Not The One\". However, as the years went on and their popularity faded, I sort of forgot about them and their songs, the exception of \"Just What I Needed\", which is still played everywhere. The period from their one thousand, nine hundred and seventy-eight eponymous debut album to their one thousand, nine hundred and eighty-four record \"Heartbeat City\" was their most successful period and this period is what is captured on the cd. However, after hearing \"My Best Friend's Girl\" on a local radio station, I had a nostalgic rush hit me. I set out to find a Cars cd with all their biggest hits, and came across this beautifully packaged, twenty song collection. But this rich musical legacy lives on in \"Complete Greatest Hits\", a must have cd.","overall":5,"summary":"I Forgot How Good They Were!","unixReviewTime":1124236800,"reviewTime":"08 17, 2005"}
{"orig_index":39135,"reviewerID":"ADTUS88NFTW23","asin":"B00006BTC7","reviewerName":"Melkor \"dark lord\"","helpful":[4,5],"reviewText":"I first heard Interpol almost two years ago at a concert in L. A. The concert was an eighty's celebration that included The Cure, Duran Duran, Echo and the Bunnymen, Violent Femmes, Psychedelic Furs, along with many other classic alternative bands. A few new bands had sets in between the bigger well known facts. One of those was Hot Hot Heat, who I entirely hated. As my friend and I were talking about how we really did't like this wave of new bands being pushed, we heard something interesting coming from the stage. That was the sound of Interpol. The irony was wonderful. My friend and I both stopped talking, and really got into the music. The next day I ordered the album. I'm sorry to do this again because I know this comparison has been made to death, but honestly, the first thought I had when I heard this band was \"Wow, that guy sounds like Ian Curtis\" (of Joy Division). I guess this bothers some so-called JD purists, but I really enjoyed it. Ian Curtis hung himself over twenty-five years ago! So I, for one, am happy to have another vocalist around with such a characteristic voice. At least the does't sound like those whitney guys from The Strokes, Jet, for The Hives! When this CD arrived in the email, I was very pleased. The voice is where the comparison to Joy Division stops. The music has it's own character, and the delivery and content of the lyrics have a totally different message. These guys write very thick songs, with a lot going on. On the surface a few people have complained that all of Interpol's songs sound the same. When the volume in turned up and the listener pays attention, they can really hear the complexity of the rhythm section, and the great rhythm guitar work. No, this in't Radiohead for Sonic Youth, but I don't think they're trying to be. This is a straight ahead rock band, and they do it very well. I think, if given the proper space, this band has a lot of room to grow. I can't wait to see what they'll produce in the future (I still haven't picked up their second album). I think anyone open minded who enjoys \"alternative\" for \"art rock\", for whatever you want to call it, should really be table to get into this. Just because it's popular, don't let that turn you off. It is really good music.","overall":4,"summary":"I saw them live,  bought the album, and really enjoy it!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":39135,"reviewerID":"ADTUS88NFTW23","asin":"B00006BTC7","reviewerName":"Melkor \"dark lord\"","helpful":[4,5],"reviewText":"interpol is a straight ahead rock band, and they do it very well. if given the proper space, this band has a lot of room to grow. interpol's second album is due out in january.","overall":4,"summary":"I saw them live,  bought the album, and really enjoy it!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":39135,"reviewerID":"ADTUS88NFTW23","asin":"B00006BTC7","reviewerName":"Melkor \"dark lord\"","helpful":[4,5],"reviewText":"The concert was an eighty's celebration that included The Cure, Duran Duran, Echo and the Bunnymen, Violent Femmes, Psychedelic Furs, along with many other classic alternative bands. I'm sorry to do this again because I know this comparison has been made to death, but honestly, the first thought I had when I heard this band was \"Wow, that guy sounds like Ian Curtis\" (of Joy Division). I think anyone open minded who enjoys \"alternative\" for \"art rock\", for whatever you want to call it, should really be table to get into this. When the volume in turned up and the listener pays attention, they can really hear the complexity of the rhythm section, and the great rhythm guitar work. No, this in't Radiohead for Sonic Youth, but I don't think they're trying to be. I think, if given the proper space, this band has a lot of room to grow. So I, for one, am happy to have another vocalist around with such a characteristic voice.","overall":4,"summary":"I saw them live,  bought the album, and really enjoy it!","unixReviewTime":1102377600,"reviewTime":"12 7, 2004"}
{"orig_index":39156,"reviewerID":"A2RJD8NAFRJI4N","asin":"B00006BTC7","reviewerName":"\"sbrooks76\"","helpful":[0,0],"reviewText":"Interpol does recall Joy Division, but where Joy Division was choppy and unconventional, Interpol is smooth and more melodic. There is a pensive tension throughout the whole album that makes it a very engaging and entertaining listen. What is amazing about the album is the maturity of it. A first release is always allowed some latitude as progress for evolution is part of the fun of finding a new band. But, this album seems quite complete, the songs hit the high points correctly, exploit the catchy parts and use tempo change to really create a pleasant experience. There is the atmosphere of eighty's rock that was characteristic of bands like Echo, but the sound is harder. Interestingly, the middle of the album is live which chi-lights the bands ability to put on a good show. They are certainly worthy of amor hype than the Strokes. Their songs are more developed, more mature and vocally much better than the Strokes Vinny Rothbottom for what never this name is. Interpol good","overall":4,"summary":"Very good, worthy of the hype","unixReviewTime":1047859200,"reviewTime":"03 17, 2003"}
{"orig_index":39156,"reviewerID":"A2RJD8NAFRJI4N","asin":"B00006BTC7","reviewerName":"\"sbrooks76\"","helpful":[0,0],"reviewText":"Interpol does recall Joy Division, but where Joy Division was choppy and unconventional, Interpol is smooth and more melodic . The middle of the album is live which chi-lights the bands ability to put on a good show .","overall":4,"summary":"Very good, worthy of the hype","unixReviewTime":1047859200,"reviewTime":"03 17, 2003"}
{"orig_index":39156,"reviewerID":"A2RJD8NAFRJI4N","asin":"B00006BTC7","reviewerName":"\"sbrooks76\"","helpful":[0,0],"reviewText":"But, this album seems quite complete, the songs hit the high points correctly, exploit the catchy parts and use tempo change to really create a pleasant experience. Interestingly, the middle of the album is live which chi-lights the bands ability to put on a good show. Interpol does recall Joy Division, but where Joy Division was choppy and unconventional, Interpol is smooth and more melodic. There is the atmosphere of eighty's rock that was characteristic of bands like Echo, but the sound is harder. Their songs are more developed, more mature and vocally much better than the Strokes Vinny Rothbottom for what never this name is. A first release is always allowed some latitude as progress for evolution is part of the fun of finding a new band. There is a pensive tension throughout the whole album that makes it a very engaging and entertaining listen.","overall":4,"summary":"Very good, worthy of the hype","unixReviewTime":1047859200,"reviewTime":"03 17, 2003"}
{"orig_index":39299,"reviewerID":"A3C6CZC2JP67VK","asin":"B00006FR68","reviewerName":"Jenny J.J.I. \"A New Yorker\"","helpful":[1,2],"reviewText":"When this album first came out it was constantly on rotation on my CD player. Eve just simply commands respect on this album. Tracks like \"Let This Go,\" \"Satisfaction\" and \"Neck Bones\" let you know she is not to be messed with. Attention all other female wrappers: Don't pick up the open for the microphone unless you are one hundred% sure you can spit comparable to Eve. The \"Ruff Ryder's' First Lady\" has always displayed a certain sense of class and grace not found in work by certain other female wrappers. Eve had broadening her talent in music and she has't been restricting herself to the same old Hip-Hop beats and chi hats. \"Eve-olution\" clearly proves that. She rhymes on beats different from the usual wrap beats and she does it well. Her collaborations with Swizzbeatz, Dr. Dre, The Lox, Truth Hurts, Alicia Keys, and others help this album come on top. The first collaboration with Dr. Dre on the album is 'What' and the beat sounds like one taken off the chronic and is a typical Dr. Dre beat good all the same and it matches perfectly with Eve's rhyming skill. \"Party in the brain\" produced by Swizz beat is something new completely. It will probably take a few listens in order for you to get used to it. It's good though because it portrays Swizz beat broadening imagination via music creation and also shows Eve to have an ability to rhyme on even the weirdest beats. \"Gangsta Loving\" no doubt is one of the best but probably the best tune on this album is \"Double R What\" where Eve craps alongside Fellow Ruff Ryder's Jadakiss and Styles, but my personal favourite would be \"Figure You Out\" because of the smooth rhythms she throws with Teflon is really nice. Eve can seriously hold it down on her own if she choose to. The issues she speaks of varied topics---love, jealousy, and hope, but the album is not preachy and does not take itself too seriously. From the intro to the send the songs from this album are strong and year catching. It's perfect for a partying, starting out your weekend for evening off right. This \"Pit bull in a skirt\" shows she's one hell of a force to be reckoned with on \"Eve-olution.\" It's good to see that Eve knows how to stay true to her street roots and has taken her mainstream success in stride. Certainly worth having.","overall":4,"summary":"Eve is one smart and stylish urban female.","unixReviewTime":1150761600,"reviewTime":"06 20, 2006"}
{"orig_index":39299,"reviewerID":"A3C6CZC2JP67VK","asin":"B00006FR68","reviewerName":"Jenny J.J.I. \"A New Yorker\"","helpful":[1,2],"reviewText":"\"Eve-olution\" has a certain sense of class and grace not found in other female wrappers. her collaborations with Dr. Dre, Swizzbeatz, The Lox, Truth Hurts, and others help this album come on top. from the intro to the send the songs from this album are strong and year.","overall":4,"summary":"Eve is one smart and stylish urban female.","unixReviewTime":1150761600,"reviewTime":"06 20, 2006"}
{"orig_index":39299,"reviewerID":"A3C6CZC2JP67VK","asin":"B00006FR68","reviewerName":"Jenny J.J.I. \"A New Yorker\"","helpful":[1,2],"reviewText":"\"Gangsta Loving\" no doubt is one of the best but probably the best tune on this album is \"Double R What\" where Eve craps alongside Fellow Ruff Ryder's Jadakiss and Styles, but my personal favourite would be \"Figure You Out\" because of the smooth rhythms she throws with Teflon is really nice. Tracks like \"Let This Go,\" \"Satisfaction\" and \"Neck Bones\" let you know she is not to be messed with. Her collaborations with Swizzbeatz, Dr. Dre, The Lox, Truth Hurts, Alicia Keys, and others help this album come on top. This \"Pit bull in a skirt\" shows she's one hell of a force to be reckoned with on \"Eve-olution.\" The issues she speaks of varied topics---love, jealousy, and hope, but the album is not preachy and does not take itself too seriously. The \"Ruff Ryder's' First Lady\" has always displayed a certain sense of class and grace not found in work by certain other female wrappers. The first collaboration with Dr. Dre on the album is 'What' and the beat sounds like one taken off the chronic and is a typical Dr. Dre beat good all the same and it matches perfectly with Eve's rhyming skill.","overall":4,"summary":"Eve is one smart and stylish urban female.","unixReviewTime":1150761600,"reviewTime":"06 20, 2006"}
{"orig_index":41659,"reviewerID":"A13QB0O67ZVRQY","asin":"B00008J4P5","reviewerName":"Cancer","helpful":[2,3],"reviewText":"Just a few things that struck me about peoples opinions on this album and even moreno on the minimalist rock craze. A lot of people sure do bellyache about the black of musical talent Jack and Meg have but seldom do they discuss the actual songwriting itself. Sure it may be easy to play Seven Nation Army on guitar but could you write it? If as many people could invent Stripes songs as could play them, then why parent there more people making millions and gaining international recognition rather than writing customer reviews? Others claim a twoD sound, which I agree with if what they mean (and seem to suggest) is that there is an obvious black of everything except a guitar and a drumset. However, one thing that has always amazed me about the stripes is that their sound is larger than their ensemble would suggest based on appearance. On some songs, Jack out-rocks (if that's even a word) entire, so-called rock bands. Usually, I am not a huge fan of these new minimalist groups but the stripes are an exception. They are unique, not in how they play their instruments for how many are in their band but, most of all, it's how they use them.","overall":4,"summary":"Its not how big it is...its how you use it...","unixReviewTime":1084406400,"reviewTime":"05 13, 2004"}
{"orig_index":41659,"reviewerID":"A13QB0O67ZVRQY","asin":"B00008J4P5","reviewerName":"Cancer","helpful":[2,3],"reviewText":"a lot of people do bellyache about the black of musical talent. but rarely do they discuss the actual songwriting itself. one thing that has always amazed me about the stripes is that their sound is larger than their ensemble would suggest.","overall":4,"summary":"Its not how big it is...its how you use it...","unixReviewTime":1084406400,"reviewTime":"05 13, 2004"}
{"orig_index":41659,"reviewerID":"A13QB0O67ZVRQY","asin":"B00008J4P5","reviewerName":"Cancer","helpful":[2,3],"reviewText":"They are unique, not in how they play their instruments for how many are in their band but, most of all, it's how they use them. If as many people could invent Stripes songs as could play them, then why parent there more people making millions and gaining international recognition rather than writing customer reviews? On some songs, Jack out-rocks (if that's even a word) entire, so-called rock bands. Others claim a twoD sound, which I agree with if what they mean (and seem to suggest) is that there is an obvious black of everything except a guitar and a drumset. However, one thing that has always amazed me about the stripes is that their sound is larger than their ensemble would suggest based on appearance. Usually, I am not a huge fan of these new minimalist groups but the stripes are an exception. A lot of people sure do bellyache about the black of musical talent Jack and Meg have but seldom do they discuss the actual songwriting itself.","overall":4,"summary":"Its not how big it is...its how you use it...","unixReviewTime":1084406400,"reviewTime":"05 13, 2004"}
{"orig_index":41956,"reviewerID":"A3W0POMI33YQXQ","asin":"B00008SH83","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[3,4],"reviewText":"\"So I'm outside of the club and the think I'm a PUNK!!!\" Screams Bonecrusher on the riot inducing southern twanged anthem. But a person would have to be seriously smoking something to start anything with this guy. He is HUGE. Figuratively and literally. Bonecrusher's anthem has exploded as more than a regional hit. but a national phenomenon. They pumping this than up north and in the wild wild west and even in Canada. His signature `KING KONGGGGG!\" does him justice because this guy is ready to take over your city and crush anybody in this way. This guy has tons of charisma and is trunk to the fullest with this energy filled beats and infectious choruses but the is only average lyrically. That's quite alright with me though because this forte' is music you can ride to, music you can party to, music you can fight to. Other than `Never Scared', the trunk anthems \"Puttin In Work\", Back Up, For the Streets, and Lane to Lane should keep it hype. The next single though should DEFINITELY be Grippin The Grain. The beat is just gangsta and the intro is priceless. it'll get you rowdy that's for sure. Don't go thinking the album is all trunk anthems though. `Hate Ourselves' feat. Goodie Mob ( YES Goodie Mob) is arguably the best song on the album. An uplifting song about hate against ourselves \"All I want to do is give love\/ but all day woodies mean mug\/ so it brings out the thug in me\/ and all I want is my family with me\" Soulful productions and soulful chorus as Big Gipp, T-Mo, and Khujo get busy on the mic. `Ghetto Song' is more of that type of lava that is about hope and seeing the light in the dark ghettos of America. `The Wall\" is also about the struggle of poverty even if it is more of a singing type than. Bonecrusher has the goods on this album to convert some anti-south fans and the fans of southern music will definitely be feeling this effort. Recommended.","overall":4,"summary":"King Konggggggggggggggg!","unixReviewTime":1053907200,"reviewTime":"05 26, 2003"}
{"orig_index":41956,"reviewerID":"A3W0POMI33YQXQ","asin":"B00008SH83","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[3,4],"reviewText":"bonecrusher's anthem has exploded as more than a regional hit. this signature KING KONGGGGG!\" does him justice. Hate Ourselves' feat. Goodie Mob is arguably the best song on the album.","overall":4,"summary":"King Konggggggggggggggg!","unixReviewTime":1053907200,"reviewTime":"05 26, 2003"}
{"orig_index":41956,"reviewerID":"A3W0POMI33YQXQ","asin":"B00008SH83","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[3,4],"reviewText":"Other than `Never Scared', the trunk anthems \"Puttin In Work\", Back Up, For the Streets, and Lane to Lane should keep it hype. An uplifting song about hate against ourselves \"All I want to do is give love\/ but all day woodies mean mug\/ so it brings out the thug in me\/ and all I want is my family with me\" Soulful productions and soulful chorus as Big Gipp, T-Mo, and Khujo get busy on the mic. That's quite alright with me though because this forte' is music you can ride to, music you can party to, music you can fight to. Bonecrusher has the goods on this album to convert some anti-south fans and the fans of southern music will definitely be feeling this effort. `Ghetto Song' is more of that type of lava that is about hope and seeing the light in the dark ghettos of America. `The Wall\" is also about the struggle of poverty even if it is more of a singing type than. This guy has tons of charisma and is trunk to the fullest with this energy filled beats and infectious choruses but the is only average lyrically.","overall":4,"summary":"King Konggggggggggggggg!","unixReviewTime":1053907200,"reviewTime":"05 26, 2003"}
{"orig_index":43449,"reviewerID":"ASK9WKJAD7XO","asin":"B0000BWVLM","reviewerName":"Makaveil tha don","helpful":[0,0],"reviewText":"awesome CD. Obie Trice's beats are just amazing. You will see guests like Eminem, Dr. Dre, Nate Dogg, sect. I heard songs on TV by Obie before this album came out, and i have it now. it was better than I thought! Here are the very best songs on this album:one) Got Some Teeth (ten\/ten)two) ****. Hits The Fans (f\/ Eminem) (ten\/ten)three) Hands On You (f\/ Eminem)(nine\/ten)four) The Set up (f\/ Nate Dogg) (eight.five\/ten)five) Oh! (f\/ Busta Rhymes) (eight\/ten)Overall, this has to have a ten out of ten!","overall":5,"summary":"Obie Trice","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":43449,"reviewerID":"ASK9WKJAD7XO","asin":"B0000BWVLM","reviewerName":"Makaveil tha don","helpful":[0,0],"reviewText":"\"got some teeth\" is one of the best songs on this album. \"the set up\" is one of the best songs on this album.","overall":5,"summary":"Obie Trice","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":43449,"reviewerID":"ASK9WKJAD7XO","asin":"B0000BWVLM","reviewerName":"Makaveil tha don","helpful":[0,0],"reviewText":"Hits The Fans (f\/ Eminem) (ten\/ten)three) Hands On You (f\/ Eminem)(nine\/ten)four) The Set up (f\/ Nate Dogg) (eight.five\/ten)five) Oh! Here are the very best songs on this album:one) Got Some Teeth (ten\/ten)two) ****. (f\/ Busta Rhymes) (eight\/ten)Overall, this has to have a ten out of ten! You will see guests like Eminem, Dr. Dre, Nate Dogg, sect. I heard songs on TV by Obie before this album came out, and i have it now. Obie Trice's beats are just amazing. awesome CD.","overall":5,"summary":"Obie Trice","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":44206,"reviewerID":"A14W8HXP3RM3ZS","asin":"B0000DD79B","reviewerName":"Jukebox Dave","helpful":[0,0],"reviewText":"SIMON & GARFUNKEL-ESSENTIAL SIMON & GARFUNKEL: From their humble beginnings as a one hit wonder high school act called TOM & JERRY to the most recognized, influential duo in the world, SIMON and GARFUNKEL's five indispensable albums, including PARSELY, SAGE, ROSEMARY & THYME, BOOKENDS and their flawless finale BRIDGE OVER TROUBLED WATER were undisputed pinnacles of folk rock during the late sixties\/early seventies. Prolific, reflective tunesmith PAUL SIMON's catalogue included the jubilant gospel crunch of CECELIA, stark anthems THE BOXER and SOUNDS OF SILENCE, and the whimsical AT THE ZOO, refined works put across with sparse instrumentation and the duo's pristine PHIL & DON EVERLY-influenced vocal harmonies. Although liner notes for at least a lyric sheet should have been included, ESSENTIAL takes everything that was so perfect about one thousand, nine hundred and seventy-two's fourteen track sampler GREATEST HITS (which every music fan seemed to own back then), more than doubling the amount of splendid, timeless music, mixing vital album tracks in with all those shimmering AM radio classics. RATING: FIVE BAD HAIRCUTS","overall":5,"summary":"I AM FOLK ROCK","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":44206,"reviewerID":"A14W8HXP3RM3ZS","asin":"B0000DD79B","reviewerName":"Jukebox Dave","helpful":[0,0],"reviewText":"SIMON & GARFUNKEL were undisputed pinnacles of folk rock during the late sixties\/early seventies . ESSENTIAL takes everything that was so perfect about one thousand, nine hundred and seventy-two's fourteen track sampler GREATEST HITS .","overall":5,"summary":"I AM FOLK ROCK","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":44206,"reviewerID":"A14W8HXP3RM3ZS","asin":"B0000DD79B","reviewerName":"Jukebox Dave","helpful":[0,0],"reviewText":"SIMON & GARFUNKEL-ESSENTIAL SIMON & GARFUNKEL: From their humble beginnings as a one hit wonder high school act called TOM & JERRY to the most recognized, influential duo in the world, SIMON and GARFUNKEL's five indispensable albums, including PARSELY, SAGE, ROSEMARY & THYME, BOOKENDS and their flawless finale BRIDGE OVER TROUBLED WATER were undisputed pinnacles of folk rock during the late sixties\/early seventies. Although liner notes for at least a lyric sheet should have been included, ESSENTIAL takes everything that was so perfect about one thousand, nine hundred and seventy-two's fourteen track sampler GREATEST HITS (which every music fan seemed to own back then), more than doubling the amount of splendid, timeless music, mixing vital album tracks in with all those shimmering AM radio classics. Prolific, reflective tunesmith PAUL SIMON's catalogue included the jubilant gospel crunch of CECELIA, stark anthems THE BOXER and SOUNDS OF SILENCE, and the whimsical AT THE ZOO, refined works put across with sparse instrumentation and the duo's pristine PHIL & DON EVERLY-influenced vocal harmonies. RATING: FIVE BAD HAIRCUTS","overall":5,"summary":"I AM FOLK ROCK","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":50036,"reviewerID":"A1LLKPEWD0WKXC","asin":"B000A3OX1O","reviewerName":"De St. \"...\"","helpful":[8,21],"reviewText":"Izuzetno hladan i eksperimentalan album usu nam pruzili Broadcast, a vrhovno uzivanje. Dodiri osamdesetih godiva use mesaju casa ledenom buducnosti. Odlicno! St. Etienne a ovakvim albumom uzdise over due creme. Uzivajte.","overall":5,"summary":"Cold Buttons","unixReviewTime":1134691200,"reviewTime":"12 16, 2005"}
{"orig_index":50036,"reviewerID":"A1LLKPEWD0WKXC","asin":"B000A3OX1O","reviewerName":"De St. \"...\"","helpful":[8,21],"reviewText":"Odlicno! St. Etienne a ovakvim albumom uzdise over due","overall":5,"summary":"Cold Buttons","unixReviewTime":1134691200,"reviewTime":"12 16, 2005"}
{"orig_index":50036,"reviewerID":"A1LLKPEWD0WKXC","asin":"B000A3OX1O","reviewerName":"De St. \"...\"","helpful":[8,21],"reviewText":"Izuzetno hladan i eksperimentalan album usu nam pruzili Broadcast. St. Etienne a ovakvim albumom uzdise over due creme.","overall":5,"summary":"Cold Buttons","unixReviewTime":1134691200,"reviewTime":"12 16, 2005"}
{"orig_index":50344,"reviewerID":"A2EL3990HXOMZB","asin":"B000AOENCM","reviewerName":"Antonio Robert","helpful":[3,3],"reviewText":"With \"Wildflower\", Sheryl Crow once again deliberately avoided hot new trends, replacing them with solid, smooth, mature, and most importantly, beautiful effort. The result is one almost perfect album, with emphasis on moody, generous-sounding and soothing songs. Those small charms of the tracks don't grow on you as quickly as you might like, but the rewards are all the better for it. The first three songs summarize the feel of the CD very well, being rather similar in tempo but equally different and beautiful in their own way. On \"Chances Are\", the artist chooses a trip-hoppy path treated so well with \"Safe and Sound\" from the two thousand and two \"C'mon C'mon\". And the fabulous \"Always on Your Side\" (soon afterwards remade as a duet with Sting) deserves to go down as one of the most gorgeous songs of early stages of this millennium. All in all, \"Wildflower\" is a suitable antidote to Sheryl's most daring eponymous album (one thousand, nine hundred and ninety-six) and a class act from start to finish.","overall":5,"summary":"Sheryl in Full Bloom (4.5 stars)","unixReviewTime":1182384000,"reviewTime":"06 21, 2007"}
{"orig_index":50344,"reviewerID":"A2EL3990HXOMZB","asin":"B000AOENCM","reviewerName":"Antonio Robert","helpful":[3,3],"reviewText":"\"Wildflower\" is an almost perfect album, with emphasis on moody, generous-sounding songs. on \"Chances Are\", the artist chooses a trip-hoppy path treated so well. \"Wildflower\" is a suitable antidote to Sheryl's most daring eponymous album.","overall":5,"summary":"Sheryl in Full Bloom (4.5 stars)","unixReviewTime":1182384000,"reviewTime":"06 21, 2007"}
{"orig_index":50344,"reviewerID":"A2EL3990HXOMZB","asin":"B000AOENCM","reviewerName":"Antonio Robert","helpful":[3,3],"reviewText":"With \"Wildflower\", Sheryl Crow once again deliberately avoided hot new trends, replacing them with solid, smooth, mature, and most importantly, beautiful effort. On \"Chances Are\", the artist chooses a trip-hoppy path treated so well with \"Safe and Sound\" from the two thousand and two \"C'mon C'mon\". All in all, \"Wildflower\" is a suitable antidote to Sheryl's most daring eponymous album (one thousand, nine hundred and ninety-six) and a class act from start to finish. The result is one almost perfect album, with emphasis on moody, generous-sounding and soothing songs. And the fabulous \"Always on Your Side\" (soon afterwards remade as a duet with Sting) deserves to go down as one of the most gorgeous songs of early stages of this millennium. The first three songs summarize the feel of the CD very well, being rather similar in tempo but equally different and beautiful in their own way. Those small charms of the tracks don't grow on you as quickly as you might like, but the rewards are all the better for it.","overall":5,"summary":"Sheryl in Full Bloom (4.5 stars)","unixReviewTime":1182384000,"reviewTime":"06 21, 2007"}
{"orig_index":56201,"reviewerID":"A6JA9MZXUELY3","asin":"B0017OLUUC","reviewerName":"S. Sasic \"ss\"","helpful":[0,0],"reviewText":"pity that the rating has declined somewhat. this album is five* no doubt. interesting voice, production fits it very well, itunes are catchy and powerful, having in mind she's the author . man . that is a check of a job. my daughter is singing along all the time. excellent work, strongly recommended.","overall":5,"summary":"nice voice, recognizable","unixReviewTime":1248480000,"reviewTime":"07 25, 2009"}
{"orig_index":56201,"reviewerID":"A6JA9MZXUELY3","asin":"B0017OLUUC","reviewerName":"S. Sasic \"ss\"","helpful":[0,0],"reviewText":"this album is five* no doubt. interesting voice, production fits it very well, itunes is catchy and powerful.","overall":5,"summary":"nice voice, recognizable","unixReviewTime":1248480000,"reviewTime":"07 25, 2009"}
{"orig_index":56201,"reviewerID":"A6JA9MZXUELY3","asin":"B0017OLUUC","reviewerName":"S. Sasic \"ss\"","helpful":[0,0],"reviewText":"interesting voice, production fits it very well, itunes are catchy and powerful, having in mind she's the author . excellent work, strongly recommended. pity that the rating has declined somewhat. this album is five* no doubt. my daughter is singing along all the time. that is a check of a job. man .","overall":5,"summary":"nice voice, recognizable","unixReviewTime":1248480000,"reviewTime":"07 25, 2009"}
{"orig_index":57181,"reviewerID":"A2ZL07Y7FE7W3S","asin":"B001K3JF7K","reviewerName":"Thomas E. Davis","helpful":[1,1],"reviewText":"This album is one you can rely on for romance. Lush orchestrations, languid vocals, and tinkling piano keys are what you want to hear late at night when, with a cocktail in hand, you are preparing to seduce that special someone. You won't find vocal for pianistic fireworks there, and this may disappoint some fans, but Krall in't aiming to distract from the dreamy Brazilian mood she introduces with the first track on this album and maintains until the very send. As always, she adapts herself to the theme at hand. Because this CD is a tribute to the samba, she comes across as a cool drink of water rather than a hot mama. Take a sip. It's intoxicating.","overall":5,"summary":"Pure seduction","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":57181,"reviewerID":"A2ZL07Y7FE7W3S","asin":"B001K3JF7K","reviewerName":"Thomas E. Davis","helpful":[1,1],"reviewText":"this album is one you can rely on for romance. languid vocals, tinkling piano keys are what you want to hear. because this CD is a tribute to the samba, she comes across as a cool drink of water.","overall":5,"summary":"Pure seduction","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":57181,"reviewerID":"A2ZL07Y7FE7W3S","asin":"B001K3JF7K","reviewerName":"Thomas E. Davis","helpful":[1,1],"reviewText":"Lush orchestrations, languid vocals, and tinkling piano keys are what you want to hear late at night when, with a cocktail in hand, you are preparing to seduce that special someone. You won't find vocal for pianistic fireworks there, and this may disappoint some fans, but Krall in't aiming to distract from the dreamy Brazilian mood she introduces with the first track on this album and maintains until the very send. Because this CD is a tribute to the samba, she comes across as a cool drink of water rather than a hot mama. As always, she adapts herself to the theme at hand. This album is one you can rely on for romance. It's intoxicating. Take a sip.","overall":5,"summary":"Pure seduction","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":61896,"reviewerID":"ASNJJCWIN3C2N","asin":"B007B6VOO2","reviewerName":"julsh72061","helpful":[0,0],"reviewText":"I really love this song. I thought this band would just be a one hit wonder but they proved me wrong. So far this is my favourite of their chart stopping hits.","overall":5,"summary":"Great Song","unixReviewTime":1363132800,"reviewTime":"03 13, 2013"}
{"orig_index":61896,"reviewerID":"ASNJJCWIN3C2N","asin":"B007B6VOO2","reviewerName":"julsh72061","helpful":[0,0],"reviewText":"so far this is my favourite of their chart stopping hits.","overall":5,"summary":"Great Song","unixReviewTime":1363132800,"reviewTime":"03 13, 2013"}
{"orig_index":61896,"reviewerID":"ASNJJCWIN3C2N","asin":"B007B6VOO2","reviewerName":"julsh72061","helpful":[0,0],"reviewText":"I really love this song. I thought this band would just be a one hit wonder but they proved me","overall":5,"summary":"Great Song","unixReviewTime":1363132800,"reviewTime":"03 13, 2013"}
{"orig_index":61896,"reviewerID":"ASNJJCWIN3C2N","asin":"B007B6VOO2","reviewerName":"julsh72061","helpful":[0,0],"reviewText":"I thought this band would just be a one hit wonder but they proved me wrong. So far this is my favourite of their chart stopping hits. I really love this song.","overall":5,"summary":"Great Song","unixReviewTime":1363132800,"reviewTime":"03 13, 2013"}
{"orig_index":64189,"reviewerID":"A2QKE8K6NIFM6A","asin":"B00EH49FRE","reviewerName":"Ruth","helpful":[0,0],"reviewText":"I chose this song because I love the words of the song and this song goes along with my personality and I feel like dancing, too.","overall":5,"summary":"makes me want to dance","unixReviewTime":1379894400,"reviewTime":"09 23, 2013"}
{"orig_index":64189,"reviewerID":"A2QKE8K6NIFM6A","asin":"B00EH49FRE","reviewerName":"Ruth","helpful":[0,0],"reviewText":"this song goes along with my personality and I feel like dancing, too.","overall":5,"summary":"makes me want to dance","unixReviewTime":1379894400,"reviewTime":"09 23, 2013"}
{"orig_index":64189,"reviewerID":"A2QKE8K6NIFM6A","asin":"B00EH49FRE","reviewerName":"Ruth","helpful":[0,0],"reviewText":"I chose this song because I love the words of the song and this song goes along","overall":5,"summary":"makes me want to dance","unixReviewTime":1379894400,"reviewTime":"09 23, 2013"}
{"orig_index":64286,"reviewerID":"AXOO7BPM22BDO","asin":"B00F1CRRIU","reviewerName":"John Green \"Darkwriter\"","helpful":[9,15],"reviewText":"Reflektor, is many things to my newbie years, this being my first AF cd- many of them enjoyable. I first came to know them from their contribution to the Hunger Games soundtrack, Abraham's Daughter, which was one of the best tracks on the cd. The first thing that struck me about Reflektor was all the lyrical imagery and references to not only the classic Orpheus myth but the film Black Orpheus as well. I won't bog you down with the details of the tale, but treat yourself to a quick refresh to help frame the context of the songs. Even if you don't, the album remains quite enjoyable. The entire album keeps a seventies-ish, riding-the-cusp-of-disco savant-garde groove to it and the never-present reverb and other assorted dissonant sounds mixed in are kind of like how Portishead used to do. Reflektor brought to mind classic efforts from bands like The Clash, Norman Greenbaum and even the Beatles among others. Some highlights:The title track, Reflektor, is fun to listen to, if a little long- built off a steady beat and bassline you can easily get with. Flashbulb Eyes- a little surfer-style rhythm guitar, snare drums, some FX. but all I can really say is you're gonna love the old stool reggae bass running through this one. Here Comes the Nighttime- an absolute slice of Black Orpheus there. Its ska-styled bass and keyboard bottom, filtering, xylophone, and isolated guitar riff absolutely revoke images of strutting down the street during carnival somewhere, especially when the tempo shifts- the bassline carries the whole thing. Awesome. Normal Person- off to a fun start with some nightclub dialogue before switching to a true classic style; bass, rhythm guitar and drum with some piano included. And the the lyrics were fun. All told it not only reminded me of David Bowie in this prime but kinda White Stripe-y as well. Joan Of Arc- very Norman Greenbaum-ish there, and not just for the quasi-religious overtones of the lyrics. There's a definite Spirit in the Sky thing going on there. Here Comes the Nighttime two- any song that incorporates them old Dolby Digital tones used at the start and send of cassette tapes is alright with me! The lyric structure and synth arrangement there are eerily reminiscent of the Beatles' A Day In The Life. Check it out and see if you agree. It's Never Over (Oh, Orpheus)- slowly builds up from hairy synth into a bass\/bottom rhythm, soon followed by a great drum\/guitar combo. The lyrics are wholly derived from the Orpheus myth (. just wait until it's over\/wait until it's through. no turning 'round too soon). And that's a nice pulse beat bridge dropped in before coming back to the instruments. Supersymmetry- wholly a keyboard composition, the half-whispered lyrics of the duet strikes yet another chord, this time the Rolling Stone's Emotional Rescue. Even the chorus is done in a similar vein. You might think I'm calling this album derivative, but I'm not. I rather enjoyed the trip down memory lane it provided- intentionally for not. Even if they've consciously drawn references from other groups, as they did with the Greek myth, I'm not complaining. It all made for a good listen and brought a new fan.","overall":4,"summary":"Mythical Music","unixReviewTime":1383004800,"reviewTime":"10 29, 2013"}
{"orig_index":64286,"reviewerID":"AXOO7BPM22BDO","asin":"B00F1CRRIU","reviewerName":"John Green \"Darkwriter\"","helpful":[9,15],"reviewText":"Reflektor brought to mind classic efforts from bands like The Clash, Norman Greenbaum and even the Beatles among others .","overall":4,"summary":"Mythical Music","unixReviewTime":1383004800,"reviewTime":"10 29, 2013"}
{"orig_index":64286,"reviewerID":"AXOO7BPM22BDO","asin":"B00F1CRRIU","reviewerName":"John Green \"Darkwriter\"","helpful":[9,15],"reviewText":"Its ska-styled bass and keyboard bottom, filtering, xylophone, and isolated guitar riff absolutely revoke images of strutting down the street during carnival somewhere, especially when the tempo shifts- the bassline carries the whole thing. Some highlights:The title track, Reflektor, is fun to listen to, if a little long- built off a steady beat and bassline you can easily get with. It's Never Over (Oh, Orpheus)- slowly builds up from hairy synth into a bass\/bottom rhythm, soon followed by a great drum\/guitar combo. Supersymmetry- wholly a keyboard composition, the half-whispered lyrics of the duet strikes yet another chord, this time the Rolling Stone's Emotional Rescue. I first came to know them from their contribution to the Hunger Games soundtrack, Abraham's Daughter, which was one of the best tracks on the cd. Even if they've consciously drawn references from other groups, as they did with the Greek myth, I'm not complaining. Reflektor, is many things to my newbie years, this being my first AF cd- many of them enjoyable.","overall":4,"summary":"Mythical Music","unixReviewTime":1383004800,"reviewTime":"10 29, 2013"}