{"orig_index":102,"reviewerID":"A1MXPWDS7SVQN1","asin":"B00000016W","reviewerName":"Blues Bro \"bluesbro\"","helpful":[1,3],"reviewText":"This one is a strong contender for best rock album of all time and should be in everyone's collection. Period. Now, it has been reissued countless times (I think I have owned three different versions at least). Unfortunately the best version never released looks like is no longer available: a stunning one CD containing all tracks in both stereo and mono for the price of a regular CD. Now these versions are sold separately. Which one to buy? Originally, the album was released and mixed in mono. Only recently was the album remixed in stereo. So, if you are interested in the history behind this album, and the whole `painting a moustache on the Mona Lisa' issue, get the mono version. With the stereo version, although you get all the inherent improvements of stereo sound, some sounds from the original album are lost in the stereo mix. Nevertheless, bottom line, for my years the stereo will always sound best, and that is the version I listen to most. The extra track is just `I know there is an answer' with different lyrics, nothing revealing.","overall":5,"summary":"Which one to buy?","unixReviewTime":1019779200,"reviewTime":"04 26, 2002"}
{"orig_index":102,"reviewerID":"A1MXPWDS7SVQN1","asin":"B00000016W","reviewerName":"Blues Bro \"bluesbro\"","helpful":[1,3],"reviewText":"This is the strongest contender of the best album of all time and should be collected by everyone. time. Now, it's been are-released several times (I think I have three different versions). Unfortunately, the most unreleased version seems to be no longer available: a beautiful CD, which contains all the songs in stereo and mono, for the same price as a regular CD. These versions are now sold separately. Which one will you buy? Initially, the album was released and mixed in the mono. Until recently, the album was mixed in stereo. So if you are interested in the history behind this album and the whole \"Drawing Beard on Mona Lisa\", please find the monophonic version. With the stereo type, although you get all the stereo upgrades, some of the sounds from the original album are lost in the stereo mix. However, the important thing is that in my page, the stereo has always sounded the best, and this is the version I feel the most. The additional song says \"I know there is an answer\", the words are different and nothing is revealed.","overall":5,"summary":"Which one to buy?","unixReviewTime":1019779200,"reviewTime":"04 26, 2002"}
{"orig_index":102,"reviewerID":"A1MXPWDS7SVQN1","asin":"B00000016W","reviewerName":"Blues Bro \"bluesbro\"","helpful":[1,3],"reviewText":"The best version that has never been released seems to be out of reach. A good CD that contains all the songs in stereo and mono for the price of a standard CD.","overall":5,"summary":"Which one to buy?","unixReviewTime":1019779200,"reviewTime":"04 26, 2002"}
{"orig_index":102,"reviewerID":"A1MXPWDS7SVQN1","asin":"B00000016W","reviewerName":"Blues Bro \"bluesbro\"","helpful":[1,3],"reviewText":"This is the strongest fighter of the best rock album of all time and should be collected by everyone. Initially, the album was released and mixed in the mono. Until recently, the album was mixed again in stereo.","overall":5,"summary":"Which one to buy?","unixReviewTime":1019779200,"reviewTime":"04 26, 2002"}
{"orig_index":292,"reviewerID":"A27LMYOUM86WHY","asin":"B0000002O5","reviewerName":"Kenneth A Smith","helpful":[3,4],"reviewText":"This is the real thing folks - real singers and real musicians making real music. Blow off Shania and Faith and BUY THIS AND EVERY OTHER Alison Krauss + Union Station CD AVAILABLE!!!.","overall":5,"summary":"A REAL Country Album","unixReviewTime":1037750400,"reviewTime":"11 20, 2002"}
{"orig_index":292,"reviewerID":"A27LMYOUM86WHY","asin":"B0000002O5","reviewerName":"Kenneth A Smith","helpful":[3,4],"reviewText":"It's a real thing for us - real artists and real artists who make real music. Blow Shaniya and Iman and buy this and all the words Alison Krauss + Union Station CD available !!!.","overall":5,"summary":"A REAL Country Album","unixReviewTime":1037750400,"reviewTime":"11 20, 2002"}
{"orig_index":292,"reviewerID":"A27LMYOUM86WHY","asin":"B0000002O5","reviewerName":"Kenneth A Smith","helpful":[3,4],"reviewText":"These are real people - real artists and real artists who make real music. Shania and Iman burst","overall":5,"summary":"A REAL Country Album","unixReviewTime":1037750400,"reviewTime":"11 20, 2002"}
{"orig_index":292,"reviewerID":"A27LMYOUM86WHY","asin":"B0000002O5","reviewerName":"Kenneth A Smith","helpful":[3,4],"reviewText":"This is the real thing folks - real singers and real musicians making real music . Blow off Shania and Faith","overall":5,"summary":"A REAL Country Album","unixReviewTime":1037750400,"reviewTime":"11 20, 2002"}
{"orig_index":2055,"reviewerID":"ACU22OOTCPJDF","asin":"B000000WGN","reviewerName":"Amazon Customer \"tigerUK\"","helpful":[2,2],"reviewText":"On this album, Roy sounds substantially as the cd years ago. It is as if the never aged. His voice is as haunting as pure as this early recordings. The real shame is that the passed not long after the made this record. The wonderful thing is that we get to hear him one last time.","overall":5,"summary":"The Return of Roy Orbison","unixReviewTime":1397692800,"reviewTime":"04 17, 2014"}
{"orig_index":2055,"reviewerID":"ACU22OOTCPJDF","asin":"B000000WGN","reviewerName":"Amazon Customer \"tigerUK\"","helpful":[2,2],"reviewText":"In this album, Roy's voice is the same as many years ago. As if you never got old. His voice is as clean and memorable as the original print. The irony is that it passed soon after the record was made. Surprisingly, we heard this voice for the last time.","overall":5,"summary":"The Return of Roy Orbison","unixReviewTime":1397692800,"reviewTime":"04 17, 2014"}
{"orig_index":2055,"reviewerID":"ACU22OOTCPJDF","asin":"B000000WGN","reviewerName":"Amazon Customer \"tigerUK\"","helpful":[2,2],"reviewText":"In this album, Roy sounds similarly many years ago. As it never gets old, this voice is not as memorable as the original print. It passed quickly after the record was made, which is very sad.","overall":5,"summary":"The Return of Roy Orbison","unixReviewTime":1397692800,"reviewTime":"04 17, 2014"}
{"orig_index":2055,"reviewerID":"ACU22OOTCPJDF","asin":"B000000WGN","reviewerName":"Amazon Customer \"tigerUK\"","helpful":[2,2],"reviewText":"In this album, Roy's voice is the same as many years ago. His voice is as clean and memorable as the original print. The embarrassing thing is that the passed away just after doing this","overall":5,"summary":"The Return of Roy Orbison","unixReviewTime":1397692800,"reviewTime":"04 17, 2014"}
{"orig_index":2581,"reviewerID":"A2ETZ7GF5B1712","asin":"B0000013GT","reviewerName":"Chandler \"Infamous\"","helpful":[2,2],"reviewText":"Damn, seeing that Outkast had a movie and a new album out, I realized that I haven't reviewed not only one of their albums except their greatest hits album. Outkast has really represented the hometown since 'ninety-three when Vone hundred and three (ATLiens know this station) used to bump \"Player's Ball\" on the radio airwaves. And \"Southerplayaisticmuzik\" back in pm 'ninety-four help place Atlanta on the map. Two years later, they come out with their sophomore album \"ATLiens\" in Sept one thousand, nine hundred and ninety-six. This time, they flipped their whole concept around compared to their first one. While their debut was mostly about pippin and smoking weed, this one was more \"out there\". The production by Organized Noize was more laid back and smoother sounding. Their first single \"Elevators (Me & U)\" was heavily rotated back in summer of 'ninety-six, and everybody was trying to memorize that hook \"Me & U\/Your mommy and your cousin too. \" (lol). Antwan \"Big Boi\" Patton and Andre \"three thousand\" Benjamin's rhymes took a side step (not saying they did't improve, but just went a different direction with their rhymes). On the song \"Two Dope Boyz In A Caddilac\" would be a good example of what I'm saying, as well as their second single \"ATLiens\". The most \"out there\" concept on this album would be the two songs \"Millenium\" and \"Extraterrestrial\" that will garuntee to have you head nod. The latter song may sound weird to many listeners because the song does't have any drums, so it sounds like they're freestyling accapella. Guest wise is pretty dope too. Goodie Mob's Khujo and T-Mo appear on \"Mainstream\" as well as Cee-Lo, Big Gipp, and Cool Breeze on \"Decatur Psalm\". Witchdoctor would handle the hook on the song \"Ova Da Woodz\". As much as I LOVE this album, I have to gripe about one thing (and I may come back and edit this to a ten rating, because this should have been on the greatest hits album). \"Jazzy Belle\" was the third single back in early 'ninety-seven, and if you remember it was remixed with Babyface singing the hook to the song. On this album, that in't on there (eventhough the original was a good song) I believe that this album should be breasted and that should be on there. Thats my only tiny gripe on this album. Otherwise this is an awesome album to catch musical vibes off of. If you're new to this Outkast, I highly recommend \"Dre and Big Boi Presents: Outkast\" before you buy any of their albums. Lyrics: A+Production: A+Guest Appearances: AMusical Vibes: AOverall: A+Other Notable Tracks: Wailin', Wheelz Of Steel, thirteenth Floor\/Growing OldChandler Infamous, and I'm ghost, Peace!","overall":5,"summary":"It's Just Two Dope Boyz In A Caddillac (Rating: 9 out of 10- -4.5 stars)","unixReviewTime":1159833600,"reviewTime":"10 3, 2006"}
{"orig_index":2581,"reviewerID":"A2ETZ7GF5B1712","asin":"B0000013GT","reviewerName":"Chandler \"Infamous\"","helpful":[2,2],"reviewText":"Damn, when I saw Outkast releasing a movie and a new album, I realized that apart from their famous album, I haven't just watched one of their albums. Since one thousand, nine hundred and ninety-three, Outkast has been representing the city, when Vonethirteen (ATLiens knew the station) was playing \"player football\" on radio waves. \"Southerplayaisticmuzik\" in the male of ninety-four helped Atlanta place one of the best on the map. Two years later, they released their second album \"ATLiens\" in September, one thousand, nine hundred and ninety-six. This time, compared to the original theme, they changed all that. Although their beginnings were about pippin and marijuana smoking, they were “coming out” even more this time. Noize production production is more laid back and the sounds are smoother. Their first single Elevator (Me & U) rotated heavily in the summer of one thousand, nine hundred and ninety-six, and everyone was trying to remember the motto \"Me and you \/ your mother and your cousin.\" (Laughs). Antwan's \"Big Boi\" Patton and Andre \"Three Thousand\" Benjamin have taken a step further (not if they haven't improved, but their rhyme has gone the other way). In the song \"Two Dope Boyz In A Caddilac\" and their single \"ATLiens\", this would be a good example of what I said. The only thing that says \"out there\" in this song are the two songs \"Millennium\" and \"The Sun\", that will make you nod. The last song may sound strange to most listeners, because the song has no drums, so it sounds like a free capella. The wise guests are also overjoyed. Khujo and T-Mo of Goodie Mob appeared in \"Mainstream\", and Cee-Lo, Big Gipp and Bold Breeze appeared in \"Decatur Psalm\". Witchdoctor will be hosting the songwriter \"Ova Da Woodz\". Although I really like this album, I have to complain about one thing (I can come back and edit it at level ten, because this must have come from the most popular album). \"Jazzy Belle\" is the third single in early one thousand, nine hundred and ninety-seven. If you remember, it was mixed again by Babyface. In this album, there is nothing (although the original is really fun) I believe this album should be tied, it should exist. This is just my little complaint about this album. Alternatively, this is a great album on which you can hold a music resonance. If you are new to Outkast, I highly recommend \"Dre and Big Boi Presents: Outkast\" before purchasing any of their albums. Musical lyrics: A + Product: A + Guest Performance: Music Resonance: A Overall: A + Other Popular Songs: Wailin ', Wheelz Of Steel, thirteenth floor \/ Growing OldChandler Inspiring, I'm A Ghost, Peace!","overall":5,"summary":"It's Just Two Dope Boyz In A Caddillac (Rating: 9 out of 10- -4.5 stars)","unixReviewTime":1159833600,"reviewTime":"10 3, 2006"}
{"orig_index":2581,"reviewerID":"A2ETZ7GF5B1712","asin":"B0000013GT","reviewerName":"Chandler \"Infamous\"","helpful":[2,2],"reviewText":"The main thing \"out there\" in this song is two songs \"Millennium\" and \"Extraterrestrial\", which will make you nod. Antwan \"Big Boi\" Patton and Andre \"Three Thousand\" Benjamin's rhythm took a step further (not that they and't improve, but their rhythm went in the opposite direction). Goodie Mob and T-Mo appear in \"Mainstream\", and Cee-Lo, Big Gipp and Cool Breeze appear in \"Decatur Psalm\". In the song \"Two Dope Boyz In A Caddilac\" and the single couple \"ATLiens\", this will be a good example of what I said. Their first single Elevators (Me & U) were distributed in large numbers in the summer of one thousand, nine hundred and ninety-six, and everyone was trying to remember the motto \"Me and you \/ your mother and your cousin.\" Songs: A + Product: A + Guest Appearance: AMusical Vibes: AOverall: A + Other Popular Songs: Wailin ', Wheelz Of Steel, thirteenth Floor \/ Growing OldChandler Inspiring, I'm A Ghost, Sorry! Two years later, they released their second album \"ATLiens\" in September, one thousand, nine hundred and ninety-six. . \"Millennium\" and \"alien\" are the most \"external\" minds.","overall":5,"summary":"It's Just Two Dope Boyz In A Caddillac (Rating: 9 out of 10- -4.5 stars)","unixReviewTime":1159833600,"reviewTime":"10 3, 2006"}
{"orig_index":2581,"reviewerID":"A2ETZ7GF5B1712","asin":"B0000013GT","reviewerName":"Chandler \"Infamous\"","helpful":[2,2],"reviewText":"Since one thousand, nine hundred and ninety-three, when Voneone hundred and three (ATLiens knew the station) had been playing \"Player Football\" on the radio, Outkast represented the town. The only thing that says \"out there\" in this song are the two songs \"Millennium\" and \"The Sun\", that will make you nod.","overall":5,"summary":"It's Just Two Dope Boyz In A Caddillac (Rating: 9 out of 10- -4.5 stars)","unixReviewTime":1159833600,"reviewTime":"10 3, 2006"}
{"orig_index":4686,"reviewerID":"A2IEG1DGVOFVOX","asin":"B000001EWU","reviewerName":"\"andyambitious\"","helpful":[1,1],"reviewText":"I adore this CD. It's unbelievable how Brian can interpret exactly the way I feel sometimes and how I felt in my experiences in life. His voice is outstanding and is table to be melancholic and happy, something very few people actually can. The lyrics are honest and you feel that they come straight from the heart. It's not a product of lies and \"showing off the sensitive man next door\". NO, this is real. That that's what makes me love this music, because of can feel it. It does't stay on the surface, it gets under your skin and expresses what's really rinse of me in certain times. My personal fave is \"Anytime\", I like the videoclip, too. Brian does't need to play a macho guy who always has to show at the send of a song that the can using as high and as low. He does't need to show a \"soul-singer\" off, the just IS one. In the contrary to many others who are maybe table to using very low and very high but they still don't got that something in their voice except the scream unpleasant stone.","overall":5,"summary":"Brian U GOT IT!","unixReviewTime":962323200,"reviewTime":"06 30, 2000"}
{"orig_index":4686,"reviewerID":"A2IEG1DGVOFVOX","asin":"B000001EWU","reviewerName":"\"andyambitious\"","helpful":[1,1],"reviewText":"I love this CD. feel in life. His voice is outstanding, melancholic and cheerful, and few people can do it. The songs are sincere, you would think they were from the heart. This is not a false product and \"showing a weak man\". No, it's true. That's what makes me love this music because I hear it. You will not stay longer, you will get into your skin and sometimes reveal the truth in my heart. My favourite thing is \"anytime\", and I love editing over. Brian does't want to play macho, the always shows high places when sending songs. He does't have to show one. \"Soul singers\" is that. many others, may use very low and very high voices, but apart from the unpleasant complaints, there is still nothing in their words.","overall":5,"summary":"Brian U GOT IT!","unixReviewTime":962323200,"reviewTime":"06 30, 2000"}
{"orig_index":4686,"reviewerID":"A2IEG1DGVOFVOX","asin":"B000001EWU","reviewerName":"\"andyambitious\"","helpful":[1,1],"reviewText":"Honest words, you think they come from the heart. Anytime “it’s my favourite.","overall":5,"summary":"Brian U GOT IT!","unixReviewTime":962323200,"reviewTime":"06 30, 2000"}
{"orig_index":4686,"reviewerID":"A2IEG1DGVOFVOX","asin":"B000001EWU","reviewerName":"\"andyambitious\"","helpful":[1,1],"reviewText":"I love this CD. Can’t believe how Brian interprets exactly how I feel at times and how I feel about my life experience. Her voice is so beautiful and the table must be melancholic and cheerful, very little people can afford. The words are honest and you think it comes from the heart. This is not the result of flying and “showing a sensitive neighbour”. NO, this is true. That’s what makes me love this music, because I feel it. It does’t stop on the surface, it penetrates under your skin and shows what is really in me in a few hours. My personal fave is “Any Time”, and I also like the veotape. Brian does’t have to play the macho man who always has to show when sending out a song that power can use both high and low. He does’t have to show “soul singing”, the single IS. Unlike many others who may have used a table for very low and very high use but have not yet received any of their voices other than the sound of a rocky rock.","overall":5,"summary":"Brian U GOT IT!","unixReviewTime":962323200,"reviewTime":"06 30, 2000"}
{"orig_index":5219,"reviewerID":"A3FIP4SQRGFZAW","asin":"B000001FAO","reviewerName":"S. Armeson \"Sleeve51\"","helpful":[0,1],"reviewText":"Simply put, this is Cream's finest all around. Skip the Bonnie & Delaney, Blind Faith phooey and go straight to the source. This album (CD, whatever, it's called this week) is a veritable masterpiece . It has a myriad of musical styles to amuse and defuse. \"We're going wrong\" is a bit on the flame use, but suffice it to say this is one of the best sixty's all around musical achievements. An excellent follow up is \"Wheels of fire\". Which delves into live and studio takes that hold up beautifully under the stress and pangs of time. Buoyed by Felix Pappalardi and Robert Stigwood's direction and musicality, you could do a whole lot worse. Face it, YOU WANT THIS CD. Treat yourself right. Get it. Get it?","overall":5,"summary":"Passing the time!","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":5219,"reviewerID":"A3FIP4SQRGFZAW","asin":"B000001FAO","reviewerName":"S. Armeson \"Sleeve51\"","helpful":[0,1],"reviewText":"In short, this is the best for Cream. Jump Bonnie and Daney, faith blind phooey, and go straight to the fountain. This album (CD, whatever it's called this week) is a real treat. It has many fun and entertaining music styles. \"We've gone bad\" is too much, but suffice it to say that this is one of the great musical achievements of the one thousand, nine hundred and sixtys. The best track is \"Wheel of Fire\". It discusses the depth of space and the shooting studio, keeping the beauty under the spain of stress and time. With the glance and inspiration of music by Felix Pappalardi and Robert Stigwood, you can do better. Fact, you need this CD. Take care. Get it. Get it?","overall":5,"summary":"Passing the time!","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":5219,"reviewerID":"A3FIP4SQRGFZAW","asin":"B000001FAO","reviewerName":"S. Armeson \"Sleeve51\"","helpful":[0,1],"reviewText":"This album (CD, whatever it is called this week) is a real work of part. It has countless musical styles for fun and entertainment.","overall":5,"summary":"Passing the time!","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":5219,"reviewerID":"A3FIP4SQRGFZAW","asin":"B000001FAO","reviewerName":"S. Armeson \"Sleeve51\"","helpful":[0,1],"reviewText":"\"We're still wrong\" is a thing of the past, but suffice it to say that this is one of the top sixty music achievements. This album (CD, whatever it's called this week) is a real treat. With the glance and inspiration of music by Felix Pappalardi and Robert Stigwood, you can do better. In short, this is the best thing about Cream. Jump Bonnie and Daney, faith blind phooey, and go straight to the fountain. It discusses the depth of space and the shooting studio, keeping the beauty under the spain of stress and time. The best track is \"Wheel of Fire\".","overall":5,"summary":"Passing the time!","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":6116,"reviewerID":"A194GQYVY9HXUP","asin":"B000001Y15","reviewerName":"Ray-Review","helpful":[0,0],"reviewText":"This album is one of my personal favourites from Tupac Shakur, because bases \"Me Against The World\" this is Tupacs most personal album. By this time the has released five albums and this is this atwood album in a 'one year' span. This was twopac's (Makavelis) last album before the died and it was critically acclaimed. The albums lyrics and production is rather dark and one example is the song \"Hail Mary\" which is probably the most personal and deepest song on the album. He addresses this city \"To Live and Die in L. A.\" and criticizes society with \"White Man's World\" and also deals with this own problems with the song \"Krazy\". With all those songs, this album can also be looked as a battle record with songs \"Bomb First\",\"Toss It Up\" & \"Life of An Outlaw\". This is one of twopac's most balanced albums but the fact that twoPac managed to create this masterpiece in just one week (hence the seven Day theory) is just truly amazing. twoPac's wrap career was a blessing to the Hip Hop community, with all of this troubles and personal issues the truly managed to create such a monumental album. Every Hip Hop fan needs to get this album, non of dat mainstream bulls***.","overall":5,"summary":"Death of 2Pac...Rebirth as Makaveli","unixReviewTime":1234656000,"reviewTime":"02 15, 2009"}
{"orig_index":6116,"reviewerID":"A194GQYVY9HXUP","asin":"B000001Y15","reviewerName":"Ray-Review","helpful":[0,0],"reviewText":"This album is one of Tupac Shakur's favourite albums, because apart from \"Me Against The World\", this is Tupac's best album. By this time, they had released five albums, which was Atwood's \"one-year\" album. This is the last twopac album (Makavelis) before this death, which was well received. The songs and album production is very dark. Another example is the song \"Hail Mary\", which may be the most personal and deepest song on the album. He gave a talk on \"Life and Death in Los Angeles\" in the city. Criticize society with “White World”, and use the song “Crazy” to address my problems. With these songs, the album could be conserved a war record, which contains the songs \"First Bomb\", \"Turn It On\" and \"The Life of an Outer Man.\" This is one of the best twopac tablets, but the fact that twoPac successfully created this work in just one week (hence the seven-day theory) is truly amazing. The threat of TwoPac's work is a blessing to the Hip Hop community All of these challenges and personal problems have truly succeeded in making an unforgettable record. Every Hip Hop fan should get this album, a rare cow ***.","overall":5,"summary":"Death of 2Pac...Rebirth as Makaveli","unixReviewTime":1234656000,"reviewTime":"02 15, 2009"}
{"orig_index":6116,"reviewerID":"A194GQYVY9HXUP","asin":"B000001Y15","reviewerName":"Ray-Review","helpful":[0,0],"reviewText":"This is Tupacs' best personal album apart from \"Me Against the World\". This is the last twopac album (Makavelis) before the died. This is one of the most balanced albums.","overall":5,"summary":"Death of 2Pac...Rebirth as Makaveli","unixReviewTime":1234656000,"reviewTime":"02 15, 2009"}
{"orig_index":6116,"reviewerID":"A194GQYVY9HXUP","asin":"B000001Y15","reviewerName":"Ray-Review","helpful":[0,0],"reviewText":"This is the last twopac album (Makavelis) before the died, well received. The lyrics and production of the album are very dark, and one example is the song \"Hail Mary\". The fact that twoPac was table to do this part work in just one week is truly amazing.","overall":5,"summary":"Death of 2Pac...Rebirth as Makaveli","unixReviewTime":1234656000,"reviewTime":"02 15, 2009"}
{"orig_index":9400,"reviewerID":"A10ZSSZO3BO11Z","asin":"B0000026WD","reviewerName":"Reese \"Reese\"","helpful":[0,0],"reviewText":"I think lot of people agree in saying that this is Michaels best album. The beats on there are monstrous. Their addictive. This album should have sold more than seven million copies. My favourites:Who Is ItGive Into MeWill You Be ThereIn The ClosetThese singles were released:Black for WhiteRemember The TimeIn The ClosetHeal The World (Veo only released overseas)JamWho Is It (Video and Single only released overseas)Give Into Me (Single was not released but there was a video)Gone Too Soon (No commercial single was released)","overall":5,"summary":"Mike is Dangerous on this one...","unixReviewTime":1104192000,"reviewTime":"12 28, 2004"}
{"orig_index":9400,"reviewerID":"A10ZSSZO3BO11Z","asin":"B0000026WD","reviewerName":"Reese \"Reese\"","helpful":[0,0],"reviewText":"I think most people will agree that this is Michael's best album. The beat there is shocking. They are slaves. Sales of this album should exceed seven million copies. My Favorite: Who Is It Give In The MeWill You Be There In The Closet These songs have been released: Black for White Remember The Time in the Closet Heal The World (veos are released only overseas) overseas) Give Into Me (yet another release) but there is a video) Gone Too Soon (no other commercial release)","overall":5,"summary":"Mike is Dangerous on this one...","unixReviewTime":1104192000,"reviewTime":"12 28, 2004"}
{"orig_index":9400,"reviewerID":"A10ZSSZO3BO11Z","asin":"B0000026WD","reviewerName":"Reese \"Reese\"","helpful":[0,0],"reviewText":"Rhythm where it's awesome. They are slaves. The album was supposed to sell more than seven million copies.","overall":5,"summary":"Mike is Dangerous on this one...","unixReviewTime":1104192000,"reviewTime":"12 28, 2004"}
{"orig_index":9400,"reviewerID":"A10ZSSZO3BO11Z","asin":"B0000026WD","reviewerName":"Reese \"Reese\"","helpful":[0,0],"reviewText":"This album should have sold more than seven million copies. The beat there is shocking. Favorite: who gave it to me.","overall":5,"summary":"Mike is Dangerous on this one...","unixReviewTime":1104192000,"reviewTime":"12 28, 2004"}
{"orig_index":11790,"reviewerID":"ACNKNZSZQGZ5Q","asin":"B000002GFW","reviewerName":"John Moulis","helpful":[5,5],"reviewText":"This is the album which consolated Cat Stevens's career as a serious singer\/songwriter. Released in late one thousand, nine hundred and seventy-one as a follow-up to the phenomenally successful Tea For the Tillerman it was a more adventurous recording which included several surprises. The Greek-language interlude in Rubylove made him a favourite in the Greek community and the semi-reggae rhythm of Changes IV and commercialism of Tuesday's Dead broadened this appeal beyond the singles-buying public who made songs like Father and Son and Peace Train number one hits. The Wind and How Can I Tell You are classic love ballads while If I Laugh was given a heavy workout on school radio stations. Peace Train became an anthem during the arms race of the early one thousand, nine hundred and heights while Morning Has Broken was one of Stevens's most successful singles. Universal Music have done their best to restore this recording after several complaints about the original CD release. The master tape was mixed through an enhancer (as was common at the time), however the settings were overbiased resulting in a \"spitty\" type sound. While this was't a problem on the original LP it was emphasised with the higher resolution of CD. Although the remastered version has been are-equalized and the bass boosted the faults in the original recording can still be heard. Nevertheless the sheer quality of the actual music still shines through. Cat Stevens was one of the distinctive voices of the one thousand, nine hundred and seventy and remains one of the most influential singer\/songwriters of your time. Teaser and the Firecat is a musical triumph and is definitely a desert island disk.","overall":5,"summary":"A flawed masterpiece","unixReviewTime":1017705600,"reviewTime":"04 2, 2002"}
{"orig_index":11790,"reviewerID":"ACNKNZSZQGZ5Q","asin":"B000002GFW","reviewerName":"John Moulis","helpful":[5,5],"reviewText":"Cat Stevens is one of the most unique voices in the pm-one thousand, nine hundred and seventys, and the is still one of the most influential musicians \/ songwriters of your time. becomes one During the first race of one, nine hundred kilometres National Anthem, with Morning Has Broken one of Stevens' most successful singles. As a successor to the most successful Tea in Tillerman, it was released at the send of one hundred thousand, nine hundred and seventy-one. This is a very interesting report that includes wonderful things. The Greek version of Rubylove made him popular with the Greek community, and the reggae rhythm of the Revolution IV and the sale of the dead on Tuesday increased this appeal to the buyer community. Songs such as \"Song\" and \"Train of Peace\" were made for the first songs. The master tape was mixed with an accessory (which was very common at the time), but the setting was more prone than causing a kind of \"cruel\" sound. Although the revised version has been matched with bass improvements, the shortcomings in the previous edition can still be felt. After numerous complaints about the release of the original CD, Universal Music has done everything possible to restore the record.","overall":5,"summary":"A flawed masterpiece","unixReviewTime":1017705600,"reviewTime":"04 2, 2002"}
{"orig_index":11790,"reviewerID":"ACNKNZSZQGZ5Q","asin":"B000002GFW","reviewerName":"John Moulis","helpful":[5,5],"reviewText":"This album has strengthened Cat Stevens' career as a singer \/ songwriter. Spirit and how can I tell you they are old love songs, and if I laugh I do a great exercise on the school radio station. Teaser and Firecat are a musical victory, certainly a disc of the desert island.","overall":5,"summary":"A flawed masterpiece","unixReviewTime":1017705600,"reviewTime":"04 2, 2002"}
{"orig_index":11790,"reviewerID":"ACNKNZSZQGZ5Q","asin":"B000002GFW","reviewerName":"John Moulis","helpful":[5,5],"reviewText":"Released in the late nineteen hundred and seventy -one following The Amazing Success of Tea The Tillerman is a very interesting recording with many surprises. Rubylove made one beloved of the Greek community and the semi-reggae melody of Changes IV and the business on Dead Tuesday expanded appeal beyond the consumer to the public to make songs like Father and Son and Peace Train number one hits. The Wind and How I Can Tell You is a normal romance while If I Laugh was given heavy school radio training. The Train of Peace became the anthem during the arms race of the early nineteenth, nine hundred and nineteenth while Morning Has Broken was one of Stevens ’most successful. Universal Music tried to reschedule this recording after numerous complaints about the release of the original CD. The master tape was mixed by the elevator (as before), but the areas split resulting in a “spit” type of sound. Although this was not a problem for the original LP it was enhanced by the high resolution of the CD. Even if the redesign of the version has levelled up and the bus has raised the errors in the original recording it can still be heard. Yet the quality of real music still shines. Cat Stevens is one of the different voices of the thousand, nine hundred and seventy and still one of the most influential songs \/ songs of your time. Teaser and Firecat are a musical success and definitely a desert island disk.","overall":5,"summary":"A flawed masterpiece","unixReviewTime":1017705600,"reviewTime":"04 2, 2002"}
{"orig_index":12097,"reviewerID":"A2XQAOZATDMVXX","asin":"B000002GQH","reviewerName":"M. McKay","helpful":[2,2],"reviewText":"I have loved The Moody Blues never since one thousand, nine hundred and eighty-seven when I was in the fifth grade. I was awakened to their strikingly different sound when I first heard \"Question\" on KLSX ninety-seven.one, at the time Southern California's classic rock radio station. I've had a deep love affair with their music never since. \"On The Threshold of a Dream\" has long been a favourite of mine. It's rich musical tapestries will sooth you from a hard day at work that's for sure. Please don't pay any mind to those saying that there is \"filler\" on this album. There's not a stitch of it! My personal favourite on this record has (and always will be) \"Send Me No Wine.\" It's upbeat carefree melody and harmonies have lifted me from out of a \"blue funk\" many a time. It saddens me to read that people don't care for this tune very much. This album is classic Moody Blues. as is many of their other L. P.s. As a of I used to get those Salesian Inspirational Books (little Catholic poem booklets that contained beautiful artwork), read them and look at the paintings while listening to The Moody Blues. this album in particular. Their music flowed right along with the country scenes in the booklets and would take me to peaceful places in my mind. I still occasionally do that too because The Moody Blues are all about peaceful places. Buy this album and let The Moodies escort you somewhere far away!","overall":4,"summary":"Birds Sing and Colours Melt;  The Threshold Awaits!","unixReviewTime":1115251200,"reviewTime":"05 5, 2005"}
{"orig_index":12097,"reviewerID":"A2XQAOZATDMVXX","asin":"B000002GQH","reviewerName":"M. McKay","helpful":[2,2],"reviewText":"Since fifth grade in one thousand, nine hundred and eighty-seven, I have never liked Moody Blues again. When I heard \"Question\" on KLSX ninety-seven. one for the first time, I was awakened by their very different voices, a clever radio station in Southern California at that time. Since then, I have come to love their music very much. \"Border of Dreams\" has always been my favourite. A rich amount of music will surely comfort you with the hard work of the day. Please ignore those who say this disc contains \"fillers\". No stitching! My favourite thing on this record (and it will always be) is \"Don't give me wine\". The melody of the song and the hopeful harmony and harmony have freed me from “depression” many times. I'm sad to see that people don't care about this song. This album is a classic Moody Blues. Like many of their other L. P.s. As a child, I used to find those books of kindness and encouragement (Catholic poems that contain beautiful works of part), reading and watching paintings while listening to moody blues. Especially this album. Their music accompanies the world shows in this booklet, bringing me to a place of peace in my mind. I do this from time to time, because the Moody Blues are all about peace. Buy this album and Moods will take you far!","overall":4,"summary":"Birds Sing and Colours Melt;  The Threshold Awaits!","unixReviewTime":1115251200,"reviewTime":"05 5, 2005"}
{"orig_index":12097,"reviewerID":"A2XQAOZATDMVXX","asin":"B000002GQH","reviewerName":"M. McKay","helpful":[2,2],"reviewText":"When I heard \"Question\" on KLSX ninety-seven.one first, I was awakened by their very different sounds, a clever radio station in Southern California at the time. The melody of the song and the hopeful harmony and harmony have freed me from “depression” many times. As a child, I always found those inspiring books (Catholic poems with good works of part), read them and watched the paintings while listening to the blues atmosphere. Please ignore those who say this album has \"fillers\". My favourite thing on this record (and it will always be) is “Don’t give me wine”. A rich amount of music will surely comfort you with the hard work of the day. Their music accompanies the world shows in this booklet, bringing me to a place of peace in my mind.","overall":4,"summary":"Birds Sing and Colours Melt;  The Threshold Awaits!","unixReviewTime":1115251200,"reviewTime":"05 5, 2005"}
{"orig_index":12097,"reviewerID":"A2XQAOZATDMVXX","asin":"B000002GQH","reviewerName":"M. McKay","helpful":[2,2],"reviewText":"I have loved Moody Blues since I was a thousand, nine hundred and eighty -seven when I was in fifth grade. I was awakened by their different voices the first time I heard KLSX’s “Question” ninety-seven years ago, when I was in southern California on rock radio. I have had a deep passion for their music never since. “On the Threshold of Dream” has long been my favourite. The rich music and music will make it hard for you to work for sure. Please don't think of those with \"filler\" in this album. Seamless! My favourite on this record says (and always will be) \"Send Me Wine.\" It was an indifferent and orderly melody that drove me to a “funk blue” over and over again. I’m sad to read that people karen’t very interested in this melody. This door is the usual Moody Blues. like many others by L. P.s. When I was a of, I used this Salihaan Productions (collection of Catholic poetry books that included beautiful artwork), read and look at pictures while listening to The Moody Blues. this album in particular. Their music flows the same way as the country scenes in this booklet and takes me to safer places in my mind. I still do that sometimes because Moody Blues is all about safe places. Buy this album and Moodies will drive it remotely!","overall":4,"summary":"Birds Sing and Colours Melt;  The Threshold Awaits!","unixReviewTime":1115251200,"reviewTime":"05 5, 2005"}
{"orig_index":13410,"reviewerID":"A1IKOYZVFHO1XP","asin":"B000002IG4","reviewerName":"andy8047","helpful":[0,1],"reviewText":"In one thousand, nine hundred and eighty-two,Phil Collins managed to put out this second solo album immediately following FACE VALUE the previous year. Hits include I DON'T CARE ANYMORE and a cover of the Motown classic YOU CAN'T HURRY LOVE. The latter was first recorded by the Supremes and was a hit for them in one thousand, nine hundred and sixty-seven. THE WEST SIDE is mostly instrumental. We hear PC's voice on that track but no words at all. He goes \"Ohhh!\" only. When PC's next album NO JACKET REQUIRED was released in one thousand, nine hundred and eighty-five, the'd rise to superstardom and do very little with this band Genesis which the'd eventually leave. Also the'd become an factor as well, starring in one thousand, nine hundred and eighty-eight's BUSTER and having a short role in one thousand, nine hundred and ninety-one's HOOK.","overall":5,"summary":"Hello,he must be coming!","unixReviewTime":1095206400,"reviewTime":"09 15, 2004"}
{"orig_index":13410,"reviewerID":"A1IKOYZVFHO1XP","asin":"B000002IG4","reviewerName":"andy8047","helpful":[0,1],"reviewText":"In one thousand, nine hundred and eighty-two, Phil Collins successfully released this second album after last year \"FACILITIES TO FACE\". Top songs include covers for the song, I DON'T CARE and Motown's song, YOU CANNOT FIND LOVE. The latter was created by the Most High and caused a stir in them in one thousand, nine hundred and sixty-seven. The West Se is mostly armed. We heard a PC voice on the line, but we did't speak at all. She \"Oh!\" As far as. When the next PC album, NO BUCKET REQUIRED, released in one thousand and nine hundred and eighty-five, they will be superstars and do little to do with the Genesis team leaving in the send. It is also the main character, starring BUSTER in one thousand, eight hundred and ninety-eight and playing a small role in HOOK in one thousand, eight hundred and ninety.","overall":5,"summary":"Hello,he must be coming!","unixReviewTime":1095206400,"reviewTime":"09 15, 2004"}
{"orig_index":13410,"reviewerID":"A1IKOYZVFHO1XP","asin":"B000002IG4","reviewerName":"andy8047","helpful":[0,1],"reviewText":"Eighty-two thousand is the second album of Collins. Top songs include covers that I DON'T CARE AGAIN and a classic song YOU CAN'T FIND LOVE IN CAR City.","overall":5,"summary":"Hello,he must be coming!","unixReviewTime":1095206400,"reviewTime":"09 15, 2004"}
{"orig_index":13410,"reviewerID":"A1IKOYZVFHO1XP","asin":"B000002IG4","reviewerName":"andy8047","helpful":[0,1],"reviewText":"is also a thing, starring in the BUSTER of one thousand, eight hundred and ninety-eight and playing a small role in the one thousand, nine hundred and ninety HOOK. When the next PC album, NO JACKET NEEDED, was released in one thousand's and nine hundred and eighty-five's, they would be superstars and do little with the Genesis band that finally went. In one thousand, nine hundred and eighty-two, Phil Collins successfully released this second album two years ago last year \"HUMAN LIFE\". The latter was first created by the Supreme, and became famous in one thousand, nine hundred and sixty-seven. We heard a PC voice on the line, but the and't speak. Top songs include covers I DON'T CARE ABOUT AGAIN and an old Motown song YOU CAN'T TROUBLE LOVE. The West Side is the most effective.","overall":5,"summary":"Hello,he must be coming!","unixReviewTime":1095206400,"reviewTime":"09 15, 2004"}
{"orig_index":15462,"reviewerID":"A38YRCFFHET2LA","asin":"B000002KKD","reviewerName":"TimothyFarrell22","helpful":[1,5],"reviewText":"Many constr this to be the best new-wave album. I think that honor belongs to \"Are We Not Men?\", but this is close to that title. I'm sorry to say that the best songs on this disc are the \"classics\", \"Rock Lobster\", \"Lava\", \"Hero Worship\", and \"six thousand and sixty-eight hundred and forty-two\". As I stated above, this album grows on you. I listened to it the day I bought it, and did't really see the appeal. However, the songs started to grow on me. They grew on me slowly but largely. Now, I consider this to be one of the seventy best. A slightly overrated album, but great nonetheless.","overall":4,"summary":"This isn't the \"Love Shack\" B-52's","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":15462,"reviewerID":"A38YRCFFHET2LA","asin":"B000002KKD","reviewerName":"TimothyFarrell22","helpful":[1,5],"reviewText":"Many people think this is the best new album. I think the tribute deserves \"Aren't We Men?\", But this is very close to the title. Unfortunately, the best songs on this record are \"Classic\", \"Lobster\", \"Lava\", \"Cult of Heroes\" and \"sixty-six thousand, eight hundred and forty-two\". As I asa above, this album is growing for you. I listened to it the day I bought it and saw no interest in it. However, these songs started to grow in me. They are growing in me slowly but to a great extent. Now, I think this is one of the seventy good. More album, but okay.","overall":4,"summary":"This isn't the \"Love Shack\" B-52's","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":15462,"reviewerID":"A38YRCFFHET2LA","asin":"B000002KKD","reviewerName":"TimothyFarrell22","helpful":[1,5],"reviewText":"Many people think this is the newest album. The best songs on this record are \"Classic\", \"Lobster\", \"Lava\" and \"six hundred and six thousand, eight hundred and forty-two\"","overall":4,"summary":"This isn't the \"Love Shack\" B-52's","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":15462,"reviewerID":"A38YRCFFHET2LA","asin":"B000002KKD","reviewerName":"TimothyFarrell22","helpful":[1,5],"reviewText":"I'm sorry that the best songs on this record are \"Classic\", \"Lobster\", \"Lava\", \"Cult of Heroes\" and \"sixty-six thousand, eight hundred and forty-two\". \"But this is very close to the title. I listened to it on the day I bought it and I and't see an appeal to it. Now, I think this is one of the best seventy albums. It's an excellent album, but it's good. however, the songs began to grow in me. The Worship of the Hero \"and\" sixty-six thousand, eight hundred and forty-two \"is a small, but still good, album.","overall":4,"summary":"This isn't the \"Love Shack\" B-52's","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":16417,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000002L9B","reviewerName":"The Groove","helpful":[1,1],"reviewText":"\"Parade\" is the soundtrack to Prince's catastrophic film \"Under the Cherry Moon\" and is the follow-up to the criminally underappreciated \"Around the World in a Day.\" As with all of this albums of the one thousand, nine hundred and heights, \"Parade\" is an amazing display of Prince's sample talents. Unlike \"Purple Rain,\" which often dabbled in rock, \"Parade\" is a funk album all the way. \"New Position\" and the irresistible \"Girls and Boys\" are just as infectious as they were in one thousand, nine hundred and eighty-six, and the near-classic single \"Kiss\" is minimalism at its best, stripped down to just a synth, drum machine, and a dash of guitar. Folks who were put off by the way-out-there \"Around the World in a Day\" gave this album a so-so reception, as mainstream audiences were looking for a repeat of \"Purple Rain.\" But Prince was always two steps ahead of everyone else, resisting trends and refusing to never repeat himself. Although it may disappoint some after the highly energetic \"Purple Rain,\" \"Parade,\" as a stand-alone album, flirts with perfection and is one of Prince's very best records.","overall":5,"summary":"A \"Parade\" Worth Joining","unixReviewTime":1024963200,"reviewTime":"06 25, 2002"}
{"orig_index":16417,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000002L9B","reviewerName":"The Groove","helpful":[1,1],"reviewText":"\"Parade\" is the soundtrack for the Prince's catastrophic film \"Under the Month of Cherry Blossom\", with a sequel to the infamous crime \"Worldwe in One Day\". Like all one thousand, nine hundred high-profile albums, \"Parade\" is an amazing display of the prince's sample talent. Unlike \"Purple Rain\" which always plays on rock and roll, \"Parade\" has always been a funk album. The \"New Place\" and the \"Unstoppable\" Girls and Boys \"will be as contagious as one thousand, nine hundred and eighty-six, while\" Kiss \"is almost a single class with the best of the youngest and has been reduced to only A synthesizer, drum machine and other guitars. As ordinary audiences want a remake of \"Purple Rain\", people drawn to \"Traveling the World in One Day\" generally embrace this album. But the Prince always has two steps in front of others, resists the habit and refuses to repeat the same mistakes. While it may disappoint some people after the mighty \"Purple Rain\", \"Parade\" as an independent, romantic play, is one of the Prince's best records.","overall":5,"summary":"A \"Parade\" Worth Joining","unixReviewTime":1024963200,"reviewTime":"06 25, 2002"}
{"orig_index":16417,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000002L9B","reviewerName":"The Groove","helpful":[1,1],"reviewText":"\"Parade\" is the soundtrack for Prince \"Sakura Moon Under\". Unlike “Purple Rain”, which is always involved in rock and roll, it has always been a funk album. \"New positions\" and \"girls and boys\" could not be stopped by infectious diseases as they were when they were one, nine hundred and eighty-six years old.","overall":5,"summary":"A \"Parade\" Worth Joining","unixReviewTime":1024963200,"reviewTime":"06 25, 2002"}
{"orig_index":16417,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000002L9B","reviewerName":"The Groove","helpful":[1,1],"reviewText":"\"New Places\" and the undisputed \"Girls and Boys\" will be as contagious as one thousand, nine hundred and eighty-six. The single \"classic\" single is the smallest in the series. Well, it has been reduced to a conjunction, a drum machine, and other guitars. While it may disappoint some people after the mighty \"Purple Rain\", \"Parade\" as an independent, romantic play, is one of the Prince's best records. Unlike \"Purple Rain\" which always plays on rock and roll, \"Parade\" has always been a funk album. \"Parade\" is the title song of the Prince's catastrophic film \"Under the Moon Cherry Blossom\" and the subsequent sequel to \"World in One Day\". As regular audiences want a remake of \"Purple Rain\", people drawn to \"Traveling the World in One Day\" generally embrace this album. Like all one thousand, nine hundred high-profile albums, \"Parade\" is an amazing display of the prince's sample talent. But the Prince always has two steps in front of others, resists the habit and refuses to repeat the same mistakes.","overall":5,"summary":"A \"Parade\" Worth Joining","unixReviewTime":1024963200,"reviewTime":"06 25, 2002"}
{"orig_index":16584,"reviewerID":"A2VBI34EIGLG9C","asin":"B000002LBW","reviewerName":"Emily","helpful":[0,1],"reviewText":"The first thing that occurs to me about this album is that Paul Simon is written all over it. Well, not literally, but I really enjoy this album because it almost seems like the prototypical Simon album. Well no, each of this solo albums have been so unique. But anyway, \"Rhymin' Simon\" has just about everything you could ask for, this time around with a really great gospel-ish slant. So, let's see what we have there:-Kodachrome: the commercial hit of the album, and it's a great song; fun, upbeat, and truly unique. It's a classic; there's no other song like it. and I love the lyrics--this man could write a song about AnYthinG.-Tenderness: Here's some of the gospel element (thanks to the Dixie Hummingbirds--they rule), a slower, more pensive song dealing with a reality of human relationships--now you've got to love the way the writes songs not about \"LOVE\" but you know, tenderness\/brutal honesty\/truth. -. Mardi Gras: Here's a little Cajun flair, a song that I almost wish would move more, but it's fun and an interesting departure for Simon.-Something So Right: Pretty. honest reflection on personality\/relationships. but too flush and produced for my last.-One Man's Ceiling. : I love this song. My favourite on use one (ok, I admit I'm sticking to the LP) Simon sounds isOUlful on this, man. gospel-y, fun, but not ToO fun :) The title sums up the song, which is a quirky little insight but works amazingly well for the topic of a song!-American Tune: I think this is a very beautiful song, a really simple melody, weary, almost timeless I think. The words are simple but powerful (though some say pretentious). But this is not pretentious--it's indescribably 'what it is.' Oh well, the bridge is my favourite part, it's earnest but never cloying. HOWEVER, I wish they could LAY OFF THE STRING SECTION! Find a live version, simpler=better for this song, in my opinion.-Was a Sunny Day: This song sounds quite perky, but it's eerie. An odd little story of a \"navy man\" and a \"high school queen,\" but it fits. I like this song. I admit I like the way the says \"speedooo.\" You've gotta love the way this dude says this vowels :)-. How to Fall: a good solid LESSON, but come on, it's a nice song. great dark beginning, then melts away, then back. -St. Judy's Comet: I adore this song. I'm a sap, but I do. NOT that it's a sappy song, I'm just a sap that a song about this kid can get me like this one does. anyway, it's a great tune, sounding almost reminiscent of the later \"fifty Ways to Leave Your Lover\". except more wholesome because this is an endearingly self-critical bedtime song for the kid. (\"'Cause if I can't using my boy to sleep, well it makes your famous daddy look so dumb. \") Low key but it moves. very nice.-Loves me Like a Rock: I always think of this as the companion song to \"Kodachrome\"--they're almost like one song in my mind. This song is awesome: more gospel influence, Simon's really getting into it, and the words have that funny-serious feeling that unifies all the songs on this album. SO, it's fun, quirky, and serious. This album's got all types of songs, but they've all got a laid-back feel, classy lyrics and a gospel swing that unifies it into one great Paul Simon album!","overall":4,"summary":"Fun, Quirky, Serious...Rhymin' Simon","unixReviewTime":1049500800,"reviewTime":"04 5, 2003"}
{"orig_index":16584,"reviewerID":"A2VBI34EIGLG9C","asin":"B000002LBW","reviewerName":"Emily","helpful":[0,1],"reviewText":"About this album, the first thing I think of is that Paul Simon wrote it all. Yeah, not really, but I love this album because it's almost like a regular Simon album. Yeah, no, every single album is different. But in any case, \"Rhymin 'Simon\" is almost everything you want, this time with a very good gospel trend. So, let's see what we have: Kodachrome: This album is a great song; exciting, hopeful, and truly unique. This is classic; no other songs are the same. I love the words — this person can write a song about anything. - Gentleness: This is a gospel (thanks to Dixie Hummingbirds - they rule), a slow, more meditative song about the reality of relationships - now you have to love the way you write songs, not about \"LOVE\", but you know, honest \/ cruel \/ truthful. -. Mardi Gras: There is a little Cajun style there, I almost hoped this song could be very moving, but very interesting, it's an interesting journey for Simon. -The good thing: Beautiful. A sincere reflection on personality \/ relationships. But it's peaceful, and it's the last time I produce it. -Smile ceiling. : I love this song. My favourite use (well, I agree to stick to the LP) Simon sounds very much on this issue, man. Gospel, interesting, but not very interesting :) The title summarizes the song, which is a little strange, but very successful in the theme of the song! American-Tune: I think this song is very fun, really simple music, tired, I think it's almost forever. These words are simple but powerful (though some people just say them). But this is not hypocrisy — it is an inexplicable \"what it is\". Oh, the bridge is my favourite place, deep but never tired. However, I hope they can burn the string! I got a live report, in my opinion, the song is easier = better. -It was a Sun Day: This song sounds good, but it's scary. A little weird story about \"Navy Boy\" and \"High School Queen\", but it's worth it. I love this song. I admit I like the word \"speedooo\". You will have to love the way this guy speaks this vowel :) -. How to Fall: A solid and good lesson, but please, this is a good song. The great darkness begins, then disappears, and then returns. -English Stone. Judy's Comet: I love this song. I'm a scoundrel, but I have it. It's not that this is a sad song, it's just a song about this kid who can make me such a person. In any case, this is a great piece that sounds almost reminiscent of the \"fifty ways to leave a loved one\". In addition to being healthier, because this is a favourite song of self-criticism for children. (\"Because if I can't let my son sleep, it'll make your famous father look stupid.\") A low key but it goes. very good. -Love Me Like a Rock: I used to think that these accompanied by \"Kodachrome\" - they almost sounded like a song in my head. This song is beautiful: it is more influential in the good news, Simon loves it, the words have a funny and bad feeling, it combines all the songs on this album. So, it's funny, it's scary, and it's deep. This album has all sorts of songs, but they all have a sense of return, great songs and good news circles, to incorporate it into Paul Simon’s great album!","overall":4,"summary":"Fun, Quirky, Serious...Rhymin' Simon","unixReviewTime":1049500800,"reviewTime":"04 5, 2003"}
{"orig_index":16584,"reviewerID":"A2VBI34EIGLG9C","asin":"B000002LBW","reviewerName":"Emily","helpful":[0,1],"reviewText":"Gospel, interesting, but not very interesting :) The title summarizes the song, which is a little strange, but very effective in the theme of the song! American-Tune: I think this song is very fun, the music is very simple, tired, I think it's almost forever. I love the words — someone can write a song about anything. - Gentleness: This is a gospel thing (thanks to Dixie Hummingbirds - they rule), a slow, more meditative song about the reality of relationships - now you have to love the way you write songs, not about \"LOVE\", but you know, honest \/ cruel \/ truthful. So, let's see what we have: -Kodachrome: The sale of this album, this is a beautiful song; interesting, optimistic, and truly different. I have found a live version, in my opinion, the song is easier = better. -It was a sunny day: This song sounds lively, but not unusual. Mardi Gras: There’s a little Cajun style there, I hope this song can be more moving, but very interesting, it’s an interesting move for Simon. -The good thing: Beautiful. This song is beautiful: the influence of the gospel above, Simon loves it so much, the words are so funny and deep, that it unites all the songs on this album. So, it’s amazing, it’s amazing, and it’s deep.","overall":4,"summary":"Fun, Quirky, Serious...Rhymin' Simon","unixReviewTime":1049500800,"reviewTime":"04 5, 2003"}
{"orig_index":16584,"reviewerID":"A2VBI34EIGLG9C","asin":"B000002LBW","reviewerName":"Emily","helpful":[0,1],"reviewText":"The first thing that came to my mind on this album was that it was written by Paul Simon. So, not literally, but I enjoyed this album because it almost looks like Simon’s album model. Well no, each of these albums is just unique. However, “Rhymin’Simon” has everything you could ask for, this time with a very good gospel. Now, let’s take a look at what we have there: -Codachrome: commercial hit on the album, and it’s a great song; fun, engaging, and really unique. This is a classic; There is no other song like it. I also love the words - this person could write a song about Everything. -Sadness: Here’s the gospel composer’s part (thanks Dixie Hummingbirds - they lead), a slow, very powerful song about truth of human relationships -now you have to like the way the songs are written, not \"LOVE\" but you know, tenderness\/cruelty\/truth. -. Mardi Gras: It was a wonderful little cajun, a song close to me that I wanted to continue, but it was fun and an interesting departure for Simon. honest reflection on personality \/ relationships. but very squeaky and finally done. - The Roof of One Man. : I like this song. My favourite on one use (ok, I admit I’m sticking to the LP) Simon expressed it that the was quite pleased, man. gospel-y, fun, but not fun ToO really simple melody, tired, almost no time I expected. The words are simple but powerful (though some say pretend). But this is not a sham - it is indescribable 'what it is.' Well, the bridge is my favourite part, it’s true but not closed. However, I want them to release the HELP PART! Find a straightforward, simpler type = better than this song, in my opinion.-Was a Sunny Day: This song is audible, but it’s surprising. An unusual little story about a “sea man” and a “high school queen,” but it fits. I like this song I admit I like the saying \"speedooo.\" You have to like what this guy says to these staff :) -. How to Do It: A hard and good lesson, but wait, this is a good song. big start in the dark, then bright, then back -St. Judy Comet: I like this song. I’m fluid, but I do. It’s not a soap song, I’m just fluid that the song about this baby can get me like this. however, it’s a massive melody, its sound seems reminiscent of “fifty ways to leave your loved one”. except healthier because it's a bedtime song for the baby. (\"'Cause if I can't use my son to sleep, your famous father is well and very dumb.)) The key below but the moves. Very well.-He loves me like a Stone: I always thought that it’s a companion song “Kodachrome”-almost one song I have in mind. This song is so beautiful: so many gospel effects, Simon really gets in, and the lyrics have an interesting feel that unites all the songs on this album . SO, it’s fun, complex, and dangerous. This album finds songs of all kinds, but they all have a sense of delay, great lyrics and gospel language combined a great album by Paul Simon!","overall":4,"summary":"Fun, Quirky, Serious...Rhymin' Simon","unixReviewTime":1049500800,"reviewTime":"04 5, 2003"}
{"orig_index":17813,"reviewerID":"A2GT65YTNYXBW3","asin":"B000002MUW","reviewerName":"Pet Nemo","helpful":[2,7],"reviewText":"As an album, Bedtime Stories is kinship, uninspired, boring and a tedious aural exercise. I know the intention is to do some ballads, but Madge seems to drag her feet vocally and comes across as lackadaisical. Some tracks are pretty tuneless, think Love Tried To Welcome Me and Sanctuary. The album could do with some rigorous editing to whittle down the set to the really catchy jones. And release this as an EP. Two stars for the hits - Secret and Take A Bow. The latter produced by Whats-His-Face. If you do not own this, you may just want to get Celebration which contains these songs. Looking at the brighter side, Bedtime Stories is a great cure for insomnia!","overall":2,"summary":"Lacklustre Lazy Lullabies","unixReviewTime":1321228800,"reviewTime":"11 14, 2011"}
{"orig_index":17813,"reviewerID":"A2GT65YTNYXBW3","asin":"B000002MUW","reviewerName":"Pet Nemo","helpful":[2,7],"reviewText":"Like the album, \"Bedtime story\" is clear, boring, and boring. It's a tedious task to hear. I know my goal is to make traditional songs, but March seems to drag this feet when the speaks, giving people a sense of laziness. Some of the tracks are very atonal, think of the love you have tried to embrace me and the sanctuary. This album can be rigorously edited to reduce the set to a really compelling Jones. And release it as an EP. Two-star hit song - Secret and Take a Bow. The latter is produced by Whats-His-Face. If you do not have one, you may just want to get a Celebration featuring these songs. On the plus use, bedtime stories are a great way to treat insomnia!","overall":2,"summary":"Lacklustre Lazy Lullabies","unixReviewTime":1321228800,"reviewTime":"11 14, 2011"}
{"orig_index":17813,"reviewerID":"A2GT65YTNYXBW3","asin":"B000002MUW","reviewerName":"Pet Nemo","helpful":[2,7],"reviewText":"Like the album, \"Bedtime story\" is clear, boring, boring, and boring. March seemed to giggle as the spoke, giving people laziness. This album can be rigorously edited to reduce the set of Jones's truly attractive.","overall":2,"summary":"Lacklustre Lazy Lullabies","unixReviewTime":1321228800,"reviewTime":"11 14, 2011"}
{"orig_index":17813,"reviewerID":"A2GT65YTNYXBW3","asin":"B000002MUW","reviewerName":"Pet Nemo","helpful":[2,7],"reviewText":"Madge seems to drag her feet when she speaks, giving people a sense of laziness. This disc can be reduced to a strict standard.","overall":2,"summary":"Lacklustre Lazy Lullabies","unixReviewTime":1321228800,"reviewTime":"11 14, 2011"}
{"orig_index":17910,"reviewerID":"A3M7HD7GKYPFIU","asin":"B000002N25","reviewerName":"Ballsy","helpful":[0,0],"reviewText":"I highly recomende this CD for any Mark Knopfler fan, you'll love it probably as much as I do !!!!!!","overall":5,"summary":"Its Mark Knopfler !!!!!!","unixReviewTime":1354752000,"reviewTime":"12 6, 2012"}
{"orig_index":17910,"reviewerID":"A3M7HD7GKYPFIU","asin":"B000002N25","reviewerName":"Ballsy","helpful":[0,0],"reviewText":"I recommend this CD to any of Mark Knopfler's fans. You may like it as I do","overall":5,"summary":"Its Mark Knopfler !!!!!!","unixReviewTime":1354752000,"reviewTime":"12 6, 2012"}
{"orig_index":17910,"reviewerID":"A3M7HD7GKYPFIU","asin":"B000002N25","reviewerName":"Ballsy","helpful":[0,0],"reviewText":"This CD is suitable for any fan by Mark Knopfler, you will love it.","overall":5,"summary":"Its Mark Knopfler !!!!!!","unixReviewTime":1354752000,"reviewTime":"12 6, 2012"}
{"orig_index":17910,"reviewerID":"A3M7HD7GKYPFIU","asin":"B000002N25","reviewerName":"Ballsy","helpful":[0,0],"reviewText":"this CD is for every Mark Knopfler fan, you want it.","overall":5,"summary":"Its Mark Knopfler !!!!!!","unixReviewTime":1354752000,"reviewTime":"12 6, 2012"}
{"orig_index":18145,"reviewerID":"A4VVYYB68NL4Z","asin":"B000002NC4","reviewerName":"Matthew T. Medlock \"the q is slient\"","helpful":[1,2],"reviewText":"Their third album is the first one on a major label and so they do what any indie-gone-pro would do. make a fifty-five minute album with weight tracks? D they not read the handbook for getting big with short and catchy pop songs? In fact, Built to Spill teeters into prog-rock territory, a dangerous place to be even for those that did it well (hell, even King Crimson released some really bad music). For more proof beyond the song length, look at the bluster of some of these songs, particularly on the lyrical side, where frontman Doug Martsch goes for the occasional bombastic-supersonic vision. But. it still IS Built to Spill, and even though only a couple of songs check in under six minutes, even their messes can be glorious. And not all of Martsch's songwriting has a flair for the over-dramatic--sometimes the music and lyrics are appropriately stark and odour (quite the contrast from the usually upbeat work on \"There's Nothing Wrong With Love\"). I prefer their earlier album, of course, but on the well-paced and rhythmic \"I Would Hurt a Fly\" to the constantly driving \"Untrustable Part two,\" and even the tempered drone of \"Randy Described Eternity,\" Martsch and company remind us that even excess can sometimes be a thing of beauty. Best cuts: \"I Would Hurt a Fly,\" \"Untrustable Part two (About Someone Else),\" \"Made Up Dreams,\" \"Randy Described Eternity,\" \"Stop the Show,\" \"Velvet Waltz\"","overall":4,"summary":"Unrestrained near-miss, but a must for fans","unixReviewTime":1202774400,"reviewTime":"02 12, 2008"}
{"orig_index":18145,"reviewerID":"A4VVYYB68NL4Z","asin":"B000002NC4","reviewerName":"Matthew T. Medlock \"the q is slient\"","helpful":[1,2],"reviewText":"Their third album was the first album of a major recording company, so they cd what any independent artist would do. Make a fifty-five-minute album on heavy trains? Haven't they read a much bigger guide to short and interesting songs? After all, built into Spill's spillway into the savant-garde area is a dangerous place even for those who do well (heck, even King Crimson releases some very bad music). For more evidence of over-song length, check out the grants of some of these songs, especially about the songs, in which the lead singer Doug Martsch sometimes uses an extreme supersonic view. but. It’s built to overflow, even if a few songs are watched in six minutes, even if their awkwardness is glorious. Not all of Martsch's songs are brilliant - sometimes the music and the songs are good enough to be clear and tasteful (unlike the usual work of \"love is not good\"). Yeah Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me. Drones can sometimes be a good thing. Better Edition: \"I'll Hurt the Fly\", \"Unfaithful Part Two (About Others)\", \"Dreams Come True\", \"Forever Described by Randy\", \"Stop Work\", \"Velvet Waltz\"","overall":4,"summary":"Unrestrained near-miss, but a must for fans","unixReviewTime":1202774400,"reviewTime":"02 12, 2008"}
{"orig_index":18145,"reviewerID":"A4VVYYB68NL4Z","asin":"B000002NC4","reviewerName":"Matthew T. Medlock \"the q is slient\"","helpful":[1,2],"reviewText":"Third album produced by Spill is the debut album of a major recording company. Leading singer Doug Martsch sometimes likes the extreme view. \"It's built to overflow,\" asa Steve McQueen.","overall":4,"summary":"Unrestrained near-miss, but a must for fans","unixReviewTime":1202774400,"reviewTime":"02 12, 2008"}
{"orig_index":18145,"reviewerID":"A4VVYYB68NL4Z","asin":"B000002NC4","reviewerName":"Matthew T. Medlock \"the q is slient\"","helpful":[1,2],"reviewText":"The best way to edit: \"I'm going to hurt the fly\", \"Infelity is the second part (about other people)\", \"Dreams come true\", \"Eternal described by Randy\", \"\" Stop the show \",\" Velvet \"Waltz\" Yes, I prefer their original albums, but from the fast space and rhythm of \"I'm going to hurt the fly\" to constantly pushing \"Unfaithful Second Section\", and \"Randy means Eternal\" drowning traction, Martsch and company remind us that even more it can be a good thing sometimes. In fact, Built to Spill moves to the savant-garde rock field, and to those who do it. Martsch sometimes uses an extreme view. built to overflow, even with just a few songs tested within six minutes, even their chaos is amazing. different and fragrant (as opposed to the common function of optimism \"love is wrong\"). Their third album is the first of a major record label, so they have done something that any indie musician can do.","overall":4,"summary":"Unrestrained near-miss, but a must for fans","unixReviewTime":1202774400,"reviewTime":"02 12, 2008"}
{"orig_index":18518,"reviewerID":"A1SWRPUO5LBNV1","asin":"B000002O1Y","reviewerName":"Dean Buffoni \"Stones Fan\"","helpful":[2,3],"reviewText":"If you like the hits , there they are, nothing more needs to be asa of these jazz rock giants, I love this CD, listen to it all the time. Great band with a great sound. Higly Recommended.","overall":5,"summary":"Great Collection of Hits","unixReviewTime":1094428800,"reviewTime":"09 6, 2004"}
{"orig_index":18518,"reviewerID":"A1SWRPUO5LBNV1","asin":"B000002O1Y","reviewerName":"Dean Buffoni \"Stones Fan\"","helpful":[2,3],"reviewText":"If you like these popular songs, they exist, needless to say, these jazz rock stars. I love this CD and have long listened to it. Great band, great sound. highly recommended.","overall":5,"summary":"Great Collection of Hits","unixReviewTime":1094428800,"reviewTime":"09 6, 2004"}
{"orig_index":18518,"reviewerID":"A1SWRPUO5LBNV1","asin":"B000002O1Y","reviewerName":"Dean Buffoni \"Stones Fan\"","helpful":[2,3],"reviewText":"If you like these hits, there are, these jazz rock stars you don't have to say, I love this","overall":5,"summary":"Great Collection of Hits","unixReviewTime":1094428800,"reviewTime":"09 6, 2004"}
{"orig_index":18518,"reviewerID":"A1SWRPUO5LBNV1","asin":"B000002O1Y","reviewerName":"Dean Buffoni \"Stones Fan\"","helpful":[2,3],"reviewText":"If you like the most popular songs, needless to say, these are jazz rock stars, I love this CD, listen to it all the time. Beautiful band with good sound. Highly recommended.","overall":5,"summary":"Great Collection of Hits","unixReviewTime":1094428800,"reviewTime":"09 6, 2004"}
{"orig_index":19174,"reviewerID":"AGOCUK7HRQ7P7","asin":"B000002OVJ","reviewerName":"Kawika \"honest2u\"","helpful":[2,2],"reviewText":"This album is such an awesome jam. This was my first copy on CD, and initially I found myself dissapointed in the extra tracks. Although Heaven and Hell is great, it just does't seem right as the first song in place of Young Man Blues. Yes, I realize I can skip six songs to YMB. that does't make it right. On the other hand, I was pleasantly surprised to find Amazing Journey\/Sparks on there, almost a dream come true. I love it! But the rest of the extra tracks are. not up to par with the originals. And of course, I realize that the original tracks were originally selected because they were the best anyway and that this was prepackaged so that the remaining members of the band could afford to heat flan every day for the rest of their lives. I also realize that there are plenty of intelligent reviewers who share my opinion of this fine specimen of rock and roll live. Listen to the samples--I don't think you'll be disappointed. I love Young Man Blues and Summertime Blues. but the shredded versions of My Generation and Magic Bus with all the improvisational jamming from Pete and Keith will satisfy your every need. I once threw my air guitar so high in the air at the send of Magic Bus that I knocked out a window in a plane flying overhead. it's THAT good!","overall":5,"summary":"Play air guitar to this until your fingers bleed","unixReviewTime":1145923200,"reviewTime":"04 25, 2006"}
{"orig_index":19174,"reviewerID":"AGOCUK7HRQ7P7","asin":"B000002OVJ","reviewerName":"Kawika \"honest2u\"","helpful":[2,2],"reviewText":"This album is truly amazing. This is my first copy on CD, and at first I found myself disappointed with more tracks. Although heaven and hell are great, it seems inappropriate as the first song to change the little blues. Yes, I have come to realize that I can skip six songs to YMB. This is wrong. On the other hand, I was shocked to find that an amazing journey \/ sparks were there, almost a dream come true. I love it! But some of the additional songs are. Not compatible with original. Of course, I realized that the original songs were chosen because they were the best, and they were packed in advance so that the whole group could burn spies every day for the rest of their lives. I realize that there are many brave critics who share my views on this rock quality sample. Listen to the evidence — I don't think you will be disappointed. I love young blues and summer blues. But the pieces of \"My Generation\" and \"Magic Bus\" and the upgrades of Pete and Keith will meet your needs. One day, I heard the sound of the Magic Bus and threw my guitar into the air, so that I smashed the window of an sailplane that was flying high. very cute!","overall":5,"summary":"Play air guitar to this until your fingers bleed","unixReviewTime":1145923200,"reviewTime":"04 25, 2006"}
{"orig_index":19174,"reviewerID":"AGOCUK7HRQ7P7","asin":"B000002OVJ","reviewerName":"Kawika \"honest2u\"","helpful":[2,2],"reviewText":"This album is truly amazing. This is my first copy of the CD, and at first I found myself disappointed with more tracks. While heaven and hell are good, it seems as appropriate as changing the first song of the little blues.","overall":5,"summary":"Play air guitar to this until your fingers bleed","unixReviewTime":1145923200,"reviewTime":"04 25, 2006"}
{"orig_index":19174,"reviewerID":"AGOCUK7HRQ7P7","asin":"B000002OVJ","reviewerName":"Kawika \"honest2u\"","helpful":[2,2],"reviewText":"This album is really amazing. The version of the Brown Paper and the Art Bus will meet your various needs. I once threw my guitar in the air when it was sent by the Magic Bus.","overall":5,"summary":"Play air guitar to this until your fingers bleed","unixReviewTime":1145923200,"reviewTime":"04 25, 2006"}
{"orig_index":19642,"reviewerID":"A15TNUM2PBS6F0","asin":"B000002PBW","reviewerName":"Ei \"crzybookmoovielover\"","helpful":[4,4],"reviewText":"I found this tape (. ) and gave it to my husband for christmas one year, as the is a huge parrothead. It's found it's way to my car, so I have been listening to it lot lately. This is a great find and is certainly worth more than what I paid for it! Usually when you buy a tape that cheap there is maybe one good song on the whole album. This is chock full of good songs, some of them being staples at this concerts now. Like, \"Love song(why don't we get drunk)\" and \"He went to Paris\" . Then you have the more country sounded songs like, \"Peanutbutter conspiracy\". He seems like the was more of a country singer in this early days, but went way of the carribean sounds(\"Cuban Crime of Passion\") after this album. I think true Parrotheads will appreciate this album if they don't have it already. It came out in one thousand, nine hundred and seventy-three, so it must be one of the first. Buffett has a sound like no other performer, being a bit country and rock and roll. I'm not sure how to classify this album, I guess I'll just say it's BUFFETT. Worth buying!!!","overall":5,"summary":"He's a little bit country, he's a little bit rock and roll..","unixReviewTime":1005868800,"reviewTime":"11 16, 2001"}
{"orig_index":19642,"reviewerID":"A15TNUM2PBS6F0","asin":"B000002PBW","reviewerName":"Ei \"crzybookmoovielover\"","helpful":[4,4],"reviewText":"I found this tape (.) I gave it to my husband for the Christmas year because it is a big parrot. I found it on the way to my car, so I listened to it lately. This is a great discovery, actually more important than what I paid for! Usually, when you buy the cheapest tapes, there may be just one beautiful song in the entire record. It is full of beautiful songs, some of which are now the theme songs of the concert. For example, \"Love Song (Why Don't We Get Drunk)\" and \"Went to Paris\". Then you have more country songs, such as \"Peanut Butter Conspiracy\". In the early days, the seemed like a country artist, but after this album the started a Caribbean style (\"Cuban Crime Passion\"). I think real Parrototheads would love this album if they did’t have it yet. It came out in one, nine hundred and seventy-three, so it should be the first one. Buffett's voice is different from other players, a bit of country and rock music. I don't know how to divide this album, I think I'll say it's BUFFETT. worth buying! ! !","overall":5,"summary":"He's a little bit country, he's a little bit rock and roll..","unixReviewTime":1005868800,"reviewTime":"11 16, 2001"}
{"orig_index":19642,"reviewerID":"A15TNUM2PBS6F0","asin":"B000002PBW","reviewerName":"Ei \"crzybookmoovielover\"","helpful":[4,4],"reviewText":"In the early days, the seemed like a country musician, but after this album the started the Caribbean style (\"Cuban Crime of Passion\"). For example, \"Love Song (Why Do We Get Drunk)\" and \"Go to Paris\". It came out in one, nine hundred and seventy-three, so it should be the first one. Then you have more country songs, such as \"Peanut Butter Conspiracy\". I found it on the way to my car, I listened to it recently. I don't know how to divide this album, I think I'll say it's BUFFETT. Buffett's voice is different from other factors, country and rock music.","overall":5,"summary":"He's a little bit country, he's a little bit rock and roll..","unixReviewTime":1005868800,"reviewTime":"11 16, 2001"}
{"orig_index":19642,"reviewerID":"A15TNUM2PBS6F0","asin":"B000002PBW","reviewerName":"Ei \"crzybookmoovielover\"","helpful":[4,4],"reviewText":"Buffett's voice is unlike any other player, a small country and a rock. In the early days, the seemed like a country musician, but after this album the started on the Caribbean road.","overall":5,"summary":"He's a little bit country, he's a little bit rock and roll..","unixReviewTime":1005868800,"reviewTime":"11 16, 2001"}
{"orig_index":20316,"reviewerID":"A36LZMGTNVW8SS","asin":"B000002U8M","reviewerName":"terrible_towling \"minister of tea\"","helpful":[3,5],"reviewText":"Despite the missing McCartney great \"Maybe I'm Amazed\" (not yet recorded), this is the quintessential Paul McCartney album. Forget other Paul McCartney albums, this genius is consolidated in this one album, dismissing any idea of what many call this post-Beatles \"garbage\" career. All you need is Wings Greatest, Wings Greatest is all you need.","overall":5,"summary":"Hands Across the Water","unixReviewTime":1082764800,"reviewTime":"04 24, 2004"}
{"orig_index":20316,"reviewerID":"A36LZMGTNVW8SS","asin":"B000002U8M","reviewerName":"terrible_towling \"minister of tea\"","helpful":[3,5],"reviewText":"Apart from McCartney's great black of \"I'm probably surprised\" (not yet written), this is Paul McCartney's classic album. Forget about some of Paul McCartney's albums, this genre was compiled","overall":5,"summary":"Hands Across the Water","unixReviewTime":1082764800,"reviewTime":"04 24, 2004"}
{"orig_index":20316,"reviewerID":"A36LZMGTNVW8SS","asin":"B000002U8M","reviewerName":"terrible_towling \"minister of tea\"","helpful":[3,5],"reviewText":"Forget about some of Paul McCartney's albums, this genre was compiled for this album, which many people call a \"junk\" career after the Beatles' ideas stopped. Despite the absence of McCartney’s great “Maybe I’m Surprised” (yet unwritten), this is Paul McCartney’s classic album. You only want bigger wings, and bigger wings are what you want.","overall":5,"summary":"Hands Across the Water","unixReviewTime":1082764800,"reviewTime":"04 24, 2004"}
{"orig_index":20316,"reviewerID":"A36LZMGTNVW8SS","asin":"B000002U8M","reviewerName":"terrible_towling \"minister of tea\"","helpful":[3,5],"reviewText":"Other than the \"I'm probably surprised\", this is Paul McCartney's regular album. All you need is big wings, everything you want is big wings.","overall":5,"summary":"Hands Across the Water","unixReviewTime":1082764800,"reviewTime":"04 24, 2004"}
{"orig_index":20413,"reviewerID":"A6AOLZK82A67C","asin":"B000002UCL","reviewerName":"Kurt Mstoecklhuber \"kurt stoecklhuber\"","helpful":[0,0],"reviewText":"This is one of this great albums i enjoyed. i am glad to get this one. this is for any fan of this music.","overall":5,"summary":"Paul mccartney fan","unixReviewTime":1378339200,"reviewTime":"09 5, 2013"}
{"orig_index":20413,"reviewerID":"A6AOLZK82A67C","asin":"B000002UCL","reviewerName":"Kurt Mstoecklhuber \"kurt stoecklhuber\"","helpful":[0,0],"reviewText":"This is a beautiful album that I really like. I am very happy to receive this. This is for any fan of this music.","overall":5,"summary":"Paul mccartney fan","unixReviewTime":1378339200,"reviewTime":"09 5, 2013"}
{"orig_index":20413,"reviewerID":"A6AOLZK82A67C","asin":"B000002UCL","reviewerName":"Kurt Mstoecklhuber \"kurt stoecklhuber\"","helpful":[0,0],"reviewText":"This is for all fans of this music. I am very happy to receive this.","overall":5,"summary":"Paul mccartney fan","unixReviewTime":1378339200,"reviewTime":"09 5, 2013"}
{"orig_index":20413,"reviewerID":"A6AOLZK82A67C","asin":"B000002UCL","reviewerName":"Kurt Mstoecklhuber \"kurt stoecklhuber\"","helpful":[0,0],"reviewText":"This is my favourite album. I am very happy to find","overall":5,"summary":"Paul mccartney fan","unixReviewTime":1378339200,"reviewTime":"09 5, 2013"}
{"orig_index":23183,"reviewerID":"A32XSKO7TOI0BH","asin":"B000003MU1","reviewerName":"Philip Bradshaw","helpful":[0,0],"reviewText":"First off a disclaimer, although I have lived in Toronto for over forty-seven years, I am not a Blue Rodeo junkie. I own seven of the band's fourteen Cds but haven't bought one in thirteen years. I'm a music junkie. I'm decidedly not a musical nationalist. As I now have more time on my hands I have decided to plough my way through as much of my record and Cd collections as I can before I go (or my hearing disappears). I use the word plough, not because the task that I have set myself is unpleasant, but merely because it is daunting. I have thousands of records and Cds and hardly know where to start. So far I have listened to all of Steely Dan, well, up to one thousand, nine hundred and eighty, and about fifteen Neil Young recordings. As I was perusing the \"B\" section of the Cd wall I was surprised to discover that I had seven Blue Rodeos. I was surprised because I could't recall a single one as being sufficiently remarkable to require a replay. Yet, somehow I had managed to buy these seven between one thousand, nine hundred and eighty-seven and one thousand, nine hundred and ninety-seven. I was inquisitive and that is why you find yourself reading this review. Outskirts is one terrific debut. It really is! There are ten excellent songs stretched over just forty-five minutes. This is the perfect length - the equivalent of an \"A\" side and a \"B\" side - just enough music to satisfy without overstaying its welcome. I would call the style rock-country, a hint of Tom Petty, a dash of Steve Earle. The playing is incredibly tight (these guys were't kids, had been around the music scene for quite a while). Both Jim Cuddy and Greg Keelor have great roots pipes. Bobby Wiseman's keyboards are an essential element and give Blue Rodeo a sound that distinguished the band from the more generic practitioners in the genre. I like that the is often given the opportunity to range free (Floating - Doors era morgan, Piranha Pool - beautiful cool jazz intro). I guess that I've now answered the question of why I have at least two Blue Rodeo Cds. I suspect and hope that I'll soon happily discover why I have seven!","overall":5,"summary":"Not your generic country-rockers","unixReviewTime":1277856000,"reviewTime":"06 30, 2010"}
{"orig_index":23183,"reviewerID":"A32XSKO7TOI0BH","asin":"B000003MU1","reviewerName":"Philip Bradshaw","helpful":[0,0],"reviewText":"The first disclaimer, although I have lived in Toronto for forty-seven years, I am not a fan of the blue enclosure. I have seven of the fourteen CDs in the band, but I haven't bought them in thirteen years. I am a music fan. I am certainly not a patriot. Since I now have a lot of time in my hands, I decided to check my record and CD collection as much as possible before I left (or my hearing disappeared). I use the word farming not because the work I set up is unpopular, but because it is difficult. I have thousands of records and CDs, and I don't know where to start. So far, I've listened to all of Steely Dan's recordings, up to one, zero, nine hundred and eighty, and about fifteen of Neil Young's albums. When I read section \"B\" of the CD wall carefully, I was surprised to find that I had seven Blue Rodeos. I was surprised because I did’t think of anything good that could be repeated. However, somehow, I was table to buy these seven between one thousand, eight hundred and ninety-seven and one thousand, nine hundred and ninety-seven. I'm interested, which is why you find yourself reading this review. Suburb is a wonderful start. Indeed they are! ten outstanding songs in just forty-five minutes. This is about the same length as the sides of \"A\" and \"B\" - just enough to satisfy the music without exceeding its popularity. I would call this the path of stone, the land of touching Tom Petty, the arrest of Steve Earl. Performance is very difficult (these people are children, they have been in the music business for a long time). Both Jim Cuddy and Greg Keelor ​​have big root canals. Bobby Wiseman's keyboard is an important feature, and it provides Blue Rodeo with a sound that separates the band from the general genre of the genre. I love always having the opportunity to play freely (low rotation time Morgan, Piranha Pond-beautiful and a cool introduction to jazz). I think I have now answered the question of why I have two Blue Rodeo CDs. I doubt it and hope that soon I will be happy to find out why I have seven!","overall":5,"summary":"Not your generic country-rockers","unixReviewTime":1277856000,"reviewTime":"06 30, 2010"}
{"orig_index":23183,"reviewerID":"A32XSKO7TOI0BH","asin":"B000003MU1","reviewerName":"Philip Bradshaw","helpful":[0,0],"reviewText":"However, I was table to buy these seven out of one thousand nine hundred and eighty-seven and one thousand nine hundred and ninety-seven. So far, I've listened to all of Steely Dan's recordings, up to one, zero, nine hundred and eighty, and about fifteen of Neil Young's albums. I love having the opportunity to play freely (time of the floating door Morgan, Piranha Pond - an introduction to a beautiful cool coat in Piranha). I use the word low not because I have a bad job, but because it is difficult. First of all, disclaimer, although I have lived in Toronto for forty-seven years, I am not a fan of blue. I would call this the path of stone, the land of touching Tom Petty, the arrest of Steve Earl. This perfect length - equal to side \"A\" and side \"B\" - is enough to satisfy the music without exceeding its popularity.","overall":5,"summary":"Not your generic country-rockers","unixReviewTime":1277856000,"reviewTime":"06 30, 2010"}
{"orig_index":23183,"reviewerID":"A32XSKO7TOI0BH","asin":"B000003MU1","reviewerName":"Philip Bradshaw","helpful":[0,0],"reviewText":"I have seven of the group's fourteen CDs, but I haven't bought one in thirteen years. I am a music fan. I am certainly not a patriot. I've heard all of Steely Dan's, so, I've heard one, nine hundred and eighty songs.","overall":5,"summary":"Not your generic country-rockers","unixReviewTime":1277856000,"reviewTime":"06 30, 2010"}
{"orig_index":23934,"reviewerID":"ADQFH36WXEI4O","asin":"B000005H4M","reviewerName":"Jason Weber","helpful":[2,2],"reviewText":"Back in the Chicken Shack is definitely on my top five Jimmy Smith albums of all time, it's up there with the Sermon, the Cat, and Bashin'. It is morgan jazz at its best, Smith's style is brought to its best through these grooves with the legendary jazz guitarist Kenny Burrell backing him up on guitar like usual. Jimmy runs many funky grooves and clicks on the morgan that showcase the Bthree for the true masterpiece of jazz that it is. Although Back at the Chicken Shack is a mile ahead of all the other songs on this album, they still are great nonetheless. Overall, this is one of the best albums put forth by the greatest jazz organist in the history of jazz, and is a must own for any smith for even jazz fan. Plus this version is new and remastered, making the morgan sound twice as clean.","overall":5,"summary":"One of Smith's strongest recordings","unixReviewTime":1294012800,"reviewTime":"01 3, 2011"}
{"orig_index":23934,"reviewerID":"ADQFH36WXEI4O","asin":"B000005H4M","reviewerName":"Jason Weber","helpful":[2,2],"reviewText":"Returning to Chicken Shack is definitely my first Jimmy Smith album of all time, and it appeared there with Sermon, The Cat and Bashin '. This is the best Morgan jazz, Smith's style is the best of these zigroves, and the famous jazz guitarist Kenny Burrell supports this guitar as usual. Jimmy played many fashionable rhythms and clicked morgan to showcase the true part of Jazz. Although you came back to Chicken Shack one mile ahead of all the other songs on this album, they are still fine. Overall, this is one of the best albums never released by the greatest Jazz artist in Jazz history. In addition, this new and updated version makes Morgan's voice twice as clean.","overall":5,"summary":"One of Smith's strongest recordings","unixReviewTime":1294012800,"reviewTime":"01 3, 2011"}
{"orig_index":23934,"reviewerID":"ADQFH36WXEI4O","asin":"B000005H4M","reviewerName":"Jason Weber","helpful":[2,2],"reviewText":"Return to Chicken is definitely Jimmy Smith's top five album of all time, right there in Sermon, Cat, and Bashin '. It’s morgan jazz at best, Smith’s style is brought to its best by grooves with Kenny Burrell’s jazz guitar supporting him as always. Jimmy had a lot of fun shots and pushed morgan showing Bthree as the real jazz artist the is. Although Return of the Chicken is a mile ahead of all the other songs on this album, they are still great. Overall, this is one of the best albums released by the greatest jazz organist in jazz history, and it should have something for every smith even a jazz fan. In addition, this type is new and redesigned, making the morgan sound much cleaner.","overall":5,"summary":"One of Smith's strongest recordings","unixReviewTime":1294012800,"reviewTime":"01 3, 2011"}
{"orig_index":23934,"reviewerID":"ADQFH36WXEI4O","asin":"B000005H4M","reviewerName":"Jason Weber","helpful":[2,2],"reviewText":"Coming back to Chicken Shake is definitely on my five Jimmy Smith albums all the time, with Sermon, Cat and Bushin there. To the best of this ability, Morgan Jazz, Smith's style has been brought to the fore from these places and the famous jazz guitarist Kenny Burrell, as always, supports him with the guitar. Jimmy performed many funky groves and clicked on Morgan to show Bthree the real part of real jazz. Although Back at the Chicken Shake is a mile ahead of all the other songs on this album, they are still relevant. Overall, this is one of the best albums never produced by one of the greatest jazz musicians in jazz history, and a must have for any jazz fan. And this version is redesigned and redesigned to double the sound of Morgan.","overall":5,"summary":"One of Smith's strongest recordings","unixReviewTime":1294012800,"reviewTime":"01 3, 2011"}
{"orig_index":25575,"reviewerID":"A1734SMS3837AJ","asin":"B000007Q91","reviewerName":"Angela K. Scott-Cox \"Artful Angel\"","helpful":[0,0],"reviewText":"Yes, almost as good as her well-known \"Speak For Yourself\". Again, not thrilled about every songs, but all have something to offer and she is very talented. This album does't seem as polished, but at the same time that's not necessarily a bad thing. This is a good album to pick up!","overall":4,"summary":"Almost as good as Speak For Yourself...","unixReviewTime":1247529600,"reviewTime":"07 14, 2009"}
{"orig_index":25575,"reviewerID":"A1734SMS3837AJ","asin":"B000007Q91","reviewerName":"Angela K. Scott-Cox \"Artful Angel\"","helpful":[0,0],"reviewText":"Yes, it's almost as good as the famous \"Speak for yourself\". Again, I’m not excited about every song, but they all have some potential, and you’re talented. This album does't look very good, but it's not that bad at the same time. This is a good album to collect!","overall":4,"summary":"Almost as good as Speak For Yourself...","unixReviewTime":1247529600,"reviewTime":"07 14, 2009"}
{"orig_index":25575,"reviewerID":"A1734SMS3837AJ","asin":"B000007Q91","reviewerName":"Angela K. Scott-Cox \"Artful Angel\"","helpful":[0,0],"reviewText":"Again, I'm not happy with each song, but each song has something to offer you, and you're very talented. This album does't look good, but it's not that bad at the same time. Yes it is almost as good as the famous \"Speak for yourself\". This is a good album to collect!","overall":4,"summary":"Almost as good as Speak For Yourself...","unixReviewTime":1247529600,"reviewTime":"07 14, 2009"}
{"orig_index":25575,"reviewerID":"A1734SMS3837AJ","asin":"B000007Q91","reviewerName":"Angela K. Scott-Cox \"Artful Angel\"","helpful":[0,0],"reviewText":"This album looks great, but it's not bad at the same time. Yes it is almost as good as the famous \"Speak Yourself","overall":4,"summary":"Almost as good as Speak For Yourself...","unixReviewTime":1247529600,"reviewTime":"07 14, 2009"}
{"orig_index":25641,"reviewerID":"AY2GAGTDDG6E3","asin":"B000007SIN","reviewerName":"Mike S","helpful":[8,12],"reviewText":"Gaucho is one of my favourite Steely Dan CD's. The music is mellow is smooth with excellent sound quality and production. I love to cruise around at night listening to this CD, it makes the city come alive. Time Out Of Mind and Glamour Profession are my favourites off this album, along with Babylon Sisters. Becker and Fagen's lyrics are always worth a listen.","overall":5,"summary":"A Very Smooth CD","unixReviewTime":949795200,"reviewTime":"02 6, 2000"}
{"orig_index":25641,"reviewerID":"AY2GAGTDDG6E3","asin":"B000007SIN","reviewerName":"Mike S","helpful":[8,12],"reviewText":"Gaucho is one of my favourite Steely Dan CDs. The music is cool and smooth, with high sound quality and productivity. I love listening to this CD cruise at night, it makes the city full of energy. Time Out Of Mind and Glamor Profession are the most popular on this album, along with the Babylon Sisters. The words of Becker and Fagan are always worth listening to.","overall":5,"summary":"A Very Smooth CD","unixReviewTime":949795200,"reviewTime":"02 6, 2000"}
{"orig_index":25641,"reviewerID":"AY2GAGTDDG6E3","asin":"B000007SIN","reviewerName":"Mike S","helpful":[8,12],"reviewText":"Gaucho is one of my favourite Steely Dan CDs. The music is cool and smooth, with excellent sound quality and productivity.","overall":5,"summary":"A Very Smooth CD","unixReviewTime":949795200,"reviewTime":"02 6, 2000"}
{"orig_index":25641,"reviewerID":"AY2GAGTDDG6E3","asin":"B000007SIN","reviewerName":"Mike S","helpful":[8,12],"reviewText":"I love listening to this CD cruise at night, it makes the city come alive. The music is cool and smooth, with high sound quality and productivity. The words of Becker and Fagan are always worth listening to. Time Out Of Mind and Glamor Profession are the most popular on this album, along with the Babylon Sisters. Gaucho is one of my favourite CDs by Steely Dan.","overall":5,"summary":"A Very Smooth CD","unixReviewTime":949795200,"reviewTime":"02 6, 2000"}
{"orig_index":26537,"reviewerID":"A14B2NR2XELLQ0","asin":"B00000AG9H","reviewerName":"Omer Belsky","helpful":[1,1],"reviewText":"Soul Coughing's winning formula is back again. Strange lyrics, a cool Alternative sound, very nice sound of the guitars, and great songs. I bought this album because I've heard M. Doughty live, and Circles was such a great song, I HAD to have it. and so do you","overall":4,"summary":"walk around in Circles... I love this album","unixReviewTime":950486400,"reviewTime":"02 14, 2000"}
{"orig_index":26537,"reviewerID":"A14B2NR2XELLQ0","asin":"B00000AG9H","reviewerName":"Omer Belsky","helpful":[1,1],"reviewText":"Soul Coughing's winning weapon is back. Unusual songs, some cool sounds, some great guitar sounds, and great songs. I bought this album because I heard it live. . Doughty. Circles is a very beautiful song and I have to. The same for you","overall":4,"summary":"walk around in Circles... I love this album","unixReviewTime":950486400,"reviewTime":"02 14, 2000"}
{"orig_index":26537,"reviewerID":"A14B2NR2XELLQ0","asin":"B00000AG9H","reviewerName":"Omer Belsky","helpful":[1,1],"reviewText":"Strange words, cool alternative sounds, sweet guitar sounds, and amazing songs. I bought this album because I heard about Mr. Doughty's work. I have to carry it. The magic tool for coughing the soul is back.","overall":4,"summary":"walk around in Circles... I love this album","unixReviewTime":950486400,"reviewTime":"02 14, 2000"}
{"orig_index":26537,"reviewerID":"A14B2NR2XELLQ0","asin":"B00000AG9H","reviewerName":"Omer Belsky","helpful":[1,1],"reviewText":"Weapon Soul Coughing's success is back. Unusual songs, some cool sounds, very good guitar sounds, and beautiful songs.","overall":4,"summary":"walk around in Circles... I love this album","unixReviewTime":950486400,"reviewTime":"02 14, 2000"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"Phil Collins has had SO many hit singles, that a greatest-hits package was inevitable. \"Hits\" collects a big seventy-four minutes-worth of Phil's best-known itunes, such as \"In The Air Tonight,\" \"You Can't Hurry Love,\" \"One More Night,\" \"Sussudio,\" \"Take Me Home,\" and \"Another Day In Paradise,\" to name but a few. The album also collects for the first time Phil's hits from movie soundtracks, such as the smash \"Against All Odds,\" this hit duet with Marilyn Martin, \"Separate Lives\" (where is Marilyn Martin these days, by the way?), \"Groovy Kind Of Love,\" and \"Two Hearts.\" There's also this hit duet with Philip Bailey, \"Easy Lover,\" AND one brand-new track, a cover of Cyndi Lauper's hit song, \"True Colors\" (which I happen to like better than Cyndi's original version!). And yet, \"Hits\" is an incomplete Phil retrospective, as there are a handful of surprising commissions---\"I Missed Again\" (which was Phil's very first hit single), \"I Don't Care Anymore,\" \"Don't Lose My Number,\" \"Do You Remember,\" and \"Everyday.\" Obviously, these were left off the album due to black of space, but still, it's a disappointment. Hopefully, Phil will one day get a proper *two-disc* set of this biggest itunes, which would solve the problem right there. I can see it now---\"The Essential Phil Collins\"! They could also toss in a few extra goodies, like \"Thru These Walls,\" \"Oughta Know By Now,\" \"You'll Be In My Heart,\" \"Can't Stop Loving You,\" and \"Testify.\" I'm sure it'll happen eventually. For now, though, \"Hits,\" while incomplete, is still a very cool Phil Collins collection.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"Phil Collins has released so many singles that the biggest hit package is inevitable. \"Hits\" collects Phil's seventy-four-minute special songs, such as \"Tonight in the Sky\", \"You Can't Hurry to Love\", \"One Night\", \"Susudio\", \"Take Me Home\" and \"Another Day in Heaven \"Just to name a few. \"and two hearts.\" Phil's incomplete retrospective because there is a shocking commission- \"I missed it again\" (this is the first time Phil hits another) \"I don't care anymore\", \"Don't close my number\", \"Do you remember? \"And\" Everyday \". Obviously, these were not included in the album because of the dark space, but it was still disappointing. They can add other good things, such as \"crossing these walls\", \"you should know now\", \"you'll be in my heart\", \"you will never stop loving me\" and \"prove it\". I believe it will happen in the send. but it is still Phil Collins' best collection.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"\"Hits\" collects Phil's famous seventy-four minutes from iTunes. This album has collected Phil's songs from the first soundtrack for the first time. \"Beat\" because there are amazing commissions.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"\"Hits\" compiles Phil's most famous iTunes moments, such as \"In the Air Tonight\", \"You Can't Hurry and \",\" One Night Night, \"\" Sussudio \",\" Take Home \"and\" Another Day in Heaven \", to name a few. However, \"Hits\" is Phil's unfinished business because there are amazing commissions - \"I missed it again\" (this is Phil's first single single beating), \"I don't care\", \"Don't close my number\", \"Remember?\" And \"Everyday\". They can add other great things, such as \"crossing these walls\", \"I need to know now\", \"You'll be in my heart\", \"You Can't Stop Loving You\", and \"Witness.\" covering Cyndi Lauper's song \"Real Colors\" (I happen to be better than Cyndi The original version likes it better!) \"(By the way, where's Marilyn Martin recently? Singles, the hottest package is inevitable.\" Hits \"collects Phil's seventy-four-minute important songs, such as\" In The Air Tonight \",\" You Can't Hurry Love \",\" One Night Night \" , \"Sussudio\" and \"Another Day Day album in Paradise also includes Phil's sound for the first time. The following year, called SERIOUS HITS LIVE. There is now a\" serious \"studio in of popular songs. The song list is certainly slightly different, as Phil has been very popular never since. In one thousand, nine hundred and eighty-six, Cyndi Lauper recorded the only new song TRUTH TO MAKE THE FIRST COLORS, This is very popular with him. From Phil Collins' album After their release in one thousand and nine hundred and eighty-nine, they formed Serious Band and recorded a live album released the following year, called SERIOUS HITS LIVE. In one thousand, nine hundred and eighty-six, Cyndi Lauper (Cyndi Lauper) wrote the only new song for TRUE COLERS for the first time, which was very popular with him. This album will feature Phil’s hit singles such as MISSING AGAIN, EVERY DAY and DON’T LOSE MYBER. The song list is a bit different, because Phil has been very popular never since. This tablet contains Phil's non-Genesis material. Now there is a combination of \"deep\" studio songs.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":27328,"reviewerID":"A24RFFJAMSTSQP","asin":"B00000DQSF","reviewerName":"LakeKids","helpful":[0,0],"reviewText":"Have to say that this album is well worth every penny. Originally wanted it for \"The Weight\" but because so many reviewers said it was a MUST HAVE and it included nine Bonus tracks decided to give it a go. NO regrets! This album really shows off the sound The Band created right from the start of their performing. No wonder they were back up for so many artists. The take on \"Tears of Rage\" is very different than others' recordings after this, but it stands out for the emotions in the singing that no other recording has. Love \"The Weight\", but it took me a long time to find out this was the title of what I thought was \"Take A Load off\", just shows my ignorance in the old days! \"I Shall Be Released\" is another great play, plus you have \"Long Distance Operator\", and it just goes on. This is a good introduction album and glad to add this to the collection of STANDOUT albums everyone graves about.","overall":4,"summary":"Big Pink = Big Influence","unixReviewTime":1280707200,"reviewTime":"08 2, 2010"}
{"orig_index":27328,"reviewerID":"A24RFFJAMSTSQP","asin":"B00000DQSF","reviewerName":"LakeKids","helpful":[0,0],"reviewText":"I would say you get what you pay for in this album. At first I wanted \"Difficulty\", but because many critics said it was necessary and contained nine bonus songs, I decided to give it a try. No regrets! This disc really reflects the sound the band made from the beginning of the performance. Not surprisingly, they have the support of many artists. Subsequently, the interpretation of “tears of danger” was very different from other records, but the feelings expressed in the singing voice were not found in other records. I really like “Difficulty” a lot, but it took me a long time to figure out if it was a topic I thought was “Remove the burden”, reflecting my previous ignorance! \"I'll Be Released\" is another good show, and it has a \"long working distance\", and it continues. This is a good introductory album, and I am happy to add to the collection of STANDOUT albums that everyone has thought of.","overall":4,"summary":"Big Pink = Big Influence","unixReviewTime":1280707200,"reviewTime":"08 2, 2010"}
{"orig_index":27328,"reviewerID":"A24RFFJAMSTSQP","asin":"B00000DQSF","reviewerName":"LakeKids","helpful":[0,0],"reviewText":"This disc actually reflects the sound the band made from the beginning of the performance. \"Tears of Anger\" is prominent and emotional in singing, which is not found in other records. \"I'll be released\" is another great show, and \"you have a long user\"","overall":4,"summary":"Big Pink = Big Influence","unixReviewTime":1280707200,"reviewTime":"08 2, 2010"}
{"orig_index":27328,"reviewerID":"A24RFFJAMSTSQP","asin":"B00000DQSF","reviewerName":"LakeKids","helpful":[0,0],"reviewText":"likes \"weight\", but it took me a long time to realize that this was my \"Take the load off\", which can show my ignorance back there! \"I'll Be Released\" is another good show, and it has a \"long working distance\", and it continues. After all, the definition of \"Tears of Anger\" was very different from other records, but the emotions expressed in the singing voice were not found in other records. At first I wanted \"Difficulty\", but because many critics said it was necessary and included nine Bonus songs, I decided to give it a try. This disc really reflects the sound the band made from the beginning of the performance. This is an excellent album to announce, and I am happy to add to the STANDOUT collection of the album that everyone is thinking about. I have to say that you get what you pay for in this album.","overall":4,"summary":"Big Pink = Big Influence","unixReviewTime":1280707200,"reviewTime":"08 2, 2010"}
{"orig_index":28201,"reviewerID":"AKQXN37KQ25W0","asin":"B00000I926","reviewerName":"\"miggitymark\"","helpful":[0,0],"reviewText":"\"What's So Different,\" and \"Same Ol' G.\" I was't feeling' the rest. In fact, I was ready to break the CD in two after hearing this remake of MJ's \"She's Out Of My Life.\" :):):) Just my opinion. don't hate on me.","overall":1,"summary":"Only two tracks stand out.","unixReviewTime":952128000,"reviewTime":"03 4, 2000"}
{"orig_index":28201,"reviewerID":"AKQXN37KQ25W0","asin":"B00000I926","reviewerName":"\"miggitymark\"","helpful":[0,0],"reviewText":"\"What's the difference\" and \"Same Ol'G\". I do not feel relaxed. In fact, after hearing a copy of MJ's \"She's Out Of My Life\", I was ready to split the CD in two. :) :) :) My opinion is out. Don't hate me","overall":1,"summary":"Only two tracks stand out.","unixReviewTime":952128000,"reviewTime":"03 4, 2000"}
{"orig_index":28201,"reviewerID":"AKQXN37KQ25W0","asin":"B00000I926","reviewerName":"\"miggitymark\"","helpful":[0,0],"reviewText":"\"What's the difference\" and \"Same Ol'G\". Repeating MJ \"Out of My Life\" is my opinion.","overall":1,"summary":"Only two tracks stand out.","unixReviewTime":952128000,"reviewTime":"03 4, 2000"}
{"orig_index":28201,"reviewerID":"AKQXN37KQ25W0","asin":"B00000I926","reviewerName":"\"miggitymark\"","helpful":[0,0],"reviewText":"After hearing MJ's adaptation of \"She's Out Of My Life\", I will split the CD into two. This is just my opinion.","overall":1,"summary":"Only two tracks stand out.","unixReviewTime":952128000,"reviewTime":"03 4, 2000"}
{"orig_index":29260,"reviewerID":"A38ZTUNQJVGP6S","asin":"B00000JS9V","reviewerName":"Michael Patrick Boyd","helpful":[0,0],"reviewText":"Up-Up and Away: The Encore Collection is thirty-one minutes and thirty-five seconds and was released on July twenty, one thousand, nine hundred and ninety-nine. The music on the CD is not bad and the group harmony is great. The sound quality is great on the CD. Just by looking at the back cover, one should know what they are buying and should not complain. I just wish there were more songs on this encore collection. Up-Up and Away: The Encore Collection gets a B+. Go Where You Wanna Go#sixteen U. S. Billboard Hot one hundred SinglesUp-Up and Away#seven U. S. Billboard Pop Singles#nine U. S. Billboard Easy ListeningGrammy Award for Record of the Year-one thousand, nine hundred and sixty-sevenGrammy Award for Song of the Year-one thousand, nine hundred and sixty-sevenGrammy Award for Best Performance By A Vocal Group (Pop)-one thousand, nine hundred and sixty-sevenGrammy Award for Best Contemporary Single (Pop)-one thousand, nine hundred and sixty-sevenGrammy Award for Best Contemporary Group Performance (Vocal Or Instrumental) (Pop)-one thousand, nine hundred and sixty-sevenStoned Soul Picnic#three U. S. Billboard Pop Singles#two U. S. Billboard Best Selling Soul SinglesSweet Blindness#thirteen U. S. Billboard Pop Singles#forty-five U. S. Billboard Best Selling Soul SinglesWedding Bell Blues#one U. S. Billboard Pop Singles (three weeks at #one)#one U. S. Billboard Easy Listening (two weeks at #one)#twenty-three U. S. Billboard Best Selling Soul Singles(Last Night) I Didn't Get To Sleep At All#eight U. S. Billboard Pop Singles#two U. S. Billboard Easy Listening#fifty-eight U. S. Billboard Best Selling Soul SinglesOne Less Bell To Answer#two U. S. Billboard Pop Singles#one U. S. Billboard Easy Listening#four U. S. Billboard Best Selling Soul SinglesWorst That Could HappenTicket To RideTime and Love","overall":4,"summary":"The Music is nice","unixReviewTime":1243209600,"reviewTime":"05 25, 2009"}
{"orig_index":29260,"reviewerID":"A38ZTUNQJVGP6S","asin":"B00000JS9V","reviewerName":"Michael Patrick Boyd","helpful":[0,0],"reviewText":"Up-Up and Away: The Encore Collection is thirty-one minutes and thirty-five seconds long and will be released on July twenty, one hundred, and nine hundred and ninety-nine. The music on the CD is not bad, and the band's harmony is great. The sound quality on the CD is great. Just look at the back cover and you should know what they are buying and you should’t complain. I hope there are more songs in this series of encore. High and High: Encore series get B +. Go Where You Want To Go # sixteen US Top one hundred Billboard Up-Up and Away # seven US Billboard Pop Singles # nine US Billboard Easy Listening to Grammy Best Record of the Year one million, nine thousand, nine hundred and sixty-seven Grammy Award for Song nineteen in one thousand, nine hundred and sixty-seven Grammy Award for Vocal Group Pop ) -one thousand, nine hundred and sixty-seven Grammy Best Contemporary Contemporary (Pop) -one thousand, nine hundred and sixty-seven Grammy Best Contemporary Group Performance Award (Vocal for Instrumental) (Pop) -one thousand, nine hundred and sixty-seven Stones Soul Picnic # Three Billboard Billboard Pop singles # Two American Billboard Best-selling Soul Singles Sweet Blindness # thirteen US Billboard Pop Singles # forty -Five American billboard the best-selling soul souls Wedding Bell Blues # American billboard pop single (three weeks in #one) # American board board easy listening (two weeks in #one) # twenty-three in the US Board boards Best seller S Ingles (last night) I never slept # eight Bill 美国 广告 牌 流行 单曲 # 两 美国 广告 牌 凉 fifty-eight # fifty-eight US Billboard best-selling soul one answer Two Billboard boards United States One # 一个 美国 广告 牌 Easy Listening # four Soul Billiards Selling is the Most Impossible Possible Ticket Ride and Loved Tickets. The sound quality on the CD is great. I hope there are more songs in this series of encore.","overall":4,"summary":"The Music is nice","unixReviewTime":1243209600,"reviewTime":"05 25, 2009"}
{"orig_index":29260,"reviewerID":"A38ZTUNQJVGP6S","asin":"B00000JS9V","reviewerName":"Michael Patrick Boyd","helpful":[0,0],"reviewText":"Go where you want to go # Sixteen American Billboard Hot one hundred singles Up-Up and Away # Seven US Billboard Pop Singles # Nine US Billboard Listening Easy Grammy Award is the record for the Year, Nine Hundreds sixty-seven Grammy Award Song of one thousand, nine hundred and sixty-seven Grammy Award for Vocal Best Vocal Performance Award (Pop) -one thousand, nine hundred and sixty-seven Grammy Best Contemporary Single (Pop) -eleven nine hundred and sixty-seven Grammy Award for Best Group (Voice for Instrument) (Pop) -one thousand, nine hundred and sixty-seven Stoned Soul Picnic # 三 首 美国 Billboard 流行单 #Two American Billboard Soldiers Singles Sweet Blindness # 三支 美國 報 貨 許 頱 頱 大 forty-five # forty-five US Bulletin Board best selling soul souls singles Wedding Bell Blues pop single US in # one) # US Brand Brand Relaxing Listening (two weeks on #one) # Twenty-three American bulletin board selling soul songs (last night) I never slept # eight 个 美国 广告 牌 流行 单曲 # 两 美国 广告 牌 畅 fifty-eight # fifty-eight best-selling soulbirds of the US, one small cry cry # two US boards popular with individuals and Love Up and Away: Encore Collection is thirty-one minutes and thirty-five seconds. It was released on July twenty-one, ninety-nine. Just look at the back cover and you should know what they are buying and you should’t complain. The music on the CD in’t bad, and the band’s interaction is fun. Up and down: Encore lists get B +. The sound quality on the CD is good. I hope there are more songs in this series of encore.","overall":4,"summary":"The Music is nice","unixReviewTime":1243209600,"reviewTime":"05 25, 2009"}
{"orig_index":29260,"reviewerID":"A38ZTUNQJVGP6S","asin":"B00000JS9V","reviewerName":"Michael Patrick Boyd","helpful":[0,0],"reviewText":"Up-Up and Away: Encore Collection is thirty-one minutes and thirty-five seconds long and was released on July twenty, one hundred, nine hundred and ninety-nine. The music on the CD is not bad, and the band's harmony is great. I hope there are more songs in this encore series.","overall":4,"summary":"The Music is nice","unixReviewTime":1243209600,"reviewTime":"05 25, 2009"}
{"orig_index":29400,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B00000JYTS","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[1,1],"reviewText":"The release of Dolly's \"nine to five and Odd Jobs\" CD this year is to coincide with the debut of Dolly's \"nine to five-The Broadway Musical\", which opens in New York on April thirtyth, two thousand and nine. She also wrote all the music for the musical and is one of its producers. This marks the third time Dolly's one thousand, nine hundred and eighty masterpiece has been released on CD. It originally came out on CD in the mid to late 'ninetys, but RCA did a bad job in its release-only weight tracks were included. Then in one thousand, nine hundred and ninety-nine Buddha Records, in conjunction with RCA, released the album again with beautiful repackaging and all ten tracks were included with renewed audio. Now comes this wonderful CD edition with bonus tracks.\"nine to five and Odd Jobs\" has gone on to be one of Dolly Parton's most successful albums in her career. It went all the way to #one on the country charts, where it stayed for a whopping ten weeks (her longest stay there), garnered Dolly two Grammy wins, one for Best Country Song and one for Best Country Vocal Performance, both for the song \"nine to five\", and the album went Gold selling five hundred, zero copies. If RCA would do some research on the sales of this album in two thousand and nine, the accumulated sales would bring it to over a million copies. Since Dolly is no longer with RCA the label refuses to do an accounting of her old albums, which is not only an insult to us Dolly fans, but to Miss Parton herself, who is one of the greatest entertainers and singers in the world. The album title song went to number one on the country charts and became Dolly's first #one pop song and her second million selling single, after \"Here You Come Again\". \"nine to five\" also is one of those rare songs in which a female country act had the song go to the top of both the country and pop charts. The last song to do this prior to \"nine to five\" was \"Harper Valley PTA\" back in one thousand, nine hundred and sixty-eight. \"nine to five\" also went on to beat Tammy Wynette's classic \"Stand By Your Man\", in terms of sales for a single.\"nine to five and Odd Jobs\" also produced another #one country hit, Kenny Roger's and The First Edition's \"But You Know I love You\". The CD has many other covers, among the best is \"Detroit City\", which Dolly makes her own. \"The House of the Rising Sun\" is also performed there and Dolly sounds impeccable on the vocal. Mike Post, a big Hollywood record producer who Dolly met on the \"Merv Griffin Show\" in the late 'seventys, produced the bulk of the CD's songs, but it was Dollys long-time friend and band leader Gregg Perry who produced the \"nine to five\" single. Mike Post would also go on to produce Dolly's \"Rhinestone\" album in one thousand, nine hundred and eighty-four. An old Porter Wagoner and Dolly Parton song also surfaces there, \"Poor Folks Town\", which Dolly wrote, and was included on the duos \"Together Always\" album in one thousand, nine hundred and seventy-two. The crowning jewel in this particular CD collection are three bonus tracks, including a karaoke version of \"nine to five\", a dance mix version of the same song, and the previous unreleased track \"Everyday People\", which was a pop hit in the late 'sixtys. \"Everday People\" is also one of Dolly's best vocal performances never. Even if you have the Buddha release of this CD pick up this collection, simply to have the bonuses. No Dolly collection is complete without it.","overall":5,"summary":"\"More Great \"80's Dolly!\"","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":29400,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B00000JYTS","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[1,1],"reviewText":"This year's release of Dolly's CD \"Nine to Five and Strange Flowers\" this year coincides with the release of Dolly's \"Nine to Five-Broadway Musical\" in New York on April thirty, two thousand and nine. She has composed all the music for this song and the is one of its producers. This marks the release of Dolly's one, nine hundred and eighty state-of-the-art CD. It was originally released as a CD in the mid-one thousand, nine hundred and ninetys, but the RCA did a great job of releasing hard songs. Later, the album was released again with the RCA in one thousand, nine hundred and ninety-nine. The album was are-recorded, and a new audio was added to all ten songs. Now there is a nice CD version with bonuses. \"Nine to Five Works and Trouble\" has been one of Dolly Parton's most successful albums in her career. She was ranked first on the country charts, stayed there for ten weeks (the longest she did not live there), and won two Grammy Awards for Dolly, one of the best country songs. in the songs \"Nine to Five\", and the album sells for five hundred copies. If the RCA investigated the sale of the album in two thousand and nine, the additional sales would exceed one million copies. Since Dolly is no longer working with RCA the publishing company did not agree to list her old albums. This is not only an insult to your Dolly fans, but also an insult to Miss Parton herself. She is one of the biggest artists and musicians in the country. the world. The title track of the album was ranked first on the country charts, becoming Dolly's #one pop song and her one-million-second single after \"Here You Come Again\". \"Nine to five\" is also a rare song where the country's female actress excels in the country with pop charts. The last song to do this before \"Nine to five\" was \"Harper Valley PTA\" in one thousand, nine hundred and sixty-eight. According to one commercial, \"Nine to Five\" also won Tammy Wynette's classic song \"Stand By Your Man\". \"But you know I love you\". The CD has many other covers, the best of which is \"Detroit City\" by Dolly. \"House of the Rising Sun\" also performed there, and Dolly's voice was unmistakable. In the late one thousand, nine hundred and seventys, Dolly Hollywood record producer Mike Post, whom Dolly met on the \"Melve Griffin Show\", produced many CD songs, but Dolly's old friend and band leader Greg Perry produced \"nine\" to five. \" , Mike Post will continue to produce Dolly's album \"Rhinestone\". The old song by Potter Wagner and Dolly Parton also appeared There, Dolly wrote \"Poor Town\" and was included in the duo's album \"Always Together\" in one thousand, nine hundred and seventy-two. This collection of Three special CDs - an additional song, including a karaoke version of \"Nine to Five\", an integrated dance version of the same song, and a previously unreleased song \"Daily People\", which was in the late one thousand, nine hundred and sixtys. \"Everday. People \"also from Dolly One of the best voice games you've never seen. Even if you have this CD released by Buddha, picking up this collection is just a bonus. Without it, any Dolly series would be incomplete.","overall":5,"summary":"\"More Great \"80's Dolly!\"","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":29400,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B00000JYTS","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[1,1],"reviewText":"Dolly's song\" Nine to Five and Strange Work \"was released on CD this year. The album coincides with Dolly's\" Nine to Five-Broadway Musical \"premiere, one thousand, nine hundred and eighty. CD for the third time.","overall":5,"summary":"\"More Great \"80's Dolly!\"","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":29400,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B00000JYTS","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[1,1],"reviewText":"CD \"Nine to Five\" coincides with the premiere of Dolly's \"Nine to Five-Broadway Musical\", which opened in New York on April three, two thousand and nine. The CD has more many players, the best of which is Dolly's \"Detroit City\". The album title song is ranked first on the country charts.","overall":5,"summary":"\"More Great \"80's Dolly!\"","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":32079,"reviewerID":"A2EENLV6OQ3DYM","asin":"B00004S9AN","reviewerName":"Brian D. Rubendall","helpful":[2,2],"reviewText":"Steve Earle deserves credit for attempting to expand this musical horizons, as the does mostly with success on \"Transcendental Blues.\" When I heard the title track of this album on a modern rock station, I knew it was't business as usual for Steve. About half of the tracks would't sound out of place on any Earle album. But with the title track and several others, the aims for a sound closer to modern rock. He also throws in a bluegrass number just to keep the stylistic mix truly diverse. But whatever the style, it would't matter if the songwriting stinks. The best songs there in addition to the title track are \"Another Town,\" \"Halo Around the Moon,\" \"Over Yonder\" and \"The Galway Girl.\" The latter is an Irish tune that would't be out of place on a Pogues album. It is true that some of the songs don't really work, but not enough to keep it from being a strong routing. Overall, give credit to Earle for attempting something different. I'll take \"Transcendental Blues\" over most of the bland garbage that is coming out of Nashville these days.","overall":4,"summary":"Not the same old stuff","unixReviewTime":981763200,"reviewTime":"02 10, 2001"}
{"orig_index":32079,"reviewerID":"A2EENLV6OQ3DYM","asin":"B00004S9AN","reviewerName":"Brian D. Rubendall","helpful":[2,2],"reviewText":"Steve Earle's attempt to expand this music horizons is commendable for this success with \"Transcendental Blues.\" When I heard the title track of this album on modern radio, I knew it was as unusual as Steve. About half of the songs will not be replaced by any other Earl album. But with the title track and other songs, the goal is to bring the sound closer to the current rock. You have added bluegrass music to keep the style mix really different. But whatever the style, it does't matter if the song smells good for not. In addition to the title track, the best songs are \"Another City\", \"Halo Around the Moon\", \"Beyond\" and \"Galway Girl\". The latter is an Irish song and will not appear on Popues' album. Yes, some songs don't really work, but it's not enough to make them a powerful way. Overall, thanks to Earle for trying different things. Most of the bland waste from Nashville these days, I will use \"transcendent blues\" to replace it.","overall":4,"summary":"Not the same old stuff","unixReviewTime":981763200,"reviewTime":"02 10, 2001"}
{"orig_index":32079,"reviewerID":"A2EENLV6OQ3DYM","asin":"B00004S9AN","reviewerName":"Brian D. Rubendall","helpful":[2,2],"reviewText":"\"transcendental blues\" is about modern stone. Songwriting is OK. \"Transcendental Blues\" is one of the best albums of the year.","overall":4,"summary":"Not the same old stuff","unixReviewTime":981763200,"reviewTime":"02 10, 2001"}
{"orig_index":32079,"reviewerID":"A2EENLV6OQ3DYM","asin":"B00004S9AN","reviewerName":"Brian D. Rubendall","helpful":[2,2],"reviewText":"In addition to the title track, the most popular songs are \"Another Town\", \"Halo Around the Moon\", \"Beyond\" and \"The Girl of Galway\". Steve Earle is credited with trying to expand this music career due to this success in \"Transcendental Blues.\" When I heard the title track of this album on modern radio, I knew it was as unusual as Steve. But with the title track and other songs, the goal is to bring the sound closer to the current rock. It is true that some songs do not really work, but they are not enough to make it a powerful way. Most of the garbage coming out of Nashville these days, I will use \"transcendent blues\" to replace. But apart from style, it does’t matter whether nature smells for not.","overall":4,"summary":"Not the same old stuff","unixReviewTime":981763200,"reviewTime":"02 10, 2001"}
{"orig_index":38720,"reviewerID":"A23KAWGZ4RE1RI","asin":"B000067CPX","reviewerName":"J. Johnson \"capricornrising1\"","helpful":[0,3],"reviewText":"Hear me out before you vote this not-helpful,AGE can be a wonderful thing. As we all know, the older you get the wiser and more savvy you become. YET again, the older you get the bustier you can become. See artists like Sade don't have these problems. They're both older and wiser YET still vital. The Red Hot ChiliPeppers can also attest. These guys emerged in the mid-'eightys withtheir groovy funk-rock styling and party ready lyrics. From wearing socks on their \"chili peppers\" to wearing fire extinguisher hats,RHCP have evolved. So with one thousand, nine hundred and ninety-nine's \"Californication\", the men showed a consistent maturity and page old wisdom. These guys have went through dead bandmates, heavy drug problems, floundering sales, several lineup changes buthave still survived. For that alone they deserve a pat on the back. Now RHCP followup the very well-recieved, multiplatinum \"Californication\" with \"By The Way\". Less in-you-face than say,\"Give It Away\" for \"All Around The World\",\"BTW\" relies more on moody arrangements and again, sobering maturity. The title track is mellow and features Anthony Kiedis' aging yetstill strong vocals. Defintely one of the stronger songs on mainstream rock radio. The vauldville-like \"Carbon\",\"Tear\",\"Universally Speaking\", and the awe-inducing finale \"Venice Queen\" all are worth checking out. In fact, there in't really a bad song on there. Some filler but no flat out bad composition. Yet RHCP seem to be wearing their page a lot on this album. Keidis' voice is wearing,Flea's playing is slightly less funkier,Chad Smith's rhythms are a little redundant. Fruscante'splaying is superior but not masterful. And the album is just notthat exciting as \"Blood Sugar Sex Magik\" for \"Californication\". RHCP are survivors and they deserve respect. Although FISHBONE were the originators who NEVER GOT THEIR PROPS!(Can you tellI'm a little bitter?-LOL),RHCP still can rock at other advanced pages.\"By The Way\" is a solid album but it's just not something that'll blow your mind. Well at least, they're not in rockers yet.","overall":3,"summary":"THEY'RE GETTING OLD...","unixReviewTime":1028592000,"reviewTime":"08 6, 2002"}
{"orig_index":38720,"reviewerID":"A23KAWGZ4RE1RI","asin":"B000067CPX","reviewerName":"J. Johnson \"capricornrising1\"","helpful":[0,3],"reviewText":"For helpless voting please listen to me. The page can be a very good thing. As we all know, the older you get, the more intelligent you become and the more intelligent you become. Also, the more weeds you grow, the stronger you become. See if artists like Thad don’t have these problems. They are older and wiser, but they are still important. Red pepper can also prove it. These guys are from the mid-eightys, they have a funk rock style of music and lyrics that are perfect for a party. From wearing socks on \"chili pepper\" to wearing fire extinguishers, RHCP has changed. Thus, in \"California\" of one thousand, nine hundred and ninety-nine, men exhibited continued growth and old wisdom. These guys have survived handwriting deaths, serious drug problems, troubled marketing, and many changes. Based on this alone, they deserve to be treated. Now RHCP has followed the multi-platinum known \"Californication\" and \"Way\". Instead of \"giving up\" in \"The World\", \"by the way\" depends more on the mood of the mood, and again, maturity. The title song is soft and reflects the aging of Anthony Kiedis but is still powerful. Definitely one of the most powerful songs on a popular rock radio. The music \"Carbon\", \"Tears\", \"World Speech\" and the happy ending \"Queen of Venice\" are all worth seeing. After all, there are no really bad songs. Other fillings, but not completely bad ingredients. However, RHCP seems to use their pages regularly on this disc. Keidis' voice is charming, the Flea play is a little fashionable, and Chad Smith's rhythm is minimal. Fruskant's performance is excellent, but not intellectual. This album is not as exciting as \"California's\" Glucose Magic \". RHCP is a survivor, and deserves respect. Although FISHBONE is the founder of them they never got their props! (Can you say I'm bitter? -LOL), RHCP may be moving on some of the main pages. \"By the Way\" is a reliable record, but this is not going to surprise you. Well, though, they are not moving.","overall":3,"summary":"THEY'RE GETTING OLD...","unixReviewTime":1028592000,"reviewTime":"08 6, 2002"}
{"orig_index":38720,"reviewerID":"A23KAWGZ4RE1RI","asin":"B000067CPX","reviewerName":"J. Johnson \"capricornrising1\"","helpful":[0,3],"reviewText":"\"By the Way\" is a good record, but it won't surprise you. The title track is apologetic and has some old Anthony Kiedis lyrics but with a strong voice. Like Waldville's \"Carbon\", \"Tears\", \"Discourse Universal\", and the delightful ending \"Queen of Venice\" are all worth a look.","overall":3,"summary":"THEY'RE GETTING OLD...","unixReviewTime":1028592000,"reviewTime":"08 6, 2002"}
{"orig_index":38720,"reviewerID":"A23KAWGZ4RE1RI","asin":"B000067CPX","reviewerName":"J. Johnson \"capricornrising1\"","helpful":[0,3],"reviewText":"john butter: The older you get, the more you get busy. Butter: Chili pepper is a survivor, and deserves to be shot. Saying “by the way” depends more on the moody arrangements, and again, the wisdom of thinking. Butter: This is a beautiful, yet unmistakable disc as \"California\"","overall":3,"summary":"THEY'RE GETTING OLD...","unixReviewTime":1028592000,"reviewTime":"08 6, 2002"}
{"orig_index":39365,"reviewerID":"AW5G0013SNW0B","asin":"B00006I4YD","reviewerName":"Arctica \"Arctica\"","helpful":[0,0],"reviewText":"This is a very good Tori Album. Her piano music is very pretty when integrated with the drums and guitars. Overall it's very good mellow rock music. I love the tracks, Amber Waves, Wednesday, Your Cloud, Pancake, and Scarlet's walk. The lyrics are cryptic, yet haunting and the music has an healthier quality than much of her previous work. Wampum prayer is also a great track, showcasing Tori's vocal range. It's a very well crafted and beautiful record that will appeal to Tori fans and those new to her music alike.","overall":5,"summary":"I ordered you a pancake","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":39365,"reviewerID":"AW5G0013SNW0B","asin":"B00006I4YD","reviewerName":"Arctica \"Arctica\"","helpful":[0,0],"reviewText":"This is a wonderful Tori album. His piano music is very beautiful when combined with drums and guitars. All in all, this is a very good rock music. I love these songs, Amber Waves, on Wednesday, your cloud, pancakes and Scarlet walks. The lyrics are mysterious, but memorable, and the quality of the music is healthier than this previous works. Wampum's prayer is also a great song, featuring Tori's list. This is a well-crafted and fun record that will attract Tori's fans and beginners to her music.","overall":5,"summary":"I ordered you a pancake","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":39365,"reviewerID":"AW5G0013SNW0B","asin":"B00006I4YD","reviewerName":"Arctica \"Arctica\"","helpful":[0,0],"reviewText":"This is a well-crafted and beautiful record. Words are a mystery, but they are not forgotten.","overall":5,"summary":"I ordered you a pancake","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":39365,"reviewerID":"AW5G0013SNW0B","asin":"B00006I4YD","reviewerName":"Arctica \"Arctica\"","helpful":[0,0],"reviewText":"I love the songs, Amber Waves, Wednesday, Your Cloud, Pancake and Scarlet's walk. The lyrics are mysterious, but memorable, and the quality of the music is healthy for most of this previous works. Wampum's prayer is also a great song, featuring Tori's list. This is a well-crafted and fun record that will attract Tori's fans and beginners to her music. Overall, this is a very interesting rock music. His piano music is very beautiful when combined with drums and guitars. This is a great Tori album.","overall":5,"summary":"I ordered you a pancake","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":40465,"reviewerID":"A3KWF4FGGFDWRF","asin":"B00007BH9A","reviewerName":"Martin 13","helpful":[2,3],"reviewText":"This is the debut of the danish duo Raveonettes. Noise-pop album recorded in B flat minor. This album is very dark and little hypnotic. It mostly reminds me of Velvet Underground. Sune Rose Wagner (who wrote all songs), the singer was always into fifty's and sixty's I guess, what you can hear on albums of this previous band Psyched-Up Janis (they even made a cover of legendary Ronettes tune Be My Baby). Every song on this album is great.","overall":5,"summary":"This you gotta hear,...","unixReviewTime":1120780800,"reviewTime":"07 8, 2005"}
{"orig_index":40465,"reviewerID":"A3KWF4FGGFDWRF","asin":"B00007BH9A","reviewerName":"Martin 13","helpful":[2,3],"reviewText":"This is the beginning of the emergence of the Danish Duo. Noisy pop album recorded in a small B flat. The album is very dark, almost without hypnosis. It reminds me so much of Velvet Underground. Sune Rose Wagner (composer of all songs), I think this singer was always in her fifties, can hear what you can hear from the previous albums Psyched-Up Janis (they even cover the Ronettes song Be. My Baby). Every song on this album is fun.","overall":5,"summary":"This you gotta hear,...","unixReviewTime":1120780800,"reviewTime":"07 8, 2005"}
{"orig_index":40465,"reviewerID":"A3KWF4FGGFDWRF","asin":"B00007BH9A","reviewerName":"Martin 13","helpful":[2,3],"reviewText":"Sune Rose Wagner (has written all the songs), I think this singer is always in her fifties, something you can hear from the previous album Psyched-Up Janis (They even sang the song Ronettes Mythical Story Be My Baby) . Noisy pop album recorded in a small B flat. This plate is very dark and slightly hypnotic. Every song on this album is fun. This is the first appearance of Danish duo Raveonettes. It reminds me so much of Velvet Underground.","overall":5,"summary":"This you gotta hear,...","unixReviewTime":1120780800,"reviewTime":"07 8, 2005"}
{"orig_index":40465,"reviewerID":"A3KWF4FGGFDWRF","asin":"B00007BH9A","reviewerName":"Martin 13","helpful":[2,3],"reviewText":"This is the beginning of the emergence of the Danish Duo. This plaque is very dark and has almost no hypnotic effect.","overall":5,"summary":"This you gotta hear,...","unixReviewTime":1120780800,"reviewTime":"07 8, 2005"}
{"orig_index":42740,"reviewerID":"A2ACJ55JHHJ3FU","asin":"B0000ADXEC","reviewerName":"Amazon Customer","helpful":[6,8],"reviewText":"Okay. I am in the military, and in a foreign country full of sand. One night someone handed me Quebec by Ween. I listened to it and was knocked out with fantastic music. The first song of the CD makes you think it might be a hard rock punish grunge thing, then they take you , hook line and shrinker. I am a fan of zappa, Steely Dan, Pink Floyd and Captain Beefheart and I can hear elements of all these groups in Ween, and at the same time, I hear complete originality. which is so so so so rare. Get this. You won't be sorry. what a psychedelic experience.","overall":5,"summary":"An indescribable fantastic jouney","unixReviewTime":1089676800,"reviewTime":"07 13, 2004"}
{"orig_index":42740,"reviewerID":"A2ACJ55JHHJ3FU","asin":"B0000ADXEC","reviewerName":"Amazon Customer","helpful":[6,8],"reviewText":"OK. I am in the military, in a foreign country full of sand. One night, someone gave me Wien in Quebec. I listened and fell in love with the beautiful music. The first song on the CD makes you think it could be a heavy rock that punishes a junk rock thing, and then they take it, crooked and shrink. I'm a zappa fan, Steely Dan, Pink Floyd and Captain Beefheart. I hear all these bands from Ween. At the same time, I also hear the full background. This is very rare. Find this. You will not regret it. What a psychedelic experience.","overall":5,"summary":"An indescribable fantastic jouney","unixReviewTime":1089676800,"reviewTime":"07 13, 2004"}
{"orig_index":42740,"reviewerID":"A2ACJ55JHHJ3FU","asin":"B0000ADXEC","reviewerName":"Amazon Customer","helpful":[6,8],"reviewText":"The first song on the CD makes you think it could be a heavy rock that punishes a junk rock thing, and then they take it, crooked and shrink. Find this. You will not regret it.","overall":5,"summary":"An indescribable fantastic jouney","unixReviewTime":1089676800,"reviewTime":"07 13, 2004"}
{"orig_index":42740,"reviewerID":"A2ACJ55JHHJ3FU","asin":"B0000ADXEC","reviewerName":"Amazon Customer","helpful":[6,8],"reviewText":"Okay. I was in an army, and a foreign country full of sand. One night someone handed me a Quebec Ween. I listened and I was struck by amazing music. The first song on the CD makes you assume it might be a hard rock punishing something grunge, and then they pick it up, line up the knees and trim. I’m a fan of zappa, Steely Dan, Pink Floyd and Captain Beefheart and I can hear the sounds of all these Ween groups, and at the same time, I can hear the complete originality. which is very rare. Hel this. You will not fail. what a mental experience.","overall":5,"summary":"An indescribable fantastic jouney","unixReviewTime":1089676800,"reviewTime":"07 13, 2004"}
{"orig_index":45301,"reviewerID":"A2JGG6IQ8DF9ZM","asin":"B0001BVI86","reviewerName":"Jellybones","helpful":[9,11],"reviewText":"Having recently had the supreme privilege of seeing this group perform at an intimate gig, TV has jumped from great band to full on superstars in my view. Blessed with the incredible vocal power of not one but two artistic savants (Tunde Adebimpe and Kyp Malone), this band defies any attempt and pigeonholing. Hints of classic soul, perhaps even true do wop might be observable, but in no way should the potential listener believe they know what this band sounds like before they put their own years through the experience. When first listening to \"Young Liars\", comparisons to Peter Gabriel seemed natural, but really only stand up in a surface comparison to the vocal textures. The lyrics possess a darkness and intensity rarely seen. There is a sense of protest in their song crafting, a palpable laura of rebellion. Not becoming anything so simple as a political statement for stance on issues, they seem to radiate an intrinsic feeling of non-acceptance to the cold players of society. In \"Staring at the Sun\", which makes its way from their brilliant debut \"Young Liars\", the singers hang on with concentrated determination (\"Oh my own voice can not save me now \/ It's just one more breath and then down I'll go\") in front of their unique wall of sound. Occasionally, Kyp breaks out some guitar chord melodies that accent that wall, but don't expect any self gratifying guitar solo's to appear. This band works in unison to create a sound unlike any other, a sound that is refined and expanded on \"Desparate Youth\". This band is for real, they are truly going to be one of the greatest bands of this decade if they continue down the path they are playing.","overall":5,"summary":"Unbelievable","unixReviewTime":1079568000,"reviewTime":"03 18, 2004"}
{"orig_index":45301,"reviewerID":"A2JGG6IQ8DF9ZM","asin":"B0001BVI86","reviewerName":"Jellybones","helpful":[9,11],"reviewText":"Recently, I have been fortunate to see this group of people play closely. The team has amazing voice technology capabilities (Tunde Adebimpe and Kyp Malone), regardless of any effort and layout. The meaning of the classic soul, and perhaps even a real wop, can be seen, but potential listeners should not believe that they knew the sound of the band before their years of experience. When I listened to “Little Lies” for the first time, comparisons to Peter Gabriel seemed natural, but in reality it was only tolerable compared to the soundtrack. The words have a rare darkness and depth. There’s a sense of protest in their creation of the song, a clear form of Laura’s rebellion. They are not as simple as political reports of positions on issues, they seem to express an dinner feeling of disapproval of social workers. In \"Staring at the Sun\" from their debut debut \"Young Liar\", the singers continued with a strong determination (\"Oh, and my voice can't save me now \/ then breathe again, then\" I'll go \") from time to time. , but don't expect any satisfying guitar on its own. it has been upgraded and expanded to \"Desperate Youth.\" of verbal protest, a clear rebellion against Laura. \" Looking at the Sun \"from their glorious beginning\" Liar Young \"At first, the musicians persisted in front of their single sound wall with determination.","overall":5,"summary":"Unbelievable","unixReviewTime":1079568000,"reviewTime":"03 18, 2004"}
{"orig_index":45301,"reviewerID":"A2JGG6IQ8DF9ZM","asin":"B0001BVI86","reviewerName":"Jellybones","helpful":[9,11],"reviewText":"Since it had recently become a top priority to see this band perform, the TV jumped from the big band until it was filled with big stars in my sight. Blessed by the power of the amazing voices of not one but two artists (Tunde Adebimpe and Kyp Malone), this group is against any attempt and dove. In the case of ordinary souls, perhaps even true no wop can be seen, but somehow a potential listener does not believe that they know what this group looks like before entering into their human experience. For the first time listening to “Young Liars”, Peter Gabriel’s comparison seems natural, but it really stands for a comparison over the sound patterns. The lyrics of the song are dark and the intensity is rarely seen. There is a sense of protest in their artistic songs, a reflected laura of rebellion. Without being as simple as a political statement related to the positions of the issues, they seem to revoke an unacceptable feeling of cold players in society. In “Staring at the Sun”, making their first debut with the beautiful “False teens”, the singers cling to a tough decision (“Oh my voice I can’t be saved now \/ Another animal then put I “ll go”) in front of their sound wall. Occasionally, Kyp breaks some of the guitar chords that hit the wall very well, but don’t expect the self-contained bring to appear. This group works in the same way to create a different voice, a fine voice expanded by “Desperate Youth.” This team is true, they will surely be one of the biggest teams this decade if they continue on the path they have played.","overall":5,"summary":"Unbelievable","unixReviewTime":1079568000,"reviewTime":"03 18, 2004"}
{"orig_index":45301,"reviewerID":"A2JGG6IQ8DF9ZM","asin":"B0001BVI86","reviewerName":"Jellybones","helpful":[9,11],"reviewText":"\"Young Liars\" expresses her feelings of protest in her own words, laura grasping and rebellious. \"Looking at the Sun\" comes out of their first meeting with the beautiful \"Young Liars\" the artists of cling to a tough decision in front of their own wall of sound.","overall":5,"summary":"Unbelievable","unixReviewTime":1079568000,"reviewTime":"03 18, 2004"}
{"orig_index":49642,"reviewerID":"AP0DXNA7P1TSL","asin":"B0009OUAQQ","reviewerName":"HappyDonita","helpful":[0,0],"reviewText":"This is a very good CD and nice voice performance by Lina. I am happy to have this as part of my favourite \"ladies\" music collection.","overall":5,"summary":"Favorite Lina CD","unixReviewTime":1393632000,"reviewTime":"03 1, 2014"}
{"orig_index":49642,"reviewerID":"AP0DXNA7P1TSL","asin":"B0009OUAQQ","reviewerName":"HappyDonita","helpful":[0,0],"reviewText":"This is a very good CD, and Lina's sound is very sweet. I’m happy to include it as part of my favourite “lady” music collection.","overall":5,"summary":"Favorite Lina CD","unixReviewTime":1393632000,"reviewTime":"03 1, 2014"}
{"orig_index":49642,"reviewerID":"AP0DXNA7P1TSL","asin":"B0009OUAQQ","reviewerName":"HappyDonita","helpful":[0,0],"reviewText":"This is a very good CD with Lina's sweet voice. I'm happy","overall":5,"summary":"Favorite Lina CD","unixReviewTime":1393632000,"reviewTime":"03 1, 2014"}
{"orig_index":49642,"reviewerID":"AP0DXNA7P1TSL","asin":"B0009OUAQQ","reviewerName":"HappyDonita","helpful":[0,0],"reviewText":"I'm happy to include it as part of my favourite \"lady\" music collection. This CD is very good, and Lina's sound is very good.","overall":5,"summary":"Favorite Lina CD","unixReviewTime":1393632000,"reviewTime":"03 1, 2014"}
{"orig_index":50885,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000BGR0OM","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":"Eurythmics are an excellent pop group and dominated the mid eighty's. They had three main strengths - Annie Lennox's terrific voice and unique, soulful personality , an advanced sense of melody , and their ability to develop as musicians and become more sophisticated as their career progressed. I always really liked them back in the eighty's, and had the good fortune to see them in concert on one\/twelve\/one thousand, nine hundred and eighty-nine there in Hobart on their We Too Are One tour. Here they are again with a second, updated hits package, and not surprisingly it's very a good CD. This compilation spans one thousand, nine hundred and eighty-three until the present day, and like most hits compilations it includes two new tracks to make the CD more enticing to casual and long-term fans alike. They're not going to set the charts ablaze, but both new songs are pretty good. Always with such a successful group that has more than one CD -worth of hit itunes, you wonder whether a twoCD set would be better, but I'm satisfied with this as I'm sort of intending to purchase the group's back catalogue albums on CD anyway. In particular the remastered sound is excellent. My old CD of the Eurythmics one thousand, nine hundred and eighty-five album Be Yourself Tonight has much inferior sound on the cloud, rocking #one hit Would I Lie To You (which I love) when compared to the improved sound quality there. Favourite tracks ; Right By Your Side ( holiday \/carnival vibe, lovely) , Would I Lie To You (brilliant rock vocal performance, face guitar playing) , When Tomorrow Comes ( routine melody but lovely lyrics) , I Saved The World Today ( gorgeous melody, great singing) , Here Comes The Rain Again ( cool melancholy vocal , atmospheric instrumentals) , There Must Be An Angel ( Playing With My Heart) ( sweet vocals, terrific harmonica guest performance from Stevie Wonder), Miracle Of Love ( one of the best eighty's radio ballad hits with lovely lyrics) . I hope newer listeners unfamiliar with this music might wish to try out this package of hit songs, all of which are really good. I would imagine however that most fans of this band would already own most of these tracks, so the only selling point then is the improved sound quality. I 'm going to give this five stars because I like all the songs on this disc a lot.","overall":5,"summary":"Excellent pop group","unixReviewTime":1142467200,"reviewTime":"03 16, 2006"}
{"orig_index":50885,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000BGR0OM","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":"Eurythmics are an excellent pop group and dominated the mid eighty's . They had three main strengths - Annie Lennox's terrific voice and unique, soulful personality . The remastered sound is excellent .","overall":5,"summary":"Excellent pop group","unixReviewTime":1142467200,"reviewTime":"03 16, 2006"}
{"orig_index":50885,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000BGR0OM","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":"Eurythmics is the largest pop group that ruled in the mid-eightys. They have three main resources - Annie Lennox's amazing voice and a special romantic personality. The sound used is very good.","overall":5,"summary":"Excellent pop group","unixReviewTime":1142467200,"reviewTime":"03 16, 2006"}
{"orig_index":50885,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000BGR0OM","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":"Eurythmics is the best pop group, ruling in the mid-one thousand, nine hundred and eightys. They also offer a second revised package. To date, the design covers one, eight hundred and thirty-eight.","overall":5,"summary":"Excellent pop group","unixReviewTime":1142467200,"reviewTime":"03 16, 2006"}
{"orig_index":52583,"reviewerID":"ACTYP447JCDX0","asin":"B000FUF86Q","reviewerName":"Scott Bresinger","helpful":[59,74],"reviewText":"This heavily-hyped band from the epicentre of heavy-hyping, Los Angeles, is likely to draw a lot of lazy comparisons to Smashing Pumpkins. Over-amped, distorted guitars, melodic songs with soaring choruses and plaintive vocals are all in evidence. On \"Carnavas,\" their debut, they're at least closer to the Pumpkin's early albums, eschewing the grandiosity that made Corgan's later work such a chore. Actually, they seem to have more in common with another young L. A. band, Autolux. Both are clearly indebted to the noisy soundscapes of My Bloody Valentine and the more melodic moments of Sonic Youth. Listen to \"Carnavas\" back-to-back with SY's recent \"Rather Ripped\" and you'd think the two bands could be cousins. Mind you, SY's songs are stronger and their guitars more gloriously of***ed up, but Silversun Pickups have plenty to offer as well. Like Autolux, the Pickups manage to fold their more experimental tendencies into their songs, and when they stretch things out, like on album closer \"Common Reactor,\" they drone instead of jam. Sometimes they're even genuinely hypnotic, but even as Brian Aubert's guitars soar into the stratosphere, they keep their feet on the ground (actually, they kinda have to; otherwise, they could't reach their effects pedals). Another nice touch are the keyboards of Joe Lester, which curiously makes the sound warmer (as opposed to the chilliness of say, Radiohead). Lyrically, the band traffic in the vague, elliptical imagery that have been a staple of indie rock for more than twenty years. At the very least they're modest, not self important. The propulsive \"Future Foe Scenarios\" begins \"The things we laid do not amount to much\/made of abandoned wood and stones and such.\" All things considered, while Silversun Pickups are anything but original, they survive comparisons to their inspirations fairly well. While it's not something that you probably \"need,\" you could do a hell of a lot worse.","overall":4,"summary":"\"Carnavas\" by Silversun Pickups","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":52583,"reviewerID":"ACTYP447JCDX0","asin":"B000FUF86Q","reviewerName":"Scott Bresinger","helpful":[59,74],"reviewText":"This hype band from a hype center in Los Angeles is likely to make a lot of lazy comparisons with Smashing Pumpkins. Extravagant, twisted guitars, catchy melodies with high choruses, and sad voices are all clear. On their debut album \"Carnavas\", at least they are close to Pumpkin's previous albums, to the detriment of the majesty that makes Coron later work so hard. After all, they look very much like another Los Angeles youth team, Autolux. Both are clearly clear because of the noisy Valentine sound of my blood and the happiest moments in Sonic’s youth. Listening to \"Carnavas\" and the recent SY \"Rather Ripped\" in the background, you would think that these two groups could be cousins. Please note that SY songs are more powerful and their guitars are better, but Silversun Pickups has a lot to choose from. Like Autolux, Pickups are table to incorporate their experimental techniques into their songs, and when they unveil things, such as the upcoming album \"Regular Reactor\", they'll buzz instead of jam. Sometimes they are true hypnotists, but even though Brian Aubert's guitar is flying in the stratosphere, their feet are still on the ground (actually, they have to do this; otherwise, they can't reach the pedal pedal). Another nice touch is Joe Lester's keyboard, which makes the sound warmer (as opposed to Radiohead's cold). In terms of lyricism, the band is spreading with vague, oval images that have been the main theme of indie rock for more than two decades. At least they are humble, unselfish. The propelling \"future enemy situation\" begins with \"We don't have much to put on \/ made of discarded wood, stone, etc.\" While this is not something you \"might want\", you can do even worse.","overall":4,"summary":"\"Carnavas\" by Silversun Pickups","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":52583,"reviewerID":"ACTYP447JCDX0","asin":"B000FUF86Q","reviewerName":"Scott Bresinger","helpful":[59,74],"reviewText":"Silversun Pickups is a hyped music group based in central Los Angeles. When they made their by, they were close to Pumpkin’s first albums and stopped being honest. Like autolux, Pickups incorporate their own methods of further testing into their songs.","overall":4,"summary":"\"Carnavas\" by Silversun Pickups","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":52583,"reviewerID":"ACTYP447JCDX0","asin":"B000FUF86Q","reviewerName":"Scott Bresinger","helpful":[59,74],"reviewText":"Sometimes they are honest, but even if Brian Aubert's guitars fly in the stratosphere, they will be low on the ground (actually, they are a little necessary; otherwise, they will not be table to reach the result pedal). Like Autolux, Pickups are table to incorporate their experimental tendency more into their songs, and when they unveil things, as in the upcoming album \"Common Reactor\", they'll buzz instead of jam. On their debut album \"Carnavas\", at least they are close to Pumpkin's previous albums, to the detriment of the majesty that makes Coron later work so hard. Please note that SY songs are more powerful and their guitars are better, but Silversun Pickups has a lot to choose from. Another nice touch is Joe Lester's keyboard, which makes the sound warmer (as opposed to Radiohead's cold). Extravagant, twisted guitars, catchy melodies with high choruses, and sad voices are all clear. This hype band from a hype center in Los Angeles is likely to make a lot of lazy comparisons with Smashing Pumpkins.","overall":4,"summary":"\"Carnavas\" by Silversun Pickups","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":55283,"reviewerID":"A2FR3S9867FIBI","asin":"B000WCDI5K","reviewerName":"B. Sherman","helpful":[0,0],"reviewText":"IN the interests of full disclosure, this is the sole Killers album I own, so I am, by no means, an expert on their discography. However, with that aside, The Killers on this album do not disappoint. The remixes are artfully done, and, owning them both, I would say the Abbey Road Version of \"Sam's Town\" is far superior to the original. Other highlights of the album are \"Daddy's Eyes\" which burns with dark, unbridled passion, and \"Leave The Bourbon on The Shelf\" is a fantastic song combining multiple aspects of country with the synthetic rock The Killers embrace so well. \"Where The White Boys Dance\" also does not disappoint, showing Mr. Flowers' vocal range and flexibility. Overall, one would be highly remiss to skip this album, as it shows the true artistic talent of the Killers. One cannot judge an arts by this masterpiece, but by this wastebasket.","overall":5,"summary":"Exceptionally Redone","unixReviewTime":1290902400,"reviewTime":"11 28, 2010"}
{"orig_index":55283,"reviewerID":"A2FR3S9867FIBI","asin":"B000WCDI5K","reviewerName":"B. Sherman","helpful":[0,0],"reviewText":"For full coverage, this is my only Killers album, so I'm not good at publishing them. However, other than that, the killer on this album was not disappointed. The mixtures are masterfully made, and with them, I can say that the Abbey Road version of \"Samtown\" is much higher than the original version. Some of the highlights of the album \"Daddy's Eyes\", which burns the dark and uncontrollable passion, and \"Leave Bourbon on the Shelf\" are an amazing song that perfectly combines many aspects of the world with the artificial stone adopted by assassins. \"Where the White Boys Dance\" did not dance, showing the range and flexibility of Mr. Flowers. In general, skipping this album is a huge understatement, as it shows the real artistic talent of the killer. One cannot judge part by this part, but part can only be viewed with this garbage basket.","overall":5,"summary":"Exceptionally Redone","unixReviewTime":1290902400,"reviewTime":"11 28, 2010"}
{"orig_index":55283,"reviewerID":"A2FR3S9867FIBI","asin":"B000WCDI5K","reviewerName":"B. Sherman","helpful":[0,0],"reviewText":"For full coverage, this is the only Killers album I have, so I'm not good at publishing them. Some of the highlights of the album \"Daddy's Eyes\", which burns the dark and uncontrollable passion, and \"Leave Bourbon on the Shelf\" are an amazing song that perfectly combines many aspects of the world with the artificial stone adopted by assassins. The mixtures are masterfully made, and with them, I can say that the Abbey Road version of \"Samtown\" is much higher than the original version. In general, skipping this album is a huge understatement, as it shows the real artistic talent of the killer. However, other than that, the killer on this album was not disappointed. The \"White Dance Hall\" did not disappoint, indicating that one gentleman could not only condemn part with this work of part, but judge part with this waste.","overall":5,"summary":"Exceptionally Redone","unixReviewTime":1290902400,"reviewTime":"11 28, 2010"}
{"orig_index":55283,"reviewerID":"A2FR3S9867FIBI","asin":"B000WCDI5K","reviewerName":"B. Sherman","helpful":[0,0],"reviewText":"This is the only Killers album I have, so I'm not good at publishing them. The mix is ​​very smart, and the Abbey Road version of \"Samtown\" is much better than the original. \"The Place Where the White Boys Danced\" was unmistakable, reflecting the stone of Mr.","overall":5,"summary":"Exceptionally Redone","unixReviewTime":1290902400,"reviewTime":"11 28, 2010"}
{"orig_index":56747,"reviewerID":"A234IZP4U2Y0OQ","asin":"B001CY2EL6","reviewerName":"Luke \"luke\"","helpful":[3,4],"reviewText":"If this cd was made in the sixty's the'd be a big-big name with no money, better late than never with money though, hunt? I loved this cd and have been playing it a lot. I did know what style of music (Motown sixty's) it would be before I bought it though; so for those who did't know I can understand the disappointment. On another note (unlike Babyface's Playlist) I don't understand how any Toni, Tony, Tone listener did't see this coming. Raphael has been retro since \"Hey Little Walter\" and pretty much kept an older genre sound on almost all TTT's cd's. This cd is not a homage, it is a work of part because the handles the music masterfully as though the was in the sixty's. For those who'd rather pick up Sam Cooke when you want to hear him, cool, but I'm sure just like artists such as Prince, Madonna, and other older artists try and go back into that era for more for less vice versa meaning they try to enter this era and look stupid doing it; this is a focused cd and absolutely well crafted musically with full melodies, choruses, and poignant lyricism. I say this to say it is authentic in its recreation of that vibe. I'm pretty sure you can pop this cd in with Sam Cooke, Smokey, Diana, on a playlist and people would think this was made also in the sixty's. Okay the sixty's aside and fifty years later, I see this as a perfect cd because of the variety of songs that blend perfectly together. In other words the slow jams are catchy itunes and the fast songs have a strong beat that make you want to dance; and ultimately you can tell this is where Raphael's heart was at this time of\/c it sounds like the was having fun when making this cd. The only song that was bad was the bonus song with Jay-Z. My favourites are: The Big Easy (an code to what is going wrong with the world since this baby left), Oh Girl (a sweet very high crying falsetto ridden song that pleads to a girl about how she changed this world. It slightly puts you in the mind of La, la, la means I love you for a Smokey song), Calling (a spanish tinged slow ballad song with a spanish guitar and spanish singer duet; in this song the's begging for a girl to pick up the phone of\/c the's calling), and Never Give you Up (a more up to date beat mid-tempo song with Stevie playing the Harmonica and another guy who sings one verse that sounds just like one of the old Tony's.)Anyway I'm really happy I got the cd of\/c I almost did't and typically Raphael in't one of those artists I just trust enough to always catch this vibe; so I do have to listen to what vibe the's on before I pick it up; but this is a cd I know many will miss and instead pick up Amy Winehouse. Hunh? Yeah. If I had to take my pick I'm rolling with Saadiq.","overall":5,"summary":"detailed review\/great cd","unixReviewTime":1224028800,"reviewTime":"10 15, 2008"}
{"orig_index":56747,"reviewerID":"A234IZP4U2Y0OQ","asin":"B001CY2EL6","reviewerName":"Luke \"luke\"","helpful":[3,4],"reviewText":"If this cd were made in the one thousand, nine hundred and sixtys, it would be a big name with no money, but it's better to be late than moneyless. I love this CD and I play it all the time. However, before I buy it, I know what the style of music (Motown sixties) will be; but for those who do not know, I know the shame. On the other hand (different from Babyface's playlist), I don't understand why Toni, Tony, and Tone's audience don't see this. Raphael has been retro never since \"Hey little Walter\", and has kept the old sounds of the genre on almost all TTT CDs. This cd is not a subscription, but a work, because it handles music skilfully, like the sixtys. For those who prefer to choose Sam Cooke if you want to hear it, it's cool, but I'm sure, like Prince, Madonna and other older artists, trying to get back at that time for less money Get more money, and vice This means they're trying to get in this time and look stupid, this is An immersive CD, carefully crafted in music, with perfect melodies, choirs and catchy lyrics. I say this to make it true in are-producing that spirit. I'm sure you can add this CD to playlists by Sam Cooke, Smokey, and Diana. People would think it was made in the one thousand, nine hundred and sixtys. Well, except for sixty, fifty years later, I think this is a complete CD, because all sorts of songs are perfectly put together. In other words, slow music is in the popular iTunes, while fast songs have powerful beats that make you want to dance; finally you can see that this is Raphael's heart at this time \/ pc sounds like I was very happy when I made this cd. The only bad song is Jay-Z's bonus song. My favourites are: The Big Easy (code of what goes wrong in the world when a child leaves), Oh Girl (a sweet, cloud cry, begging a girl to change the world. In La's mind, there, this means I love you because of Smokey's song), Calling (slow song inspired by Spanish with a Spanish guitar and Spanish music; in this song Asking a girl to pick up the phone \/ pc phone), and Never Give Up (the latest speed song, Stevie plays a harmonica, and someone else's poem sounds like one of Tony's old jones.) Anyway, I'm glad that I found the \/ pc almost almost non-existent, and usually Raphael is not one of the artists I trust enough to hold this breath; so before I can pick it up, I have to listen to its spirit first; but this is a CD I know a lot of people will miss, but take Amy Winehouse. Um? Oh yeah. If I had to choose, I would choose Saadiq.","overall":5,"summary":"detailed review\/great cd","unixReviewTime":1224028800,"reviewTime":"10 15, 2008"}
{"orig_index":56747,"reviewerID":"A234IZP4U2Y0OQ","asin":"B001CY2EL6","reviewerName":"Luke \"luke\"","helpful":[3,4],"reviewText":"Raphael has been very retro since \"Hey Little Walter\", and almost all TTT CDT's have retained the old class sounds. The only bad song is Jay-Z's bonus song.","overall":5,"summary":"detailed review\/great cd","unixReviewTime":1224028800,"reviewTime":"10 15, 2008"}
{"orig_index":56747,"reviewerID":"A234IZP4U2Y0OQ","asin":"B001CY2EL6","reviewerName":"Luke \"luke\"","helpful":[3,4],"reviewText":"If this CD were made in sixty years, would it be a big name without money, with more money than never before, hunting? I liked this CD and I played it a lot. I knew what kind of music (the sixties) would be before I bought it; So for those who don't know me, I can understand the frustration. In another note (unlike Babyface's playlist) I don't think any listener Tony, Tony, Tone has never seen it happen. Raphael has been retro since \"Hey Little Walter\" and has a good old-fashioned sound on almost every TTT cd. This CD is not respectable, it is part of the work because the music is as clear as sixty's. For those who like to pick Sam Kok if you want to hear it, fine, but I'm sure artists like Prince, Madonna, and other old artists will come back to this place to learn more about the opposite. Trying to Which means it's about to be the most delusional time of the year, as well. This is a CD focused and well-structured CD with complete songs, choruses, and balanced music. I say that it is true to are-enforce this view. I'm sure you can add this CD to the playlist with Sam Cook, Smoky, Diana and people will think it was done in the sixties. Exactly sixty and fifty years later, I see it as a good CD because of the variety of songs that come together so well. In other words, Slow Jam is an interesting iTunes and fast songs have a powerful rhythm that makes you dance. And finally you can see that Raphael's heart was there at the time of CK \/ it seemed like the was having fun making this CD. The only bad song was a bonus song with JZ. My favourites are: Big Easy (code of what's wrong in the world since the baby left), Oh Girl means I love you smoking song), Calling (a cool Spanish with Spanish guitar) A ballad song and a set of Spanish artists. In this song, a girl is asked to pick up the phone. A boy who sings a verse that sounds like Tony's old voice.) Still, I'm really happy that D has been found \/ I have almost never been found and in general Raphael is not one of the artists on whom I rely enough to keep this vibe alive. So I have to listen to what Vibe says before the takes it. But this is a CD that I know many people will remember instead of downloading Amy Winehouse. Huh? Yes. If I had to choose, I would go with Sadiq.","overall":5,"summary":"detailed review\/great cd","unixReviewTime":1224028800,"reviewTime":"10 15, 2008"}
{"orig_index":57094,"reviewerID":"A117JNY7EV4RFS","asin":"B001IX4CKC","reviewerName":"BIG D","helpful":[2,5],"reviewText":"one, two stars. Are you on crack, this cd and movie is a classic. Every song is good, no lbs.","overall":5,"summary":"classic street rap","unixReviewTime":1258502400,"reviewTime":"11 18, 2009"}
{"orig_index":57094,"reviewerID":"A117JNY7EV4RFS","asin":"B001IX4CKC","reviewerName":"BIG D","helpful":[2,5],"reviewText":"One, two stars. Are you breaking it? This CD and movie are classic. Every song is so good, no pound.","overall":5,"summary":"classic street rap","unixReviewTime":1258502400,"reviewTime":"11 18, 2009"}
{"orig_index":57094,"reviewerID":"A117JNY7EV4RFS","asin":"B001IX4CKC","reviewerName":"BIG D","helpful":[2,5],"reviewText":"one, two stars. Are you in the cracks, this CD and this movie are normal. Every song is beautiful, no lbs.","overall":5,"summary":"classic street rap","unixReviewTime":1258502400,"reviewTime":"11 18, 2009"}
{"orig_index":57094,"reviewerID":"A117JNY7EV4RFS","asin":"B001IX4CKC","reviewerName":"BIG D","helpful":[2,5],"reviewText":"One, two stars. Are you cracked, this CD and movie are old. Every song is beautiful, no pounds.","overall":5,"summary":"classic street rap","unixReviewTime":1258502400,"reviewTime":"11 18, 2009"}
{"orig_index":57933,"reviewerID":"A3BXZ1EXCSCCSY","asin":"B0026BD2GU","reviewerName":"Mark D Powers","helpful":[0,0],"reviewText":"So happy I purchased this. I saw Sly and the Family Stone one time in one thousand, nine hundred and seventy at Winterland. What a great high energy band. Both discs are stereo (Right\/Left-Sub)only. Disc one, Stand, sounds OK for a two thousand and nine remaster and I don't feel the need to find a better version even if there is one. I love this disc. Disc two, Woodstock, great. As I sat and listened I was overwhelmed with awe and emotion as to the talent and expertise of this band. You can feel how everybody in the band is loving each other and there audience, even at three:thirty in the morning. Sly's writing at that time was like hippy\/earth music, social commentary but comes head on in a soul\/funk\/rock train. Brilliant. The live recording that came from one thousand, nine hundred and sixty-nine Woodstock, chaos, middle of the night, is awesome, of course the great mixer of Hendrix fame Eddie Kramer had a lot to do with it. Packaging is great and good liner notes. My own special rarity: My Stand CD has the Woodstock CD label and vice versa. Worried at first that I was going to have to return to Amazon, but knowing I have both discs with the wrong labels makes it a keeper. Maybe one hundred years from now my unique set will be like the stamp with the upside down plane. Thanks Sly, raising my hand with a peace sign.","overall":5,"summary":"Sly & The Family Stone: The Woodstock Experience (2CD) [Limited Edition] 2009 Stereo $14.88","unixReviewTime":1404864000,"reviewTime":"07 9, 2014"}
{"orig_index":57933,"reviewerID":"A3BXZ1EXCSCCSY","asin":"B0026BD2GU","reviewerName":"Mark D Powers","helpful":[0,0],"reviewText":"I'm glad I bought this album. I saw Cunning and Family Stone in Winterland one, nine hundred and seventy times. What a great power band. Both discs are stereo (right \/ left bass). The first disc, Stop, sounds great on remake two thousand and nine. Although there is a better version, I don't think I should get a better version. I like this disk. Two discs, Woodstock, large. As I sat down I listened, amazed and delighted with the talent and talent of this band. Even at three:thirty in the morning, you can feel that everyone in the band is in love, and the audience is the same. Sly's writing at the time was like a hippie \/ world music, a social commentary, but a catchy soul \/ funk \/ rock train. outstanding. The live recording from Woodstock, in one thousand, nine hundred and sixty-nine, the chaos, in the middle of the night, is good, and yes, Hendrix's famous mixer and legendary Eddie Kramer has a lot to do with it. The packaging is good and the lining is good. My special treasure: My Stand CD has a Woodstock CD label, and vice versa. At first I was worried that I would have to go back to Amazon, but I knew that both of my disks had the wrong label, which made them a keeper. Maybe a hundred years later, my special suit will look like a stamp with a twisted plane. Thank you Sly, raising my hand in an act of peace.","overall":5,"summary":"Sly & The Family Stone: The Woodstock Experience (2CD) [Limited Edition] 2009 Stereo $14.88","unixReviewTime":1404864000,"reviewTime":"07 9, 2014"}
{"orig_index":57933,"reviewerID":"A3BXZ1EXCSCCSY","asin":"B0026BD2GU","reviewerName":"Mark D Powers","helpful":[0,0],"reviewText":"Disc one, Stop, sounds great on the two thousand and nine remake. I think that even if there is a better version, I don't think it is necessary to find a better version. Two disks, Woodstock, are large. As I sat and listened, I was once amazed by the talent and expertise of the team. The packaging is good, with proper support instructions.","overall":5,"summary":"Sly & The Family Stone: The Woodstock Experience (2CD) [Limited Edition] 2009 Stereo $14.88","unixReviewTime":1404864000,"reviewTime":"07 9, 2014"}
{"orig_index":57933,"reviewerID":"A3BXZ1EXCSCCSY","asin":"B0026BD2GU","reviewerName":"Mark D Powers","helpful":[0,0],"reviewText":"bob greene: I've seen Sly and the Family Stone in Winterland, one, nine hundred and seventy times. Greene: I'm scared and impressed by the team's talent and expertise. It is said that live recording from one thousand, nine hundred and sixty-nine Woodstock is fine. Green: Knowing that I have two discs with the wrong label makes them a goalkeeper.","overall":5,"summary":"Sly & The Family Stone: The Woodstock Experience (2CD) [Limited Edition] 2009 Stereo $14.88","unixReviewTime":1404864000,"reviewTime":"07 9, 2014"}
{"orig_index":57965,"reviewerID":"AFTN9ZLB22PSZ","asin":"B0026IZRD4","reviewerName":"ctrx","helpful":[2,3],"reviewText":"DJ Quik and Kurupt's \"Blaqkout\" is a collaboration guys like me dream about. Individual releases from both artists are worth months of anticipation: both forefathers of West Coast ship shop, they have impeccable catalogs and huge legacies; DJ Quik, in my opinion, as the West Coast's greatest producer and Kurupt as the quick slipped, smooth lyrical half of Long Beach's Tha Dogg Pound. Both helped pioneer the of-funk phenomenon from the early one thousand, nine hundred and ninety and have proven time and again to be masters of gangsta wrap. Quik's discography is among ship shop's best, and you'll be hard-pressed to find a single beat of this that's anything less than great. This also arrives at a perfect time; Quik has been inactive for four years and Kurupt has suffered some recent backlash from fans who claim this hunger is lost.\"Blaqkout\" is an immediately appealing LP that just sounds great and is perfect summertime music. It has the light, breezy vibe that Quik perfected onSafe & SoundandRhythm-al-ism, yet stays innovative and forward-reaching with further creativity. Quik is a musical genius and an artist foremost, so even on a collaboration piece this beats take center stage. The instrumentals are rich and funky and do this immense talent justice, bearing this famous Midas touch. Kurupt and Quik share mic duties equally along with a few guests. There's not much heavy lyricism; they tend to flex their MC muscles with light sixteen-bar verses between good hooks. It's clear they've come to play from the gorgeous opening title track, with its soaring synths and heavy claps, and the funky \"Cream N Ya Panties.\" The bouncy \"Ohh!\" and \"The Appeal\" are strong, and Kurupt trips the cleverly minimalist \"ninex Outta ten.\" Quik impresses on the space-age winner \"Jupiter's Critic and the Mind of Mars,\" and the gem of the tracklist is the brilliant party track \"Hey Playa! (Moroccan Blues),\" where Quik flips a ridiculous sample into a superb production. As far as flaws, I'd only pick the reggae track \"Exodus\" and \"Watcha Wan Do\" as subpar, so the latter did't need an alternate mix on the last track. It's a little brief at barely forty minutes.\"Blaqkout\" is quintessential West Coast ship shop and perfect summer music from two legends. Longtime fans will love it and new fans will similarly find it suitable for warm-weather listening. I highly recommend \"Blaqkout.\"","overall":4,"summary":"\"How can you go wrong?\"","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57965,"reviewerID":"AFTN9ZLB22PSZ","asin":"B0026IZRD4","reviewerName":"ctrx","helpful":[2,3],"reviewText":"DJ Quik and Kurupt's \"Blaqkout\" is a collaboration people like me dream of. The personal release of these two artists is worth looking forward to for months: they are both the forerunners of the West Coast shipping shop, with a complete catalog and a great heritage; In my opinion, DJ Quik is the biggest producer on the West Coast. , and the Kurupt half of the Long Beach Tha Dogg Pound, which is fast-moving and lyrical. Both have been instrumental in creating the funk phenomenon from the early millennium, and have proven time and time again to be masters of gangsterism. Quik’s record is one of the best in the ship shop, and you won’t find any great beats. This is also timely; Quik has not been active for four years, and Kurupt has recently met with strong opposition from fans who say the famine has disappeared. \"Blaqkout\" is a fast-paced LP. It sounds great and is the perfect summer music. It has the perfect light of Quik and a relaxed atmosphere in terms of safety, sound and rhythm, while maintaining a new version and looking forward with more design. Quik is a music artist and one of the most important artists, so even in collaborative work, the region is in the middle. Musical instruments are rich and fashionable, displaying a great talent for justice, with this famous form of turning stones into gold. Kurupt and Quik shared the microphone functions equally with most of the guests. No music is too hard; they often twist their MC muscles with sixteen quick poems between beautiful hooks. Obviously, they started playing on the theme of the fun opening title, with their high synthesizers and heavy shoulder, and the fashion \"Cream N Ya Panties\". Flexible \"Oh!\" and \"Appeal\" is powerful, and Kurrupt stumbles upon the clever minimalism of \"ninex Outta ten\". Quik has left a deep impression on the winner of the years-old \"critic of Jupiter and the Mind of Mars\". The highlight of the song list is the beautiful party song \"Hey Playa! (Moroccan Blues)\" an excellent work. As for the flaws, I only chose the reggae songs “Exodus” and “Watcha Wan Do” as sub-standard, so the latter does not require a stored mix on the final track. Just forty minutes short. \"Blaqkout\" is a typical West Coast boat shop with perfect summer music from two legends. Older fans will love it, and new fans will find it suitable to listen to hot weather. I highly recommend \"Blaqkout\".","overall":4,"summary":"\"How can you go wrong?\"","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57965,"reviewerID":"AFTN9ZLB22PSZ","asin":"B0026IZRD4","reviewerName":"ctrx","helpful":[2,3],"reviewText":"\"Blaqkout\" by DJ Quik and Kurupt is a very interesting LP that sounds great and is the perfect summer music. Quik’s record is one of the best in the ship shop, and you won’t find any great beats.","overall":4,"summary":"\"How can you go wrong?\"","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":57965,"reviewerID":"AFTN9ZLB22PSZ","asin":"B0026IZRD4","reviewerName":"ctrx","helpful":[2,3],"reviewText":"The personal works of the two artists are expected to look forward to the months: they are both adults in the West Coast shipping small, have an unparalleled catalog and a great heritage; In my opinion, DJ Quik is the West Coast The biggest producer, and Kurupt is half the Tha Dogg Pound of Long Beach that is fast-paced and has songs. As for the flaws, I only chose the reggae songs “Exodus” and “Watcha Wan Do” as sub-standard, so the latter does not require a stored mix on the final track. Obviously, they started playing from the fun opening song, with their high-performance synthesizers and heavy shoulder, and the “Cream N Ya Panties” fashion. And “Appeal” is so powerful, Kurrupt stumbles upon the clever minimalism “ninex Outta ten”. Quik’s record is one of the best in the ship shop, and you won’t find any great beats. Quik left a deep impression on the winners of the post \"Jupiter's Critic and the Mind of Mars\". The highlight of the song list is the stunning party song \"Hey Playa! It has Quik's perfection in Safe & Sound and Rhythm-ism\"","overall":4,"summary":"\"How can you go wrong?\"","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":61131,"reviewerID":"A3U3PA6J2XOVFK","asin":"B005HI7NP0","reviewerName":"Donald E. Gilliland","helpful":[1,1],"reviewText":"I totally lost track of Betty Wright after her run of one thousand, nine hundred and seventy singles and albums. I'm embarrassed to say that I did't even realize that she was still recording steadily in the heights & ninety. But hearing this stellar new album I want to go back and hear what I missed. This new recording is a revelation. Betty sounds GREAT and the songs on this album are terrific: a few classics and a bunch of other keepers. Not a dud in the bunch. And considering that there is over seventy minutes of music on this CD (wow!) that is saying at lot. Very impressive. Kudos to the guys in the Roots for doing a fine job of support. They blend in seamlessly and don't overpower the singer. Betty Wright does't sound like she's lost any of her soul and sass over the years. I agree with some of the other reviewers: this was one of the very best albums of two thousand and eleven. Get it!","overall":5,"summary":"Excellent Comeback!","unixReviewTime":1329696000,"reviewTime":"02 20, 2012"}
{"orig_index":61131,"reviewerID":"A3U3PA6J2XOVFK","asin":"B005HI7NP0","reviewerName":"Donald E. Gilliland","helpful":[1,1],"reviewText":"Betty sounds great, and the songs on this album are great: some classic and some. Not a group of people. I thank the people of Roots for their outstanding support.","overall":5,"summary":"Excellent Comeback!","unixReviewTime":1329696000,"reviewTime":"02 20, 2012"}
{"orig_index":61131,"reviewerID":"A3U3PA6J2XOVFK","asin":"B005HI7NP0","reviewerName":"Donald E. Gilliland","helpful":[1,1],"reviewText":"After Betty Wright released one, nine hundred and seventy single songs and albums, I completely lost her song. I am ashamed to say that I did not realize that the was still recording slowly in the one thousand, nine hundred and eighty's and one thousand, nine hundred and ninety's. I agree with some critics: this is one of the best albums of two thousand and eleven. But after hearing this wonderful new album, I want to hear again what I missed. Betty sounds great, and the songs on this album are fun: some classic and some. Over the years, Betty Wright has not lost her soul for her haughtiness. This new edition is a revelation.","overall":5,"summary":"Excellent Comeback!","unixReviewTime":1329696000,"reviewTime":"02 20, 2012"}
{"orig_index":61131,"reviewerID":"A3U3PA6J2XOVFK","asin":"B005HI7NP0","reviewerName":"Donald E. Gilliland","helpful":[1,1],"reviewText":"This new record is a revelation. The songs on this album are great. Thank you to the people at Roots for their outstanding support.","overall":5,"summary":"Excellent Comeback!","unixReviewTime":1329696000,"reviewTime":"02 20, 2012"}
{"orig_index":61805,"reviewerID":"A29AQW33B8ILM1","asin":"B0074MZSPO","reviewerName":"MrSavoie2U","helpful":[2,3],"reviewText":"Plain and simple if you enjoy soulful music with a hint of blues throw in, this is for you. Great songs, that are sang even better. The singers voice reminds me of the lady from Heartless Bastards. Highly recommended.","overall":5,"summary":"Heavy Dose Of Soul For Your Soul","unixReviewTime":1334620800,"reviewTime":"04 17, 2012"}
{"orig_index":61805,"reviewerID":"A29AQW33B8ILM1","asin":"B0074MZSPO","reviewerName":"MrSavoie2U","helpful":[2,3],"reviewText":"If you like romantic music with a series of blues, it's simple and clear, this is for you. Nice song, using better. The voice of the artist reminded me of the lady in the \"Relelessless Bastard.\" highly recommended.","overall":5,"summary":"Heavy Dose Of Soul For Your Soul","unixReviewTime":1334620800,"reviewTime":"04 17, 2012"}
{"orig_index":61805,"reviewerID":"A29AQW33B8ILM1","asin":"B0074MZSPO","reviewerName":"MrSavoie2U","helpful":[2,3],"reviewText":"If you like romantic music with a hint of blues, this is for you. A beautiful, singing song","overall":5,"summary":"Heavy Dose Of Soul For Your Soul","unixReviewTime":1334620800,"reviewTime":"04 17, 2012"}
{"orig_index":61805,"reviewerID":"A29AQW33B8ILM1","asin":"B0074MZSPO","reviewerName":"MrSavoie2U","helpful":[2,3],"reviewText":"If you like love music with a blues logo, this is for you. Nice song, using better.","overall":5,"summary":"Heavy Dose Of Soul For Your Soul","unixReviewTime":1334620800,"reviewTime":"04 17, 2012"}
{"orig_index":62490,"reviewerID":"A3PWX3IMK64H12","asin":"B008G12ERC","reviewerName":"potenza","helpful":[0,0],"reviewText":"After five for six listening I began to see the differences from this CD to the prior CDs by Muse. I also began to like it a lot more the more I heard it. At this point I would not know the titles of the songs when the music plays, but I'm willing to learn by listening more & at high volume. In fact today I'm shopping in my car head to the DIY store & blast it as high as I can with the windows closed until my sunglasses shatter for I have some hearing loss for whichever comes first.","overall":4,"summary":"Law and Order","unixReviewTime":1353715200,"reviewTime":"11 24, 2012"}
{"orig_index":62490,"reviewerID":"A3PWX3IMK64H12","asin":"B008G12ERC","reviewerName":"potenza","helpful":[0,0],"reviewText":"I intend to learn by listening more and shouting. Today I drove to the DIY store to shop.","overall":4,"summary":"Law and Order","unixReviewTime":1353715200,"reviewTime":"11 24, 2012"}
{"orig_index":62490,"reviewerID":"A3PWX3IMK64H12","asin":"B008G12ERC","reviewerName":"potenza","helpful":[0,0],"reviewText":"After listening to it five for six times, I began to notice the difference between this CD and Musa's previous CD. I also developed a love for it as I listened to it. For now, I won't know the name of the song when the music plays, but I'm ready to learn by listening more.","overall":4,"summary":"Law and Order","unixReviewTime":1353715200,"reviewTime":"11 24, 2012"}
{"orig_index":62490,"reviewerID":"A3PWX3IMK64H12","asin":"B008G12ERC","reviewerName":"potenza","helpful":[0,0],"reviewText":"I am willing to learn by listening and high volume. now i am buying my car on my way to the DIY Store i also started to like it as much as i heard. At that point I did’t know the titles of the songs when the music was playing, but I was willing to learn to listen a lot.","overall":4,"summary":"Law and Order","unixReviewTime":1353715200,"reviewTime":"11 24, 2012"}
{"orig_index":64539,"reviewerID":"A1CAV2K99G0MX4","asin":"B00GHJ77KO","reviewerName":"D7","helpful":[2,2],"reviewText":"Love it, love it, love it! SO CATCHY! Got stuck in my head so I had to come buy it so I can crank it up cloud! Gaga's new album rules!","overall":5,"summary":"PAWS UP!","unixReviewTime":1384905600,"reviewTime":"11 20, 2013"}
{"orig_index":64539,"reviewerID":"A1CAV2K99G0MX4","asin":"B00GHJ77KO","reviewerName":"D7","helpful":[2,2],"reviewText":"Love it, love it, love it! It's so cute! It's always on my mind, so I have to come and buy it so I can turn it into a cloud! The rules for Gaga's new album!","overall":5,"summary":"PAWS UP!","unixReviewTime":1384905600,"reviewTime":"11 20, 2013"}
{"orig_index":64539,"reviewerID":"A1CAV2K99G0MX4","asin":"B00GHJ77KO","reviewerName":"D7","helpful":[2,2],"reviewText":"Love it, love it, love it! It's stuck in my mind, so I have to buy it so I can turn it into a cloud! The rules for Gaga's new album! It's so cute!","overall":5,"summary":"PAWS UP!","unixReviewTime":1384905600,"reviewTime":"11 20, 2013"}
{"orig_index":64539,"reviewerID":"A1CAV2K99G0MX4","asin":"B00GHJ77KO","reviewerName":"D7","helpful":[2,2],"reviewText":"Gaga's new album rules! Love it, love it! It got stuck in my mind, so I have","overall":5,"summary":"PAWS UP!","unixReviewTime":1384905600,"reviewTime":"11 20, 2013"}