{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"Way back in one thousand, nine hundred and eighty-three for 'eighty-four, a rock music show there featured footage of a live-in-the-studio performance from Ry Cooder and those fabulous backing vocalists, presumably made during the sessions for this album. The next day at work, it was the only thing people talked about. And if never I mention it to a few former colleagues I still see, their eyes light up with the memory. I had already bought P&L on the strength of a Rolling Stone recommendation, so I was doubly ecstatic when I saw those clips ('If Walls Could Talk' and probably 'Tattler' and 'Jesus On The Mainline'). This is a terrific journey through American blues and gospel, with immaculate playing and an infectious sense of fun. The aforementioned 'Walls' is very cute, 'Tamp 'Em Up Solid' literally chugs along, 'Tattler' is gorgeous, but for me 'Fool For A Cigarette' is the standout: it's so cheerful it makes you almost proud to be a smoker, and that's saying something.","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"One thousand, eighty-two 'eighty-four', the rock music program there included live performances by Rai Coder and this supporting artists in the studio, which was probably made during the album season. The next day at work, that was what people talked about. And if I never talk about it with the few guys I'm still watching, their eyes light up with memory. I had already bought P&L from Rolling Stone's recommended strength, so I was glad to see these clips ('If Walls Can Talk' and maybe 'Tuttler' and 'Jesus on the Main Line') )۔ It's a terrifying journey that traverses the American blues and gospel with a sense of flawless play and contagious fun. The 'walls' we've talked about are great,' Temp ', M-Solid' is really good, 'Tuttler' is good, but for me 'Stupid for Cigarettes' is the best: it's so much fun that It's almost like you're proud to smoke, and that means something.","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"Going back to one thousand, nine hundred and eighty-three for ‘eighty-four, a rock music show was there featuring a live studio performance by Ry Cooder and this most vocal supporters, who thought to have been made during the session of this album. Tomorrow at work, this is all people talk about. And if I were to mention a few people I’ve been with before that I still see, their eyes lighten the memory. I’ve already bought P&L Rolling Stone’s advice, so I’m so happy to see these videos (‘If Walls Can Speak’ and maybe ‘Tattler’ and ‘Jesus On Thelineline’). It was a terrific journey between the blues and the gospel of the United States, with a challenging game and a sense of fun. The ‘walls’ mentioned above are stunning, ‘Tamp‘ Em Up Solid ’is literally,‘ Tattler ’is stunning, but for me‘ Fool For A Cigarette ’is the highest: it’s so awesome that you scream to be a smoker, and that has to do with it.","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":14744,"reviewerID":"A3C3VPRXPGCGU8","asin":"B000002KC4","reviewerName":"\"redcraze\"","helpful":[11,13],"reviewText":"As early as one thousand, nine hundred and eighty-three, in the one thousand, nine hundred and eighty-fours, rock music featured films by Ry Cooder and outstanding supporting musicians, probably produced during the conference. At work the next day, this is the only topic people talk about. If I have never mentioned this to some of my colleagues I still see, their eyes will be bright with memories. I bought P&L based on the Rolling Stones proposal, so when I saw these clips (\"If the Wall Can Speak\", maybe \"Tattler\" and \"Jesus On The Mainline\"), I was very happy. This is a wonderful journey with the American blues and the gospel. The game is flawless and full of contagious fun. The \"Walls\" mentioned are very good, \"Tamp'Em Up Solid\" literally means \"Tattler\" is beautiful, but to me, \"Fool For A Cigarette\" is the best: it's fun and makes you almost smoke yourself, showing something.","overall":5,"summary":"Sure to make you smile","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"This CD is just plain great. There is no other explanation required. This is the perfect CD to listen to just before you fall asleep at night. Even the fast songs that I love such as Living Inside Your Love, You Know How to Love Me & Under Your Spell are just perfect for this. My fave of the slow jams is Be Careful (How U Treat My Love). This set is a winner from start to finish :)","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"This CD is huge. No other explanation is needed. It is best to listen to the CD before you go to bed at night. Even my favourite fast songs like Living In Your Love, You Know How To Love Me & Your Spelling Below are perfect for it. My love for the slow crowd is careful (how you treat my dear). This section is a winner from start to finish :)","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"This CD is amazing. No further explanation is required. This is a good CD to listen to before you go to bed at night. Even my favourite fast songs, such as staying in your love, you know how to love me and under your spelling are very good at this. My favourite jam is that you are careful (how you treat my love). This is a successful set from start to finish :)","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":21032,"reviewerID":"A3081DMXTZ21EB","asin":"B000002VS3","reviewerName":"Brian Campbell","helpful":[3,3],"reviewText":"This CD is just awesome. No further explanation is required. This is a great CD you can listen to at night before going to bed. Even my favourite fast songs like Living in Your Love, you know how to love me and are perfect for it under your magic. Beware of my money for the little sheep (how do you handle my love). This set is the winner from start to finish :)","overall":5,"summary":"A true diva at her best!","unixReviewTime":994291200,"reviewTime":"07 5, 2001"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"Canadian sister duo Tegan and Sara follow-up two thousand and nine'sSainthoodwith two thousand and thirteen's fine offeringHeartthrobvia Vapor\/Warner Bros. Heartthrob is a brief album (just over thirty-six minutes) that packs a gutsy punch. Styled in heights sensibilities (pop, new-wave, electronic production), the sound may be a contrast for the duo, but it is a welcome one. Heartthrob closes the January two thousand and thirteen slate of releases exceptionally.\"Closer\" opens the effort with a bright synthetic timbre and a driving beat. Tegan and Sara deliver solid, commanding vocals that are well produced. The songwriting is notable, particularly the chorus: \"It's not just all physical \/ I'm the type who won't get pooh so critical \/ so let's make things physical \/ I won't treat you like you're pooh so typical\". New wave influence continues to show on \"Goodbye Goodbye\", another crisply produced affair. In addition to another 'hooky' chorus, the bridge stands out, contrasting the verse. \"I Was a Fool\" continues soundness through solid songwriting, compelling vocals, and fine production work. \"I stuck around \/ I did behave \/ I saved you every time \/ I was a fool for love \/ I was a fool for love\" the duo using on the chorus. Tegan and Sara are three for three.\"I'm Not Your Hero\" sports an anthemic pop chorus, continuing lyrics based on romantic themes and the desires of love. \"Drove Me Wild\" is better, camping up the heights styling. Tegan and Sara's vocal approach is perfect, with the duo singing things staccato and in distinct fashion. Catchy and well written, \"Drove Me Wild\" is a standout cut. \"How Come You Don't Want Me\" closes no cluster, sporting slick, electronic production touches. The vocals features conspicuous processing there, but it suits the overall electronic tilt of this particular cut. The rhythmic nature of the vocals is a selling point. \"I Couldn't Be Your Friend\" epitomizes heights pop given an archetypical quick tempo and sound. Like its contemporaries, \"I Couldn't Be Your Friend\" is consistent and enjoyable. No misses for Tegan and Sara as of yet. The final three cuts don't close their 'oomph'. \"Love They Say\" may be a shade less compelling than the rest, but not by much. \"Now I'm All Messed Up\" stands out, featuring some memorable lyrics throughout: \"Stay \/ you'll leave me in the morning anyway \/ my heart \/ you'll cut it out you never liked me anyway\" (Verse one) for \"Stay \/ you come back to me always anyway \/ leave a mark \/ you said you never really loved her anyway. \" (Verse two). Closing cut \"Shock To Your System\" is as consistent and nearly as memorable as the very best of the album. OverallHeartthrobis a strong effort from the Canadian duo. Consistent and enjoyable, Tegan and Sara never miss a beat. four stars.","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"Canadian sisters Tegan and Sara follow Heartthrobvia Vapor \/ Warner Bros. Heartthrobvia Vapor \/ Warner Bros. Heartthrob in two thousand and nine \"Holiness\" and two thousand and thirteen great dedication. With high sensitivity (popular, new waves, electronic products), the sound may be different for the duo, but it is popular. Heartthrob strangely completed its release in January two thousand and thirteen. \"Closer\" opened the effort with a vibrant sound making and running of beats. Tegan and Sara provide a strong, commanding voice. The composition of the song is worth noting, especially the choir: \"It's not just the body \/ I'm the kind that won't criticize Pooh \/ So let's do physical things \/ I won't be the same as\" Pooh \". \"Hooks\", the bridge is also prominent, as opposed to the verse. Tegan and Sara are three to three years old. - This \"Drove Me Wild\" interesting and well written, excellent editing. \"How come you don't want me\" did't cover any topics, with a smooth product style. Sounds have a clear pattern there, but it is worth the general electronics trend in this adjustment. Voice rhythm is a place of sale. \"I Can't Be Your Friend\" is the beginning of a fast-paced, fast-paced, high-pitched soundtrack. Like the people of my time, \"I can't be your friend\" is consistent and appealing. So far, Tegan and Sara have not missed a chance. The last three cuts did not erase their \"charm\". \"Lovers say\" it may not look a little better than others, but it may not be so much. \"Now I'm confused\" they came forward, running away with some unforgettable words: \"Stay \/ Whatever you leave me in the morning \/ My heart \/ You will cut it off you will never love me\" (No Part One) because \" (Section two). The closing ceremony \"Shock Your Process\" was consistent and almost memorable as the best song on the album. Overall, this is a powerful effort for the Canadian duo. Compatible and lovely, Tegan and Sara never miss a beat. Four stars.","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"Two Canadian girls Tegan and Sara chased two thousand and nine cents with two thousand and thirteen beautiful Heththrobvia Vapor \/ Warner Bros. offerings. Focused on high sensitivity (pop, new wave, electronic making), the sound may be different for both people, but it’s welcome. Heartthrob closes the two thousand and thirteenth of January in another release. Tegan and Sara give cloud voices, commanding good work. The singing is remarkable, especially for the chorus: \"I'm not just physical \/ I'm the type who does't dare to criticize \/ so make it physical \/ I won't treat you like you should\". The impact of the new waves can still be seen in “Peace of Mind”, another hotly debated issue. Aside from another ‘hooky’ song, the bridge stands, opposite the verse. “I Was Stupid” continues to thrive through solid song writing, compelling voices, and great production work. \"I clung to \/ I acted \/ I always saved you \/ I was stupid for love \/ I was stupid for love\" two people using the song. Tegan and Sara are three. “Drove Me Wild” is even better, the design of the top spots. Tegan and Sara’s voting system is perfect, with both people singing in improper and unique style. A charming and well written, “Wild Place” is a standing ovation. “How Do You Want Me Not To Want Me” does not cover product packs, sportswear, electronic touches. Sounds are included in the visual techniques there, but it fits the overall electronic tilt of this particular cut. The rhythmic nature of the voices is the selling point. “I Can’t Be Your Friend” refers to the high pop-ups given the previous schedule and soundtrack. Like people like, “I Won’t Be Your Friend” is a consistent and enjoyable one. There is nothing missing from Tegan and Sara so far. The last three cuts don’t shut off their oomph. “The Love They Say” may be less than others, but not much. \"Now I've Met Us All\" stands out, featuring some memorable songs: \"Stay \/ you'll leave me in the morning still \/ my heart \/ you'll be cut off you never loved me\" (Verse one) of \" Stay \" \/ You'll always come back to me \/ leave a mark \/ You said you did't really love him.\" (Second paragraph) . The closing remarks of \"Shock Your System\" are a consistent and almost memorable addition to album. Overall Heartthrobis a strong effort from two Canadian men. Continuously entertaining, Tegan and Sara never miss a beat.four stars.","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":63235,"reviewerID":"A1QEWOSV05RYEO","asin":"B00A4EDAN6","reviewerName":"Michael Brent Faulkner, Jr. \"Brent Faulkner\"","helpful":[1,2],"reviewText":"Her Canadian sisters Jodi Tegan and Sarah followed in two thousand and nine. High intensity style (pop, new wave view, electronic production), sound may vary from pair, but it is welcome. Heartthrob closes the January release with two thousand thirteen releases. Tegan and Sarah bring strong, instructive voices that are well-crafted. Songwriting is worth mentioning, especially the course: \"It's not all physical \/ I'm the kind of person you don't consider very important \/ So let's do physical things \/ I won't treat you like a normal symbol. \" The new effect of the waves keeps appearing in \"Goodbye Goodbye\", another thing that clearly arises. Aside from another hockey course, the bridge is different, comparing this verse. \"I was a fool\" is being heard with strong songwriting, catchy melodies and good production work. \"I \/ behaved \/ saved \/ always \/ I was a love fool \/ I was a love fool\" They both used the course. Tegan and Sarah are three of the three. \"I'm not your hero\" sports songs pop songs, love themes and romantic melodies based on romantic desires. \"Drive Me Wild\" is a better, more camping style. Tegan and Sarah's soundtrack is perfect, paired with songs in a variety of styles and styles. Caught up and well written, \"Drive Me Wild\" is a great kit. \"How do you want me\" does not cover collections, sports games, electronic product contacts. There is a clear processing in the sound, but it corresponds to the full electronic ratio of this particular kit. The rhythmic nature of words is a selling point. \"I can't be your friend\" sets the high speaks offered with the speed of sound and noise. Like the people of my time, \"I can't be your friend\" is constant fun. No tags and Sarah are missing yet. The last cut that does't close their 'omf'. \"Love may be a less compelling shade than others, but not too much,\" the says. \"I'm all upset now\" is featured, including songs that are memorable everywhere: \"Wait \/ You'll leave me in the morning \/ My heart \/ You'll cut me off before you love me\" (Verse one) Always stay \/ Come back to me \/ Leave a mark \/ He said you never liked it. \"(Verse two). Closing the cut Known as the best of the album, Overall Heart Throbes is a strong effort by Canadian factors. Permanent and entertaining, Tegan and Sarah never close their rhythm.","overall":4,"summary":"Solid Effort From the Canadian Sister Duo","unixReviewTime":1359676800,"reviewTime":"02 1, 2013"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"Just cop it. Thats all I can tell you really. Black Rob is the best person in Bad Boy atm.","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"It's just a policeman. That's all I can tell you. Black Rob is the ultimate Bad Boy atm.","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"Just copy it. That's all I can say. Black Robb Bad Boy is the best person at ATM.","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":50018,"reviewerID":"A27CLBSNZCDJSY","asin":"B000A3DFYU","reviewerName":"Ayatollah316","helpful":[0,0],"reviewText":"Just copy. That's really the only thing that can tell you. Black Rob is the best Atm Bad Boy.","overall":5,"summary":"This CD is no joke","unixReviewTime":1129593600,"reviewTime":"10 18, 2005"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"Johnny Cash \/ Cash (American Recordings): Late in this career, and late in this life, Johnny Cash began to record a series of brilliant albums for American Recordings. The tracks on this first of those albums contain many `unplugged' versions of this own classic songs and a few by other writers, along with some spoken pieces. Johnny's voice was not this strongest during this time and there are tracks that show its weakness. Strangely enough, the weakness of this voice often blends even more power to the content of the songs. This album and the following albums the would do for American Recordings are granite monuments by which other artists are measured, for on which the pretenders are broken. This is a Masterpiece. This deserves a Sixth Star.","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"Johnny Cash \/ Cash (American Recordings): Later in this career, later in this life, Johnny Cash began recording a series of excellent albums on American Records. The songs on the first album contain many \"unmixed\" versions of this old song and other songs by other authors, as well as other oral works. Johnny's voice was weak at the time, and some methods showed a weakness. Surprisingly, the weakness of this sound always involves a lot of strength in the content of the song. This plate and the following discs will be made of Granite monuments on American Records, which are used to imitate other artists, where they were drunk by people pretending to be us. This is a work of part. This is worth about six stars.","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"Johnny Cash \/ Cash (American Recordings): Towards the send of this project, and later in life, Johnny Cash began recording a series of the best albums in American recording. The album's tracks are the first of many \"unreleased\" versions of these old songs, as well as songs from a few other authors, as well as some of the pieces mentioned. Johnny's voice was not strong at the time and there were tracks that showed this weakness. Surprisingly, this sound weakness often combines too much power with the content of the songs. These albums and subsequent albums that Americans can record are reminiscent of granite, where other artists are rated, where they play broken. This is an part form. This is because of the sixth star.","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":26177,"reviewerID":"A12R54MKO17TW0","asin":"B000009QPA","reviewerName":"J. Bynum","helpful":[1,2],"reviewText":"Johnny Cash \/ Cash (American Records): Later in this career, and later in this life, Johnny Cash began recording a series of very good albums for American Records. Traces on the first of these albums include many ‘unopened’ genres of classic songs and many other authors, along with spoken parts. Johnny’s voice was’t the strongest at the time and there were signs of this weakness. Surprisingly, this weakness of sound often confuses even more strength in the content of the songs. This door and the next album they will make for American Records are rock carvings by other artists, broken by sculptors. It is a masterpiece. It's worth a Six Star.","overall":5,"summary":"The first of Johnny's Masterpiece albums for American Recordings","unixReviewTime":1326240000,"reviewTime":"01 11, 2012"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"Like always with AF releases, the sound is just so bad and lifeless. As usual a reverse remaster job by the \"great\" Hoffman for Gray. The plot is suck the life out of the music and make it sound dull. Take away the sparkle and details. Why are not this company exposed yet? Why do people use USD thirty to buy these discs? It really annoys me that this company still releases discs. It is an offence to the artists.","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"As is often the case with AF, noise is very bad and unhealthy. As usual, Hoffman did the previous work through \"Great\" Gray. The plot absorbs the music in life and makes it dim. Remove glitter and details. Why has't this company been revealed yet? Why do people spend thirty dollars to buy these discs? It really bothers me that this company still removes discs. This is a crime for artists.","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"Like the AF type, the sound is not very bad and is lifeless. As usual, \"great\" Hoffman made a comeback in Gray. The plot is to draw life into music and make it fun. Remove glitter and details. Why has this company not been identified? Why do people buy these CDs for $ thirty? The company is still releasing CDs that annoy me. This is a debt to the artist.","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":3095,"reviewerID":"A2872PI8C2CQ7E","asin":"B000001A6X","reviewerName":"Eyolf Lund","helpful":[12,26],"reviewText":"As before with the release of AF, the sound is so bad it does’t live. It’s usually an adjustment work behind the “big” Hoffman for Gray. The plan absorbs life from the music and makes it boring. Remove enamel and details. Why has’t this company been disclosed yet? Why do people spend thirty USD to buy these tapes? It really annoyed me that this company was still releasing tapes. This is an insult to the artists.","overall":1,"summary":"Very poor sound","unixReviewTime":1305331200,"reviewTime":"05 14, 2011"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"I had heard the poppy and peppy stuff that Madonna made in the eighty's and I did't like it, but I must admit that this album is really cool and basically a one hundred and eighty degree turn of sorts. That she was table to bring in album concept like this and make it her best one yet says something of her talent. I do agree that there is some kind of weird myst-self-centered aspect to the songs on there, but the songs are unique and more interesting then most people her page can come up with. I was especially intrigued by the electronica that dominates the whole album, quite a change. This album is all about changing, growing up in a way. It does't work all the time (\"candy perfume girl\" always annoyed me) but there are very strong aspects to all of the songs. This cd is definitely worth your time. Go get it!","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"I once heard about the pope and the interesting things Madonna did in the one thousand, nine hundred and eightys. I don’t like it, but I have to admit that the album is really cool. He is ready to introduce the content of the album and make it the best, but also showcasing this talent. I agree that the songs there are somewhat bizarre, but these songs are different and more interesting than most people can think of on this page. I am particularly interested in the electronic music that governs the entire album. This is a big change. This album is about change, about growing up. It does't always work (\"Candy Perfume Girl\" always annoys me) but every song has strong themes. This CD is well worth your time. Understanding (dream); to get it (something!","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"I heard about Madonna's poppy and papaya stuff in this decade and I did't like it, but I have to admit that this album is great and it's one hundred and eighty. That the was on the table to come up with the idea of such an album and make it better, but the said something about this abilities. I agree that there is a kind of ambiguity in the current songs, but the songs are unique and very interesting to many people whose page may come up. I really like the electronics that have the whole album, a real change. This album is about changing, growing in a way. It does't always work (\"Candy Girl\" always annoys me) but there are strong elements in all the songs. This CD is definitely worth your time. Go get it!","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":18401,"reviewerID":"A7JRDNX3WOMTR","asin":"B000002NJS","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,1],"reviewText":"I’ve heard of the puppet and peppy stuff Madonna did in the eighties and I don’t like it, but I’ll admit this album is really cool and originally a hundred and eighty degrees different. That the is on the table to bring the idea of the album like this and make it best to comment on this abilities. I agree that there is some kind of hidden self-reflection structure in the songs there, but the songs are unique and very interesting so most people can have their own page. I particularly admire the electronics that control the entire album, a big change. This album is about change, growing in a way. It does’t always work (the “candy scent girl” always annoys me) but there are very strong aspects to all the songs. This CD is definitely worth your time. Go and find it!","overall":5,"summary":"strong electro pop, a new direction entirely","unixReviewTime":1113782400,"reviewTime":"04 18, 2005"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"When this CD was previewed and released in Australia in early two thousand,I felt, on impulse, that I should purchase it. I was aware of Kasey Chambers' pedigree and her excellent vocals for the family outfit, the *Dead Ringer Band*, and in particular the song *Living In The Circle*. When I played this CD the initial production and sound surprised me. There were extremely personal and sparse songs with equally sparse vocals, that I immediately connected with. It was a refreshing change and she was attempting to deliver a country sounding,Lucinda Williams,Shawn Colvin *ish*project aimed at the international market. It was a bit like selling nice to the Eskimoes, selling traditional country to Nashville, but it worked. and it still does!! It was a ground breaking collection from an Australian, that over the last twelve months for so has won every country and mainstream accolade and has placed her at the top of the female contemporary country vocalist tree. and all with her debut effort and at the ripe old page of twenty-two!!! From the title track*The Captain* which is a haunting track that grows on you after every listen, so much so that it appears in the Sopranos* soundtrack, and deservedly so. and gives her richly deserved exposure. She has been on Letterman and has received some fame in the US. and we can only wait for the follow up release. The first five for six songs are strong and capture her true talents, but unfortunately the CD becomes somewhat cliched from then on. The lyrics are generally pleasing but the striving to sound like American country detracts somewhat from the overall feel of excellence. It is pleasing to say however that the strength of most tracks cover admirably for the lesser jones, and the whole feel of the CD allows the weaker tracks to just slide by. This is a watershed CD for Australian country, and has produced a flood of activity from female country vocalists. The CD has a maverick quality. It is well produced and the vocal variety is excellent. Her Brother and father contribute throughout the songs and her brother produces.this has the confidence of a family effort, a familiarity that produces confidence. I recommend that you purchase this CD and savour the emotion and feel contained. I am eagerly awaiting her next effort. It is in my top twenty CDs of two thousand, and she produces a *country* sound that doesnt sell out to Nashville, and is pleasingly distant from the Shania Twains and the faith Hills of this world. four.five to five stars.","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"When this CD was first reviewed and released in Australia in early two thousand, I felt, I wanted to buy it. I know Kasey Chambers ’kids and her great voice for the family band, * Ringer Band *, and especially the song * Living in the Space *. When I hit this CD the first production and sound I was shocked. There were very few individual songs with very few voices, which we immediately connected. It was an inspiring change and the tried to reach the voice of the country, Lucinda Williams, Shawn Colvin * wish * for the global market. It’s a bit like a great Eskimoes sale, a traditional Nashville sale, but it works. He's still doing it !! It’s an Australian underground collection, which in the last twelve months has won each country and an overall prize and placed it at the top of the tree of voices in the modern country. and all this first efforts and the sample page of twenty -two !!! From the title track * Captain * which is a difficult path that will come to you after every hearing, until it appears in the songs of the Sopranos *, and it deserves it. and gives him a very important message. He was in Letterman and became popular in the United States. and we can only wait for the follow-up to come out. The first five of the six songs are cloud enough to hold its true potential, but unfortunately the CD has been pretty clicked since then. The words are generally pleasing but trying to be closer to the United States slightly diminishes the overall sense of efficiency. It’s interesting to note however that the strength of most tracks is covered by tiny lions, and the feel of the entire CD allows weak tracks to be easily slippery. It was a water -based CD for Australia, and it brought a lot of flooding to the activities of women voters in the country. The CD has maverick quality. It’s well made and the sound diversity is great. Her brother and father are contributing to all the songs and her brother is doing something. I recommend you buy this CD and taste the emotion and feeling it contains. I look forward to this next effort. This CD is in the top twenty of two thousand, and produces a * country * voice that is not sold in Nashville, which is very happy and far from Shania Twains and the faith of the mountains of this world. far five five stars.","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"When this CD first appeared and was released in Australia in the early part of the second century, I thought I would buy it. Unfamiliar to me, their beautiful voices about Casey Chambers' children and family attire, * Dead Ringer Band *, especially the song * Staying in the Circle *. When I first played this CD, the sound surprised me. There were personal and very short songs with similar sounds, which I quickly contacted. It has been a recent change and it is trying to bring the world to the forefront, Lucinda Williams, a Sean Colon * Eyes * project that has been targeted in the international market. It was like a good sale to Eskimos, selling conventional land in Nashville, but it worked. And so far !! It was a collection of pieces of land belonging to an Australian man, who had conquered the whole country twelve months earlier and was highly respected and placed on the tree of the word page women. And all with this first attempt and on the old adult page twenty-two !!! The title of the track is * The Captain * which is an awesome track that grows after listening to all of you, so much so that the song comes from Supranus *, and you deserve it. And it gives quite a rich exposure. He has been a letter man and has gained fame in the United States. And we can only wait for the next release. The first five songs of six are powerful and take on real potential, but unfortunately the CD is almost hidden from there. Ordinary words are funny but try to sound like an American country that somehow interferes with the full sense of well-being. It's interesting to note that the power of many tracks encompasses the little Jones well, and the whole feel of the CD just keeps the weak songs from slipping. It is one of the most delicious CDs in the Australian country, and it has created a flood of work for women's voices. The CD is of marquee quality. It is well crafted and has a great variety of sounds. Her brother and father contributed to all the songs and her brother also produced. It involves the confidence of the family effort, a habit that reflects self-confidence. I suggest you buy this CD and enjoy and feel it. I look forward to this next attempt. On my top twenty-two, zero CDs, it also produces a voice of the world that Nashville does't sell, and happily parted ways with the world's most iconic Twins and Faith Hills. Four stars","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":33563,"reviewerID":"A2KM0EANYJW4MF","asin":"B00004Y6ND","reviewerName":"Lance G. Rigley","helpful":[8,8],"reviewText":"When this CD was previewed and released in Australia in the early two thousands, I felt like I had to buy it angrily. I know the blood of Kasey Chambers and this excellent singing in the family costume * Dead Ringer Band *, especially the song * Living In the Circle *. When I played this CD, the original production and sound shocked me. There are personal and rare songs, and the voice is equally small, and I communicate with them right away. This is a refreshing change, trying to provide a national voice in international marketing, Lucinda Williams, a Sean Colvin * wish * project. It’s like selling good stuff in Eskimo and selling traditional villages in Nashville, but it works. It still is! ! This is an Australian album that has won national acclaim and has been popular for the past twelve months, and has set the bar high for contemporary tree artists. All these twenty-two papers of hard work and maturity of this first trial! ! ! From the title track * Captain *, this is a memorable song that will impress you every time you listen to it, so that it appears in the Sopranos * sound, which is appropriate. And give him a fair chance to express himself. He has been with Letterman and has a certain reputation in America. We can only wait for the release to be tracked. The first five of these six songs were strong and caught up with this real talent, but unfortunately, the CD has been a bit of a chore since then. The words are always convincing, but trying to sound like an American country somehow damaged the status quo. Thankfully, however, the size of most of the tracks is commendable for young Jones, and the full CD feelings allow the weak tracks to slip. This is an Australian water CD and has produced a large number of material from female country musicians. The CD has a maverick standard. Well done and the voice variation is very good. Her brother and father contributed to the whole song, while her brother was in charge of the production. There is a kind of confidence in the hard work of the family, and a state of knowledge that produces self-confidence. I recommend that you buy this CD and enjoy the feelings and emotions it contains. I patiently wait for this next attempt. Level twenty high on two thousand of my CDs. The real world * will not be sold in Nashville, and they are far from the Shania Twains and the mountain of faith in this world. Four to five stars.","overall":5,"summary":"On an Impulse...A Different Maverick Sound..Very Original","unixReviewTime":991785600,"reviewTime":"06 6, 2001"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"I love this album because it is not \"Britney Spears,\" get up and dance, snap your fingers music. \"Tidal\" represents the part of life that makes you sit down and hold your head in your hands, and it is a much needed breath of smokey air in a bubblegum society. Songs such as \"Sleep to Dream\" and the wonderful \"Shadowboxer\" show that this young woman has much to offer in the future.","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"I like this album because it's not \"Britney Spears\", get up and dance, beat your music with your fingers. \"Marine\" represents the part of life that forces you to sit up and hold your head in your hands, and is a much needed breath of fresh air in the bubblegum community. Songs like \"Sleep to Dream\" and the beautiful \"Shadow Boxer\" show that this woman has a lot to offer in the future.","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"I like this album because it's not \"Britney Spears\". Get up and dance and beat the music. The \"waves\" represent a living space that allows you to sit down and hold your head in your hands. This is the most sought after smoking in the bubblegum community. Songs like \"Sleep to Dream\" and the amazing \"Shadowboxer\" show that this lady can do a lot in the future.","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":11058,"reviewerID":"A38UBVJEV1LLS7","asin":"B000002BE9","reviewerName":"NorthofCB","helpful":[1,1],"reviewText":"I love this album because it’s not “Britney Spears,” get up and dance, listen to the music in your hands. “Bad luck” means part of life sitting on you and holding your hand, and it’s a necessary breath in the smoky atmosphere of a bubble -filled society. Songs like “Sleeping Dreams” and the amazing “Shadowboxer” show that this young woman has a lot to offer in the future.","overall":5,"summary":"A Taste of the Darker Side","unixReviewTime":1070582400,"reviewTime":"12 5, 2003"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"This has a timeless, warm feel to it, as if it's a long-lost LP from the early 'seventys and not a brand-new CD. The piano-based songs conjure Carole King, Laura Nyro and Roberta Flack, among others, with a dash of southern soul (think the Dixie Flyers) thrown in for good measure, yet never deviate from being distinctly original. Diane's voice is an absolutely wondrous, expressive instrument, and the music is guaranteed to percolate through the head long after it's over. My favourites keep expanding - at first listen they were \"Fools,\" \"Nothing but a Miracle\" and \"Rise Up,\" but now, my third time through, they also include \"Valentino,\" \"Photograph,\" \"Don't Wait Up,\" \"Mirror Mirror\" and \"Ariel,\" too. (In other words, there's not a bum song in the bunch.)","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"It's a timeless, hot moment, like an LP lost in the early one thousand, nine hundred and seventy's, not a brand new CD. Piano-based songs include Carol King, Laura Nero, and Roberta Flack, among others, cast well (according to Dexie Flyers) with an abundance of Southern spirits, but never deviating from the former. Diane's voice is a wonderful instrument, and it sounds great, and music is guaranteed to enter her head very late. My likes are growing - at first \"they were stupid,\" \"nothing but miracles\" and \"get up\", but now, the third time I pass, they include \"Valentino,\" \"picture,\" \"Dawn.\" There are it-waitups, \"\" Mirror Mirror \"\" and \"Ariel,\" again. (In other words, there is no song in the crowd.)","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"It gives people a glimpse of endless life and warmth, as if it were a long LP loss since the one thousand, nine hundred and seventys, instead of a brand new CD. Piano-based songs remind Carole King, Laura Nyro, and Roberta Flack, among others, with the finger of the southern soul (think Dixie Flyers), but never deviate from the material. Diane's voice is certainly an amazing and descriptive instrument, and music will penetrate the mind long after it is completed. My favourites continue to grow - at first I felt like \"stupid\", \"without miracles\" and \"high\", but now, for the third time I've listened, they also include \"Valentino\", \"photos\", \"don't wait\" Top, as well as \"Mirror Mirror\" and \"Ariel\". (In other words, no song roams the group.)","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":57875,"reviewerID":"A3JNJMHPPR33SI","asin":"B0024RI70M","reviewerName":"J. Gemmill \"Fan of music, movies and more.\"","helpful":[0,0],"reviewText":"It has an endless sense of warmth, as if it were a long -lost LP since the early seventies and not a new CD. The piano -based songs have combined Carole King, Laura Nyro and Roberta Flack, among others, with a soul -stirring (think Dixie Flyers) that is of great proportion, but has yet to deviate from the originality. . Diane’s voice is absolutely wonderful, a device that shows, and the music is guaranteed to be felt in your head long after this. My favourites are expanding - at first the listening were \"Stupid,\" \"Something Mighty\" and \"Wake Up,\" but now, the third time I've gone through them, they're also on \"Valentino,\" \"Photo,\" \"Don't Wait,\" \"Mirror Mirror\" and \"Ariel,\" also. (In other words, there karen’t a lot of crude songs.)","overall":5,"summary":"Perfect Debut","unixReviewTime":1243987200,"reviewTime":"06 3, 2009"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"One of the best albums EVER. Great mix of hard and soft songs. Lots of standout tracks.one. Open Your Eyes five\/one hundred and two. Pressure seven\/one hundred and three. Fade ten\/one hundred and four. It's Been a While ten\/one hundred and five. Change weight\/one hundred and six. Can't Believe six\/one hundred and seven. Epiphany weight\/one hundred and weight. Suffer weight\/one hundred and nine. Safe Place five\/one thousand and ten. For You nine\/one thousand and eleven. Outside nine\/one thousand and twelve. Waste seven\/one thousand and thirteen. Take It six\/ten","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"One of the best albums. Great combination of hard and soft songs. More visible .mid tracks. Open your eyes \/ five \/ one hundred and two. Pressure seven hundred and three. Fade ten \/ one hundred and four. It became a period of ten hundred and five. Change the weight \/ hundred and six. I can't believe six hundred and seven. The weight of the Epiphany \/ hundred and weight. Weight \/ one hundred and nine. A safe place with fifteen thousand. You are nine thousand and eleven. Out of nine \/ thousand and twelve. Waste seven thousand and thirteen. Get six","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"One of the best albums of all time. The perfect combination of soft and hard songs. Lots of great ways. One. Open your five eyes \/ one hundred and two. Seven pressures \/ one hundred and three. Decrease ten \/ one hundred and four. It was ten\/one hundred and fifty-five for a while. Change the weight \/ one hundred and six. I can't believe six \/ one hundred and seven. Epiphany difficulty \/ hundred difficulty. By weight \/ nineteen hundred. Fifth \/ tenth place safe. Nine \/ eleven thousand. Over nine \/ twelve to'clock. Expenditure seven \/ thousand and thirteen. Take six \/ ten","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":34672,"reviewerID":"A11YFRHUSK8IP9","asin":"B00005AAFJ","reviewerName":"shadowchild","helpful":[2,4],"reviewText":"One of the most beautiful albums. A good combination of hard and soft songs. Too many stop tracks. One Open your five \/ one hundred and two eyes. Seven \/ one hundred and three pressures. Only ten \/ one hundred and four. This is ten times \/ one hundred. Change weight \/ one hundred and sixty. I can't believe six \/ one hundred and seven. Epiphany weight \/ sleep and weight. Allow weight \/ hundred and nine. Five thousand \/ thousand and ten thousand safe. Nine \/ one thousand and eleven for you. Except for nine thousand \/ one thousand and twelve. Clean seven \/ thousand and thirteen wastes. Take it six \/ ten.","overall":5,"summary":"Great CD","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"I've been a fan of The Game since the dropped The Documentary, and over the years this music has become a guilty pleasure of mine. And the's been subject to a lot of heat for this name dropping' style of wrapping', but that's just this style. I don't think anyone else can pull that style off like The Game. Anyway I've been anticipating this album since what seems like forever, and in some aspects I'm a little disappointed. One thing is it seems like there in't one solid sound throughout the album. The production seems like it's all over the place. He has some corny radio beats, some true old school beats, and some southern sounding beats. The other thing is the features. It's become something that's expected on a Game album, but on this I don't agree with a lot of them. Snoop - I feel the's really corny now, but the did't have a real verse. He just spits a couple of bars so it does't ruin the song, and they are on point. Wayne - I haven't liked anything the's put on since Cthree, but I got lucky and the only did the hook on the two songs the's on. Tyler the Creator - I just don't like this dude. But the came through on a pretty decent verse. And that \"That's expected like Jayceon whenever the name drops\" line is classic and made me chuckle. Drake - I hate this cat. I always have, and this verse is straight terrible. He should've got a more respectable MC for a song wit this subject matter. Rick Ross - I hate this dude too because the's a fraud. Rappin' about thuggin' and selling' drugs but the was a cop. Game should've got one of The LOX members to shop on this track. Lloyd - I can't stand this voice, Ne-Yo would've been better. Mario - Not a fan of this singing voice either. Wale - Dude is just really whack as an MC. My favourite tracks: \"The City\", \"The Good, The Bad, The Ugly\", \"Born In The Trap\", \"California Dreams\"Tracks to skip: \"Hello\", \"All The Way Gone\"This could've been a really solid\/classi album if the would've switched some guest artists for just left 'em off altogether. And if the would've been more coherent production wise.eight\/ten","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"Since the release of The Documentary, I have been a fan of the Game over the years, this kind of music has become a kind of fun for me. And because the name goes down to ‘packing style’, it’s got a lot of praise, but this is just the way it is. I think no one else can remove this style like Game. In any case, I was looking forward to this album because it seems to be a thing of the past, and somehow I am disappointed. The only downside is that it seems like there is no solid sound on the whole album. The product seems to be everywhere. You have old radio beats, some really hit the old school, and some hit the bottom. Another thing is work. It’s already an expectation for the game’s album, but for now I don’t agree with most of them. Snoop — I think it's very old now, but there are no real verses. He just scratched a few bars, so as not to pollute the song, and they were right. Wayne — I don’t like anything since Cthree, but I’m lucky that only two songs had a habit. Tyler the Creator — I don’t like this guy. However, with a good verse. And \"Whenever a word comes down, it's like Jayceon\" is a common funny joke. Drake — I hate this cat. I always have it, this verse is awesome. He will have to have a more respected MC to make a song about this. Rick Ross — I hate that guy too, because the's a liar. Rappin 'about gangsters' and 'selling' drugs, but this is a police officer. The game must allow one of the LOX members to purchase on this song. Lloyd — I can't stand the sound, Ne-Yo will get better. Mario-doesn't like this kind of singing. Wale-Dude is as good as MC. My favourite songs: \"City\", \"Good, Bad, Bad\", \"Born in a Trap\", \"Dream of California\". Reliable \/ classic albums, if they can replace some of the visiting artist, let them go completely. That this would be a more consistent product of wisdom. eight\/ten","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"I’ve been a fan of the Game since the Documentary was released, and over the years this music has become an apology to me. And there was a lot of heat to this name up to ‘recording mode’, but that’s just the style. I don’t think anyone else can get that style like Game. However I look forward to this album because it seems like forever, and in some respects I apologize. One thing seems to be that there in’t a single solid sound throughout the album. Production seems to be somewhere. He has some radio beats, some old school beats, and some southern beats. The other things are attributes. It turned out to be the game’s album hope, but I disagree with many of them. Snoop - I feel like the’s really corny now, but I don’t have a real verse. He spits out a lot of bars so as not to break the song, and they are in the spotlight. Wayne - I haven’t liked anything to put on since Cthree, but luckily I got hooked on both Tyler the Creator songs - I don’t like this year. But the poem comes in a beautiful and clear paragraph. And the “That’s reliable like Jayceon every time the name goes down” line was normal and made me laugh. Drake - I hate this cat. I always have, this verse is directly wrong. The MC should get a lot of respect for songs on this topic. Rick Ross - I also hate this guy because the’s a cheater. Rappin ‘on stealing’ and ‘selling’ drugs but a cop. The game must have one of the LOX members to shop this route. Lloyd - I can't stand this sound, Ne -Yo will be good. Mario - Not a fan of this soundtrack. Wale - The true friend is an MC. My favourite tracks: \"City\", \"Good, Bad, Ugly\", \"Born in a Trap\", \"California Dreams\" Jumping Paths: \"Hello\", \"All the Way Gone\" This is going to be a hard \/ class album if it’s going to be some of the guest artists they’re all just. And if it will be productive and connected. Eight","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":58758,"reviewerID":"ADCC3WHSZNW1R","asin":"B002U1ABZG","reviewerName":"J. Richardson","helpful":[0,0],"reviewText":"I've been a fan of the game since the documentary was released, and for many years this music has been my test of joy. And it was too hot to dismiss the word 'rap style' for that word, but that's just the style. I don't think anyone else will take this style as a game. Anyway, at least I did't go down without explaining myself first. One thing is for sure, there is not a single solid sound in the whole album. Production is everywhere. He has some radio equipment, some old school instruments, and some Southern songs. The other thing is features. This is what is expected of a game album, but this time I do not agree with most of them. Snoop - I feel like Carney is right now, but I don't have a real verse. He spat out just a few bars so it would't hurt the song, and they're on point. Wayne - I've never liked anything since Cthree, but I've been lucky and only hooked on these two songs. Tyler is the creator - I don't like this guy. But it happened with a very good verse. And the \"Jason's expectations whenever the name goes down\" line is old and makes me laugh. Drake - I hate this cat. I have always been, and this verse is very straightforward. He should have got the highly respected MC of the song that goes with this story. Rick Ross - I hate this guy too because the's a cheater. Reagan was a 'thug' and 'seller' of drugs but a police officer. The game was to be purchased by one of the LOX members this way. Lloyd - I can't stand the word, Ni Yu would be better. Mario - He's not a fan of this song. Well - man, there's only one MC. My favourite tracks: \"The City\", \"The Good, Bad, The Next\", \"Born In The Trap\", \"California Dreams\" Escape Songs: \"Hello\", \"All The Way Gone\" This is probably a solid album \/ Which, of course, made the video an overnight sensation. And if the product is more integrated. Eight \/ ten","overall":4,"summary":"Not his best, but not his worst","unixReviewTime":1319155200,"reviewTime":"10 21, 2011"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"I was absolutely shocked after hearing the new Incubus album. There is just so much to love on there. If you want to make a name for yourself; if you want to leave your stamp in the world of music, you have to bring something different to the table. Which is exactly what Incubus did. There is so much diversity in the music. The new bass player from the roots is a vast improvement. The guitar solos are just sick! The songerwriting is from out of this world. I own all of the Incubus albums, from Fungus Amongus through A Crow Left of the Murder. this one is the most diverse and shocking, making it there best one. in my opinion. (Best Track: Sick Sad Little World)","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"I was surprised to hear about the new album Incubus. There is so much to love. If you want to make a name for yourself, if you want to leave your stamp on the music scene, you have to bring something different to the table. Exactly what Incubus did. There are many variations in music. The new bass player from the roots is a huge improvement. Solita Solo is just sick! The songwriting belongs to this country. I have all the incubus albums, from Fungus Amangus to A Crow Left of the Murder. It's very different and shocking, it makes it so much better. I think. (Top Track: Sick Seed Little World)","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"After hearing the new album Incubus, I was shocked. There are so many things to love there. If you want to be famous yourself; if you want to leave your mark in the music world, you will have to come up with something different. This is exactly what the Incubus does. There is a lot of diversity in music. The new bus player from the roots is a huge improvement. Guitar solo is a spain! The songwriter comes from this world. I have all the Incubus albums, from Fungus Withinus to Crow Left of the Murder. This one is the most unique and shocking, it makes it the most outstanding. in my opinion. (The real track is: Sick Little World Is Sick)","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":45107,"reviewerID":"AX94XE2KY5WK4","asin":"B00018D5CQ","reviewerName":"Alan Pounds \"Al's Music & Movies\"","helpful":[4,4],"reviewText":"I was shocked after hearing about the new album Incubus. Many will love there. If you want to make a name for yourself; if you want to leave your stamp on the world of music, you have to bring something else to the table. Which Incubus did. The music contains so many variations. The new bus player with roots is a big improvement. The guitar just exists! The songs they using come from this world. I own all of Incubus albums, from Fungus Amongus to A Crow Left of the Murder. this one is the most varied and the most surprising, which makes it the best place. In my opinion. (Best Effect: The Chaotic World of the Small World)","overall":5,"summary":"Out with the old, in with the NEW","unixReviewTime":1081814400,"reviewTime":"04 13, 2004"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"Years ago, I wanted the song \"Funny how time flies.\" So, I went to buy it and found that it was only available for purchase on the gold \"MasterDisc\" series. So, I purchased it from a certain record store and personally, never regretted it. Now, you all get the same thing (plus extra tracks) at domestic! Get your copy, and enjoy it!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"Years ago, I wanted this song “Time Runs for Happiness”. So, I went to buy it and found that it could only be bought in the gold series \"MasterDisc\". Well, I bought it at a record store, and I have no regrets. Now, you can find similar items in China (and additional songs)! Grab your copy and enjoy!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"Years ago, I wanted a song called \"It's funny how time passes.\" So, I went to buy it and found out that it is available for purchase in the gold series \"Master Disc\". So, I bought it in a recording studio and personally, I never regretted it. Now, you all get the same thing (and more tracks) at home! Get your copy, enjoy it!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":5239,"reviewerID":"A36NUDST4Y5JBA","asin":"B000001FC0","reviewerName":"D. S. HARDEN \"a movie fan\"","helpful":[1,1],"reviewText":"Years ago, I liked the song \"Laugh at how time passes.\" So, I went to buy it and found out that it was just ready to sell the “MasterDisc” gold series. So, I bought it from a private recording shop and personally, I don’t regret it. Now, you’re all getting the same thing (plus more clues) inside! Get your copy, and enjoy!","overall":5,"summary":"Tears for Fears...","unixReviewTime":1126828800,"reviewTime":"09 16, 2005"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"Jeff Lynne had wanted to quit recording albums under the ELO name for some time. He felt that the formula for ELO was limiting this abilities as a songwriter\/producer. He stepped forward with a fine final album. \"Balance of Power\" has a handful of terrific songs including the great \"Calling America\". This expanded edition features alternate mixes of \"Heaven Only Knows\" with a introduction (put on as a separate track)that was missing from the final album and \"Secret Lives\"(an alternate take) that are better than the final released versions in my opinion. \"Sorrow About to Fall\" is an alternate mix of the album track. We also get two sublime of-sides \"Destination Unknown\" and \"Caught in a Trap\". The songs were previous released on the first ELO boxed set but rightfully regain their place next to the stronger tracks on this next-to-last ELO album. When Lynne would return as ELO only Richard Tandy would play on \"Zoom\". Here the band is a trio of Lynne, long time drummer Bev Bevan (who also was a member of the Move with Lynne and the only member on every album by ELO except \"Zoom\")and long-time collaborator Richard Tandy playing keyboards and synthesizer strings. Lynne plays both guitar and bass. Although the production and use of electronic drums date the album, they add a charm to the album. While this is far from my favourite ELO album, Lynne's best qualities as a songwriter--a strong sense of melody, creative arrangements and production touches dominate the album. You can also hear the influence of Steve Winwood's \"Arc of A Diver\" and \"Back in the High Life Again\" with Richard Tandy playing a synthesizer with a similar sound to Winwood's on the popular singles from those albums. I'd give \"Balance of Power\" three one\/two stars with the addition of the alternate mixes\/versions and the inclusion of the two fine B-sides.","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"Jeff Lane has long wanted to stop recording albums under the ELO name. You may have noticed that the ELO formula reduces these skills as a singer \/ producer. You go ahead with a great last album. \"Balance of Power\" has some great songs, including the big \"Calling America\". This extended version has some \"Heaven Only Knows\" mix tapes with the introduction (included as a separate song) that were't available on the last album and in \"Secret Lives\" (another tech) that my Feedback is better than the latest version released. \"Fall About Sorrow\" is a unique combination of album tracks. We also found the upper two sides of the \"unknown\" and \"trapped\" aspects. The songs were first released on the first set of ELO boxes, but regained their place on the next ELO album, right next to the solid tracks. Only Richard Tandy will play in \"Zoom\" when Lane returns as ELO. Here are all three of Group Lane, longtime drummer Beau Beyonce (who was also a member of Mowwood Lane and the only member of all ELO albums except \"Zoom\") and longtime co-star Richard Tandy with the Synthesis strings. Play keyboard Lane plays guitar and bass. Electronic drums are produced and used through albums, but they add charm to the album. While this is far from my favourite ELO album, Lane's great qualities as a songwriter - a strong sense of music, creative arrangements and productive touch are the hallmarks of the album. You can also hear the effects of Steve Onewood's \"Arc of a Diver\" and \"Back in the High Life Again\" and Richard Tandy playing a synthesizer with rosewood-like sound in the popular songs on these albums. I can give \"balance of power\" three \/ two stars by adding some mix \/ version and two good B sides.","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"Jeff Lynne wanted to stop recording albums named ELO for a while. She felt that the ELO formula was limiting her ability as a singer \/ songwriter. He has already picked up the latest good album. “Balance of Power” has a large number of awesome songs along with the great “Call of America”. This expanded edition presents another combination of “Heaven Only Know” with an introduction (set as a separate path) missing from the last album and “Hidden Life” (another take) that is better than in the latest versions. Opinion released. “Sadness About Fall” is a mixed mix of songs from the album. We also found two very high levels of “Unknown Place” and “Trapped”. The songs were already released for the first time in the ELO box but they were right back in their place following the strong tracks on the next ELO album until the very send. When Lynne returns to ELO only Richard Tandy will perform \"Zoom\". Here the band is three with Lynne, drummer Bev Bevan (who is also a member of Move with Lynne and the only member of any ELO album other than “Zoom”) and longtime partner Richard Tandy who plays the key and string maker. Lynne plays both guitar and bass. While the making and use of electronic drums is historically an album, they add to the charm of the album. While this is far from my favourite ELO album, Lynne’s great qualities like strong voice, creative compositions and creative touches dominate the album. You can also hear the effects of Steve Winwood’s “Arc of A Diver” and “Back to High Life Again” with Richard Tandy playing a producer with a Winwood -like voice on popular singles from the albums. I will give “Strength Balance” three one \/ two stars plus a combination \/ other type and will add both sides of the B-positive.","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":8946,"reviewerID":"AQP1VPK16SVWM","asin":"B00000264E","reviewerName":"Wayne Klein \"If at first the idea is not absu...","helpful":[18,19],"reviewText":"Jeff Lynn wanted to stop recording albums under the name ELO for a while. You feel that the ELO formula establishes this skill as a songwriter \/ producer. He has gone ahead and released a beautiful final album. \"Balance Power\" has some great songs, including the great \"Call America\". This extended genre is marked by a rotating mix of \"Heaven Only Knows\" with a lost introduction (as a separate song) and \"Secret Life\" (another version) to the last album, which has a better view than my last report. \"Sorrow About Falling\" is one of the songs in the album. We also have two important issues \"unknown destination\" and \"arrest\". These songs were previously released on ELO's debut album, but on ELO's latest album, they are back in their tracks alongside more powerful tracks. When Lynn returns as ELO, only Richard Tandy will appear in \"Zoom\". The band there is Lynne's third, long-serving Bev Bevan (also a member of the Move with Lynne and the only member on each ELO album, with the exception of \"Zoom\") and long-time collaborator Richard Tandy playing keyboards and String Bonds. Lynne can play the guitar and the bus. Although the production and use of electronic drums on the day of the album, they add charm to the album. While this is a long way from my favourite album, Lynne’s most outstanding qualities as a powerful musician, design alignment and production style dominate this album. You can feel the influence of Steve Winwood's \"Arc of A Diver\" and \"Back in the High Life Again\". Richard Tandy played is a synthesizer similar to Winwood's sound in famous singles on these albums. I'll give you a \"Power Balance\" of three \/ two stars, as well as a combination \/ alternative versions and include two beautiful B sides.","overall":4,"summary":"Final ELO album before \"Zoom\"","unixReviewTime":1174435200,"reviewTime":"03 21, 2007"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"When it has came down to female artists from the U. K., they haven't been striking in regards to music lately. Of course, that showed examples from a few years ago from facts like Adele and Amy Winehouse to name a few female songstresses. For Lorde, whom is trying to escape the shadows of being underwhelmed and breakout nicely, She showed that brilliantly with her debut single from her album Pure Heroine. Her song Royals worked extremely well that matched heart and soul well for her style. Her second single, Team from her debut record Pure Heroine, in't actually as strong for driven as was the case with Royals. It is a fairly good song, but not anything that drives like what Royals did before. Hopefully, Lorde can really drive more from her voice with her next single. Maybe there will be more than what Team had showed. Song: C one\/two+","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"In the final analysis, it was the UK female artists, who were not recognized in music recently. Of course, this shows examples from the last few years, such as female singers such as Adele and Amy Winehouse. For the Lord, who was trying to eradicate the shadow of unhappiness and piercing, the showed this brilliantly with the first person on this album \"Pure Heroine\". His song \"Royals\" works well and matches this style well. His second single, Group on this album Pure Heroine, is actually not as strong as the Royals. This is a beautiful song, but not as popular as the Royals. Hope the Lord can find more in His word in this next single. Perhaps there will be more than what the Group indicated. Song: C One \/ Two +","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"When it comes to female artists from the UK, they have not been on strike recently. Well, over the last few years, she has named a few women's songs from facts like Adele and Amy Winehouse. For Lorde, who is trying to escape the shadow of oppression and disintegration, the made this clear with this first single on this album Pure Heroin. Her song Royals has done a great job which fits her heart and soul well with her style. Her second marriage, her first record on pure heroin, is not as strong as it was with the Royals. A great song, but nothing driving like the Royals. Hopefully Larde can say a lot with this voice and this next person. Probably more than the team indicated. Song: C one \/ two +.","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64375,"reviewerID":"A3W4D8XOGLWUN5","asin":"B00FAEQ65Y","reviewerName":"Michael Kerner \"Michael Kerner\"","helpful":[1,2],"reviewText":"When it comes to female singers from the United Kingdom (UK), lately they haven’t been playing music. Of course, that showed examples a few years ago from realists including Adele and Amy Winehouse to name a few girls in the girls ’choir. Lorde tried to escape the shadows of the pouring brain and break it properly, showing off her beauty in her first single from her album Pure Heroine. His Royals songs worked hard so the heart and soul perfectly fit this style. In its second place, the team’s first Pure Heroine roster, in’t really as strong at driving as in the case of the Royals. It’s a good song, but it’s not the same as what the Royals did before. Hopefully, Lorde can really take this voice to the next level. Perhaps there will be more than the Group has shown. Song: C now \/ lab +","overall":3,"summary":"Sequel?","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"What do you say about an album you had to replace twice on vinyl before finally scoring a hit on a CD that is still with you? That this is likely the single best album the never produced? That the song cycle, singing, and instrumentation there is what still distinguishes Browne as a singular singer\/songwriter\/artist from all the others? That you still smile every time you hear the last several lines, \"Look, you're standing in the window\/ Of a house nobody lives in\/ And I'm sitting in a car across the way \/Let's just say an early model Chevrolet\/ You go pack your sorrows\/ The trash man comes tomorrow \/ We'll throw 'em on the curb\/ And then just sail away\"This best-selling album will sail on forever. From \"Late For The Sky\" to \"Fountain of Sorrow\" and all the rest of the wonderfully intimate, strikingly autobiographical, personal, and evocative songs the introduced to the waiting world with this album, this is one everyone should have in their CD collection. It is a cleverly innocent Technicolor snapshot picture taken on clear, cool Southern California night, just like the album cover. It is a faithful, memorable, and absolutely artistic reproduction of a moment in contemporary culture made by someone who has built a whole musical career by being the ultimate self-acknowledged dreamer and world-watcher. Spin it and enjoy. I still do.","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"What about an album that you had to change twice on Vinyl before you finally hit the CD you had? Could this be one of the best albums never? Cycling, singing, and playing the instrument that sets Brown apart as an artist \/ singer \/ artist. That every time you hear the last few lines you smile, \"Look, you're standing by the window \/ The house is empty. This best-selling album will last forever. From\" Let for the Sky \" \"Spring of Sorrow\" and all the amazingly closed, personal, personal and moving songs introduced the waiting world with this album, all of which should be in your CD collection. A clean, cool night in Southern California was taken as the cover of the album. And as a mentor, I've developed all the musical skills. Get around and enjoy it. I still do.","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"What about an album that you had to change twice to vinyl before you could finally hit a CD that was still with you? That was maybe the best album never released? That the song rotation, song, and instrumentation still has something that sets Browne apart from the songs \/ chants \/ singers that are different from everyone else? Still smiling whenever you hear the last lines, \"Here, you're standing at the window \/ An uninhabited house \/ I'm sitting in a car on the side of the road \/ Let's say an old model Chevrolet \/ You're going to your grief \/ The garbage man comes \/ We'll throw it on the road \/ Then we'll go \"This best -selling album will last forever. From “Late For the Sky” to “The Soul of Sorrow” and all the other exciting, biographical, personality, and emotional songs presented to the waiting world on this album, it’s a must have for anyone to keep their collection on CD. This is an unintelligent photo of a Technicolor technician taken on a cold white night in Southern California, like the cover of an album. It is a trustworthy, memorable, and completely artistic work on a moment in modern culture created by someone who built a full range of music and became the latest self -confessed commitment to self and observers around the world. Turn around and enjoy. I still do.","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":12504,"reviewerID":"ALR35EFI69S5R","asin":"B000002GXU","reviewerName":"Barron Laycock \"Labradorman\"","helpful":[82,88],"reviewText":"What do you think of an album that you need to double return to a vinyl record in order to finally win on the CD that goes with you? Is this the best album never made? Musical songs, singing, and instrumental work still distinguish Brown as a single singer \/ songwriter \/ artist from others? Every time you hear the last few lines, you still smile, \"Look, you're standing at a window \/ in an empty house \/ I'm sitting in a car next to you \/ let's say the first models of the Chevrolet \/ you'll pack your grief From the \"Late For the Sky\" to the \"Source of Sorrow\", and all the other wonderful, intimate, wonderful personal life, personal and inspiring songs are brought to the waiting world by this album, that's where everyone should be. songs from this CD collection.the spotless ingenuity and pure color photograph taken from California's clear and cool night of the night, like an album cover. for the is the most famous dreamer and spectator of the world. Go around it and have fun. I am.","overall":5,"summary":"One Of Jackson Browne's Early Masterworks","unixReviewTime":963100800,"reviewTime":"07 9, 2000"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"One of the best USA rock albums never. no kidding! Rebellion rules there. with the film \"West Side Story\" as the backdrop, even incorporating the film's score throughout the album. A piece of cultural history and great songs fusing guitar drenched rock and roll, sophisticated theatrical excitement, elegant sleaze, into a total theme trip that pushed Alice into the stratosphere as both as a star and a clever force that was to be taken seriously. Every note is a treasure and unique. Should get a better remastered two CD version with all the trappings, restored artwork and whatever outtakes and live songs that are floating around capturing this highly influential group in the midst of creativity that began with inearnest with Love It To Death,Killer,School's Out and Billion Dollar Babies. all essential.","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"One of the best rock albums in the United States never. no joke! The laws of revolt there. with the film “West Side Story” behind it, even adding film points throughout the album. Part of the cultural history and great songs of rock and roll guitar, modern interest in theatre, elegant laughter, in a general theme of the tour pushed Alice to stratosfirst as a star and a brilliant force that will truly capture. Every text is valued and unique. There should be two well -arranged CDs with all the straps, restored artwork and everything that comes out of it and the live music that causes this highly influential group to get inside creatively and started irrationally. The Love for Death, Murder, Billion School Kids. everything needed.","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"One of the American rock albums never existed. No joke! Rebellion reigned there. With the movie \"The Story of the Western World\" as the original, the soundtrack is included throughout the album. A piece of cultural history and great songs combine rock-filled rock music, the thrill of stage play, and the beauty and rudeness of a full-fledged tour, pushing Alice into the stratosphere, both a star and an intelligent force, worthy of consideration. Every piece of paper is rich and unique. You need to find the best type of CD, which contains all the decorations, restored part works, and any pieces and revolving songs around to capture the creative performance of this influential group. out of school and billions of dollars for babies. They are all important.","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":14862,"reviewerID":"AARJLW29JSF31","asin":"B000002KE5","reviewerName":"JG \"jg\"","helpful":[2,2],"reviewText":"There has never been a better album in America. Not played! Apostasy is too much. With the movie \"West Side Story\" as the background, including movie points throughout the album. A piece of cultural history and a mix of rock and roll guitar, a passion for theatre, a beautiful sledgehammer, on a thrilling journey that compelled Alice to be taken seriously as a star and an intelligent force. Each note is complete and unique. You should get a duplicate CD version with all the catches, a masterpiece of part and all the output and live songs so that this influential group can be added to the part Billions of dolls have made an unfortunate start with children. . Everything is important.","overall":5,"summary":"Epitome Of American Cool ..Rhino Give It the treatment","unixReviewTime":1145750400,"reviewTime":"04 23, 2006"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"I don't know how else to describe this CD. It's just plain sappy. Almost every single song the's whining about love, talking about being in love, for how someone did him wrong. It's very Motown, but without the \"uumph.\" I could listen to the Temptations all day, and I really enjoyed the Motown era, but it sounds out of place from an artist so young and so fresh. When the was with Tony Tone Toni (or however you spell it), the music had a modern feel. \"Instant Vintage\" was really good--a touch of jazz, a touch of blues, a lot of R&B, instrumentals, and a hint of ship shop. But this whole CD makes me feel like I'm involuntarily sitting by myself at a booth table, with one shabby changing light above me, while the sings across the room from me and cleans against a jukebox. If that's your thing, you'll love this CD. If not, you may be disappointed, especially in the fact that the even made Jay-Z sound about as vulnerable as Keith Sweat.","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"I don't know how to explain this CD. Just a simple shell. Almost every song cries out for love, talks about being in love, how someone hurt her. It's mostly in Motown, but without \"Amp\". I was table to listen to the trials all day, and I really enjoyed the motto season, but it felt like there was no room for a young and young artist. Music had a modern feel when it came to Tony Tony Tony (or spelling). \"Instant Vintage\" was really good - jazz hits, blues hits, lots of R&B, musical instruments, and ship shop tips. But the whole CD makes me feel like I'm sitting alone at the booth table, changing a lamp over me, while I using in the room and clean the jack box. If this is your thing then you will love this CD. If not there's a new product just for you!","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"I know of no other way to describe this CD. It's a clear sappy. Almost every song that loves to drink and talks about love, like someone made a mistake. It’s very Motown, but there’s no “uumph”. I could listen to drums all day, and I really enjoyed the Motown era, but it did’t have a very small, very modern part area. When the’s with Tony Tone Toni (or whatever you spell), the music has a modern feel. “Fast Home” is really great - touches of jazz, blue touches, lots of R&B, instruments, and ship shop instructions. But this whole CD makes me feel like I’m inadvertently sitting at a tent table, with something turning me over to my light, while the sings in my room and cleans my jukebox. If this is your thing, you'll love this CD. Otherwise, you might be disappointed, especially with the fact that even Jay-Z has also made a sound about being vulnerable to Keith Sweat.","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":56756,"reviewerID":"A2C5VLIJMDPWHI","asin":"B001CY2EL6","reviewerName":"Shamontiel L. Vaughn \"I'm boycotting Amazon's...","helpful":[10,25],"reviewText":"I don't know how to describe this CD. He's just an ordinary fool. Almost every song complains about love, talking about love, because someone has sinned. This is very Motown, but no \"umph\". I listen to the temptation all day. When used in conjunction with Tony Tone Toni (or spelled it), music has a modern feel. \"Vintage Instant\" is perfect - a little jazz, little blues, a lot of R&B, instrumental music, and a little taste of the boat shop. But the whole CD made me feel like I was sitting alone at a small table with a flash of light above my head, while the room in front of me sang and cleaned the box. If this is your case, you will love this CD. If not, you might be disappointed, especially because it makes Jay-Z sound as vulnerable as Keith Sweat.","overall":2,"summary":"Sappy","unixReviewTime":1221609600,"reviewTime":"09 17, 2008"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"If you have heard of NOFX before, chances are you've heard at least one of the songs off of this album. If you own any NOFX CD's, you probably already own this album. If you own any other NOFX albums, this is definitely a must have. It in't as heavy as 'So Long and Thanks For All the Shoes' for as fast as 'Pump Up the Valuum'. The reason that this CD gains my extreme support is that this album started it all. It was the album that transformed a mediocre punk band into what many now consider the best new school punk band.","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"If you've heard of NOFX before, you've probably heard at least one song on this album. If you own NOFX CDs, you probably already own this album. This is a must if you own NOFX albums. It does't weigh as much as Pump Up the William, thank you for all the length and all the shoes. The reason this CD gets so much support is that this album has started it all. It was an album that replaced the infamous punk band that many now see as a new punk music group.","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"If you’ve heard NOFX before, you’ve probably heard at least one of the songs on this album. If you have NOFX CDs, you may already have this album. If you have other NOFX albums, this is definitely a must have for you. It’s not as heavy as ‘Extra and Thanksgiving for All Shoes’ as easily as ‘Make Water’. The reason why this CD got my tremendous support is that this album started them all. This is the album that evolved into a moderate punk group for many who now consider the school punk group the best.","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":5949,"reviewerID":"A3S98L5B1SR9P1","asin":"B000001IPS","reviewerName":"Zack H.","helpful":[2,3],"reviewText":"If you’ve heard of NOFX before, you’ve probably heard one song on this album. If you have any NOFX CD, you probably already have this album. If you have any other NOFX album, this is a must. It's not as hard as \"long time, thank you for all the shoes\", but it \"improves the price\" faster. The reason this CD is sponsored by me is that this album started it all. The album has transformed a punk band into a new punk band that many consider to be the best.","overall":5,"summary":"One of NOFX's best!","unixReviewTime":1131062400,"reviewTime":"11 4, 2005"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"First Mariah Carey, then Michael Jackson and now the Bee Gees. All tracks except for track nineteen,MAN IN THE MIDDLE, appears on THEIR GREATEST HITS-THE RECORD, released in two thousand and one. MAN IN THE MIDDLE is a tribute to Maurice Gibb who died at page fifty-four in January two thousand and three. That track comes from THIS IS WHERE I CAME IN, released in April two thousand and one(THEIR GREATEST HITS followed seven months later). MASSACHUSETTS is from HORIZONTAL, originally released in one thousand, nine hundred and sixty-eight on the Atco label. The song also appeared on GOLD, released on RSO in 'seventy-six. WORLD and WORDS are from HORIZONTAL also. DON'T FORGET TO REMEMBER is from one thousand, nine hundred and seventy's CUCUMBER CASTLE(minus Robin Gibb). I'VE JUST GOTTA GET A MESSAGE TO YOU is from one thousand, nine hundred and sixty-eight's IDEA, also appearing on GOLD. From the SATURDAY NIGHT FEVER soundtrack album, released in one thousand, nine hundred and seventy-seven, are STAYIN' ALIVE,HOW DEEP IS YOUR LOVE and NIGHT FEVER. Also on SNF but originally from one thousand, nine hundred and seventy-six's CHILDREN OF THE WORLD is YOU SHOULD BE DANCING. Also from COTW is LOVE SO RIGHT. From one thousand, nine hundred and seventy-five's MAIN COURSE is the disco-flavored JIVE TALKIN'. From one thousand, nine hundred and seventy-nine's SPIRITS HAVING FLOWN are TRAGEDY,LOVE YOU INSIDE OUT and TOO MUCH HEAVEN(the latter track was released as a single before the album). From one thousand, nine hundred and eighty-seven's E. S. P. is YOU WIN AGAIN. In addition to JIVE TALKIN',TRAGEDY,STAYIN' ALIVE,YOU SHOULD BE DANCING,NIGHT FEVER and LOVE YOU INSIDE OUT are ideal for discotheque play since all those songs were recorded during the disco era of the one thousand, nine hundred and seventy's. If this album had one for two new songs on it,I'd purchase it. I won't since I already own THEIR GREATEST HITS. Some copies of this album are accompanied by a bonus DVD containing some of the Bee Gees' live performances. I dedicate this album to the memories of Maurice and the Bee Gees' father Hugh Gibb.","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"First Mariah Carey, then Michael Jackson and now B-Gays. Except for the nineteenth track, The Medal Man, all the tracks are of this greatest record, which was released in two and a half thousand. The middle man charges Maurice Gibb, who died on page fifty-four in January two thousand and three. This track comes from where I came from, was released in April two thousand and one (HIT THE MOST HITS then seven months later) comes from MASSACHUSETTS HORIZONTAL, which was originally on the Atco label at Thousand, Nine Hundred and Sixty-Eight. Was issued from The song also appeared on Gold, which was released by RSO. Earth and sounds from HORIZONTAL too. Don't forget that it came from Cumber Castle in one thousand, nine hundred and ninety-seven (download Robin Gibb). I have just received a message from you, one thousand, sixty-six, idea, gold. From the September Day Favor music album, released in one thousand, nine hundred and seventy-seven, it says that Stein is alive, how to dip your night. And in the SNF, but actually one thousand, nine hundred and sixty-six children must go through the earth. And the thing that comes out of COTW is LOVE SO RIGHT. One thousand, nine hundred and seventy-five important certificates with Dave is Jeevan Talkin. One thousand, ninety-nine, ninety-nine souls that are inspiring, we love you from the inside out and so much more (the last track released before the album). ESP tells you one thousand, nine hundred and eighty-seven that you can win again. In addition to the living talc, sadness, patience, survival, play, night fever and love are ready to play disco within because all those songs were recorded during the disco of one thousand, nine hundred and seventy. If there was one of the two new songs on this album, I would buy it. I can't because I already own their greatest people. Some copies of this album are accompanied by a bonus DVD featuring live performances by BGs. I dedicate this album to the memory of Hugh Gibbs, the father of Morris and B-Gage.","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"First Mariah Carey, then Michael Jackson and now the Bee Gees. All tracks except track nineteen, MEN IN THE CITY, which appear on the BIG HITS record, were released by two thousand and one. THE MAN IN THE CITY is a tribute to Maurice Gibb who died on page fifty -four in January of two thousand and three. That clue came from HERE THERE I WAS, and was released in April two thousand and one (THE BIGGEST DEATH followed seven months later). MASSACHUSETTS came from HORIZONTAL, originally released on one thousand, nine hundred and sixty -eight Atco brands. The song also features GOLD, which was released at seventy -six by RSO. THE WORLD AND THE WORD are also HORIZONTAL. DON'T FORGET it's from one thousand, nine hundred and seventy CAST CUQUM (minus Robin Gibb). YOU WANT TO RECEIVE A MESSAGE FROM YOU THAT IS ONE THOUSANDS, NINE WANTS AND SIX IDEAS, WHICH WILL ALSO COME OUT IN GOLD. From the Saturday Night Live album, to one thousand, nine hundred and seventy-seven songs, STAYIN IS ALIVE, HOW TO HAVE A FAMILY WITH YOUR LOVE AND NIGHT. So is the SNF but usually one thousand, nine hundred and seventy -six CHILDREN IN THE WORLD MUST BE KILLED. Also COTW is LOVE THAT IS RIGHT. From one thousand, nine hundred and seventy -five THE BIGGEST ARTICLE is JIVE TALKIN with delicious taste. From one thousand, nine hundred and ninety -nine THE SICKNESS OF FLYING IS DIFFICULT, I WANT HEAVEN AND MANY HEAVEN (the last song was released as a single before the album). From one thousand, nine hundred and eighty -seven ESP you WILL WIN. Besides JIVE TALKIN ', TRAGEDY, STAYIN' LIVE, YOU MUST DANCE, CLAN NIGHT AND LOVERS OUTSIDE are suitable for discotheque because all these songs were recorded while at the disco, one thousand, nine hundred and seventy. If this album has one of the two new songs, I will buy it. I won’t have like I have their HITS. Some copies of this album are accompanied by a bonus DVD that includes several live performances by the Bee Gees. I dedicate this album in memory of Maurice and Bee Gees ’father Hugh Gibb.","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":48067,"reviewerID":"A1IKOYZVFHO1XP","asin":"B00066N8JI","reviewerName":"andy8047","helpful":[11,14],"reviewText":"First Mariah Carey, then Michael Jackson, now Bee Gees. With the exception of song nineteen, MAN INSIDE, all the songs appeared in THEIR HOLY RECORDS, released in two thousand and one. The middle man gives it to Maurice Gibb, who passed away on page fifty-four in January two thousand and three. The song appeared in HERE I HAVE BEEN AND WAS RELEASED IN April two thousand and one (\"THE GREATEST TECHNIQUES\" released seven months later). MASSACHUSETTS comes from HORIZONTAL, which was released on the Atco label in one hundred thousand, nine hundred and sixty-eight. The song also appeared on GOLD and was released on RSO in one thousand, nine hundred and seventy-six. THE WORLD and the names also come from HORIZONTAL. Don't forget to remember Cucumber Castle since one thousand, nine hundred and seventy (take Robin Gibb). IVE JUSTA RECEIVED A MESSAGE FROM YOU IDEA from one thousand, nine hundred and sixty-eight, also appeared GOLD. The first FULL SATURDAY, released in one thousand, nine hundred and seventy-seven, says STAYIN 'LIVES, HOW DEEP YOUR LOVE AND THE END OF THE NIGHT. Also on the SNF, but from the very beginning kids from the world of one, nine hundred and seventy-six, will have to dance. It also comes from COTW LOVING IT WELL. The main dish from one thousand, nine hundred and seventy-five is the disco style JIVE TALKIN '. The one thousand, nine hundred and seventy-nine song \"WRITING SPIRITS ARE SORROWFUL, WE LOVE YOU OUTSIDE AND VERY HEAVENLY\" (this last song was released as a single before the album). Starting with the ESP of one thousand nine hundred and eighty-seven, you have won again. Unless JIVE TALKIN ', PAIN, STAYIN' ALIVE, YOU SHOULD BE DANCE, FULLY FEVER and LOOK IN is a good choice for discos, because all of these songs were recorded during the disco era in the one thousands and nine hundred and seventys. If there are two new songs on this album, I will buy them. I'm not going to admit it, because I've already caught them. Some copies of the album are accompanied by an additional DVD containing Bee Gees games. I dedicate this album to the memories of Hugh Gibb, Maurice's father and Bee Gees.","overall":5,"summary":"Chart-toppers!","unixReviewTime":1100044800,"reviewTime":"11 10, 2004"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"Ok, so this album came out near the tailed of the real big-haired, screaming eighty's bands (you know who you are), but this one has really stood the test of time. I broke the CD out after letting it sit for at least a couple of years and was reminded of how good a drummer Jason Bonham is. He turns beats inside out, drives forward with a thundering backbeat and uses very tasteful fills throughout. Get this if you want to hear some wonderful rock drumming done with style.","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"So, then this album came out near the back of real hair, shouting eighty bands (you know who you are), but this one really stood the test of time. I broke the CD after I let it sit for at least a few years and I remembered how good a Jason-Jason Bonham drum was. He beats the inside, runs the beat of the beat and uses a full-bodied flavor. Get it if you want to hear a little rock -shaped drum.","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"Okay, so the release of this album is close to the tail of real big hair, screaming eightys band (you know who you are), but this album is standing in the test of time. After playing at least a few years, I removed the CD, reminding me how good Dr. Jason Bonham is. He removed the sound from the inside out, moving on with the thunderous sound, and used a pleasant filling throughout the process. If you want to hear unique and amazing stone drums, please buy this one.","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":9260,"reviewerID":"A26R7F3OOY1UN4","asin":"B0000026QU","reviewerName":"Mike \"Squirrel Nutkin\"","helpful":[9,9],"reviewText":"Okay, so this album came in front of a big haircut tail, it looks like this eighty band (you know who you are), but it stands the test of time. I broke the CD after playing for at least a few years and was reminded of how good drummer Jason Bonham is. He pushes the beat from the inside out, thunders forward and uses delicious fillings everywhere. Discover it if you want to experience delicious rock drums made in style.","overall":5,"summary":"Great Drumming","unixReviewTime":1016236800,"reviewTime":"03 16, 2002"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"I would've never thought that Lil Wayne, when the was talking about Drop It Like It's Hot, would turn out to be one my favourite lyricist. This cd is extremely HOOD. He does't even need to feature a lot of people on this cd. I was still listening to the Carter, now all I listen to is the Carter two. Who says sequels suck? I love this cd, and I recommend it to everyone everywhere!","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"I never thought Lil Wayne could be one of my favourite songs when the talked about \"Drop It Like It Hot\". This CD is very HOOD. He does't have to show many people on this CD. I still listen to Carter, now I only listen to Carter II. Who says this way is bad? I love this CD and recommend it to everyone around the world!","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"I never thought Lil Wayne, when the talks about Drop It Like It Hot, would be one of my favourites in literature. This CD is VERY BEAUTIFUL. He does’t even have to show it to a lot of people on this CD. I’m still listening to Carter, now the only thing I’m just listening to is Carter’s two. Who says the series sucks? I love this cd, and I recommend it to everyone everywhere!","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":51101,"reviewerID":"AK5FG9F4B4A00","asin":"B000BLI4UG","reviewerName":"J. Brooks \"*~*Pryncez*~*\"","helpful":[2,3],"reviewText":"I never thought it would be one of my favourite songs when Jehovah talked about Drop It Like It Hot. This CD is very HOOD. You don't even have to add more people to this CD. I used to listen to Carter, now I only listen to Carter II. Who says sequels are useless? I love this CD, and I recommend it to everyone everywhere!","overall":5,"summary":"Best Rapper Alive!","unixReviewTime":1136678400,"reviewTime":"01 8, 2006"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"And, no, I'm not talking about the publicized incident in this private life. Quincy Jones seems to specialize in recording sexually ambivalent youngsters, whether intentional for (probably) not. Tevin can always talk to a couple of Jones' former proteges for advice on how to scope. However, on the basis of this deep and mature album, Tevin Campbell is well on this way to finding this own voice. That voice has mellowed and lowered but is as flexible and intense as before, and this talents as an interpreter continue to grow. As a songwriter, the is inventive and prone to exploring this dark side. \"Losing All Control\" is as terse and succinct a declaration of erotic powerlessness as you're likely to encounter, and \"Don't Throw Your Life Away\" recalls Aretha's \"Ain't No Way\" in structure and conviction. His own production on the self-penned instrumental, \"Just Begun to Grow,\" successfully points him in another career direction; and the inputs of Wyclef, Narada Michael Walden and Stevie J are custom-fit to Campbell's emotive persona. It is the collaborations with Marc Kinchen, particularly the moody \"Another Way,\" that position Tevin Campbell as a voice and a potent force to be reckoned with in the new millennium. Teen star grows up in public, indeed.","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"And, no, I’m not talking about this particular life broadcast event. Quincy Jones seems to specialize in filming young people sexually, even intentionally. Tevin always talks to some of Jones ’former bodyguards for advice on how to expand. However, based on this deep and mature album, Tevin Campbell will soon get this sound. The volume has decreased but diminished but is softer and stronger than before, and these interpretations of the translators are increasing. As a songwriter, the Lord is creative and prone to exploring this dark side. “Loss of All Control” is very clear and summarizes the evidence of erectile Dysfunction you are likely to experience, and “Don’t Throw Away Your Life” recalls Aretha’s “Ain No No Way” structure and sentence. His unique making of open tools, “Just Begined to Grow,” successfully directed the other direction of the profession; and productions by Wyclef, Narada Michael Walden and Stevie J are a tribute to Campbell’s passionate personality. This is Marc Kinchen’s collaboration, especially in the spirit of “Another Way,” in that position of Tevin Campbell who is the voice and power of the new millennium. The young star is growing up in public, really.","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"And, no, I'm not talking about a public event in this private life. Quincy Jones seems to be focusing on recording teens who don't think about sex, even if they don't (maybe) intend to. Tune can always talk to some of Jones' previous proteins for advice on measuring. However, based on this deep and solid album, Tune Campbell is on track to achieve this sound. This voice has melted and diminished but has changed and grown as before, and these skills as translators are growing. As a psalmist, Jehovah is keenly interested in examining this dark side. \"Losing all control\" is like a strap and summarizes the declaration of impotence as you can experience it, and \"Don't Leave Your Life Away\" reminds Areta of \"Not Way\" with structure and conviction. Do His musical production, \"Just Grow, Grow,\" which the wrote for himself, successfully points him to another side of the work. And the input of Wycliffe, Narada Michael Walden and Steve Jay is ideal for Campbell's emotional process. This is a partnership with Mark Kanchen, especially the bitterness of the \"other way\", a position that will be regarded in the new century as a voice and a great power. The star of youth is growing in the society.","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":28052,"reviewerID":"ATSULHQXHRGOV","asin":"B00000I3ZO","reviewerName":"James A. Allio \"aheyheynow\"","helpful":[2,3],"reviewText":"And, no, I'm not talking about this public event in private life. Quincy Jones seems to focus on recording sexual conflicts between young people, and even intentionally (probably) not. Tevin regularly talks with some of Jones' former students for advice on how to look at size. However, based on this deep and mature album, Tevin Campbell has really gotten this voice heard. The voice was soft and deep, but it is still flexible and powerful than before, and this talent as a translator is still growing. As a songwriter, you are very creative and inclined to explore this dark side. \"Loss of control\" is a short and clear statement of powerlessness against pornography that you may encounter, while \"do not give up your life\" reminds Aretha \"She Has No Way\" in structure and belief. His self-titled work \"Just Begun to Grow\" successfully described another career advancement for him; the contributions of Wyclef, Narada Michael Walden and Stevie J made the role of Campbell's emotions. It is a partnership with Marc Kinchen, especially the “alternative” situation that makes Tevin Campbell a voice and a superpower that can be ignored in this new millennium. Yes, youth stars have grown in public.","overall":4,"summary":"Tevin Finds Another Way","unixReviewTime":970444800,"reviewTime":"10 2, 2000"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"You can have your Elvis Presley, but for my time and money, you can't beat James Brown for stage presence, charisma, tight grooves, and cultural impact. His influence in popular music is beyond calculation, and this songs deliver a rush of energy unlike anything you will never hear. Diehards will probably steer towards this box set, but this single disc collection is just as good. You know the hits, and if you don't, you've definitely heard their samples: \"Sex Machine,\" \"The Payback,\" \"Get Up Offa That Thing\" and so forth. Serious jams and real instruments with the Godfather himself grunting and screaming throughout. John Lennon once said, \"Before Elvis, there was nothing.\" Well, even visionaries like Lennon can be wrong. Along with Chuck Berry and Little Richard, James Brown is one of the key founding fathers of popular music, and this disc is a great display of this many hits. Priceless and timeless.","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"You can have your Elvis, but as far as my time and money is concerned, you can’t beat James Brown in terms of stage performance, charm, consistent rhythm and cultural influences. His influence on popular music is immeasurable, and this song conveys a force you can never hear. The diehards can turn to this box set, but this single disk collection is fine. You know these famous songs. If you don't know, you'll need to hear their samples: \"Sex Machine\", \"Replace\", \"Wake Up\" and so on. Great jam and real musical instruments, the godfather himself bathed and shouted throughout the process. John Lennon once said: \"Before Elvis, there was nothing.\" Yes, even an industry like Lennon would be wrong. Along with Chuck Berry and young Richard, James Brown is one of the main founders of popular music, and this record shows a good beat. Price and eternity.","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"You can take your Elvis Presley, but in my time and money, you can't beat James Brown for the stage presence, the passion, the strong drains and the cultural influences. Its impact on popular music is beyond recounting, and these songs, unlike anything else, bring a lot of energy that you will never hear. Diehards may refer to this setbox, but this single disk collection is fine. You know the songs, and if you don't know them, you've probably heard of their patterns: \"sex machine,\" \"pay,\" \"get out of this thing,\" and so on. Serious traffic and real bells and Godfather himself are moaning and screaming everywhere. John Lennon once said, \"Before Elvis, there was nothing.\" Yes, even caretakers like Lenin would be wrong. Along with Chuck Berry and Little Richard, James Brown is one of the founders of popular music, and this disc is a beautiful display of many of this songs. Precious and timeless.","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":3660,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000001DUP","reviewerName":"The Groove","helpful":[4,5],"reviewText":"You can have Elvis Presley, but with my time and money, you can’t beat James Brown for being on stage, for attraction, for long cuts, and for cultural impact. The impact of popular music is beyond calculation, these songs provide instant energy that is different from anything else you can hear. Diehards will probably head to this box, but this disc collection alone is great. You know the beats, and if you’re not sure, you’ve heard my things: “Sex Machine,” “Payment,” “Get Out of It” and so on. The intense congestion and the real devices in the Father of the Cave itself were all moans and screams. John Lennon once said, \"Before Elvis, nothing.\" Thus, even theorems like Lennon’s can be erroneous. Along with Chuck Berry and Little Richard, James Brown was one of the founding fathers of popular music, and this disc is a great introduction to many of these hits. Price and black of time.","overall":5,"summary":"Don't Ask Why or How...Just Get This Disc!","unixReviewTime":1031875200,"reviewTime":"09 13, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"Tupac Shakur's fourth album \"Me against the World\" released in one thousand, nine hundred and ninety-five, is arguably the fullest wrap album never. When Hiphops most loved, most controversial legendary MC dropped this album, the showcased to the world more than never this intellectual and poetic ability. The media liked to portray him as a violent thug, but in truth it was never like that, first and foremost Tupac was a musician with a message for the world, who never held back from displaying emotion whether it be danger, love, sadness etc, even if it meant the was going to be hated for it. Every track on this album is nice, some of my favourites (among many) include \"Me against the World\", \"So Many Tears\" and \"Dear Mama\" one of the realest tracks Pac never wrote. Pac seemed to know that death was in this cards, and the gives indication of this on some of the tracks, throughout this album. Music on this album covers many different topics and many different emotions, as one person wrote \"If there's a facet of the human experience that's left uncovered on this release, I can't think of it\". It want just Pacs lyrics, beats, versatility for production that made him the best, it was that real raw emotion, the put into this works that made him Hiphops most loved. \"Me against the World\" is one of the best albums of the ninety, essential for anyone who loves good music.","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"Topak Shakur's fourth album \"Me in the World\" was released in one thousand, nine hundred and ninety-five, apparently the complete album so far. While ship shops became very popular, the most controversial MC who released the album showed this part of poetry and poetry to the world more than never. The media portrayed him as a violent criminal, but in reality it never was, for the first time Topak was a musician with a universal message, who did not shy away from expressing emotions whether it was danger, love for sadness. ۔ , Even if it means the hated it. All the songs on this album are great, some of my favourites (among many) including \"I'm Against The World\", \"So Many Tears\" and \"Sweet Mama\" are the most creative tracks PAC has never written. ۔ The PAC knew death was on those cards, and it hinted at it on other tracks throughout the album. The music on this album covers many different themes and many different emotions, as one person wrote, \"I don't think there is any aspect of the human experience in this experience.\" Only the Pacs' melody, the beat, the search for the flexibility of the production that made it to the forefront, were the real raw emotions, the involvement in this work made it the most popular hiphop. \"Me in the World\" is one of the top nine albums, for anyone who loves good music.","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"Tupac Shakur’s fourth album “Me against the World” released in a thousand, nine hundred and ninety-five years, is arguably the most complete album never recorded. When Hiphops became popular, the most controversial MC legend threw out this album, introducing it to the world more than in terms of intellectual ability and poetry. The media wanted to show him that the was a violent thief, but in fact the did not, first of all Tupac was a musician with a message to the world, that the was not restrained from expressing feelings if it was a danger , love, sadness etc. , even if it means hatred. Every track on this album is good, some of my favourite (many) include “Me Against the World”, “Too Young” and “Dear Mama” which is one of them The most interesting traces not yet written by Pac. Pac seems to know that death is on these cards, and this guide gives you some clues, of this entire album. The music on this album covers many different topics and many different emotions, as one writer wrote “If there’s one face of human experience that in’t covered by this release, I can’t imagine it”. He just likes Pacs songs, beats, production mixes that are the best for him, the’s the real raw emotion, putting on these works that made Hiphops famous. “Me against the World” is one of the best albums of the nineties, a must for anyone who loves great music.","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":22510,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003AEK","reviewerName":"Done","helpful":[39,43],"reviewText":"Tupac Shakur's fourth album \"Me against the World\" was released in one thousand, nine hundred and ninety-five. When popular ship-hop and controversial fight MC released the album, it showed the world this intellectual and poetry. The media often portrays him as a violent man, but this is not the case. First, Tupac is a musician who conveys a message to the world. expressing this feelings, the very same thing means that people will hate him for it. All the songs on this album are very good, some of my favourite jones (most of them) include \"I Fight the World\", \"Many Tears\" and \"Dear Mother.\" real tracks. Pac seems to know that death is on this card, and is shown in other ways throughout the album. The music on this album covers a variety of themes and many different emotions. It only takes Pacs' words, the beat, and the unique performance of the product to make him the best the can be. \"I'm Fighting the World\" is one of the best albums of the ninety's and is important for people who love good music.","overall":5,"summary":"2pac- Me against the World","unixReviewTime":1038268800,"reviewTime":"11 26, 2002"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"The kat below me is absolutely right. To say that Pac is a joke is just immature. If Pac is such a joke, than why has the sold three times more records than BIG? Biggie has sold fifteen million worldwide, and Pac has sold seventy-five million. That's a six:one ratio there, little kid, do the death you freaking sixth grader. Anyways, forgetting about record sales, yeah, biggie did't write this rhymes down, but the did memorize them just like any other wrapper does. That's impressive, but that does't make him a better MC. And Biggie made three albums in a span of three years. twoPac made ten albums in a span of five. Talk about impressive. Beside's, who's going to listen to somebody who writes a three sentence review anyways? Especially someone who wrote- BIG is betta. top of dome. yeah. forever. Come on you wimp, step rya game up, buddy. I own all of Biggie's and twopac's albums, so I know what I'm talking about. No doubt, Biggie is one of the best wrappers never, probably in the top two. But to say Pac is a joke is in fact a joke. Just check the average stars for this cd, five. Go spend your time doing something else, cause you're a big joke. Biggie And Tupac Forever.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"The cat below me is completely correct. It’s hard to say that Pac is a funny thing. If Pac is funny, why is the sales record three times bigger than BIG? Biggie has sold fifteen million copies worldwide, and Pac has sold seventy-five million copies. This is six: one measure, a child, is a sixth grader. After all, you forgot about record sales Yes, Biggie did't write these rhymes, but the remembered them as any other wrap paper. This is amazing, but it does't make him a better MC. Biggie produced three albums in three years. TwoPac has released ten albums on five albums. Tan was impressed. Besides, who can listen to someone write a three-sentence report? Especially those who wrote BIG were fighting fish. Dome surface. Oh yeah. forever. Come on, coward, raise the game of rya, man. I have all of Biggie’s albums and twopac, so I know what I’m talking about. There is no doubt that Biggie will always be one of the biggest threats, perhaps in the top two. But that Pac is funny is a funny thing. Just look at the average of the stars on this CD, five stars. Take time to do other things, because you are so funny. Biggie and Tupac forever.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"The cat under me is really nice. To say that PAC is a joke is not an adult. If PAC is a joke, why did the record sell three times more than the bag? Buggy sold مل fifteen million worldwide, while PAC sold seventy-five seventy-five million. Here are six: One step there, little kid, commits your sixth grade death. Anyway, the forgets about record sales, yes, the elders did't write these poems, but they could't memorize it like any other threat. This is amazing, but it does't make it a better MC. And Buggy made three albums in three years. Two Pack has released ten albums in five seasons. Talk about feedback. Also, who would listen to someone write a three-sentence review anyway? Especially the person who wrote - BIG BETA. Yes above the dome. It is eternal. You have Vamp, Action Raya game up, friends. I have all the buggy albums and topics, so I know who I'm talking about. There is no doubt that Begi is one of the best threats never, perhaps in the first two. But to say that PAC is a joke is actually a joke. Just watch the regular stars of this CD, five. Go spend your time doing something else, because it's a big joke. Biggie and Tupac forever.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":2787,"reviewerID":"A2KPVBROV25H5B","asin":"B00000163G","reviewerName":"Wise Guy","helpful":[4,7],"reviewText":"Kat under me was absolutely right. The joke can be said Pac is an adult. If Pac is a joke, why is more than one seller selling it three times more than BIG? Biggie sold fifteen million worldwide, and Pac sold seventy -five million. That’s six: there’s a proportion, baby, make the death you hate in the sixth grade. However, I forgot to sell the record, yes, biggie did’t write these songs, but the memorized them like recorders. That’s surprising, but that does’t make him a better MC. And Biggie has made three albums in three years. twoPac has produced ten albums out of five. Talk about something surprising. Besides, who listens to someone who writes three sentences anyway? Especially for a writer - BIG betta. the top of the dome. yes forever Come wimp, step up rya, friend. I have all the Biggie and twopac albums, so I know what I’m saying. Undoubtedly, Biggie is one of the best recorders never, probably the top two But to say that the Pac is a joke is really a joke. Just check out the average stars of this cd, five. Go in your time to do something else, because you are a big joke. Biggie And Tupac Forever.","overall":5,"summary":"Nobody listens to kids!","unixReviewTime":1144800000,"reviewTime":"04 12, 2006"}
{"orig_index":40366,"reviewerID":"A82PQ187QVHXV","asin":"B000075A20","reviewerName":"A. Guzman \"souljaman\"","helpful":[4,8],"reviewText":"u must be out of your mind to like this pc.d. , if your a true snoop dog fan of know that this pc.d. is nothing like snoop, the has totally changed from gangsta to seventy's pimp, him not feeling this pc.d. at all, it is one of the worst if not the worst pc.d. i have never bought. peace out.","overall":1,"summary":"ur wack if u like this","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":40366,"reviewerID":"A82PQ187QVHXV","asin":"B000075A20","reviewerName":"A. Guzman \"souljaman\"","helpful":[4,8],"reviewText":"You have to get out of your mind to love this PCD. , If your real spy dog lover knows it's pc.d. There is no such thing as a snoop, Jehovah has completely changed from a gangster to a seventy pimp, the does't listen to this PCD. Of course, this is one of the worst pc.d I would never buy. Peace","overall":1,"summary":"ur wack if u like this","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":40366,"reviewerID":"A82PQ187QVHXV","asin":"B000075A20","reviewerName":"A. Guzman \"souljaman\"","helpful":[4,8],"reviewText":"you have to get lost in your mind to love the pc.d. , if you are a true dog fan know the pc.d. it’s not like hiding, the Lord completely changed the gangsta and became seventy years old, without feeling pc.d. somehow, this is the worst if not pc.d. I did’t buy a peace of mind to get out.","overall":1,"summary":"ur wack if u like this","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":40366,"reviewerID":"A82PQ187QVHXV","asin":"B000075A20","reviewerName":"A. Guzman \"souljaman\"","helpful":[4,8],"reviewText":"You will have to go crazy to love this pc.d. If you are right the sleeping dog knows this pc.d. He did't feel like a needle at all. He had completely changed into a gangster and a spy in the seventy's. He did't feel that way. In short, although it is not the worst pc.d, it is also one of the worst. I did't buy it. Go out in peace.","overall":1,"summary":"ur wack if u like this","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"When I first wrote this review, I was just glad to have the CD and I was trying to be the first to review it. Now that I've listened to it for a while, I must say, I am disgusted with this CD. The songs all are truly forgettable with the weakest lyrics I have never heard on a CD. Even though Wes Borland learned how to play guitar, it was't enough. Fred Durst just wants money and hopes to get girls out of it. He does't care about this fans! It seems like Sam Rivers has all but stopped trying on the bass, because the now plays weak itunes with one for two chords unlike the fast paced complicated lines from Three Dollar Bill Y'all$. John Otto is a bad a drummer now as the was before, for maybe even worse. DJ Lethal seems to have expanded this horizons, but please, tell me something I haven't heard. Every song has about twenty shares in it, because Fred Durst thinks it impresses girls when the cusses overexcessively but it sure makes me bored. All of this cussing is careless, especially in the song Hot Dog, where the adds that word we all know in every long, and shows more than writer's block, but a bit more than a little stupidity also. But it's not all bad on this CD. Several of the songs show attempted enthusiasm in music style, but they all fail. My Generation and Livin' It Up try very hard to impress people, but they fail lyrically. The only good song on this CD is Take A Look Around from the M:I-two soundtrack but maybe that had something to do with the fact that Fred did't write the lyrics! Please, don't even bother. I'm disgusted, and to make up for it, I've been listening to Three Dollar Bill Y'all$ even more. There karen't any really flame songs on that CD, and none of the lyrics show as much sellout as Limp Bizkit. And I take back what I said about Eminem selling out more. I was wrong.","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"The first time I wrote this review, I was just happy that I had the CD and I was trying to be the first to review it. Now that I’ve been listening for a while, I’ll say, I’m sorry about this CD. All the songs can make you forget the worst words I’ve heard on the CD. Although Wes Borland learned how to play the guitar, it was’t enough. Fred Durst just wants money and hopes to get the girls out. He does’t care about these fans! Sam Rivers seems to have stopped trying on the bus, because now the’s playing weak iTunes with one for two chords that are no different from the fast lines from Three Dollar Bill Y’all $. John Otto is a worse drummer now than never, perhaps even worse. DJ Lethal seems to have expanded this perspective, but please, tell me something I haven’t heard. Each song has about twenty shares, because Fred Durst thinks it’s great for girls when the weight is too high but it’s definitely boring for me. It’s all reckless, especially the song Hot Dog, where it adds a word we all know, and shows more than the author’s restraint, but quite a bit of nonsense as well. But not all CDs are bad. Some of the songs show a zealous attempt at musical style, but they all fail. My generation and Livin ’It Up try to attract people, but they fail sadly. The only good song on this CD is the See M: I-two soundtrack but that may be related to the fact that Fred did’t write the songs! Please, don't even bother. I hate it, and to make up for it, I listen to Bill Y’all’s Three Dollars and more. There are no songs burning on that CD, and none of the songs show how to sell like Limp Bizkit. And I repeat what I said about selling Eminem a lot. I was wrong.","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"When I first wrote this review, I was happy with just one CD and was trying to be the first to review it. Now that I've heard it for a while, I must say, I'm tired of this CD. All the songs are really memorable with weak characters that I have never heard on a CD. Even if Wes Burland learned to play the guitar, it was't enough. Fred Dorst only wants money and hopes to get the girls out of it. He does't care about these fans! Sam Reverse seems to have given up trying to be the boss, as it now plays weak iTunes with one of two options, as opposed to the three-dollar Bill Y'all's high-speed lines. John Otto is as bad a drummer as the was before, maybe even worse. DJ Little seems to have come up with the idea, but please tell me something I haven't heard. Each song has about twenty-two shares, because Fred Dorst thinks it's weird for girls when the drums go off too much, but it really bothers me. All of these arguments are irrelevant, especially in the song Hot Dog, where you add the word we all know, and it shows more than just the author's block, but a little more nonsense. But not everything is bad on this CD. Many songs have tried to create a passion for the style of music, but all have failed. My generation and Livin 'It Up are trying hard to impress people, but they are failing to using. The only entertaining song on this CD is a look from almost the most pm: two soundtracks but maybe it was related to Fred that the is not writing a song himself! Please, don't worry at all. I was bored, and to do so, I heard a three dollar bill Y'all $ even more. There are no flashy songs on this CD, nor commercial lyrics like Lamp Buzzet. And I brought back what I said about Eminem for a big sale. I was wrong.","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":33460,"reviewerID":"A1OYBF92TASIWN","asin":"B00004XOWM","reviewerName":"Mike Brennan","helpful":[0,0],"reviewText":"When I first wrote this review, I was very happy to have this CD, and I tried to be the first to review it. Now I've been listening to it for a while, I have to say that I hate this CD. These songs are some of the weakest things I've never heard on CD, and they are never forgotten. Although Wes Borland learned to play the guitar, it was not enough. Fred Durst just wants money and wants to let the girls throw it away. He does't care about this fan! It seems that Sam Rivers has almost stopped trying to bass, because the iTunes currently playing is very weak, with one-to-chord chords, which differ from the fast-paced heavy lines \"Three Bill Bills\". John Otto is just as bad as the drum now, perhaps even worse. DJ Lethal seems to amplify this, but please tell me something I haven't heard. Each song has about twenty copies, because Fred Durst thinks that the worst curse will never come on a girl, but it will surely confuse me. All of these vows are irrelevant, especially in the song \"Hot Dog\", where the words we all know are included in each song, and not only show the author's barriers, but not just a little folly. But there is nothing wrong with this CD. Many songs showed interest in trying on a musical style, but all failed. My generation and Livin 'It Up have worked very hard to show people, but they have failed to speak. The only good song on this CD is Take a Look at the first soundtrack of M: The second, but it probably has something to do with Fred who does't write lyrics! Please do not interrupt. I’m annoyed, and to do this, I’ve been listening more to the three-dollar bill. There are no popular songs on this CD, and there are no commercials like Limp Bizkit. I recap what I said about Eminem’s further marketing. I'm wrong.","overall":2,"summary":"Now let me tell you what I REALLY think...","unixReviewTime":972518400,"reviewTime":"10 26, 2000"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"dre makes a good appearance on this one which makes all happy. no more beef. cube does't slouch on this one.","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"Fear takes a good look at what makes everyone happy. No more beef. The cube does not stick to it.","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"dre looks great in this one which makes everyone happy. maybe later. cubes and liqueur on top.","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":31541,"reviewerID":"AVV5JGLBZERCM","asin":"B00004I9SP","reviewerName":"Alex Dionisio","helpful":[0,0],"reviewText":"dre looks good in this place that has delighted everyone. There is no more beef. The cube is not fast in this.","overall":3,"summary":"the sequel to the vol 1 war disc","unixReviewTime":1355529600,"reviewTime":"12 15, 2012"}
{"orig_index":58656,"reviewerID":"A3LMJYKMC25QZ4","asin":"B002OTLEG4","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"I love Christmas songs and I like Big Daddy Weave. So of course I like this song. It is a very nice Christmas song","overall":3,"summary":"Good Song","unixReviewTime":1389052800,"reviewTime":"01 7, 2014"}
{"orig_index":58656,"reviewerID":"A3LMJYKMC25QZ4","asin":"B002OTLEG4","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"I love Christmas songs and I love Big Daddy Weave. So of course I like this song. Very beautiful Christmas song","overall":3,"summary":"Good Song","unixReviewTime":1389052800,"reviewTime":"01 7, 2014"}
{"orig_index":58656,"reviewerID":"A3LMJYKMC25QZ4","asin":"B002OTLEG4","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"I love Christmas songs and I love Big Daddy Wave. So i like this song A very cute Christmas song.","overall":3,"summary":"Good Song","unixReviewTime":1389052800,"reviewTime":"01 7, 2014"}
{"orig_index":58656,"reviewerID":"A3LMJYKMC25QZ4","asin":"B002OTLEG4","reviewerName":"Amazon Customer","helpful":[0,0],"reviewText":"I love Christmas carols, and I love Big Daddy Weave. Yes I love this song. A very sweet Christmas song","overall":3,"summary":"Good Song","unixReviewTime":1389052800,"reviewTime":"01 7, 2014"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"Stevie Wonder in the sixty's was Pretty Good but you don't feel the full Voltage of this Genius. The Material Here is Promising but You get the feeling that the best was yet to come. Still it is Worthy just seeing an Artist that Has Been Bad for So Long. Stevie WOnder Has Been a Genius&a Legend for so Long you forget how Long the has been Around.","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"The sixtys Stevie Wonder is good, but you can’t feel the full power of this technique. The things there are promising, but you will feel that the best is yet to come. It’s still worth seeing a broken artist for a long time. Stevie WOnder has been a genius and legend for a long time, the forgets how far it has come.","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"Stevie Wonder in the sixties was great but you don’t feel the full Voltage of this genius. The article there is Promise but you get the feeling that the best is yet to come. It’s still worth looking at a long -term factor. Stevie WOnder is Genius & Legend a long time you forgot while the was there.","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":3274,"reviewerID":"A9Q28YTLYREO7","asin":"B000001AEL","reviewerName":"mistermaxxx08 \"mistermaxxx08\"","helpful":[2,9],"reviewText":"Steve Wonder was great in this sixties but you don't feel the full voltage of this genius. The content there is promising but you get the feeling that there is still a long way to go. Still, it's worth noting that the artist has been bad for so long. Steve Wonder has been a genius and legend for a long time. Forget how long we have been around.","overall":3,"summary":"Pretty Good but you feel something Greater awaits","unixReviewTime":954374400,"reviewTime":"03 30, 2000"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"Way back in the seventh grade, (egads, I'm dating myself. ) I had already heard Aerosmith's first album and thought it was wok. After all, I was a seventies heavy metal kid, and both \"Mama Kin\" and \"Dream On\" had become staples on the local anything goes FM station. (Remember those?) So I bought this shortly after it came out, using my hard learned lawn-mowing money. I think I've owned this album in some format for another never since. It was a huge leap forward from that first album. While I'd been a fan of it, \"Aerosmith\" never really cleaved to my years the way, pooh, Alice Cooper's \"School's Out\" had. But \"Get Your Wings,\" from the moment \"Same Old Song and Dance\" shattered my eardrums, served notice. Aerosmith had figured out where they wanted to go. Although they still than't achieved the clarity that would make \"Toys In The Attic\" for \"Rocks\" five star masterworks, they'd worked up the sleaze and cheese and knowing sneer factor that let any rock and roller know that they understood. Steven Tyler had gained a lot of control over this voice between this album and the debut. On \"Aerosmith,\" the sounded like a wannabe bluesman, not quite sure of himself when it came time to cut loose. On \"Get Your Wings,\" the gained authority. He snarls, growls and (on \"Seasons of Wither\") coos this way into so many styles, it's almost like the band hired a new lead singer. Same with Joe Perry and Brad Whitford, who really took a firm grasp of the guitar sound. Listen to the way \"S. O. S.\" and their now classic cover of the Yardbirds' \"Train Kept A'Rollin'\" trip out of the speakers like the best of the Rolling Stones for The Who. That Aerosmith had also figured out how to work a horn section into the songs (\"Pandora's Box\" and \"Same Old Song and Dance\") without making it sound like a sweetener was a compliment to the band's sense of self. Dirty, raunchy and rolling like an earthquake, \"Get Your Wings\" was the sound of a band about to take flight. As the precursor to two of the seventies' best hard rock albums, it's a landmark for Aerosmith. You need to have all three.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"Going back to seventh grade, (egads, I’m dating.) I had heard Aerosmith’s first album and I thought it was wok. After all, I was a heavy metal kid in my seventies, both “Mama Kin” and “Dream On” being the foundation of everything locally happening on FM. (Remember those?) So I bought it shortly after it came out, using my hard-earned money to cut grass. I think I’ve had this album in the form of another one never since. It was a huge success from the first album. As a fan, Aerosmith was’t really connected to my years, like, there was Alice Cooper’s “School’s Out”. But “Get Your Wings,” from the moment “Both Songs and Dance” broke my year, and gave notice. The aerosmith knew where they wanted to go. Although they haven’t yet reached the proof that “Rocks” of Toys In the Attic can make five professional stars, they worked with grief and cheese and discovered a tricky point that allows rock and roll to know that they understand. Steven Tyler had a lot of power in this sound between this album and for the first time. In “Aerosmith,” the looks like a bluesman wannabe, unsure of himself when it comes time to cut. In “Get Your Shoulder,” strength is achieved. She screams, screams and (in “Seasons of Wither”) goes through so many forms, the band seems to have accepted a new lead singer. They were like Joe Perry and Brad Whitford, who really caught the sound of the guitar. Hear the “SOS” approach and their current Yardbirds standard ‘Train Keept A’Rollin’ out of the best -selling Rolling Stones for The Who. Aerosmith also figured out how the corner portion of the songs (“Pandora’s Box” and “Same Old Song and Dance”) would work without making the dessert seem safe for the band’s attention. Dirty, soft and often self -like an earthquake, “Get Your Shoulder” sounds like a moving group. As a prologue to two of the best rock solid albums of the seventies, it is a symbol of Aerosmith. You need to have all three.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"Back in seventh grade, (man, I'm in love with you.) I heard the first album of Aerosmith and thought it was good. After all, I was a heavy-metal kid in the one thousand, nine hundred and seventy's. Both \"Mama Kin\" and \"Dream On\" have become anchors for any local radio station. (Do you remember those?) So I bought it shortly after it came out, using my hard-earned money. I think I already have this album in a certain format, and I haven't had it since. Compared to the first album, this is a big jump forward. Although I've always been a fan of that, \"Aerosmith\" is never really as attractive in my page as Alice Cooper's \"School Out\". However, from the moment the \"old song and dance\" broke my eardrum, \"spreading the wings\" attracted people's attention. Aerosmith has found where they want to go. Although they have not yet mastered the part of making five-star \"rock and roll\" \"toys in the Attic\", they have solved the dirt and cheese and the familiar humour so that any rock musician knows they understand. Between this album and debut album, Steven Taylor gained a lot of control over this sound. In \"Aerosmith\", this sounds like someone who wants to be a blues player, not sure about him when it's time to relax. In \"Get Your Wings\", you get the authorization. He roared, roared, and (in \"Seasons of Wither\") made many soundtracks this way, as if the band had hired a new lead singer. Likewise with Joe Perry and Brad Whitford, they certainly understand the sound of the guitar. Listen to \"SOS\" and their old Yardbirds \"Train A'Rollin\" cover, as the best in The Who's Rolling Stones. Aerosmith has also figured out a way to add some of the lyrics to the songs (\"Pandora's Box\" and \"Old Songs and Dances\") without making it sound as sweet, which compliments the band's self-confidence. Dirt, laziness and an earthquake, \"Get your wings\" is the sound of a band coming out. As a pioneer of the two best albums of the seventys, it’s a highlight for Aerosmith. You must belong to all three.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":10037,"reviewerID":"A3KJ6JAZPH382D","asin":"B0000029AN","reviewerName":"Tim Brough \"author and music buff\"","helpful":[0,0],"reviewText":"In seventh grade, (for example, I'm crazy.) I had just heard of Aerosmith's first album and thought it was a weekend. After all, I was a very active child, and \"Mama Qin\" and \"Dream On\" both became the staple food of everything that went on the FM station. (Do you remember that?) So I bought it right after I came out, using my hard-earned money to mow the lawn. I think I brought this album in another format from there. It was great to move on from this debut album. When I was a fan of it, \"Aerosmith\" never stopped with my page, Pooh, Alice Cooper's \"Out of School\". But \"Get your wings,\" from the moment \"the same old song and dance\" broke my years, a notice was sent. Aerosmith knew where the wanted to go. Although the had not yet been told that the would be the \"toy in the attack\" of the five-star \"Rocks\" part, the used a slice and cheese and the knew something funny that would make any rock and Roller knew the understood. Steven Tyler got a lot of power from this sound between this album and the original. In \"Aerosmith\", the looked like a wannabe bluesman, not sure when it was time to leave. \"Get your wings,\" the authority said. He screams, screams, and (in \"Weisser's Seasons\") the says it in many ways, it's like a band hiring a new lead artist. Like Perry and Brad Whitford, they do not fully understand the sound of the guitar. Listen to the high quality covers of the \"SOS\" track and the Yard Birds \"Train Capt. A Rolling\" tour that come out of the speakers as the best holes rolling stones. In fact, Aerosmith also understood that the horn part in the songs (\"Pandora's Box\" and \"Old Old Song and Dance\") was a compliment to the band's self-confidence without making a joke sound. Dirty, noisy, and rocking like an earthquake, \"Get Your Wings\" was the voice of the group on the plane. As a prelude to two of the seven hard rock albums, this is a notable feature of Aerosmith. You need three things.","overall":4,"summary":"Not your same old song and dance","unixReviewTime":1078617600,"reviewTime":"03 7, 2004"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"This album got bad criticism when it came out but honestly I think it's very underrated, sometimes Drag-On's lyrics karen't on point (but mostly they are) but then there is great production from Swizz Beatz to enjoy. DMX sounds like the could be X's little brother trained by him, and comparing it to DMX's own catalogue this sounds mostly like And Then There was X if one was to compare, with all kind of songs partyanthems, to darker songs and just streetraps. The best songs are probably the jones that goes in a specific theme throughout the whole song, brought in a story almost like small movies: Snipe Out, Groundhog's Day and of course the song about this father LIFE GOES ON. Only One song that I usually skip Ladies two thousand but the rest is pretty straight. Overall a good album and most songs are actually the opposite of Htwenty = Fire. Songratings:one. Parental Advisory (Intro) --two. Opposite Of HtwoO - (featuring Jadakiss) - seven\/ten (gangsta)three. Spit These Bars - (featuring Swizz Beatz) - nine\/ten (Dragon's own Ruff Ryders Anthem)four. Groundhog's Day ten\/ten (laid back story track)five. High Roller - (skit) --six. N***as D** four Me - (featuring DMX) -- nine\/ten (classic DMX singing hook with great beat)seven. Here We Go - (featuring Eve) - seven\/ten (partyanthem)eight. Snipe Out -- ten\/ten (story about an assassin)nine. Click, Click, Clack - (featuring P Killer Trackz) -- ten\/ten (gangsta)ten. Get It Right - (featuring DMX) -- ten\/ten (amazing beat , good)eleven. Shaquita - (skit, featuring Capone) --twelve. Ladies two thousand -- three\/ten (boring song)thirteen. Drag's S*** - (featuring Styles) -- weight\/ten (good)fourteen. Ready For War - (featuring The Lox) -- seven\/ten (streetrap)fifteen. Hot D*** - (skit) --sixteen. Way Life Is, The - (featuring Case) -- ten\/ten (song about death and struggling)seventeen. Pop It - (featuring Icepick Jay) -- weight\/ten (another good ruffryderpartyanthem)eighteen. What's It All About - (featuring Parle') -- six\/ten (kind of corny hook, and beat in't too good)nineteen. Life Goes On - (bonus track) -- ten\/ten (great track that you can't help but to love if your heart in't cold as nice, about this father)Overall judgment: weight\/ten","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"This album received a lot of criticism when it came out but honestly I think it’s very hard, sometimes Drag-On songs karen’t pointy (but often they are) but then there’s a great production of Swizz Beatz to enjoy. DMX seems to be X’s younger brother who trained him, comparing DMX to this own book it seems like most But There’s X if one compares, to all sorts of songs, up to dark songs and on the streets only. The best songs are probably jones going on a specific theme during the whole song, which is brought to a close story like the little movie: Snipe Out, Groundhog Day and of course the song about daddy LIFE WILL GO. Just one song that I usually skip over two thousand women but the rest is beautiful. Overall a great album and most of the songs are against Htwenty = Fire. Songs to using: one. Parent Intro-two. Opposite twoO - (with Jadakiss) - seven \/ ten (gangsta) three. Tufi Bars - (with Swizz Beatz) - nineteen (Dragon’s Ruff Ryders Anthem) four. Groundhog Day ten \/ ten (story postponed) five. Roller Sare - (skit) -six. N *** as D ** four I - (with DMX) - nine \/ ten (a kind of DMX song with a big beat) seven. Here We Are - (with Eve) - Eighteen (partyanthem) weight. Snipe Out - ten \/ ten (story about a murderer) nine. Click, Click, Clack - (with P Killer Trackz) - ten \/ ten (gangsta) ten. Improve - (with DMX) - ten \/ ten (amazing beat, good) eleven. Shaquita - (skit, with Capone) -Twelas. Ladies and gentlemen - thirteen \/ thirteen (lazy song) thirteen. Drag's S *** - (with shapes) - weight \/ ten (good) fourteen. Ready for War - (with The Lox) - seventeen (street) fifteen. Hot D *** - (skit) -lix. Way Life Is, The - (with Case) - seventeen (song about death and struggle) seventeen. Pop It - (with Icepick Jay) - weight (ten beautiful ruffryderpartyanthem) eighteen. What About - (with Parle ') - sixteen (a kind of corny hook, not very good) nineteen. Life goes on - (track bonus) - ten \/ ten (a great way you can't stop loving if your heart in't cold, about this dad) General rule: weight \/ ten","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"The album received a lot of criticism when it came out but honestly I don't think it's very stressful, sometimes the drag on songs karen't at the point (but most of the time they are) but then the Suez Beats A good product that you can enjoy. DMX thinks it could be X's younger brother who trained it, and compare it to the DMX catalog. K party songs, black songs and only on the streets. The best songs are probably the Jones that goes on a specific theme throughout the song, which is brought to the forefront of almost every movie: Snap Out, Groundhog Day and even the song about him became a life continuum. In just one song, I usually leave two thousand women, but one straight. Overall a great album and a lot of songs are actually against Htwenty = Fire. Songs: One. Parental Advice (Introduction) - Two. Opposite HtwoO - (Containing Jadakis) - Seven \/ Ten (Gangsta) Three. Sprinkle Bar - (Featuring Suez Beats) - Nine \/ Ten (Drag Rough Riders Anthem) Four. Five Groundhog's Ten \/ Ten (back story track) Five. Top roller - (skit) - six. N *** as D ** for me - (DMX feature) - nine \/ ten (classic DMX singing hook with a strong beat) seven. Here we go (including Eve) - seven \/ ten (party) weight. Snapout - Ten \/ Ten (Killer Story) Nine. Click, Click, Clock - (Contains P Killer Tracks) - Ten \/ Ten (Gangsta) Ten. Fix it - (including DMX) - ten \/ ten (amazing rhythm, good) eleven. Shakita - (containing skates, caps) - twelve. Two thousand women - three \/ ten (boring song) thirteen. Drag S *** - (containing style) - Weight \/ Ten (good) Fourteen. Ready for battle - (consisting of locus) - seven \/ ten (streettrap) fifteen. Hot D *** - (Skit) - Sixteen. Way Life As, The - (Featuring Case) - Ten \/ Ten (Song About Death and Struggle) Seventeen. Pop it up - (Featuring Ispac J) - Weight \/ Ten (Another Good Refrendary Parthianum) Eighteen. It's about you Life goes on - (bonus track) - ten \/ ten (a good track you can't help but with your dad if you're not cool) Total decision: Weight \/ ten","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":31427,"reviewerID":"ARFRYHIVP6VPP","asin":"B00004C4PG","reviewerName":"D3strukchun","helpful":[1,1],"reviewText":"The album was criticized as soon as it was released, but honestly, I think it was undermined. Sometimes Drag-On's words karen't appropriate (but in most cases), but then Swizz Beatz's amazing work deserves to be enjoyed. DMX might sound like X's younger brother trained. Compared to the DMX catalog itself, it sounds like And Then There X. Compare street wrap. The most famous song is Jones, who carries a certain theme throughout the song. He brings the story almost like a little film: Sniper, Groundhog Day, and yet the song LIFE CONTINUES with this dad. There is only one song I always skip \"Ladies two thousand\", but some are simple. Overall a good album, most of the songs are true against Htwenty = Fire. Song rating: one. Parental Tips (Introduction) -Two. Against HtwoO- (shown by Jadakiss) - Seven \/ ten (gangster) three. Remove these bars- (shown by Swizz Beatz) - Nine \/ ten (his own Ruff Ryders Anthem) Four. Tenth \/ Tenth Day (Place of Fun) is the fifth. Top Roller- (Diagram) -Six. N *** as D ** It- (Installed on DMX) - Nine \/ Ten (Classic DMX hook hook and big beat) Seven. Let's go- (shown with Eve) - seven \/ ten (group song) Eight. Snipe Out-Ten \/ Ten (story about the killer) Nine. Click, Click, Break- (shown with P P Killer Trackz) - Ten \/ ten (gangster) ten. Well done- (shown with DMX) - ten \/ ten (amazing beat, okay) eleven. Shaqueta- (short play, depicting Capone) -XII. Two thousand three thousand \/ ten (annoying song) thirteen. Drag SS *** Ready for War- (Including Lox) - Seven \/ Ten (Street Catcher). Hot D *** - (Small) - Eighteen. Way Life Is, The- (case featured) -ten \/ ten (songs about death and struggle) seventeen. Pop It- (shown with Icepick Jay) - weight \/ ten (another common ruffryderparty national anthem) eighteen. What It's About - (shown by Parle) -Six \/ Ten (old, not good) Nineteen. Life goes on- (bonus track) - Ten \/ ten (If your heart is not cold, you can't help but love the father's great track) Perfect judgment: Difficulty \/ ten","overall":4,"summary":"Opposite of H20 = Fire","unixReviewTime":1130112000,"reviewTime":"10 24, 2005"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"It seems like nowadays when an artist is featured on the VHone You Oughta Know tour, they eventually turn into the next big thing (ask James Blunt for Sara Bareilles). But one person that did't really garner any more popularity is Alison Sudol, better known as A Fine Frenzy -- which is also ironic considering her andSara's respective albums were released on the same day. And Alison's black of popularity is unfortunate because her album One Cell in the Sea is damn good. Alison seems to score best with heartbreak tracks, as shown by \"Ashes and Wine\" and especially the single \"Almost Lover\". But introspective tracks score as well, like \"Whisper\", \"The Minnow & the Trout\" (the song that inspired the album's title) and the metaphoric \"Rangers\". And \"Borrowed Time\" closes the album nicely. Although half a star had to be taken off for \"Liar, Liar\", One Cell in the Sea proves that Alison deserves a lot more attention than she gets because this musical experience is indeed a fine frenzy. It's not too late to pick it up. Anthony Rupert","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"Faced with these days when part is shown on the VHone You Oughta Know tour, they finally turn to the next big thing (ask James Blunt Sara Bareilles). But one person who really did’t get any popular was Alison Sudol, better known as Fine Frenzy - which is also funny considering that they and Sara’s albums were released on the same day. The famous black Alison is unlucky because her album One Cell in the Sea is bad. Alison seems to have the best score on heart traces, as shown in “Dust and Wine” and especially in an “Almost Love”. But there are also points to the clues, such as “Whisper”, “The Minnow & the Trout” (the song inspired the album’s title) and the metaphorical “Rangers”. And the “Time Taken” that closes the door nicely. Although the half star was removed from “Liar, Liar”, One Unit in the Sea proved that Alison deserves more attention than she gets because the experience of this music is really crazy. It’s never too late to pick it up. Anthony Rupert","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"It sounds like the days when the artist was featured on the VHone You Oughta Know Tour, they finally became the next big thing (ask James Blunt about Sarah Braille). But the only person who did't get much popularity was Alison Sodol, better known as A Fine Enmaz - a contradiction between her and Sarah's albums being released on the same day. And Alison's black popularity is unfortunate because her album One Cell in DC is so cute. Allison seems to benefit the most from the spain tracks, as shown by \"Ashes and Wine\" and especially the single \"Almost Lover\". But speculation also includes points, such as \"Whisper\", \"The Manno and Trout\" (a song that influenced the album title) and \"Ranger\" for the match. And \"Borrow Time\" closes the album well. Although half the star of \"Liar, Liar\" had to be taken, a cell in the ocean proves that Allison deserves more attention than that because this sound of music is quite a mystery. It did't take long to pick it up. Anthony Rupert.","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":54681,"reviewerID":"A200C7YQJ45LRR","asin":"B000QCK99E","reviewerName":"Anthony Rupert \"shut up, Shut Up, SHUT UP!!!\"","helpful":[0,0],"reviewText":"Now it seems that when an artist appears on a VHone tour you should know, they will eventually become the next big thing (ask James Blunt about Sarah Bareilles). But someone who did’t get the likes of Alison Sudol, better known as Finezy Fine — the shocking note considering that she and Sara’s albums were released on the same day. And Alison's black popularity is unfortunate, because she's left in the sea of her album so beautiful. Alison seems to have high scores on heart transactions, such as \"Ash and wine\", especially one \"Almost Lover\". But note-breaking songs have also been found, such as \"Whisper\", \"Minnow and Trout\" (a song that promoted the title of album) and \"Ranger\". \"Borrowed Time\" ended the album well. Although the \"liar, liar\" has had to take half a star, the cell at sea confirmed that Alison received more attention than she did, because this musical experience is truly a fun festival. It is not too late to pick it up. Anthony Rupert","overall":4,"summary":"4-1\/2 stars -- Dive in!","unixReviewTime":1213747200,"reviewTime":"06 18, 2008"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"I saw Nora in concert last year and she played a lot the new songs from this CD that night. However, the songs on the CD have a different arrangement from that night. Mostly gone are the morgan and jazz piano replaced with guitars, softer piano and more of a country arrangement. You can tell that most of the songs were written on guitar. Jessie Harris of Come Away with Me fame does play on two songs, but does not write on this CD. Lee Alexander who wrote a lot of songs from the last CD writes most of the tracks along with Nora. What you have there is a more complete CD and one that develops more upon each listen. This CD has no obvious singles, so the beauty is to be discovered. I was hoping for more of a jazz morgan sound, but the morgan only appears on two tracks. I would describe this, still like the first CD, as jazzy nocturnal sounding with some country western overtones. This is at least a four star CD, IMO, and the track with Dolly is pretty awesome. Do yourself a favor and buy this. You will be surprised how different in concert the songs will be played. It will be nice to compare them. Besides, this is another classic offering from someone that I hope is around a long time.","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"I saw Nora at a concert last year and she played many new songs from this CD that night. However, the songs on the CD are different from the night setting. Morgan and pianos have disappeared, replaced by guitars, soft piano and more country music. You can see that most of the songs are written on guitar. Jessie Harris came with me with two songs, but they are not written on this CD. Alexander Lee, who wrote many songs on the final CD, wrote most of the songs with Nora. What you have is a complete CD, and each time you listen to it it will be further developed. Not only is this clear on this CD, so the beauty is always there to be found. I hope to hear more of Jazz Morgan's voice, but Morgan only appears on two tracks. I would describe it as, as the first CD, the night sound of jazz and another Western country. This is at least a four-star CD, IMO, and Dolly's tracks are good. Be kind and buy this thing. You will be amazed at how different the songs are at the concert. It would be good to compare them. Plus, this is someone else's product, and I hope it will last a long time.","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"I saw Nora at a concert last year and she performed a lot of new songs on the CD that night. However, the songs on the CD had a different style that night. Most mosaic and jazz pianos have been replaced by guitars, soft pianos and much more in the country setting. You could tell that most of the songs are written on guitar. The popular Jessie Harris has played two songs Come Away with Me, but I’m not writing this CD. Lee Alexander, who wrote many songs on this latest CD, mostly sang with Nora. What you have is a complete CD and one that grows with each listening. This CD in’t just white, so the beauty should be noted. I was expecting more than one jazz morgan sound, but morgan appears on only two tracks. I will describe it, as the initial CD, as the jazzy night jazzy sound in some western countries. It’s at least a four star CD, IMO, and the road with Dolly was great. Do it for yourself and please this one. You will be amazed at how different musical dramas are. Good to compare. Besides, this is another common offer from someone I expect to be close for a long time.","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":45048,"reviewerID":"A1T7IB6NJ3KZFB","asin":"B00018D44U","reviewerName":"J. Miller \"a_tech_guy\"","helpful":[6,6],"reviewText":"I saw Nora at a concert last year and she played a lot of new songs on this CD that night. However, the songs on this CD have a different layout tonight. Basically, Morgan and jazz pianos have been replaced by guitars, soft pianos and most of the world order. You can see that many songs were written on guitar. Harris, like Kim O'Malley's Fame, played two songs, but she does't write on the CD. Lee Alexander, who wrote many songs from the last CD, writes most of the songs with Nora. All that is available is a complete CD and one that starts with every listener. There is no clear lyrics in this CD, so beauty will be available. I was expecting a lot of jazz Morgan sound, but Morgan only appears on two tracks. I can explain it, I'm still like the first CD, like the sound of a jazzy night with other western countries. It's at least a four star CD, IMO, and the track with Dolly is great. Do yourself a favor and buy it. You will be amazed at how the songs in the concert will be played differently. It would be good to compare them. Also, this is another old donation from someone else that I hope has been around for a long time.","overall":4,"summary":"Gets better with each listen.","unixReviewTime":1077494400,"reviewTime":"02 23, 2004"}
{"orig_index":40038,"reviewerID":"A3JM25YVLEE318","asin":"B00006RAKP","reviewerName":"Penny Thoughtful","helpful":[0,0],"reviewText":"I like this compilation of Elton John because it's got a lot of material from different eras, including some songs I had not heard before (I am not a huge Elton John fan, just a sort of borderline one) as well as some favourites. Of course, I do find a lot of this songs to be much too long (like I'm in the car only half paying attention and wait is the STILL talking about hold me closer Tony Danza, get the head alice on the highway)? (yes, I know the real words, but sometimes the's hard to understand.)","overall":4,"summary":"Nice compilation of Elton John","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":40038,"reviewerID":"A3JM25YVLEE318","asin":"B00006RAKP","reviewerName":"Penny Thoughtful","helpful":[0,0],"reviewText":"I love this Elton John collection because it’s fun at different times, including songs I’ve never heard before. I'm waiting I'm still talking I'm closer to Tony Danza, make head of the highway)? (Yes, I know the exact words, but sometimes it's hard to understand.)","overall":4,"summary":"Nice compilation of Elton John","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":40038,"reviewerID":"A3JM25YVLEE318","asin":"B00006RAKP","reviewerName":"Penny Thoughtful","helpful":[0,0],"reviewText":"I love this Elton John compilation because it has so many elements of different tours, including some songs I've never heard before (I'm not a big fan of Elton John, any kind of borderline ) And other favourites. Well, I found that a lot of these songs are too long (like I'm in the car just paying attention to the part and still waiting for what you're talking about so I call Tony Denza Keep it close to, keep your head forward. (Yes, I know the real words, but sometimes it's hard to understand.)","overall":4,"summary":"Nice compilation of Elton John","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":40038,"reviewerID":"A3JM25YVLEE318","asin":"B00006RAKP","reviewerName":"Penny Thoughtful","helpful":[0,0],"reviewText":"I love this Elton John collection because it has so many different things from different eras, including some songs I've never heard before (I'm not a fan of Elton John's lanka, just a channel song) and other things I love. Yeah Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me, Looks like Al that sounds pretty crap to me. (Yes, I know the truth, but sometimes it's hard to understand.)","overall":4,"summary":"Nice compilation of Elton John","unixReviewTime":1366243200,"reviewTime":"04 18, 2013"}
{"orig_index":37396,"reviewerID":"A2NDCWFYNI0PRX","asin":"B00005TPKC","reviewerName":"Beketaten \"beketaten\"","helpful":[1,1],"reviewText":"This album has its great moments, its thoughtful moments, and its drearily depressive jones, but overall, i think is a good buy, and it gives one lot to think about when in the right mood. it does seem, after listening to it, like she's expelled some important things to her out from under her \"rug\", (tho it can get a bit hard to take, at times. ). it shows that calais just keeps growing and growing artistically, without closing herself for her \"bite\". she takes her listeners along with her in this process and it's something that i think will never fail to keep people's interest. StAnDoUt TrAcKz(in no particular order):-Narcissus-twenty-one Things I Want In A Lover-So Unsexy-Precious Illusions-Utopia (though this song is my among my least favourites of the standouts. slightly trite, yet sweet).","overall":4,"summary":"Something To Think About...","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":37396,"reviewerID":"A2NDCWFYNI0PRX","asin":"B00005TPKC","reviewerName":"Beketaten \"beketaten\"","helpful":[1,1],"reviewText":"This album has her fun moments, her thinking moments, and her stressful Jones, but overall, I think it's a good purchase, and it gives a person a lot to think about. When in the right mood. It seems that after listening to him, the seems to have removed some of the things that were important to him under this \"rugby\", (sometimes it will be difficult to take it.) That is, the blacks continued to progress artistically, without confining themselves to their \"cutting.\" He walks with this audience in the process and I don't think it will never fail to keep people interested. StAnDoUt TrAcKz (no special order): - Narcissus Twenty-One Things I Want Lover-So Unsexy-Precious Illusions-Utopia (although this song is one of my favourite little stops. Slowly, but fun).","overall":4,"summary":"Something To Think About...","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":37396,"reviewerID":"A2NDCWFYNI0PRX","asin":"B00005TPKC","reviewerName":"Beketaten \"beketaten\"","helpful":[1,1],"reviewText":"This album has great moments, moments of thought, and jones — the dreams the dreams of, but overall, I think it’s a good buy, and it gives another thoughtful momentum. think if the mood is right. the seemed, after listening, as if the had removed some of the essentials from under this \"carpet\", (though it was hard to pick up, sometimes.). it shows that Calais is still growing and growing artistically, without associating “bite”. takes the listener through this process and it’s something I don’t think will fail to protect people’s interests. StAnDoUt TrAcKz (without special sequence):-Narcissus-Twenty-One Things I Want From Lover-So Unsexy-Precious Illusions-Utopia (although this song is one of my favourite stands. Still sweet) .","overall":4,"summary":"Something To Think About...","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":37396,"reviewerID":"A2NDCWFYNI0PRX","asin":"B00005TPKC","reviewerName":"Beketaten \"beketaten\"","helpful":[1,1],"reviewText":"This album has its moments of fun, time of deliberate make-up, its exhausting Jones, but overall, I think it's the right choice, when the situation is right, it gives a lot of thought. After listening, it seems that some important things have been removed from this \"carpet\" (although sometimes unacceptable.). It shows that Calais is constantly evolving and growing technically, and has not closed down because of its \"biting\". In the program, the went with this audience. I think this is something that will always keep people interested. StAnDoUt TrAcKz (listed without any specific order): - Narcissus - twenty-one of the things I want in a love-unsexy-fantasy-Utopia (although this song is one of my favourite songs.","overall":4,"summary":"Something To Think About...","unixReviewTime":1043798400,"reviewTime":"01 29, 2003"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"The guys from the Emerald City score a hit with, \"Running for Cover,\" a soft singer\/songwriter folk music style of song. For instrumentals, you get basic acoustic guitar, bass and drums. The profound lyrics in the song, however, steal the show. These guys were good enough to be featured on National Public Radio, so if you're in doubt, check them out. After all, you can download this song for free (April two thousand and thirteen), like I did. You'll be hearing more from this duo.","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"The boys from Emerald City won the \"Running for Cover\", a young singer \/ songwriter with a musical style. With instruments, you can find basic acoustic guitar, bass and drums. However, the deep lyrics in this song catch the light. These people are good enough to be featured on National Community Radio, so if you have any questions, please check them out. After all, you can download this free song like me (April two thousand and thirteen). You will hear more from this couple.","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"The Emerald City boys did something high with a soft-spoken artist \/ songwriter, \"Running for Cover.\" For musical instruments, you get a basic sound guitar, bass and drums. However, the deep melodies in this song steal the show. These guys were ready to be featured on National Public Radio, so check them out if in doubt. However, you can download this song for free (April two, two thousand and thirteen), as I did. You will hear more from this pair.","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":63654,"reviewerID":"AM4X3TREMZTQZ","asin":"B00BEFKCYE","reviewerName":"Peggy A","helpful":[0,0],"reviewText":"The men from the Emerald City beat the drums, “Running for Cover,” to soft songs \/ folk songs. Equipped, you get the basic sound of guitar, bus and drum. The song lyrics, however, steal the show. These people are good enough to be featured on National Public Radio, so if in doubt, check it out. After all, you can download this song for free (April two thousand and thirteen), as I did. You will hear more about these two men.","overall":4,"summary":"Seattle Indy Music Scene Scores Again","unixReviewTime":1365379200,"reviewTime":"04 8, 2013"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"Amy Winehouse appeared at the Brecon Jazz festival a few years ago and sadly although I was there that year, I missed the chance to see her live. With this new album she moves the goalposts from Jazz to Soul and what a triumph it is. If you like Motown for sixty's soul with an occasional hint of do-wop you are going to love this. Brassy (literally - Sax, Trumpet etc) sometimes funky, with Amy's expressive vocals singing her own earthy lyrics this is a classic album and undoubtably the best I have heard this year, regardless of style. The single 'Rehab' and 'Me & Mr Jones' are the stand-out tracks for me. As previous reviewers have noted it is short (thirty-five mind) so I have docked it a star, but there is no filler on this album and I recommend it strongly.","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"Amy Winehouse appeared at the Breakin Jazz Festival a few years ago, and sadly, although I was there this year, I missed the opportunity to see it live. With this new album you move from jazz to soul to goal and how it wins. If you love Motown with an action bug with sixty spirits that will make you love it. Bracey (literally - sex, trumpet, etc.) is sometimes entertaining, singing her songs around the world with Amy's vocal voices. This is the oldest and arguably the best album I've heard this year. Apart from 'Rehab' and 'Me and Mr. Jones' are the most inspiring songs for me. As previous reviewers have noticed it is short (thirty five brains) so I marked it, but there is nothing in this album and I highly recommend it.","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"Amy Winehouse appeared at the Brecon Jazz party a few years ago and sadly even though I was there that year, I missed the chance to see her alive. On this new album the moves on goals from Jazz to Soul and what a success it was. If you like Motown with sixty people with an occasional do you’ll love this one. Brassy (literally - Sax, Trumpet etc.) is entertaining at times, with Amy’s expressive voice singing her own sandy songs it’s a classic album and without a doubt the best I’ve heard this year, in style however . ‘Rehab’ and ‘Me & Mr Jones’ were the only paths for me. As previous reviewers mentioned it was short (thirty five pounds) so I tied a star, but there is nothing to fill this album that I recommend.","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":54091,"reviewerID":"A13IKSGDYNBNQS","asin":"B000N2G3RY","reviewerName":"S J Buck","helpful":[5,6],"reviewText":"Amy Winehouse appeared at the Brecon Jazz Festival a few years ago, unfortunately, even though I was there that year, I missed the opportunity to watch her. With this new album, the has moved this post from jazz to soul music. If you love the spirit of Motown sixty, there are occasional make-ups, you will love this. Brassy (literally means saxophone, trumpet, etc. Singles \"Rehab\" and \"Me & Mr Jones\" are my best. As shown by previous testers, it's very short (thirty-five hearts), so I added a star in it, but this album has no fillings and I highly recommend it.","overall":4,"summary":"Marvellous","unixReviewTime":1190419200,"reviewTime":"09 22, 2007"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"Moment of Forever is the most solid album by Willie Nelson in many many years. This is on par with some of Johnny Cash's late work with Rick Rubin and provides more evidence that some artists just get better with page. Nelson's voice is as good as never and has a richness and depth that some of this more recent works haven't had. His pairing with new-country idol, Kenny Chesney seems to have breathed new life into Willie. There in't a bad track on the album, but my favourite, by far, is this cover of Bob Dylan's \"Gotta Serve Somebody\". As a Dylan fanatic I must admit that Willie's version is better than Dylan's version. So soulful and heartfelt. Willie also strikes gold with this cover of \"Gravedigger\". The video for this song is just flawless. Also notable are the title track, \"Moment of Forever\" and \"I'm Alive\". And Nelson is indeed Alive on this collection. Even The Bob Song, which I initially hated has grown on me and I certainly appreciate the silliness of the song. Overall, I think this has to go down with Nelson classics like Red-Headed Stranger and Phases and Stages as this best work to date. We can only hope that Nelson continues with this momentum and keeps making such great records.","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"Moment by Moment is Willie Nelson's strongest album in many years. This is in line with Johnny Cash's latest work with Ricky Rubin and provides further evidence that some artists are better than Page. Nelson's voice is more beautiful than never and some of this latest work is good and deep. His pairing with the God of the New World, Kenny Chesney, has inspired a new life for Willie. There are no bad tracks on the album, but the one thing I like the most so far is Bob Gillan's cover \"Gota Servo Samobedi\". As an extremist Dylan, I have to admit that Willie's version is better than Dylan's. It has a soul and it comes from the heart. Willie hits gold with this \"gravedigger\" cover. The video for this song is flawless. The titles of the track are \"Forever of the Moment\" and \"I'm Alive\". And Nelson is really alive in this collection. Even Bob Song, whom I used to hate, grew up in me and I enjoyed the folly of this song. Overall, I think it should go down with Nelson's old stages like Redhead Stranger and Stages and Stages because it works so far better. We can only hope that Nelson will continue to do so and keep up such good records.","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"Eternal Minute is Willie Nelson's strongest album over the years. This compares with other works that Johnny Cash and Rick Rubin later used, and provides further evidence that other artists have become better at using paper. Nelson’s voice is better than never, and it has richness and depth that blacks some recent works. His partner and new national icon, Kenny Chesney, seems to be breathing new life into Willie. There’s nothing wrong with the album, but my favourite thing so far is the cover of “Gotta Serve Somebody” by Bob Dylan. As a Dylan fan, I have to admit that Willie's style is better than Dylan's version. She is loving and passionate. Willie won with the \"Gravedigger\" cover. The video for this song is flawless. Another thing to note is the songs titled \"Moment of Forever\" and \"I'm Alive\". Nelson lives in this series. Even the Bob Song, which I hated at first, has grown in me, and I certainly appreciate the folly of this song. Overall, I think this is the best work so far with Nelson’s classic works such as “The Red-haired Stranger” and “Stage and Stage”. We just hope that Nelson will continue to maintain this momentum and continue to make those outstanding records.","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":55453,"reviewerID":"AW2FMLQJL38DY","asin":"B000ZK0CKI","reviewerName":"David Shadd \"david_shadd\"","helpful":[1,2],"reviewText":"Moment of Forever is Willie Nelson’s hardest album in years. It’s similar to some of Johnny Cash’s accomplishments that Rick Rubin has done well and provides further evidence that some artists are great on the page. Nelson’s voice is the same as never and the has a richness and depth that some of these jobs have not received recently. Like the idol of a new country, Kenny Chesney seems to breathe new life into Willie. There’s no bad track on the album, but my favourite, so far, is the cover of Bob Dylan’s “Gotta Serve Some”. As a Dylan fan I have to admit that Willie’s type is better than Dylan’s. So sincere and sincere. Willie also hit gold on the “Gravedigger” cover. The video for this song is flawless. It’s also worth mentioning the title tracks, “Moment of Forever” and “I’m Alive”. Nelson really depends on this collection. Even Bob’s song, which I used to hate, has grown on me, and I certainly appreciate the antics of the song. Overall, I think it should go down with Nelson classics like Alien-Head Aliens and Faces and Stages as this best work to date. We just hope Nelson continues this momentum and continues to make great records.","overall":5,"summary":"Willie Nelson Forever","unixReviewTime":1226102400,"reviewTime":"11 8, 2008"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"Upon first listen, it seems cacophonous - scraps of songs mixed together with joyful abandon but with very little for the listener to hang onto. This takes a little deep listening. It took me a good three spins before \"Witch Cults\" clicked. I played it quiet. I played it cloud. I cleaned the kitchen to it. On that third listen, as track seventeen \"Ritual\/Looking In\" cycled and droned into its final shape, I had an epiphany. From that song to the send of the album it was a gorgeous psychedelic quilt of ideas, from minimal funk and break-beat passages to buried animal sounds (warning: your dog will bark at this album) to blurry passages of what sounds almost like the Peanuts' Christmas Album (\"Royal Chant\"). It's magic. And yes, it's the kind of magic that makes reindeer fly - psychedelic magic. Primal and messy and hungry, capable of crystalline beauty as much as yawning black mouths of anonymous menace. Normally, I'm a proponent of linear experience. Listen to albums start to finish, the way the artists intended them. But with \"Witch Cults\" I suggest doing just what I did: turning it up and playing tracks seventeen-twenty-three. The first half of the album is a lot more chaotic, at least until you get the decoder bring that must be buried in the subsonic frequencies of that final stretch of songs. Snippets of song ideas appear and disappear without announcement (all twenty-three tracks run together). Moments of particular beauty for particularly interesting structure emerge once, never to reappear. It's a little crazy, as if deliberately designed to make you feel slightly off-center. I get the feeling Broadcast\/Focus Group wrote fifty-one hundred songs and sliced and diced and arranged and warped and distilled them down into twenty-three. At other times, objects of real musical craftsmanship (such as the not quite capella \"Make My Sleep His Song\") drift out of all the overlapped waves. I don't think my listening method should be the ONLY way to listen to it, obviously, but it helped me get over the hump with this one. now I listen to it start to finish. It has been suggested by more than one reviewer that this sort of music could only have been produced under the influence. I, on the other hand, have a hard time believing something that takes me on such an intricate, dense and layered journey could be the random outcomes of mind alteration. To me, this feels like more of a drug-free trip, the kind that just uses the natural chemicals already in your body and engages the primitive part of your brain. Then again, song titles like \"Drug Party\" suggest I might be wrong. Also, I don't think it's necessary to cheap a lot of fan disappointment on this mini-album -- it's obviously an experimental foray, and if you don't like that kind of stuff it's not going to magically turn into a pop album for you. No need to punish the band for following their muse.\". Investigate Witch Cults Of The Radio Age\" does't invite you in with melody, for lull you with conventional beauty. It pushes you. I admit, I like the weird stuff. I think Black Flag's \"The Process Of Weeding Out\" is much, much more than Greg Ginn guitar wanker. I even kinda like \"Lumpy Gravy\" and \"Metal Machine Music\" . really! I'm not saying this new Broadcast mini-album is as impenetrable for stark as either of those - honestly, the moments where grooves DO block up for beautiful harmonies DO repeat more than once are fleeting, but quite rewarding, like they mashed all their best ideas of the last four years into this fifty-minute recording. If they're willing to traverse this sort of territory for this mini-album, I'm excited to see these methods applied to less abstract song frameworks. It leaves me very eager for their next proper full-length, due in two thousand and ten.","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"The first time you listen to it, it seems weird-a chorus of songs along with a fun but very small departure that the listener sticks out. It takes an in -depth hearing. It took me three beautiful circles before clicking on “Magic Scholar”. I played quietly. I played in the cloud. I cleaned the kitchen. At that third hearing, following seventeen “Ritual \/ Working In” bike rides toward the final form, I had an epiphany. From that song to the shipping of the album it was a very nice and thoughtful idea, from a little fun and break-up quotes to buried animal sounds (warning: your dog will be fierce in this album) up to The intricacies of what sounds like Owning a Christmas Album (\"Royal Chant\"). It's magic. Yes, this is the kind of magic that makes a flying pilot - the magic of the mind. Introduction and confusion and hunger, capable of beauty of crystals as they yawn in the black mouth of unknown danger. Usually, I am a direct experienced advocate. Listen to albums that are about to send, just as the artists intend. But in “The Challenges of Magic” I suggest doing just what I could: to roll and play twenty -three and twenty -three songs. The first part of the album is a lot of excitement, at least until you see the decoder that needs to be buried in the table below for the last of those songs. Fragments of song ideas appear and disappear without notice (all twenty -three paths come together). Moments of unique beauty with an interesting structure appear simultaneously, without reappearing. It’s a little crazy, as if it was deliberately designed to make you feel pretty out of place. I think the Broadcast \/ Focus Group has written fifty hundred and one hundred songs that have been cut, edited and distorted and divided into twenty-three. At other times, elements of true musical part (such as the smaller “Make My Sleeping Song Her”) appear from all the overlapping waves. I don’t think my listening system is the ONLY way I listen, obviously, but it helped me get past it. now I’m listening and it’s starting to send. More than one reviewer has suggested that this type of music is only possible through influence. For me, on the other hand, it’s hard for me to believe that something that will take me on this hectic, dense and layered journey could be the inevitable result of brain change. To me, this seems like a journey without drugs, the only kind of use of natural chemicals in your body focused on the front part of your brain. Again, the names of songs like “Drug Party” suggest I may be wrong. Also, I don’t think it’s necessary to break the frustration of a lot of fans with this little album - it’s obviously a test trend, and if you don’t like things like this it won’t suddenly be a pop album for to you. There is no need to punish the group that follows their museum. It pushes you. I admit, I love amazing things. I think the Black Flag of the “Exit Process” is bigger than the Greg Ginn rocket-gun. I even like “Lumpy Gravy” and “Metal Machine”. Really! I’m not saying that this new Broadcast album is unbearable in the same way as they are - honestly, the moments that cut -outs prevent good self -alignment from NOT being repeated more than once. is something that is happening, but they are very rewarding, because they broke all the best ideas in the last four years when recorded in fifty minutes. If they’re willing to across this kind of ground for this little album, I’m happy to see these techniques applied to the structure of intangible songs. I leave much interest in their appropriate length, which fits twelve thousand.","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"When you hear it for the first time, it's fun - the pieces of the song combine with the fun throw but are rare for the listener. It requires a little deep listening. I had three beautiful twists before clicking on \"Dine Cultus\". I played it quietly. I played Cloud. I cleaned the kitchen with it. On this third hearing, as the seventeenth track \"Formal \/ In Search\" got on a bicycle and was finally run, I had a strange experience. From this song to the posting of the album was a huge psychological idea, from the little funk and the rustling of animal voices (\"royal slogan\") to this magic. And yes, that's the kind of magic that makes a polar deer fly - psychedelic magic. Basic and annoying and hungry, this Crystal Line knows beauty as much as running the black clips of an unknown danger. In general, I support the line experience. Listen to albums that are just about to run out, just as the artists intended. But with \"Dine Cultus\" I suggest that I do what I have done: open it and play seventeen and twenty-three songs. The first half of the album is very chaotic, at least until you get the decoder delivery buried in the subsonic frequency of this last song information. Captions of song ideas appear and disappear without announcement (all twenty-three tracks running simultaneously). The times of a particular beauty of a very interesting building appear once, never again. It's a little crazy, as if it's deliberately designed to make you feel out of place. It seems to me that the Broadcast \/ Focus group wrote five hundred and fifty songs that were cut and composed and edited and found and are-added. Sometimes, real-life musical instruments (like Capella Nan - \"Sing My Sleep\") are swept away by the waves. I don't think my way of listening should be the only way to listen to it, obviously, but it has helped me overcome the hump. Now I hear it begin to fade. It has been suggested by multiple reviewers that this type of music can only be performed under the influence. On the other hand, I find it hard to believe that what takes me on this complex, crowded and linear journey could be the unintended consequences of mind-altering change. To me, it sounds like a drug-free journey, the kind that only uses the natural chemicals in your body and affects the first part of your brain. Then, the title of songs like \"Drug Party\" suggests that I might be wrong. Also, I don't think it's necessary to cheapen the big embarrassment of the fans on this mini album - obviously it's an honor to test it, and if you don't like that kind of thing, it does't turn magic into a pop album. Will do . You don't have to punish this group for following its museum. . It's strong. I admit, I like weird stuff. I think Black Flag's \"Process of Wedding Out\" is more than Greg Jin's Guitar Wanker. I even look like \"Lampy Gravy\" and \"Metal Machine Music\". Really! I'm not saying this new broadcast mini album in't as accessible as it used to be - honestly, the time when the drain stops good coordination often ends, but it's a huge reward, because They all consider the best of the last four years in this fifty minute recording. If you're willing to cut this kind of field in this mini-album, I'm glad to see these techniques used in non-stop singing genres. It makes me long for the next full length, two thousand and ten.","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":58587,"reviewerID":"A3SAOHS7JGYTSJ","asin":"B002NACYFE","reviewerName":"Stargrazer \"the lost mixtape of my life\"","helpful":[2,3],"reviewText":"When I first heard it, it seemed like the songs were very much spread out and mixed together, leaving with joy, but the audience was almost insane. This requires intense listening. Before clicking on \"witch churches\", I turned three times. I play very quietly. I played cloud. I cleaned the kitchen. In the third listener, when the seventeenth song “Culture \/ View” was played on a loop and eventually took its place, I had an epiphany. From this song to the introduction of the album, it's a fantastic psychedelic whole, from the smallest funk and crack to the sounds of hidden animals (warning: your dog will bark at this album) to sound almost like a Peanut Christmas album (\"Royal Poem\"). This is magic. Yes, this kind of magic makes reindeer fly-psychedelic magic. The first, rotten and hungry, with a crystal-like beauty, like a black mouth of unnamed threat. Usually, I am a longtime sponsor. Listen to the album from beginning to send, as the artists want. But for the sake of \"Witch Cults\", I suggest I do what I did: open up and play seventeen-twenty-three tracks. The first half of the album is a mess, at least before you get the decoder, it should be buried at the lowest speed of the last song. Pieces of song ideas appear and disappear without notice (all twenty-three songs go together). The particularly momentous moment of an interesting structure appears once, and will never reappear. It's a bit confusing, it seems like it was deliberately designed to make you feel out of place in the middle. I feel like the radio \/ focus group wrote five thousand, one hundred songs, then cut, cut, adjusted, twisted and adjusted twenty-three songs. Sometimes, real musical part objects (such as \"I Made My Sleep His Song\" which is not entirely capella) float all over the waves. Obviously, I don’t think my listening style might be the only way to listen, but it has helped me overcome this problem. Now I listen from beginning to send. More than one critic has said that this type of music can only be produced under the influence. On the other hand, it is hard for me to believe that what has allowed me to go on such a difficult, robust journey and assignment can be the unintended consequence of a change of mind. To me, this feels more like a non-toxic journey. This journey uses only the natural chemicals that are already in your body and allows the first area of your brain to function. Also, the title of a song like “group of drugs” suggests that I may be wrong. Additionally, I don't think it's necessary to minimize the frustration of many fans on this day - this is clearly an attempt. There is no need to punish the band for following their lines. \"Investigate Witchcraft in Radio Age\" will not invite you with a song, but with traditional beauty to bring you down. It's a push. I admit, I like the weird stuff. I think the black flag \"Out Grow Program\" is more than Greg Ginn's guitar. I even liked the genre \"Lumpy Gravy\" and \"Metal Machine Music\". really! I'm not saying the new disc-recorder can't pass like all of them - honestly, the grooves hinder good harmony. Repeat times more than one are short, but rewarding, like them. The best ideas for the past four years are in this fifty-minute record. If they are willing to go through this section on this small album, I am very happy to see these techniques used in a vague musical framework. This makes me really look forward to their next length, which ends in two thousand and ten.","overall":5,"summary":"possibly the psychedelic record of the decade!","unixReviewTime":1260057600,"reviewTime":"12 6, 2009"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"MWY is an excellent, and haunting group. Aaron Weiss's delivery and lyrics are so unique. This is a great alternative rock band, and each cd gets better and better. I like the flow of the concept throughout the album. The whole \"spiders\" theme is eerie, and artsy, but in a nice creative way.","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"MWY is a very good team, very challenging. The delivery of Aaron Weiss and the songs is very special. It’s a great group of different rocks, and each CD gets better and better. I love the flow of the whole concept of the album. The whole “spider” theme is monstrous, artistic, but in a great creative style.","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"MWY is a beautiful and memorable team. Aaron Weiss's explanation and words are very different. This is another great rock music group, every CD is getting better and better. I love the flow of concepts throughout the album. The whole \"Spider\" theme is stunning and full of artistic flavor, but very creative.","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":53250,"reviewerID":"AK6PDYF58Z7WL","asin":"B000HT36LE","reviewerName":"Benjamin Moureau-lucadamo \"Ben\"","helpful":[0,0],"reviewText":"MWY is a very good, and annoying team. Aaron Weiss's presentation with different melodies. It's a different rock band, and each CD gets better and better. I love the flow of ideas throughout the album. The whole \"Spider\" team is great, and creative, but in a great creative way.","overall":5,"summary":"Spiders...","unixReviewTime":1167868800,"reviewTime":"01 4, 2007"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Octave was released in one thousand, nine hundred and seventy-eight, six Years after their last album, Seventh Sojourn, although all the members had been involved in alternative individual for joint recordings in the interim. For me Octave is a definite winner all the way through, and apart from the original ten tracks, five more are added from live concerts. Some are faster paced like Steppin' In A Slide Zone and I'll Be Level With You, while others like I'm Your Man and Had To Fall In Love are slow ballard. My top choices are Driftwood, One Step Into The Light and The Day We Meet Again, songs about lost love, searching for spiritual truth and longing to be reunited respectively. A year safer this release I attended two of their concerts at The Empire Pool, Wembley, London and on the second occasion joined the post concert party, the band were charm personified and very modest about what were excellent shows. Maybe they never reached these heights of musical achievement again, but that can't affect their place in the history of rock for my admiration for them as people.","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Activo released their last album, one thousand, nine hundred and sixty-eight, six years after the seventh Suzuki, although all the members were involved in someone else's joint recording. For me, Active is a clear winner in every way, and in addition to the first ten tracks, five more from live concerts have been added. Some slides are as fast as steppe and I'll level with you, while others like I'm your man and I have to fall in love are slow-moving billiards. My favourite things are driftwood, a step into the light and the day we meet again, songs about lost love, the search for spiritual truth and the desire for unity. In the safest year of this release, I went to two of their concerts at The Empire Pool in Wembley, London, and the second time I attended a post-concert party. The band was great and very polite with the best shows. She may never reach these heights of music again, but my love for her as a human being will not affect her place in rock history.","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Octave was released in one thousand, nine hundred and seventy-eight after their latest album \"Journey Seven\", although all members participated in a joint recording of other people during this time. For me, Octave has always been quite successful. In addition to the first ten tracks, there are five more live concerts. Some are fast, like Steppin 'on the Slide Show and I'll have a Level with you, while others like I'm your person and I have to fall in love are slowly moving people's songs. My preferred choice is to walk through a tree, a light step, and a date to meet again, with songs of lost love, a search for spiritual truth, and a longing to meet again. In a safe year, I attended two concerts at the Imper Pool in Wembley, London, and took part in the second concert after the concert. They probably did’t reach the heights of musical success, but this would’t affect their status in stone history because of my love for them as human beings.","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":5049,"reviewerID":"A2WNY1XO0RSC2X","asin":"B000001F6G","reviewerName":"J. Thompson","helpful":[2,2],"reviewText":"Octave released one thousand, nine hundred and seventy-eight, six years after their last album Seven Sojourn, though all the members were involved with another individual for the joint recording. For me Octave was a win for everyone, except for the original ten tracks, five more were added to the live dramas. Some are fast moving like Steppin ’In A Slide Zone and I’ll Get Involved With You, while others Your Wife and I Need to Love are a slow ballard. Top choices for me were Driftwood, A Step of Light and The Day We Meet Again, songs about lost love, the search for spiritual truth and the longing to be together again. In a safer year than this release I attended two concerts at The Empire Pool, Wembley, London and the second event to join the concert, the group was very charming and very polite about what they showed. Very good. They may not have reached a high level of success in this musical, but it may not have affected their place in rock history so I appreciate them as people.","overall":5,"summary":"After A Mid 1970s Break, Back Came The Moody Blues With Another Classic Album.","unixReviewTime":1313280000,"reviewTime":"08 14, 2011"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"Jay-Z's Blueprint is a brilliant album. Everything just clicks right on this CD. The production is hot, the lyrics are original and thoughtprovoking, and the guest appearances are few. Of course, the stand out song on the album is \"Renegades\" which features Eminem. This song could be HUGE if released as a single and could really push this albums record sales up a lot. The album has fun party songs like \"Girls, Girls, Girls\" and the now overplayed \"H. O. V. A.\", but also gets serious on tracks like \"Blueprint\" and \"Song Cry\". If you like Jay-Z you will love this CD. I done know if its this best never, but its certainly this best in the past three years. Cop this album.","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"Jay-Z's paintings are the best album. Everything is just a click on this CD. The production is hot, the words are original and thought-provoking, and there are few visible guests. Yes, the best song on the album \"Renegades\" is Eminem. If released as a single, this song could be a huge hit, and could increase the recordings of this album to a huge increase. The album features interesting party songs such as \"Girls, Girls, Girls\" and \"HOVA\", which are currently playing, but are also very important for tracks such as \"Blueprint\" and \"Song Cry\". If you like Jay-Z, you will love this CD. I know this is the best, but it has to be the best for the last three years. Shoot this album.","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"Jay-Z’s Blueprint is an amazing album. Everyone pushes this CD right. The production is hot, the words are original and insulting, the appearance of the guest is minimal. Of course, the song on the album is “Renegades” featuring Eminem. This song could be great if it was released alone and could really push the sale of these albums a lot. The door has fun party songs like “Girls, Girls, Girls” and the current “HOVA”, but it also falls in love with tracks like “Blueprint” and “Song Cry”. If you like Jay-Z you’ll love this CD. I know it’s the best never, but it’s really the best in the last three years. Copy this album.","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":36332,"reviewerID":"A12WON27MLDXNI","asin":"B00005O54Q","reviewerName":"D. Johnson \"oasisgnr\"","helpful":[7,8],"reviewText":"JZ's Blueprint is a great album. Everything just clicks on this CD. The product is warm, the songs are real and thought provoking, and the guests look minimal. The highlight of the album is definitely \"Renegades\" which includes Eminem. The song could be huge if released as one and could really put a lot of pressure on album record sales. The album has some great party songs like \"Girls, Girls, Girls\" and \"Hova\" now released, but it also has power on tracks like \"Blueprint\" and \"Song Cry\". If you like JZ, you will love this CD. I don't know if it never happened, but it's definitely the best thing from three years ago. Copy this album.","overall":5,"summary":"Eastside album of the year","unixReviewTime":1000252800,"reviewTime":"09 12, 2001"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"May be the best prodigy musical work without a doubt. Altough it continues with the \"Experience\" concept goes much further by being more mature, ambitious (extensive) and intense (more long powerful songs). Mixtures of industrial techno, latin funk and punk among others, with the assistance of acoustic and non-digital instruments like the flute and the electric guitar, with political points of view as lyrics, non only makes this work so original, complete and definitive but also consecrates Liam Howlett as one of the bosses and geniuses of this musical scene. Because of its time, many songs on this one (three, four, five, weight, nine, thirteen) are definitely classics which had offered the new techno scene get influences and great production values.\"So. I've decided to take my work back underground. to stop it from falling into the wrong hands\" (Too bad it did't happen on Fat of the land).","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"Without a doubt, it can be a masterpiece of music. Although it continues with the concept of \"experience\", it continues to be an adult, ambitious (broad) and stressed (powerful songs). A mix of industrial technology, Latin funk and punk, with the help of acoustic and non-digital instruments such as band and electric guitar, using political ideas as words, not only makes this work original, complete and clear, but it also makes Leah Liam Howlett (Liam Howlett) is regarded as one of the directors and experts of the music industry. Due to its timing, most of the songs in this song (three, four, five, weight, nine, thirteen) are certainly old-fashioned, and they provide great influence and value in the production of new technologies. \"So I decided to put my work back in the basement. It prevented me from falling into the wrong hands\" (very bad, it did't happen in fertile soil).","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"Probably the best musical work of all time without a doubt. However, it continues the concept of “Experience” very far by being more mature, ambitious (broad) and more intense (stronger songs). The combination of industrial technology, funk latin and punk among others, with the help of acoustic and non-digital instruments such as balloons and electric guitars, with political theories such as words, does not only makes this work original as a, complete and definite but also sanctifying. Liam Howlett is one of the leaders and intellectuals of this musical theatre. Since this time, many songs in this one (three, four, five, weight, nine, thirteen) are certainly the Classics that introduced the appearance of new technology to again influence and great production values. are -working underground. to prevent it from falling into the wrong hands ”(Too bad not to fall into the Fat of the earth).","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":23518,"reviewerID":"A44VNJ43O5QXU","asin":"B000003Z3W","reviewerName":"Juan Pablo Uribe","helpful":[0,0],"reviewText":"It can be a great musical work, of course. It all goes hand in hand with the concept of \"experience\" which leads to greater maturity, importance (expansion) and strength (singing with greater power). A combination of industrial techno, Latin funk and punk, with the help of non-digital musical instruments such as the flute and electric guitar, with words like political points, does not make the work original, complete and descriptive but sanctifies Liam. One of the executives and talented music event. Due to its timing, most of the songs (three, four, five, weight, nine, thirteen) are classics that provide a new techno space for effects and good production quality. \"That's why I decided to take the work back underground to prevent it from falling into the wrong hands\" (not bad at Fate of the Land).","overall":5,"summary":"As original can be...Liam is the king","unixReviewTime":945648000,"reviewTime":"12 20, 1999"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"AH, the early AEROSMITH of the seventy's is pure HEAVY ROCK MAGIC!!!!! The musicians are amazing and Steven Tyler was at this speak. While i totally love later works like PUMP and PERMANENT VACATION, the seventy's was the time for the true raw ROCK AEROSMITH!!!!! All the songs there are gems like the completely classics WALK THIS WAY and SWEET EMOTION and the fast punk title track and ROUND AND ROUND!!!!!! TOTALLY GREAT!!!!!! WELL DONE, AEROSMITH!!!!","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"AH, the old seventy AEROSMITH is pure heavy and heavy magic! The factors are amazing and Steven Tyler is in this conversation. Although I absolutely loved it later on I was working as a BOMBER and PERFORMANCE, in about seventy hours for the real ROCK AEROSMITH !!!!! All the songs there have precious stones like the old jones that completely walked ON and SWEET EMOTION and track punk fast track and ROUND AND ROUND !!!!!! HUGE TOTAL !!!!!! GOOD, AEROSMITH !!!!","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"Well, AEROSMITH in the early seventies was pure. ! ! ! ! ! The musicians are good, and Steven Tyler went to the talk. Although I love PUMP and PERMANENT VACATION and some later very effective jones, the seventys are a real time for ROCK AEROSMITH! ! ! ! ! ! All of the songs are gems, such as the whole class movement GO THIS WAY WITH THE MEMORIAL YOU MEMORY and the theme song of punk music and ROUND AND ROUND! ! ! ! ! ! it's a miracle! ! ! ! ! ! Good job, Aviation Smith! ! ! !","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":10066,"reviewerID":"A35GNQK1DC7WXU","asin":"B0000029AP","reviewerName":"FLUMINENSE","helpful":[0,0],"reviewText":"Ah, the first seventy aerospace clear rock RGK magic !!!!! The artists are amazing, and so is Steven Tyler. Although I absolutely love it later pumping and working as a permanent vacation, Seventy was a real green rock aerospace time !!!!! All the songs available have the same values as the classical songs. too big !!!!!! Good wind, Aerosmith !!!!","overall":5,"summary":"ONE OF THEIR BEST!!!!!!!!!","unixReviewTime":1385769600,"reviewTime":"11 30, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"I have three copies of this on vinyl, so, obviously I dig this record! I am a classic rock, jazz, wrap,. well, I love all genres. This particular Cd is great! The sound is awesome. like vinyl. surprisingly. I played it in my Bu-ray player, so. ? The recording has been a favourite of mine for a long time, clearly. So, if you're a fan of Miss Ross, Motown, joe entertaining live recordings. buy this! One thing, though. each you knew it was coming'. for not. either way. I am looking to purchase other Motown\/Diana Ross \/\/other cool stuff that have been remastered to Vinyl Replica quality. the liner notes, etc. So, get on that! ;)","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"I have three copies of it in Vanilla, so, obviously I'm digging this record! I am a classic rock, jazz, wrapped. Well, I like all kinds. This special CD is great! The sound is great. like vinyl. Surprisingly, I played it on my bore player. ? Recording has been my favourite for a long time, of course. So, if you're a fan of Miss Ross, Motown, who enjoys live recording. Buy it! One thing, though. Everyone knows the is coming. Not so. Of course. I'm looking forward to buying some cool Motown \/ Diana Ross \/\/ Vinyl Replica quality refurbished items. If liner notes etc, get into it! ))","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"I have three copies of it on vinyl, so, I clearly dug up this record! I am an ordinary rock, jazz, roll ,. well, i love all classes. This special CD is great! The sound is surprising. such as vinyl. wondering. I played with my Bu-ray players, so. ? My favourite recording has long been, obviously. So, if you are a fan of Miss Ross, Motown, joe live video entertainment. Buy it! One thing, though. You know everyone is coming '. because it is not. on both sides. I'm looking to buy Motown \/ Diana Ross \/\/ other cool Vinyl Replica redesign products. online texts, etc. ;)","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":3288,"reviewerID":"A1AL34PRF8SSZC","asin":"B000001AFH","reviewerName":"leevon","helpful":[3,3],"reviewText":"I have three vinyl records, obviously I dug this record! I’m a regular stone, a jersey, and a circle. Yes, I love all kinds. This special CD is great! Sounds great. Like vinyl. surprisingly. I play it on a Bu-ray player, then. Long time recording is my favourite thing. So, if you are a fan of Miss Rose, Motown, Joe Entertainment has recorded live. buy this! But one thing is certain. Everyone knows the's coming '. no. either way. I want to buy another Motown \/ Diana Ross \/\/ some cool stuff made on vinyl production flooring. Liner notes etc. Go ahead then! ;)","overall":5,"summary":"An Evening with Diana Ross\/CD Deluxe Vinyl Replica","unixReviewTime":1372204800,"reviewTime":"06 26, 2013"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"the instant i heard that MECCA AND THE SOUL BROTHER from the ALL SOULED OUT EP, i could not wait to get the album. yes, it is a bit on the long side, but when it is this good, that's okay. from beginning to send, this album makes me wanna build a time machine and just come back with a fade and a starter jacket on. pooh, and i would be seventeen again too. this makes me miss those days man. it still sounds as good as it did in 'ninety-two. what does it for me is this song right there, IF IT AIN'T ROUGH IT AIN'T RIGHT. that james brown sample is addictive. THE BASEMENT is lovely too. the BAM BAM thing. i was a nut for that!!!!! i just may go home now and put this on. later with by'all!!!!","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"As soon as I heard that MECCA AND THE BROTHER OF THE SOUL IN ALLIVING MATERIALS, I could't wait to get the album. Yeah Al that sounds pretty crap to me, Looks like BT saint for me either. From the beginning of posting, this album wants to make me a time machine and come back with the original and first coat. Oh, and I could be seventeen again. It reminds me of those days, man. Twenty-two still looks as good as never. What do you do with me? This song is there. If it's not right, it's wrong. That James Brown pattern is addictive. The foundation is also good. BAM BAM object. I was strict about it !!!!! I can now wear it and go home. After all !!!!","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"When I heard MECCA AND BROTHER OF THE SOUL ON ALL THE SOULED OUT EP, I could’t wait to get this album. Yes it is long, but when it is so beautiful it does't matter. The original post, this album made me want to build a time machine and then come back with a finished and original jacket. Oh, I'm going to be seventeen years old again. It reminds me of those days. It still sounds as good as it did in the ninety-two's. To me, the song is there, if it's not rough, it'll be fine. James Brown samples are addictive. The ground floor is also very nice. BAM BAM something. I'm crazy! ! ! ! ! I can wear it there at home now. Later on by'all !!!!","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":12893,"reviewerID":"A2491UAOEC7GP9","asin":"B000002H84","reviewerName":"Martin L. King \"zonule\"","helpful":[4,4],"reviewText":"when I heard that MAKKA AND MY BROTHER is from the ALL SOULED OUT EP, I could’t wait to get the album. yes, it’s a bit long, but if so, just fine from start to finish, this album made me want to build a time machine and come back with a hood and a starting jacket. pooh, and I'll be seventeen more years old. I miss those days man. it still looked good in the 'ninety -two. what matters to me is that this song is there, IF HE DOESN’T RETURN RIGHT. that the example of james brown is addictive. BASIC is also popular. product BAM BAM. I am the nut for that !!!!! Now I can go to my house and put it away. hindi una unit by!!","overall":5,"summary":"CLASSIC MATERIAL..................IT'S EARLY PETE ROCK AND CL SMOOTH, MAN!!!!","unixReviewTime":1169596800,"reviewTime":"01 24, 2007"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"Newly newly newly. You are such a free spirit and fearless artist. You let looser with each record you put out more than the last! Bravo!","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"A new one. You are an independent spirit and a fearless factor. It allows you more flexibility for any record you make than never before! Bravo!","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"Recently, recently. He is a free spirit as well as a fearless artist. Allows you to be free with every record except the last record! be strong!","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}
{"orig_index":52397,"reviewerID":"A2PJ0XLO1WHU7C","asin":"B000FII324","reviewerName":"Spencer","helpful":[0,0],"reviewText":"New new. She is a relaxed spirit and is not afraid. Each record is played more freely than the previous record! it's a miracle!","overall":5,"summary":"looser!","unixReviewTime":1378512000,"reviewTime":"09 7, 2013"}