{"orig_index":11790,"reviewerID":"ACNKNZSZQGZ5Q","asin":"B000002GFW","reviewerName":"John Moulis","helpful":[5,5],"reviewText":"This is the album which consolidated Cat Stevens's career as a serious singer\/songwriter. Released in late one thousand, nine hundred and seventy-one as a follow-up to the phenomenally successful Tea For the Tillerman it was a more adventurous recording which included several surprises. The Greek-language interlude in Rubylove made him a favourite in the Greek community and the semi-reggae rhythm of Changes IV and commercialism of Tuesday's Dead broadened this appeal beyond the singles-buying public who made songs like Father and Son and Peace Train number one hits. The Wind and How Can I Tell You are classic love ballads while If I Laugh was given a heavy workout on school radio stations. Peace Train became an anthem during the arms race of the early one thousand, nine hundred and eightys while Morning Has Broken was one of Stevens's most successful singles. Universal Music have done their best to restore this recording after several complaints about the original CD release. The master tape was mixed through an enhancer (as was common at the time), however the settings were overbiased resulting in a \"spitty\" type sound. While this was't a problem on the original LP it was emphasised with the higher resolution of CD. Although the remastered version has been are-equalized and the bass boosted the faults in the original recording can still be heard. Nevertheless the sheer quality of the actual music still shines through. Cat Stevens was one of the distinctive voices of the one thousand, nine hundred and seventys and remains one of the most influential singer\/songwriters of your time. Teaser and the Firecat is a musical triumph and is definitely a desert island disk.","overall":5,"summary":"A flawed masterpiece","unixReviewTime":1017705600,"reviewTime":"04 2, 2002"}
{"orig_index":2581,"reviewerID":"A2ETZ7GF5B1712","asin":"B0000013GT","reviewerName":"Chandler \"Infamous\"","helpful":[2,2],"reviewText":"Damn, seeing that Outkast had a movie and a new album out, I realized that I haven't reviewed not only one of their albums except their greatest hits album. Outkast has really represented the hometown since 'ninety-three when Vone hundred and three (ATLiens know this station) used to bump \"Player's Ball\" on the radio airwaves. And \"Southerplayaisticmuzik\" back in mid 'ninety-four help place Atlanta on the map. Two years later, they come out with their sophomore album \"ATLiens\" in Sept one thousand, nine hundred and ninety-six. This time, they flipped their whole concept around compared to their first one. While their debut was mostly about pippin and smoking weed, this one was more \"out there\". The production by Organized Noize was more laid back and smoother sounding. Their first single \"Elevators (Me & U)\" was heavily rotated back in summer of 'ninety-six, and everybody was trying to memorize that hook \"Me & U\/Your mommy and your cousin too. \" (lol). Antwan \"Big Boi\" Patton and Andre \"three thousand\" Benjamin's rhymes took a side step (not saying they did't improve, but just went a different direction with their rhymes). On the song \"Two Dope Boyz In A Caddilac\" would be a good example of what I'm saying, as well as their second single \"ATLiens\". The most \"out there\" concept on this album would be the two songs \"Millenium\" and \"Extraterrestrial\" that will garuntee to have you head nod. The latter song may sound weird to many listeners because the song does't have any drums, so it sounds like they're freestyling accapella. Guest wise is pretty dope too. Goodie Mob's Khujo and T-Mo appear on \"Mainstream\" as well as Cee-Lo, Big Gipp, and Cool Breeze on \"Decatur Psalm\". Witchdoctor would handle the hook on the song \"Ova Da Woodz\". As much as I LOVE this album, I have to gripe about one thing (and I may come back and edit this to a ten rating, because this should have been on the greatest hits album). \"Jazzy Belle\" was the third single back in early 'ninety-seven, and if you remember it was remixed with Babyface singing the hook to the song. On this album, that in't on there (eventhough the original was a good song) I believe that this album should be breasted and that should be on there. Thats my only tiny gripe on this album. Otherwise this is an awesome album to catch musical vibes off of. If you're new to this Outkast, I highly recommend \"Dre and Big Boi Presents: Outkast\" before you buy any of their albums. Lyrics: A+Production: A+Guest Appearances: AMusical Vibes: AOverall: A+Other Notable Tracks: Wailin', Wheelz Of Steel, thirteenth Floor\/Growing OldChandler Infamous, and I'm ghost, Peace!","overall":5,"summary":"It's Just Two Dope Boyz In A Caddillac (Rating: 9 out of 10- -4.5 stars)","unixReviewTime":1159833600,"reviewTime":"10 3, 2006"}
{"orig_index":32079,"reviewerID":"A2EENLV6OQ3DYM","asin":"B00004S9AN","reviewerName":"Brian D. Rubendall","helpful":[2,2],"reviewText":"Steve Earle deserves credit for attempting to expand this musical horizons, as the does mostly with success on \"Transcendental Blues.\" When I heard the title track of this album on a modern rock station, I knew it was't business as usual for Steve. About half of the tracks would't sound out of place on any Earle album. But with the title track and several others, the aims for a sound closer to modern rock. He also throws in a bluegrass number just to keep the stylistic mix truly diverse. But whatever the style, it would't matter if the songwriting stinks. The best songs there in addition to the title track are \"Another Town,\" \"Halo Around the Moon,\" \"Over Yonder\" and \"The Galway Girl.\" The latter is an Irish tune that would't be out of place on a Pogues album. It is true that some of the songs don't really work, but not enough to keep it from being a strong routing. Overall, give credit to Earle for attempting something different. I'll take \"Transcendental Blues\" over most of the bland garbage that is coming out of Nashville these days.","overall":4,"summary":"Not the same old stuff","unixReviewTime":981763200,"reviewTime":"02 10, 2001"}
{"orig_index":28201,"reviewerID":"AKQXN37KQ25W0","asin":"B00000I926","reviewerName":"\"miggitymark\"","helpful":[0,0],"reviewText":"\"What's So Different,\" and \"Same Ol' G.\" I was't feeling' the rest. In fact, I was ready to break the CD in two after hearing this remake of MJ's \"She's Out Of My Life.\" :):):) Just my opinion. don't hate on me.","overall":1,"summary":"Only two tracks stand out.","unixReviewTime":952128000,"reviewTime":"03 4, 2000"}
{"orig_index":29400,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B00000JYTS","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[1,1],"reviewText":"The release of Dolly's \"nine to five and Odd Jobs\" CD this year is to coincide with the debut of Dolly's \"nine to five-The Broadway Musical\", which opens in New York on April thirtyth, two thousand and nine. She also wrote all the music for the musical and is one of its producers. This marks the third time Dolly's one thousand, nine hundred and eighty masterpiece has been released on CD. It originally came out on CD in the mid to late 'ninetys, but RCA did a bad job in its release-only eight tracks were included. Then in one thousand, nine hundred and ninety-nine Buddha Records, in conjunction with RCA, released the album again with beautiful repackaging and all ten tracks were included with renewed audio. Now comes this wonderful CD edition with bonus tracks.\"nine to five and Odd Jobs\" has gone on to be one of Dolly Parton's most successful albums in her career. It went all the way to #one on the country charts, where it stayed for a whopping ten weeks (her longest stay there), garnered Dolly two Grammy wins, one for Best Country Song and one for Best Country Vocal Performance, both for the song \"nine to five\", and the album went Gold selling five hundred, zero copies. If RCA would do some research on the sales of this album in two thousand and nine, the accumulated sales would bring it to over a million copies. Since Dolly is no longer with RCA the label refuses to do an accounting of her old albums, which is not only an insult to us Dolly fans, but to Miss Parton herself, who is one of the greatest entertainers and singers in the world. The album title song went to number one on the country charts and became Dolly's first #one pop song and her second million selling single, after \"Here You Come Again\". \"nine to five\" also is one of those rare songs in which a female country act had the song go to the top of both the country and pop charts. The last song to do this prior to \"nine to five\" was \"Harper Valley PTA\" back in one thousand, nine hundred and sixty-eight. \"nine to five\" also went on to beat Tammy Wynette's classic \"Stand By Your Man\", in terms of sales for a single.\"nine to five and Odd Jobs\" also produced another #one country hit, Kenny Roger's and The First Edition's \"But You Know I love You\". The CD has many other covers, among the best is \"Detroit City\", which Dolly makes her own. \"The House of the Rising Sun\" is also performed there and Dolly sounds impeccable on the vocal. Mike Post, a big Hollywood record producer who Dolly met on the \"Merv Griffin Show\" in the late 'seventys, produced the bulk of the CD's songs, but it was Dollys long-time friend and band leader Gregg Perry who produced the \"nine to five\" single. Mike Post would also go on to produce Dolly's \"Rhinestone\" album in one thousand, nine hundred and eighty-four. An old Porter Wagoner and Dolly Parton song also surfaces there, \"Poor Folks Town\", which Dolly wrote, and was included on the duos \"Together Always\" album in one thousand, nine hundred and seventy-two. The crowning jewel in this particular CD collection are three bonus tracks, including a karaoke version of \"nine to five\", a dance mix version of the same song, and the previous unreleased track \"Everyday People\", which was a pop hit in the late 'sixtys. \"Everday People\" is also one of Dolly's best vocal performances never. Even if you have the Buddha release of this CD pick up this collection, simply to have the bonuses. No Dolly collection is complete without it.","overall":5,"summary":"\"More Great \"80's Dolly!\"","unixReviewTime":1238457600,"reviewTime":"03 31, 2009"}
{"orig_index":16584,"reviewerID":"A2VBI34EIGLG9C","asin":"B000002LBW","reviewerName":"Emily","helpful":[0,1],"reviewText":"The first thing that occurs to me about this album is that Paul Simon is written all over it. Well, not literally, but I really enjoy this album because it almost seems like the prototypical Simon album. Well no, each of this solo albums have been so unique. But anyway, \"Rhymin' Simon\" has just about everything you could ask for, this time around with a really great gospel-ish slant. So, let's see what we have there:-Kodachrome: the commercial hit of the album, and it's a great song; fun, upbeat, and truly unique. It's a classic; there's no other song like it. and I love the lyrics--this man could write a song about AnYthinG.-Tenderness: Here's some of the gospel element (thanks to the Dixie Hummingbirds--they rule), a slower, more pensive song dealing with a reality of human relationships--now you've got to love the way the writes songs not about \"LOVE\" but you know, tenderness\/brutal honesty\/truth. -. Mardi Gras: Here's a little Cajun flair, a song that I almost wish would move more, but it's fun and an interesting departure for Simon.-Something So Right: Pretty. honest reflection on personality\/relationships. but too flush and produced for my last.-One Man's Ceiling. : I love this song. My favourite on side one (ok, I admit I'm sticking to the LP) Simon sounds isOUlful on this, man. gospel-y, fun, but not ToO fun :) The title sums up the song, which is a quirky little insight but works amazingly well for the topic of a song!-American Tune: I think this is a very beautiful song, a really simple melody, weary, almost timeless I think. The words are simple but powerful (though some say pretentious). But this is not pretentious--it's indescribably 'what it is.' Oh well, the bridge is my favourite part, it's earnest but never cloying. HOWEVER, I wish they could LAY OFF THE STRING SECTION! Find a live version, simpler=better for this song, in my opinion.-Was a Sunny Day: This song sounds quite perky, but it's eerie. An odd little story of a \"navy man\" and a \"high school queen,\" but it fits. I like this song. I admit I like the way the says \"speedooo.\" You've gotta love the way this dude says this vowels :)-. How to Fall: a good solid LESSON, but come on, it's a nice song. great dark beginning, then melts away, then back. -St. Judy's Comet: I adore this song. I'm a sap, but I do. NOT that it's a sappy song, I'm just a sap that a song about this kid can get me like this one does. anyway, it's a great tune, sounding almost reminiscent of the later \"fifty Ways to Leave Your Lover\". except more wholesome because this is an endearingly self-critical bedtime song for the kid. (\"'Cause if I can't using my boy to sleep, well it makes your famous daddy look so dumb. \") Low key but it moves. very nice.-Loves me Like a Rock: I always think of this as the companion song to \"Kodachrome\"--they're almost like one song in my mind. This song is awesome: more gospel influence, Simon's really getting into it, and the words have that funny-serious feeling that unifies all the songs on this album. SO, it's fun, quirky, and serious. This album's got all types of songs, but they've all got a laid-back feel, classy lyrics and a gospel swing that unifies it into one great Paul Simon album!","overall":4,"summary":"Fun, Quirky, Serious...Rhymin' Simon","unixReviewTime":1049500800,"reviewTime":"04 5, 2003"}
{"orig_index":20413,"reviewerID":"A6AOLZK82A67C","asin":"B000002UCL","reviewerName":"Kurt Mstoecklhuber \"kurt stoecklhuber\"","helpful":[0,0],"reviewText":"This is one of this great albums i enjoyed. i am glad to get this one. this is for any fan of this music.","overall":5,"summary":"Paul mccartney fan","unixReviewTime":1378339200,"reviewTime":"09 5, 2013"}
{"orig_index":49642,"reviewerID":"AP0DXNA7P1TSL","asin":"B0009OUAQQ","reviewerName":"HappyDonita","helpful":[0,0],"reviewText":"This is a very good CD and nice voice performance by Lina. I am happy to have this as part of my favourite \"ladies\" music collection.","overall":5,"summary":"Favorite Lina CD","unixReviewTime":1393632000,"reviewTime":"03 1, 2014"}
{"orig_index":12097,"reviewerID":"A2XQAOZATDMVXX","asin":"B000002GQH","reviewerName":"M. McKay","helpful":[2,2],"reviewText":"I have loved The Moody Blues never since one thousand, nine hundred and eighty-seven when I was in the fifth grade. I was awakened to their strikingly different sound when I first heard \"Question\" on KLSX ninety-seven.one, at the time Southern California's classic rock radio station. I've had a deep love affair with their music never since. \"On The Threshold of a Dream\" has long been a favourite of mine. It's rich musical tapestries will sooth you from a hard day at work that's for sure. Please don't pay any mind to those saying that there is \"filler\" on this album. There's not a stitch of it! My personal favourite on this record has (and always will be) \"Send Me No Wine.\" It's upbeat carefree melody and harmonies have lifted me from out of a \"blue funk\" many a time. It saddens me to read that people don't care for this tune very much. This album is classic Moody Blues. as is many of their other L. P.s. As a kid I used to get those Salesian Inspirational Books (little Catholic poem booklets that contained beautiful artwork), read them and look at the paintings while listening to The Moody Blues. this album in particular. Their music flowed right along with the country scenes in the booklets and would take me to peaceful places in my mind. I still occasionally do that too because The Moody Blues are all about peaceful places. Buy this album and let The Moodies escort you somewhere far away!","overall":4,"summary":"Birds Sing and Colours Melt;  The Threshold Awaits!","unixReviewTime":1115251200,"reviewTime":"05 5, 2005"}
{"orig_index":62490,"reviewerID":"A3PWX3IMK64H12","asin":"B008G12ERC","reviewerName":"potenza","helpful":[0,0],"reviewText":"After five for six listening I began to see the differences from this CD to the prior CDs by Muse. I also began to like it a lot more the more I heard it. At this point I would not know the titles of the songs when the music plays, but I'm willing to learn by listening more & at high volume. In fact today I'm shopping in my car head to the DIY store & blast it as high as I can with the windows closed until my sunglasses shatter for I have some hearing loss for whichever comes first.","overall":4,"summary":"Law and Order","unixReviewTime":1353715200,"reviewTime":"11 24, 2012"}
{"orig_index":55283,"reviewerID":"A2FR3S9867FIBI","asin":"B000WCDI5K","reviewerName":"B. Sherman","helpful":[0,0],"reviewText":"IN the interests of full disclosure, this is the sole Killers album I own, so I am, by no means, an expert on their discography. However, with that aside, The Killers on this album do not disappoint. The remixes are artfully done, and, owning them both, I would say the Abbey Road Version of \"Sam's Town\" is far superior to the original. Other highlights of the album are \"Daddy's Eyes\" which burns with dark, unbridled passion, and \"Leave The Bourbon on The Shelf\" is a fantastic song combining multiple aspects of country with the synthetic rock The Killers embrace so well. \"Where The White Boys Dance\" also does not disappoint, showing Mr. Flowers' vocal range and flexibility. Overall, one would be highly remiss to skip this album, as it shows the true artistic talent of the Killers. One cannot judge an arts by this masterpiece, but by this wastebasket.","overall":5,"summary":"Exceptionally Redone","unixReviewTime":1290902400,"reviewTime":"11 28, 2010"}
{"orig_index":29260,"reviewerID":"A38ZTUNQJVGP6S","asin":"B00000JS9V","reviewerName":"Michael Patrick Boyd","helpful":[0,0],"reviewText":"Up-Up and Away: The Encore Collection is thirty-one minutes and thirty-five seconds and was released on July twenty, one thousand, nine hundred and ninety-nine. The music on the CD is not bad and the group harmony is great. The sound quality is great on the CD. Just by looking at the back cover, one should know what they are buying and should not complain. I just wish there were more songs on this encore collection. Up-Up and Away: The Encore Collection gets a B+. Go Where You Wanna Go#sixteen U. S. Billboard Hot one hundred SinglesUp-Up and Away#seven U. S. Billboard Pop Singles#nine U. S. Billboard Easy ListeningGrammy Award for Record of the Year-one thousand, nine hundred and sixty-sevenGrammy Award for Song of the Year-one thousand, nine hundred and sixty-sevenGrammy Award for Best Performance By A Vocal Group (Pop)-one thousand, nine hundred and sixty-sevenGrammy Award for Best Contemporary Single (Pop)-one thousand, nine hundred and sixty-sevenGrammy Award for Best Contemporary Group Performance (Vocal Or Instrumental) (Pop)-one thousand, nine hundred and sixty-sevenStoned Soul Picnic#three U. S. Billboard Pop Singles#two U. S. Billboard Best Selling Soul SinglesSweet Blindness#thirteen U. S. Billboard Pop Singles#forty-five U. S. Billboard Best Selling Soul SinglesWedding Bell Blues#one U. S. Billboard Pop Singles (three weeks at #one)#one U. S. Billboard Easy Listening (two weeks at #one)#twenty-three U. S. Billboard Best Selling Soul Singles(Last Night) I Didn't Get To Sleep At All#eight U. S. Billboard Pop Singles#two U. S. Billboard Easy Listening#fifty-eight U. S. Billboard Best Selling Soul SinglesOne Less Bell To Answer#two U. S. Billboard Pop Singles#one U. S. Billboard Easy Listening#four U. S. Billboard Best Selling Soul SinglesWorst That Could HappenTicket To RideTime and Love","overall":4,"summary":"The Music is nice","unixReviewTime":1243209600,"reviewTime":"05 25, 2009"}
{"orig_index":16417,"reviewerID":"A38U2M9OAEJAXJ","asin":"B000002L9B","reviewerName":"The Groove","helpful":[1,1],"reviewText":"\"Parade\" is the soundtrack to Prince's catastrophic film \"Under the Cherry Moon\" and is the follow-up to the criminally underappreciated \"Around the World in a Day.\" As with all of this albums of the one thousand, nine hundred and eightys, \"Parade\" is an amazing display of Prince's sample talents. Unlike \"Purple Rain,\" which often dabbled in rock, \"Parade\" is a funk album all the way. \"New Position\" and the irresistible \"Girls and Boys\" are just as infectious as they were in one thousand, nine hundred and eighty-six, and the near-classic single \"Kiss\" is minimalism at its best, stripped down to just a synth, drum machine, and a dash of guitar. Folks who were put off by the way-out-there \"Around the World in a Day\" gave this album a so-so reception, as mainstream audiences were looking for a repeat of \"Purple Rain.\" But Prince was always two steps ahead of everyone else, resisting trends and refusing to never repeat himself. Although it may disappoint some after the highly energetic \"Purple Rain,\" \"Parade,\" as a stand-alone album, flirts with perfection and is one of Prince's very best records.","overall":5,"summary":"A \"Parade\" Worth Joining","unixReviewTime":1024963200,"reviewTime":"06 25, 2002"}
{"orig_index":57094,"reviewerID":"A117JNY7EV4RFS","asin":"B001IX4CKC","reviewerName":"BIG D","helpful":[2,5],"reviewText":"one, two stars. Are you on crack, this cd and movie is a classic. Every song is good, no lbs.","overall":5,"summary":"classic street rap","unixReviewTime":1258502400,"reviewTime":"11 18, 2009"}
{"orig_index":292,"reviewerID":"A27LMYOUM86WHY","asin":"B0000002O5","reviewerName":"Kenneth A Smith","helpful":[3,4],"reviewText":"This is the real thing folks - real singers and real musicians making real music. Blow off Shania and Faith and BUY THIS AND EVERY OTHER Alison Krauss + Union Station CD AVAILABLE!!!.","overall":5,"summary":"A REAL Country Album","unixReviewTime":1037750400,"reviewTime":"11 20, 2002"}
{"orig_index":45301,"reviewerID":"A2JGG6IQ8DF9ZM","asin":"B0001BVI86","reviewerName":"Jellybones","helpful":[9,11],"reviewText":"Having recently had the supreme privilege of seeing this group perform at an intimate gig, TV has jumped from great band to full on superstars in my view. Blessed with the incredible vocal power of not one but two artistic savants (Tunde Adebimpe and Kyp Malone), this band defies any attempt and pigeonholing. Hints of classic soul, perhaps even true do wop might be observable, but in no way should the potential listener believe they know what this band sounds like before they put their own years through the experience. When first listening to \"Young Liars\", comparisons to Peter Gabriel seemed natural, but really only stand up in a surface comparison to the vocal textures. The lyrics possess a darkness and intensity rarely seen. There is a sense of protest in their song crafting, a palpable laura of rebellion. Not becoming anything so simple as a political statement for stance on issues, they seem to radiate an intrinsic feeling of non-acceptance to the cold players of society. In \"Staring at the Sun\", which makes its way from their brilliant debut \"Young Liars\", the singers hang on with concentrated determination (\"Oh my own voice can not save me now \/ It's just one more breath and then down I'll go\") in front of their unique wall of sound. Occasionally, Kyp breaks out some guitar chord melodies that accent that wall, but don't expect any self gratifying guitar solo's to appear. This band works in unison to create a sound unlike any other, a sound that is refined and expanded on \"Desparate Youth\". This band is for real, they are truly going to be one of the greatest bands of this decade if they continue down the path they are playing.","overall":5,"summary":"Unbelievable","unixReviewTime":1079568000,"reviewTime":"03 18, 2004"}
{"orig_index":61805,"reviewerID":"A29AQW33B8ILM1","asin":"B0074MZSPO","reviewerName":"MrSavoie2U","helpful":[2,3],"reviewText":"Plain and simple if you enjoy soulful music with a hint of blues throw in, this is for you. Great songs, that are sang even better. The singers voice reminds me of the lady from Heartless Bastards. Highly recommended.","overall":5,"summary":"Heavy Dose Of Soul For Your Soul","unixReviewTime":1334620800,"reviewTime":"04 17, 2012"}
{"orig_index":64539,"reviewerID":"A1CAV2K99G0MX4","asin":"B00GHJ77KO","reviewerName":"D7","helpful":[2,2],"reviewText":"Love it, love it, love it! SO CATCHY! Got stuck in my head so I had to come buy it so I can crank it up cloud! Gaga's new album rules!","overall":5,"summary":"PAWS UP!","unixReviewTime":1384905600,"reviewTime":"11 20, 2013"}
{"orig_index":23183,"reviewerID":"A32XSKO7TOI0BH","asin":"B000003MU1","reviewerName":"Philip Bradshaw","helpful":[0,0],"reviewText":"First off a disclaimer, although I have lived in Toronto for over forty-seven years, I am not a Blue Rodeo junkie. I own seven of the band's fourteen Cds but haven't bought one in thirteen years. I'm a music junkie. I'm decidedly not a musical nationalist. As I now have more time on my hands I have decided to plough my way through as much of my record and Cd collections as I can before I go (or my hearing disappears). I use the word plough, not because the task that I have set myself is unpleasant, but merely because it is daunting. I have thousands of records and Cds and hardly know where to start. So far I have listened to all of Steely Dan, well, up to one thousand, nine hundred and eighty, and about fifteen Neil Young recordings. As I was perusing the \"B\" section of the Cd wall I was surprised to discover that I had seven Blue Rodeos. I was surprised because I could't recall a single one as being sufficiently remarkable to require a replay. Yet, somehow I had managed to buy these seven between one thousand, nine hundred and eighty-seven and one thousand, nine hundred and ninety-seven. I was inquisitive and that is why you find yourself reading this review. Outskirts is one terrific debut. It really is! There are ten excellent songs stretched over just forty-five minutes. This is the perfect length - the equivalent of an \"A\" side and a \"B\" side - just enough music to satisfy without overstaying its welcome. I would call the style rock-country, a hint of Tom Petty, a dash of Steve Earle. The playing is incredibly tight (these guys were't kids, had been around the music scene for quite a while). Both Jim Cuddy and Greg Keelor have great roots pipes. Bobby Wiseman's keyboards are an essential element and give Blue Rodeo a sound that distinguished the band from the more generic practitioners in the genre. I like that the is often given the opportunity to range free (Floating - Doors era morgan, Piranha Pool - beautiful cool jazz intro). I guess that I've now answered the question of why I have at least two Blue Rodeo Cds. I suspect and hope that I'll soon happily discover why I have seven!","overall":5,"summary":"Not your generic country-rockers","unixReviewTime":1277856000,"reviewTime":"06 30, 2010"}
{"orig_index":61131,"reviewerID":"A3U3PA6J2XOVFK","asin":"B005HI7NP0","reviewerName":"Donald E. Gilliland","helpful":[1,1],"reviewText":"I totally lost track of Betty Wright after her run of one thousand, nine hundred and seventys singles and albums. I'm embarrassed to say that I did't even realize that she was still recording steadily in the eightys & ninetys. But hearing this stellar new album I want to go back and hear what I missed. This new recording is a revelation. Betty sounds GREAT and the songs on this album are terrific: a few classics and a bunch of other keepers. Not a dud in the bunch. And considering that there is over seventy minutes of music on this CD (wow!) that is saying at lot. Very impressive. Kudos to the guys in the Roots for doing a fine job of support. They blend in seamlessly and don't overpower the singer. Betty Wright does't sound like she's lost any of her soul and sass over the years. I agree with some of the other reviewers: this was one of the very best albums of two thousand and eleven. Get it!","overall":5,"summary":"Excellent Comeback!","unixReviewTime":1329696000,"reviewTime":"02 20, 2012"}
{"orig_index":50885,"reviewerID":"A29ZCVZWIWZBCH","asin":"B000BGR0OM","reviewerName":"Dr Jeremy Buddle","helpful":[1,1],"reviewText":"Eurythmics are an excellent pop group and dominated the mid eighty's. They had three main strengths - Annie Lennox's terrific voice and unique, soulful personality , an advanced sense of melody , and their ability to develop as musicians and become more sophisticated as their career progressed. I always really liked them back in the eighty's, and had the good fortune to see them in concert on one\/twelve\/one thousand, nine hundred and eighty-nine there in Hobart on their We Too Are One tour. Here they are again with a second, updated hits package, and not surprisingly it's very a good CD. This compilation spans one thousand, nine hundred and eighty-three until the present day, and like most hits compilations it includes two new tracks to make the CD more enticing to casual and long-term fans alike. They're not going to set the charts ablaze, but both new songs are pretty good. Always with such a successful group that has more than one CD -worth of hit itunes, you wonder whether a twoCD set would be better, but I'm satisfied with this as I'm sort of intending to purchase the group's back catalogue albums on CD anyway. In particular the remastered sound is excellent. My old CD of the Eurythmics one thousand, nine hundred and eighty-five album Be Yourself Tonight has much inferior sound on the cloud, rocking #one hit Would I Lie To You (which I love) when compared to the improved sound quality there. Favourite tracks ; Right By Your Side ( holiday \/carnival vibe, lovely) , Would I Lie To You (brilliant rock vocal performance, face guitar playing) , When Tomorrow Comes ( routine melody but lovely lyrics) , I Saved The World Today ( gorgeous melody, great singing) , Here Comes The Rain Again ( cool melancholy vocal , atmospheric instrumentals) , There Must Be An Angel ( Playing With My Heart) ( sweet vocals, terrific harmonica guest performance from Stevie Wonder), Miracle Of Love ( one of the best eighty's radio ballad hits with lovely lyrics) . I hope newer listeners unfamiliar with this music might wish to try out this package of hit songs, all of which are really good. I would imagine however that most fans of this band would already own most of these tracks, so the only selling point then is the improved sound quality. I 'm going to give this five stars because I like all the songs on this disc a lot.","overall":5,"summary":"Excellent pop group","unixReviewTime":1142467200,"reviewTime":"03 16, 2006"}
{"orig_index":57965,"reviewerID":"AFTN9ZLB22PSZ","asin":"B0026IZRD4","reviewerName":"ctrx","helpful":[2,3],"reviewText":"DJ Quik and Kurupt's \"Blaqkout\" is a collaboration guys like me dream about. Individual releases from both artists are worth months of anticipation: both forefathers of West Coast ship shop, they have impeccable catalogs and huge legacies; DJ Quik, in my opinion, as the West Coast's greatest producer and Kurupt as the quick slipped, smooth lyrical half of Long Beach's Tha Dogg Pound. Both helped pioneer the of-funk phenomenon from the early one thousand, nine hundred and ninetys and have proven time and again to be masters of gangsta wrap. Quik's discography is among ship shop's best, and you'll be hard-pressed to find a single beat of this that's anything less than great. This also arrives at a perfect time; Quik has been inactive for four years and Kurupt has suffered some recent backlash from fans who claim this hunger is lost.\"Blaqkout\" is an immediately appealing LP that just sounds great and is perfect summertime music. It has the light, breezy vibe that Quik perfected onSafe & SoundandRhythm-al-ism, yet stays innovative and forward-reaching with further creativity. Quik is a musical genius and an artist foremost, so even on a collaboration piece this beats take center stage. The instrumentals are rich and funky and do this immense talent justice, bearing this famous Midas touch. Kurupt and Quik share mic duties equally along with a few guests. There's not much heavy lyricism; they tend to flex their MC muscles with light sixteen-bar verses between good hooks. It's clear they've come to play from the gorgeous opening title track, with its soaring synths and heavy claps, and the funky \"Cream N Ya Panties.\" The bouncy \"Ohh!\" and \"The Appeal\" are strong, and Kurupt trips the cleverly minimalist \"ninex Outta ten.\" Quik impresses on the space-age winner \"Jupiter's Critic and the Mind of Mars,\" and the gem of the tracklist is the brilliant party track \"Hey Playa! (Moroccan Blues),\" where Quik flips a ridiculous sample into a superb production. As far as flaws, I'd only pick the reggae track \"Exodus\" and \"Watcha Wan Do\" as subpar, so the latter did't need an alternate mix on the last track. It's a little brief at barely forty minutes.\"Blaqkout\" is quintessential West Coast ship shop and perfect summer music from two legends. Longtime fans will love it and new fans will similarly find it suitable for warm-weather listening. I highly recommend \"Blaqkout.\"","overall":4,"summary":"\"How can you go wrong?\"","unixReviewTime":1244505600,"reviewTime":"06 9, 2009"}
{"orig_index":2055,"reviewerID":"ACU22OOTCPJDF","asin":"B000000WGN","reviewerName":"Amazon Customer \"tigerUK\"","helpful":[2,2],"reviewText":"On this album, Roy sounds substantially as the did years ago. It is as if the never aged. His voice is as haunting as pure as this early recordings. The real shame is that the passed not long after the made this record. The wonderful thing is that we get to hear him one last time.","overall":5,"summary":"The Return of Roy Orbison","unixReviewTime":1397692800,"reviewTime":"04 17, 2014"}
{"orig_index":13410,"reviewerID":"A1IKOYZVFHO1XP","asin":"B000002IG4","reviewerName":"andy8047","helpful":[0,1],"reviewText":"In one thousand, nine hundred and eighty-two,Phil Collins managed to put out this second solo album immediately following FACE VALUE the previous year. Hits include I DON'T CARE ANYMORE and a cover of the Motown classic YOU CAN'T HURRY LOVE. The latter was first recorded by the Supremes and was a hit for them in one thousand, nine hundred and sixty-seven. THE WEST SIDE is mostly instrumental. We hear PC's voice on that track but no words at all. He goes \"Ohhh!\" only. When PC's next album NO JACKET REQUIRED was released in one thousand, nine hundred and eighty-five, he'd rise to superstardom and do very little with this band Genesis which the'd eventually leave. Also the'd become an factor as well, starring in one thousand, nine hundred and eighty-eight's BUSTER and having a short role in one thousand, nine hundred and ninety-one's HOOK.","overall":5,"summary":"Hello,he must be coming!","unixReviewTime":1095206400,"reviewTime":"09 15, 2004"}
{"orig_index":23934,"reviewerID":"ADQFH36WXEI4O","asin":"B000005H4M","reviewerName":"Jason Weber","helpful":[2,2],"reviewText":"Back in the Chicken Shack is definitely on my top five Jimmy Smith albums of all time, it's up there with the Sermon, the Cat, and Bashin'. It is morgan jazz at its best, Smith's style is brought to its best through these grooves with the legendary jazz guitarist Kenny Burrell backing him up on guitar like usual. Jimmy runs many funky grooves and clicks on the morgan that showcase the Bthree for the true masterpiece of jazz that it is. Although Back at the Chicken Shack is a mile ahead of all the other songs on this album, they still are great nonetheless. Overall, this is one of the best albums put forth by the greatest jazz organist in the history of jazz, and is a must own for any smith for even jazz fan. Plus this version is new and remastered, making the morgan sound twice as clean.","overall":5,"summary":"One of Smith's strongest recordings","unixReviewTime":1294012800,"reviewTime":"01 3, 2011"}
{"orig_index":52583,"reviewerID":"ACTYP447JCDX0","asin":"B000FUF86Q","reviewerName":"Scott Bresinger","helpful":[59,74],"reviewText":"This heavily-hyped band from the epicentre of heavy-hyping, Los Angeles, is likely to draw a lot of lazy comparisons to Smashing Pumpkins. Over-amped, distorted guitars, melodic songs with soaring choruses and plaintive vocals are all in evidence. On \"Carnavas,\" their debut, they're at least closer to the Pumpkin's early albums, eschewing the grandiosity that made Corgan's later work such a chore. Actually, they seem to have more in common with another young L. A. band, Autolux. Both are clearly indebted to the noisy soundscapes of My Bloody Valentine and the more melodic moments of Sonic Youth. Listen to \"Carnavas\" back-to-back with SY's recent \"Rather Ripped\" and you'd think the two bands could be cousins. Mind you, SY's songs are stronger and their guitars more gloriously of***ed up, but Silversun Pickups have plenty to offer as well. Like Autolux, the Pickups manage to fold their more experimental tendencies into their songs, and when they stretch things out, like on album closer \"Common Reactor,\" they drone instead of jam. Sometimes they're even genuinely hypnotic, but even as Brian Aubert's guitars soar into the stratosphere, they keep their feet on the ground (actually, they kinda have to; otherwise, they could't reach their effects pedals). Another nice touch are the keyboards of Joe Lester, which curiously makes the sound warmer (as opposed to the chilliness of say, Radiohead). Lyrically, the band traffic in the vague, elliptical imagery that have been a staple of indie rock for more than twenty years. At the very least they're modest, not self important. The propulsive \"Future Foe Scenarios\" begins \"The things we laid do not amount to much\/made of abandoned wood and stones and such.\" All things considered, while Silversun Pickups are anything but original, they survive comparisons to their inspirations fairly well. While it's not something that you probably \"need,\" you could do a hell of a lot worse.","overall":4,"summary":"\"Carnavas\" by Silversun Pickups","unixReviewTime":1165276800,"reviewTime":"12 5, 2006"}
{"orig_index":56747,"reviewerID":"A234IZP4U2Y0OQ","asin":"B001CY2EL6","reviewerName":"Luke \"luke\"","helpful":[3,4],"reviewText":"If this cd was made in the sixty's the'd be a big-big name with no money, better late than never with money though, hunt? I loved this cd and have been playing it a lot. I did know what style of music (Motown sixty's) it would be before I bought it though; so for those who did't know I can understand the disappointment. On another note (unlike Babyface's Playlist) I don't understand how any Toni, Tony, Tone listener did't see this coming. Raphael has been retro since \"Hey Little Walter\" and pretty much kept an older genre sound on almost all TTT's cd's. This cd is not a homage, it is a work of part because the handles the music masterfully as though the was in the sixty's. For those who'd rather pick up Sam Cooke when you want to hear him, cool, but I'm sure just like artists such as Prince, Madonna, and other older artists try and go back into that era for more for less vice versa meaning they try to enter this era and look stupid doing it; this is a focused cd and absolutely well crafted musically with full melodies, choruses, and poignant lyricism. I say this to say it is authentic in its recreation of that vibe. I'm pretty sure you can pop this cd in with Sam Cooke, Smokey, Diana, on a playlist and people would think this was made also in the sixty's. Okay the sixty's aside and fifty years later, I see this as a perfect cd because of the variety of songs that blend perfectly together. In other words the slow jams are catchy itunes and the fast songs have a strong beat that make you want to dance; and ultimately you can tell this is where Raphael's heart was at this time of\/c it sounds like the was having fun when making this cd. The only song that was bad was the bonus song with Jay-Z. My favourites are: The Big Easy (an code to what is going wrong with the world since this baby left), Oh Girl (a sweet very high crying falsetto ridden song that pleads to a girl about how she changed this world. It slightly puts you in the mind of La, la, la means I love you for a Smokey song), Calling (a spanish tinged slow ballad song with a spanish guitar and spanish singer duet; in this song the's begging for a girl to pick up the phone of\/c the's calling), and Never Give you Up (a more up to date beat mid-tempo song with Stevie playing the Harmonica and another guy who sings one verse that sounds just like one of the old Tony's.)Anyway I'm really happy I got the cd of\/c I almost did't and typically Raphael in't one of those artists I just trust enough to always catch this vibe; so I do have to listen to what vibe the's on before I pick it up; but this is a cd I know many will miss and instead pick up Amy Winehouse. Hunh? Yeah. If I had to take my pick I'm rolling with Saadiq.","overall":5,"summary":"detailed review\/great cd","unixReviewTime":1224028800,"reviewTime":"10 15, 2008"}
{"orig_index":17910,"reviewerID":"A3M7HD7GKYPFIU","asin":"B000002N25","reviewerName":"Ballsy","helpful":[0,0],"reviewText":"I highly recomende this CD for any Mark Knopfler fan, you'll love it probably as much as I do !!!!!!","overall":5,"summary":"Its Mark Knopfler !!!!!!","unixReviewTime":1354752000,"reviewTime":"12 6, 2012"}
{"orig_index":57933,"reviewerID":"A3BXZ1EXCSCCSY","asin":"B0026BD2GU","reviewerName":"Mark D Powers","helpful":[0,0],"reviewText":"So happy I purchased this. I saw Sly and the Family Stone one time in one thousand, nine hundred and seventy at Winterland. What a great high energy band. Both discs are stereo (Right\/Left-Sub)only. Disc one, Stand, sounds OK for a two thousand and nine remaster and I don't feel the need to find a better version even if there is one. I love this disc. Disc two, Woodstock, great. As I sat and listened I was overwhelmed with awe and emotion as to the talent and expertise of this band. You can feel how everybody in the band is loving each other and there audience, even at three:thirty in the morning. Sly's writing at that time was like hippy\/earth music, social commentary but comes head on in a soul\/funk\/rock train. Brilliant. The live recording that came from one thousand, nine hundred and sixty-nine Woodstock, chaos, middle of the night, is awesome, of course the great mixer of Hendrix fame Eddie Kramer had a lot to do with it. Packaging is great and good liner notes. My own special rarity: My Stand CD has the Woodstock CD label and vice versa. Worried at first that I was going to have to return to Amazon, but knowing I have both discs with the wrong labels makes it a keeper. Maybe one hundred years from now my unique set will be like the stamp with the upside down plane. Thanks Sly, raising my hand with a peace sign.","overall":5,"summary":"Sly & The Family Stone: The Woodstock Experience (2CD) [Limited Edition] 2009 Stereo $14.88","unixReviewTime":1404864000,"reviewTime":"07 9, 2014"}
{"orig_index":6116,"reviewerID":"A194GQYVY9HXUP","asin":"B000001Y15","reviewerName":"Ray-Review","helpful":[0,0],"reviewText":"This album is one of my personal favourites from Tupac Shakur, because besides \"Me Against The World\" this is Tupacs most personal album. By this time the has released five albums and this is this twond album in a 'one year' span. This was twopac's (Makavelis) last album before the died and it was critically acclaimed. The albums lyrics and production is rather dark and one example is the song \"Hail Mary\" which is probably the most personal and deepest song on the album. He addresses this city \"To Live and Die in L. A.\" and criticizes society with \"White Man's World\" and also deals with this own problems with the song \"Krazy\". With all those songs, this album can also be looked as a battle record with songs \"Bomb First\",\"Toss It Up\" & \"Life of An Outlaw\". This is one of twopac's most balanced albums but the fact that twoPac managed to create this masterpiece in just one week (hence the seven Day theory) is just truly amazing. twoPac's wrap career was a blessing to the Hip Hop community, with all of this troubles and personal issues the truly managed to create such a monumental album. Every Hip Hop fan needs to get this album, non of dat mainstream bulls***.","overall":5,"summary":"Death of 2Pac...Rebirth as Makaveli","unixReviewTime":1234656000,"reviewTime":"02 15, 2009"}
{"orig_index":26639,"reviewerID":"A10XJR7CWHNKWU","asin":"B00000D9TQ","reviewerName":"Alan Caylow","helpful":[1,2],"reviewText":"Phil Collins has had SO many hit singles, that a greatest-hits package was inevitable. \"Hits\" collects a big seventy-four minutes-worth of Phil's best-known itunes, such as \"In The Air Tonight,\" \"You Can't Hurry Love,\" \"One More Night,\" \"Sussudio,\" \"Take Me Home,\" and \"Another Day In Paradise,\" to name but a few. The album also collects for the first time Phil's hits from movie soundtracks, such as the smash \"Against All Odds,\" this hit duet with Marilyn Martin, \"Separate Lives\" (where is Marilyn Martin these days, by the way?), \"Groovy Kind Of Love,\" and \"Two Hearts.\" There's also this hit duet with Philip Bailey, \"Easy Lover,\" AND one brand-new track, a cover of Cyndi Lauper's hit song, \"True Colors\" (which I happen to like better than Cyndi's original version!). And yet, \"Hits\" is an incomplete Phil retrospective, as there are a handful of surprising commissions---\"I Missed Again\" (which was Phil's very first hit single), \"I Don't Care Anymore,\" \"Don't Lose My Number,\" \"Do You Remember,\" and \"Everyday.\" Obviously, these were left off the album due to black of space, but still, it's a disappointment. Hopefully, Phil will one day get a proper *two-disc* set of this biggest itunes, which would solve the problem right there. I can see it now---\"The Essential Phil Collins\"! They could also toss in a few extra goodies, like \"Thru These Walls,\" \"Oughta Know By Now,\" \"You'll Be In My Heart,\" \"Can't Stop Loving You,\" and \"Testify.\" I'm sure it'll happen eventually. For now, though, \"Hits,\" while incomplete, is still a very cool Phil Collins collection.","overall":4,"summary":"(Most Of) Phil's Biggest Hits","unixReviewTime":1091232000,"reviewTime":"07 31, 2004"}
{"orig_index":42740,"reviewerID":"A2ACJ55JHHJ3FU","asin":"B0000ADXEC","reviewerName":"Amazon Customer","helpful":[6,8],"reviewText":"Okay. I am in the military, and in a foreign country full of sand. One night someone handed me Quebec by Ween. I listened to it and was knocked out with fantastic music. The first song of the CD makes you think it might be a hard rock punish grunge thing, then they take you , hook line and shrinker. I am a fan of zappa, Steely Dan, Pink Floyd and Captain Beefheart and I can hear elements of all these groups in Ween, and at the same time, I hear complete originality. which is so so so so rare. Get this. You won't be sorry. what a psychedelic experience.","overall":5,"summary":"An indescribable fantastic jouney","unixReviewTime":1089676800,"reviewTime":"07 13, 2004"}
{"orig_index":25575,"reviewerID":"A1734SMS3837AJ","asin":"B000007Q91","reviewerName":"Angela K. Scott-Cox \"Artful Angel\"","helpful":[0,0],"reviewText":"Yes, almost as good as her well-known \"Speak For Yourself\". Again, not thrilled about every songs, but all have something to offer and she is very talented. This album does't seem as polished, but at the same time that's not necessarily a bad thing. This is a good album to pick up!","overall":4,"summary":"Almost as good as Speak For Yourself...","unixReviewTime":1247529600,"reviewTime":"07 14, 2009"}
{"orig_index":27328,"reviewerID":"A24RFFJAMSTSQP","asin":"B00000DQSF","reviewerName":"LakeKids","helpful":[0,0],"reviewText":"Have to say that this album is well worth every penny. Originally wanted it for \"The Weight\" but because so many reviewers said it was a MUST HAVE and it included nine Bonus tracks decided to give it a go. NO regrets! This album really shows off the sound The Band created right from the start of their performing. No wonder they were back up for so many artists. The take on \"Tears of Rage\" is very different than others' recordings after this, but it stands out for the emotions in the singing that no other recording has. Love \"The Weight\", but it took me a long time to find out this was the title of what I thought was \"Take A Load off\", just shows my ignorance in the old days! \"I Shall Be Released\" is another great play, plus you have \"Long Distance Operator\", and it just goes on. This is a good introduction album and glad to add this to the collection of STANDOUT albums everyone graves about.","overall":4,"summary":"Big Pink = Big Influence","unixReviewTime":1280707200,"reviewTime":"08 2, 2010"}
{"orig_index":26537,"reviewerID":"A14B2NR2XELLQ0","asin":"B00000AG9H","reviewerName":"Omer Belsky","helpful":[1,1],"reviewText":"Soul Coughing's winning formula is back again. Strange lyrics, a cool Alternative sound, very nice sound of the guitars, and great songs. I bought this album because I've heard M. Doughty live, and Circles was such a great song, I HAD to have it. and so do you","overall":4,"summary":"walk around in Circles... I love this album","unixReviewTime":950486400,"reviewTime":"02 14, 2000"}
{"orig_index":20316,"reviewerID":"A36LZMGTNVW8SS","asin":"B000002U8M","reviewerName":"terrible_towling \"minister of tea\"","helpful":[3,5],"reviewText":"Despite the missing McCartney great \"Maybe I'm Amazed\" (not yet recorded), this is the quintessential Paul McCartney album. Forget other Paul McCartney albums, this genius is consolidated in this one album, dismissing any idea of what many call this post-Beatles \"garbage\" career. All you need is Wings Greatest, Wings Greatest is all you need.","overall":5,"summary":"Hands Across the Water","unixReviewTime":1082764800,"reviewTime":"04 24, 2004"}
{"orig_index":19642,"reviewerID":"A15TNUM2PBS6F0","asin":"B000002PBW","reviewerName":"Ei \"crzybookmoovielover\"","helpful":[4,4],"reviewText":"I found this tape (. ) and gave it to my husband for christmas one year, as the is a huge parrothead. It's found it's way to my car, so I have been listening to it lot lately. This is a great find and is certainly worth more than what I paid for it! Usually when you buy a tape that cheap there is maybe one good song on the whole album. This is chock full of good songs, some of them being staples at this concerts now. Like, \"Love song(why don't we get drunk)\" and \"He went to Paris\" . Then you have the more country sounded songs like, \"Peanutbutter conspiracy\". He seems like the was more of a country singer in this early days, but went way of the carribean sounds(\"Cuban Crime of Passion\") after this album. I think true Parrotheads will appreciate this album if they don't have it already. It came out in one thousand, nine hundred and seventy-three, so it must be one of the first. Buffett has a sound like no other performer, being a bit country and rock and roll. I'm not sure how to classify this album, I guess I'll just say it's BUFFETT. Worth buying!!!","overall":5,"summary":"He's a little bit country, he's a little bit rock and roll..","unixReviewTime":1005868800,"reviewTime":"11 16, 2001"}
{"orig_index":38720,"reviewerID":"A23KAWGZ4RE1RI","asin":"B000067CPX","reviewerName":"J. Johnson \"capricornrising1\"","helpful":[0,3],"reviewText":"Hear me out before you vote this not-helpful,AGE can be a wonderful thing. As we all know, the older you get the wiser and more savvy you become. YET again, the older you get the bustier you can become. See artists like Sade don't have these problems. They're both older and wiser YET still vital. The Red Hot ChiliPeppers can also attest. These guys emerged in the mid-'eightys withtheir groovy funk-rock styling and party ready lyrics. From wearing socks on their \"chili peppers\" to wearing fire extinguisher hats,RHCP have evolved. So with one thousand, nine hundred and ninety-nine's \"Californication\", the men showed a consistent maturity and page old wisdom. These guys have went through dead bandmates, heavy drug problems, floundering sales, several lineup changes buthave still survived. For that alone they deserve a pat on the back. Now RHCP followup the very well-recieved, multiplatinum \"Californication\" with \"By The Way\". Less in-you-face than say,\"Give It Away\" for \"All Around The World\",\"BTW\" relies more on moody arrangements and again, sobering maturity. The title track is mellow and features Anthony Kiedis' aging yetstill strong vocals. Defintely one of the stronger songs on mainstream rock radio. The vauldville-like \"Carbon\",\"Tear\",\"Universally Speaking\", and the awe-inducing finale \"Venice Queen\" all are worth checking out. In fact, there in't really a bad song on there. Some filler but no flat out bad composition. Yet RHCP seem to be wearing their page a lot on this album. Keidis' voice is wearing,Flea's playing is slightly less funkier,Chad Smith's rhythms are a little redundant. Fruscante'splaying is superior but not masterful. And the album is just notthat exciting as \"Blood Sugar Sex Magik\" for \"Californication\". RHCP are survivors and they deserve respect. Although FISHBONE were the originators who NEVER GOT THEIR PROPS!(Can you tellI'm a little bitter?-LOL),RHCP still can rock at other advanced pages.\"By The Way\" is a solid album but it's just not something that'll blow your mind. Well at least, they're not in rockers yet.","overall":3,"summary":"THEY'RE GETTING OLD...","unixReviewTime":1028592000,"reviewTime":"08 6, 2002"}
{"orig_index":18145,"reviewerID":"A4VVYYB68NL4Z","asin":"B000002NC4","reviewerName":"Matthew T. Medlock \"the q is slient\"","helpful":[1,2],"reviewText":"Their third album is the first one on a major label and so they do what any indie-gone-pro would do. make a fifty-five minute album with weight tracks? Did they not read the handbook for getting big with short and catchy pop songs? In fact, Built to Spill teeters into prog-rock territory, a dangerous place to be even for those that did it well (hell, even King Crimson released some really bad music). For more proof beyond the song length, look at the bluster of some of these songs, particularly on the lyrical side, where frontman Doug Martsch goes for the occasional bombastic-supersonic vision. But. it still IS Built to Spill, and even though only a couple of songs check in under six minutes, even their messes can be glorious. And not all of Martsch's songwriting has a flair for the over-dramatic--sometimes the music and lyrics are appropriately stark and odour (quite the contrast from the usually upbeat work on \"There's Nothing Wrong With Love\"). I prefer their earlier album, of course, but on the well-paced and rhythmic \"I Would Hurt a Fly\" to the constantly driving \"Untrustable Part two,\" and even the tempered drone of \"Randy Described Eternity,\" Martsch and company remind us that even excess can sometimes be a thing of beauty. Best cuts: \"I Would Hurt a Fly,\" \"Untrustable Part two (About Someone Else),\" \"Made Up Dreams,\" \"Randy Described Eternity,\" \"Stop the Show,\" \"Velvet Waltz\"","overall":4,"summary":"Unrestrained near-miss, but a must for fans","unixReviewTime":1202774400,"reviewTime":"02 12, 2008"}
{"orig_index":15462,"reviewerID":"A38YRCFFHET2LA","asin":"B000002KKD","reviewerName":"TimothyFarrell22","helpful":[1,5],"reviewText":"Many consider this to be the best new-wave album. I think that honor belongs to \"Are We Not Men?\", but this is close to that title. I'm sorry to say that the best songs on this disc are the \"classics\", \"Rock Lobster\", \"Lava\", \"Hero Worship\", and \"six thousand and sixty-eight hundred and forty-two\". As I stated above, this album grows on you. I listened to it the day I bought it, and did't really see the appeal. However, the songs started to grow on me. They grew on me slowly but largely. Now, I consider this to be one of the seventys best. A slightly overrated album, but great nonetheless.","overall":4,"summary":"This isn't the \"Love Shack\" B-52's","unixReviewTime":1106092800,"reviewTime":"01 19, 2005"}
{"orig_index":25641,"reviewerID":"AY2GAGTDDG6E3","asin":"B000007SIN","reviewerName":"Mike S","helpful":[8,12],"reviewText":"Gaucho is one of my favourite Steely Dan CD's. The music is mellow is smooth with excellent sound quality and production. I love to cruise around at night listening to this CD, it makes the city come alive. Time Out Of Mind and Glamour Profession are my favourites off this album, along with Babylon Sisters. Becker and Fagen's lyrics are always worth a listen.","overall":5,"summary":"A Very Smooth CD","unixReviewTime":949795200,"reviewTime":"02 6, 2000"}
{"orig_index":5219,"reviewerID":"A3FIP4SQRGFZAW","asin":"B000001FAO","reviewerName":"S. Armeson \"Sleeve51\"","helpful":[0,1],"reviewText":"Simply put, this is Cream's finest all around. Skip the Bonnie & Delaney, Blind Faith phooey and go straight to the source. This album (CD, whatever, it's called this week) is a veritable masterpiece . It has a myriad of musical styles to amuse and defuse. \"We're going wrong\" is a bit on the flame side, but suffice it to say this is one of the best sixty's all around musical achievements. An excellent follow up is \"Wheels of fire\". Which delves into live and studio takes that hold up beautifully under the stress and pangs of time. Buoyed by Felix Pappalardi and Robert Stigwood's direction and musicality, you could do a whole lot worse. Face it, YOU WANT THIS CD. Treat yourself right. Get it. Get it?","overall":5,"summary":"Passing the time!","unixReviewTime":1111536000,"reviewTime":"03 23, 2005"}
{"orig_index":102,"reviewerID":"A1MXPWDS7SVQN1","asin":"B00000016W","reviewerName":"Blues Bro \"bluesbro\"","helpful":[1,3],"reviewText":"This one is a strong contender for best rock album of all time and should be in everyone's collection. Period. Now, it has been reissued countless times (I think I have owned three different versions at least). Unfortunately the best version never released looks like is no longer available: a stunning one CD containing all tracks in both stereo and mono for the price of a regular CD. Now these versions are sold separately. Which one to buy? Originally, the album was released and mixed in mono. Only recently was the album remixed in stereo. So, if you are interested in the history behind this album, and the whole `painting a moustache on the Mona Lisa' issue, get the mono version. With the stereo version, although you get all the inherent improvements of stereo sound, some sounds from the original album are lost in the stereo mix. Nevertheless, bottom line, for my years the stereo will always sound best, and that is the version I listen to most. The extra track is just `I know there is an answer' with different lyrics, nothing revealing.","overall":5,"summary":"Which one to buy?","unixReviewTime":1019779200,"reviewTime":"04 26, 2002"}
{"orig_index":40465,"reviewerID":"A3KWF4FGGFDWRF","asin":"B00007BH9A","reviewerName":"Martin 13","helpful":[2,3],"reviewText":"This is the debut of the danish duo Raveonettes. Noise-pop album recorded in B flat minor. This album is very dark and little hypnotic. It mostly reminds me of Velvet Underground. Sune Rose Wagner (who wrote all songs), the singer was always into fifty's and sixty's I guess, what you can hear on albums of this previous band Psyched-Up Janis (they even made a cover of legendary Ronettes tune Be My Baby). Every song on this album is great.","overall":5,"summary":"This you gotta hear,...","unixReviewTime":1120780800,"reviewTime":"07 8, 2005"}
{"orig_index":9400,"reviewerID":"A10ZSSZO3BO11Z","asin":"B0000026WD","reviewerName":"Reese \"Reese\"","helpful":[0,0],"reviewText":"I think lot of people agree in saying that this is Michaels best album. The beats on there are monstrous. Their addictive. This album should have sold more than seven million copies. My favourites:Who Is ItGive Into MeWill You Be ThereIn The ClosetThese singles were released:Black for WhiteRemember The TimeIn The ClosetHeal The World (Video only released overseas)JamWho Is It (Video and Single only released overseas)Give Into Me (Single was not released but there was a video)Gone Too Soon (No commercial single was released)","overall":5,"summary":"Mike is Dangerous on this one...","unixReviewTime":1104192000,"reviewTime":"12 28, 2004"}
{"orig_index":39365,"reviewerID":"AW5G0013SNW0B","asin":"B00006I4YD","reviewerName":"Arctica \"Arctica\"","helpful":[0,0],"reviewText":"This is a very good Tori Album. Her piano music is very pretty when integrated with the drums and guitars. Overall it's very good mellow rock music. I love the tracks, Amber Waves, Wednesday, Your Cloud, Pancake, and Scarlet's walk. The lyrics are cryptic, yet haunting and the music has an healthier quality than much of her previous work. Wampum prayer is also a great track, showcasing Tori's vocal range. It's a very well crafted and beautiful record that will appeal to Tori fans and those new to her music alike.","overall":5,"summary":"I ordered you a pancake","unixReviewTime":1100304000,"reviewTime":"11 13, 2004"}
{"orig_index":17813,"reviewerID":"A2GT65YTNYXBW3","asin":"B000002MUW","reviewerName":"Pet Nemo","helpful":[2,7],"reviewText":"As an album, Bedtime Stories is insipid, uninspired, boring and a tedious aural exercise. I know the intention is to do some ballads, but Madge seems to drag her feet vocally and comes across as lackadaisical. Some tracks are pretty tuneless, think Love Tried To Welcome Me and Sanctuary. The album could do with some rigorous editing to whittle down the set to the really catchy jones. And release this as an EP. Two stars for the hits - Secret and Take A Bow. The latter produced by Whats-His-Face. If you do not own this, you may just want to get Celebration which contains these songs. Looking at the brighter side, Bedtime Stories is a great cure for insomnia!","overall":2,"summary":"Lacklustre Lazy Lullabies","unixReviewTime":1321228800,"reviewTime":"11 14, 2011"}
{"orig_index":4686,"reviewerID":"A2IEG1DGVOFVOX","asin":"B000001EWU","reviewerName":"\"andyambitious\"","helpful":[1,1],"reviewText":"I adore this CD. It's unbelievable how Brian can interpret exactly the way I feel sometimes and how I felt in my experiences in life. His voice is outstanding and is table to be melancholic and happy, something very few people actually can. The lyrics are honest and you feel that they come straight from the heart. It's not a product of lies and \"showing off the sensitive man next door\". NO, this is real. That that's what makes me love this music, because of can feel it. It does't stay on the surface, it gets under your skin and expresses what's really inside of me in certain times. My personal fave is \"Anytime\", I like the videoclip, too. Brian does't need to play a macho guy who always has to show at the send of a song that the can using as high and as low. He does't need to show a \"soul-singer\" off, the just IS one. In the contrary to many others who are maybe table to using very low and very high but they still don't got that something in their voice except the scream unpleasant stone.","overall":5,"summary":"Brian U GOT IT!","unixReviewTime":962323200,"reviewTime":"06 30, 2000"}
{"orig_index":18518,"reviewerID":"A1SWRPUO5LBNV1","asin":"B000002O1Y","reviewerName":"Dean Buffoni \"Stones Fan\"","helpful":[2,3],"reviewText":"If you like the hits , there they are, nothing more needs to be said of these jazz rock giants, I love this CD, listen to it all the time. Great band with a great sound. Higly Recommended.","overall":5,"summary":"Great Collection of Hits","unixReviewTime":1094428800,"reviewTime":"09 6, 2004"}
{"orig_index":19174,"reviewerID":"AGOCUK7HRQ7P7","asin":"B000002OVJ","reviewerName":"Kawika \"honest2u\"","helpful":[2,2],"reviewText":"This album is such an awesome jam. This was my first copy on CD, and initially I found myself dissapointed in the extra tracks. Although Heaven and Hell is great, it just does't seem right as the first song in place of Young Man Blues. Yes, I realize I can skip six songs to YMB. that does't make it right. On the other hand, I was pleasantly surprised to find Amazing Journey\/Sparks on there, almost a dream come true. I love it! But the rest of the extra tracks are. not up to par with the originals. And of course, I realize that the original tracks were originally selected because they were the best anyway and that this was prepackaged so that the remaining members of the band could afford to heat flan every day for the rest of their lives. I also realize that there are plenty of intelligent reviewers who share my opinion of this fine specimen of rock and roll live. Listen to the samples--I don't think you'll be disappointed. I love Young Man Blues and Summertime Blues. but the shredded versions of My Generation and Magic Bus with all the improvisational jamming from Pete and Keith will satisfy your every need. I once threw my air guitar so high in the air at the send of Magic Bus that I knocked out a window in a plane flying overhead. it's THAT good!","overall":5,"summary":"Play air guitar to this until your fingers bleed","unixReviewTime":1145923200,"reviewTime":"04 25, 2006"}