{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"It's impossible listen to Pink Moon without tears in the eyes. Drake's would be dead months later and music would be in the listeners minds forever. But the sound made by that twenty-five years-old englishman with this words and single guitar remains stronger than poetry, than VW commercials (that I did't and I won't see there in Brazil), than all the simple things. This disc is a statement of life and how big it can be, Drake is saying death is possible. And only someone who knew the life can say it.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":891,"reviewerID":"ABOSS65WG9EZV","asin":"B00000064G","reviewerName":"Carlos Eduardo \"Carlos E. F. Lima\"","helpful":[0,0],"reviewText":"It is impossible to hear Pink Moon without tears in your eyes. Drakes would be dead months later and music would forever be on the minds of the listener. But the sound that the 25-year-old Englishman makes with these words and a single guitar stays stronger than poetry, than VW commercials (which I haven't seen and won't see there in Brazil), than all the simple things. This disc is a statement of life and how big it can be, Drake says death is possible. And only someone who knew life can say it.","overall":5,"summary":"25 Minutes To Heaven","unixReviewTime":954979200,"reviewTime":"04 6, 2000"}
{"orig_index":2937,"reviewerID":"AXWHRGDAA8BZD","asin":"B000001A5X","reviewerName":"N. Jackson","helpful":[7,7],"reviewText":"Ok This man was so on point, even in the seventy's!!! it is so unfortunate that the issues the so vividly describes are still affecting the Black Community. Marvin was a Pioneer!!! If you listen the beat and lyrics of Inner City Blues. it tells it all! What a shame we could not take heed to this blatant call for Change in the seventy's that now in two thousand and six it even worse!","overall":5,"summary":"I love this Album!","unixReviewTime":1150070400,"reviewTime":"06 12, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"Looking for a greatest hit album by Bon Jovi? This is it. His fanatic fans may want you to buy everything they made, but I don't have the will to do that. I especially like the guitar whaling and talking in the remixed \"Livin on a Prayer\". Brought back some fond memories of dancing at clubs. It is getting a fair amount of radio play lately. Anyway if you like seventys, eightys, and ninetys music, no collection is complete without some Bon Jovi. I recommend this CD to fill in that slot. Granted it does't have all this best work, but it has several good jones and the price is definitely right. You are sure to find a couple itunes that will fill that Bon Jovi appetite.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4042,"reviewerID":"A1GHUN5HXMHZ89","asin":"B000001EC1","reviewerName":"C. A. Luster \"The Rook\"","helpful":[2,2],"reviewText":"Looking for a greatest hit album by Bon Jovi? That's it. His fanatical fans may want you to buy everything they made, but I don't have the will. I especially like the guitar whaling and the conversations in the remixed \"Livin on a Prayer\". Has brought back some fond memories of dancing in clubs. It's been getting quite a lot of radio drama lately. However, if you like music from the seventies, eighties and nineties, no collection is complete without Bon Jovi. I recommend this CD to fill in this slot. Granted, it doesn't do all of this best work, but it has several good jones and the price is definitely okay. You're sure to find a few iTunes to satisfy your Bon Jovi appetite.","overall":5,"summary":"Best of Bon Jovi","unixReviewTime":1138233600,"reviewTime":"01 26, 2006"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"one thousand, nine hundred and seventy's \"Elton John\" is a terrific album that announced the dawning of a new decade's biggest star in neon flights. Its first track, \"Your Song,\" came out of absolutely nowhere that December to become Elton John's first Top Ten hit on the U. S. Billboard charts, speaking at #eight, and even today it fills the speakers of a car stereo for a living room with the assurance of an old friend. How nice it is to hear that meandering yet spot-on piano tinkering, alongside an atypically humble and unpretentious lyric from one Bernie Taupin: \"If I was a sculptor\/But then again no\/Or a man who makes potions\/For a travelling show.\" It's enough to forgive the irritating harpsichord of the next number, \"I Need You To Turn To.\"But only \"First Episode At Hienton\" after that is less that sparkling, and so much else about Elton's first big album (after the shakedown cruise of \"Empty Sky\") is brilliant. It's not the whitaker U. S. audiences would so soon grow accustomed to, singing about alligators and astronauts so winningly, but a thoughtful musical craftsman who was still experimenting with what mass audiences might let him get away with.\"Take Me To The Pilot\" is the one rocker, and a good one, better than \"Saturday Night's Alright For Fighting\" if not some of this other big hits of later years. Those who love Elton the whitaker will probably also treasure (as I do) such less heralded numbers as the Rolling Stones' tribute \"No Shoe Strings On Louise\" (Mick Jagger vocal mannerisms circa \"Let It Bleed\" abound), the mesquite-soaked \"Border Song,\" for \"The Greatest Discovery,\" one of the great love songs never sung, though with a clever twist that only renders the actual subject matter more affecting. How often does one hear a song about the arrival of a younger sibling? (Well, there's \"Lonely Boy\" by Andrew Gold, but this is much more positive.)I can't get behind Elton there the way I can with \"Don't Shoot Me, I'm Only The Piano Player\" for \"Captain Fantastic And The Brown Dirt Cowboy,\" though it's probably a better though less representative album than at least the first of those. It's not Elton the way you and I would come to know him in a very short time, but an interesting variation that regarded lyrical depth as important as tuneful variation. The former Mr. Reg Dwight still had three more albums to go, including a live one, before nailing down this trademark winning piano-popster sound, but this was this first hurrah, and a big one, ironically so given it was so removed from the glam image the would so soon cultivate. If you are listening to Elton's hits and liking them, and want something else to turn to, I'd suggest \"Captain Fantastic,\" \"Tumbleweed Connection,\" and this album, which combined probably will leave you with no more than three for four key songs you've already heard and a number you bought to give a listen to. If you like any of the music Elton made through one thousand, nine hundred and seventy-six, that is to say the best the never did, you lowe it to yourself to give this first hit record a spin. It still kicks more than thirty years on.","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":4200,"reviewerID":"A1NT7ED5TATUAM","asin":"B000001EG6","reviewerName":"Bill Slocum","helpful":[1,1],"reviewText":"One thousand nine hundred and seventy \"Elton John\" is a great album heralding the dawn of the greatest neon star of a new decade. His first track, \"Your Song,\" came out of nowhere in December and became Elton John's first top ten hit on the US Billboard chart, where it hit number 8, and still fills the speakers of a car radio for today a living room with the insurance of an old friend. How nice it is to hear this meandering and yet accurate piano tinkering, next to an atypically modest and unpretentious text by a Bernie Taupin: \"If I were a sculptor \/ But then no again \/ Or a man who makes magic potions \/ For a traveling exhibition. \" It is enough to forgive the irritating harpsichord the next number \"I Need You To Turn To\" from \"Empty Sky\") is brilliant. It's not the Whitaker that U.S. audiences would get used to so quickly and sing so engagingly about alligators and astronauts, but rather a thoughtful musical craftsman who was still experimenting with what the masses could get away with, a rocker, and a good one , better than \"Saturday Night's Alright For Fighting\" if not some of those other big hits of the later years. Those who love Elton the Whitaker will likely (like me) appreciate lesser-known numbers like the Rolling Stones tribute \"No Shoe Strings On Louise\" (Mick Jagger's \"Let It Bleed\" vocal mannerisms abound), the mesquite-soaked ones \"Border Song\" for \"The Greatest Discovery\", one of the great love songs that was never sung, but with a clever twist that only makes the subject matter even more touching. How often do you hear a song about the arrival of a younger sibling? (Well, there's \"Lonely Boy\" by Andrew Gold, but that's a lot more positive.) I can't stand behind Elton like I did with \"Don't Shoot Me, I'm Only The Piano Player\" for \"Captain Fantastic And.\" The Brown Dirt Cowboy \"although it's probably a better, if less representative, album than at least the first of these. It's not Elton as you and I would get to know him in no time, but an interesting variation in which lyrical depth was just as important as melodic variation. Former Mr. Reg Dwight had three more albums to go, including a live one, before nailing that award-winning piano-popster sound, but this was that first hurray, and a big one, ironically so distant that it got so far removed was the glamorous image that would soon be cultivated. If you listen to Elton's hits and like them and want to turn to something else, I would suggest \"Captain Fantastic\", \"Tumbleweed Connection\" and this album, which together probably leaves no more than three for four key songs that you've already heard, and a number you bought to listen to. If you like the music Elton made through one thousand nine hundred and seventy-six, the best that never was, then make it up to yourself to make this first hit record. It still occurs more than thirty years later.","overall":4,"summary":"Elton's First Whiff Of Greatness","unixReviewTime":1074902400,"reviewTime":"01 24, 2004"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the ultimate master of Funk music. Any of the group's music is great. This is just my most recent addition to my CD collection. If you like Funk you'll love Parliament-Funkadelic.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":5270,"reviewerID":"A1EUYZPLFU211D","asin":"B000001FCK","reviewerName":"bill","helpful":[1,1],"reviewText":"Parliament-Funkadelic is the ultimate master of funk music. All of the group's music is great. This is just my newest addition to my CD collection. If you like funk, you will love Parliament-Funkadelic.","overall":5,"summary":"Ultimate Funk","unixReviewTime":1396396800,"reviewTime":"04 2, 2014"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"When released at the send of one thousand, nine hundred and seventy-one, \"Gonna Take A Miracle\" was a novelty in that it was expected that serious \"artists\" wrote their own material. Laura Nyro, however, wanted to pay tribute to her soul roots after running out of her own songs to record after the wonderful, but quiet and consequently very challengingChristmas And The Beads Of Sweatthe previous year. The result was \"Gonna Take A Miracle\", an album of covers from the Motown and Brill Building soul eras recorded with vocal group LaBelle (Patti LaBelle, Nona Hendyx and Sarah Dash). In general, the huge hooks and frantic tempo changes ofNew York Tendaberrycould never be seen there, nor can the amazingly soft delicacy ofChristmas And The Beads Of Sweat. Instead, the stone was impressionistic in nature yet still intense and leaving one with a sense of amazement, especially in the power of the vocals in the magical medley \"Monkey Time\/Dancing In The Street\" and \"Jimmy Mack\", where Nyro's superb vocal was truly breathtaking. The impressionistic stone and the absence of Nyro's own hyperfeminine lyrical style makes \"Gonna Take A Miracle\" the most palatable Nyro for the non-cultist (as can be clearly seen in many album guides). Yet, its impressionistic stone was also out of place with the development of heavy metal that was taking place at the time \"Gonna Take A Miracle\" came out. At the same time, the stone managed to retain the sheer brilliance ofNew York TendaberryandChristmas And The Beads Of Sweatand does not go back to the rather thinFirst Songs. The beautiful, atmospheric ballad \"The Wind\" contained the only traces of the extraordinary softness ofChristmas And The Beads Of Sweat, and \"Desiree\", though more accessible, was equally beautiful. Apart from the a capella opener \"I Met Him On A Sunday\", the rest of \"Gonna Take A Miracle\" was the most accessible work Nyro never did, consisting of upbeat, joyful soul-pop songs such as \"Nowhere To Run\" (where LaBelle themselves take on lead vocals) and \"You've Really Got A Hold On Me\". Generally Nyro's piano was not nearly so prominent as on her previous three albums of original material, but she still showed her skill in the sparse playing of \"The Wind\" and \"Spanish Harlem\" (which was the origin of one of her line in the amazing \"Map To The Treasure\" off her previous album). LaBelle themselves added superb harmony vocals throughout the album and managed to match Nyro's angelic voice throughout without missing a beat - surprising since the album was recorded from first takes due to shortage of time - though Nyro did tour extensively to support it before retiring for several years. The impressionism and vocal styling of \"Gonna Take A Miracle\" were an inspiration in later years for such artists as the Roches and even recalls ESG's wonderfulA South Bronx Story. Nonetheless, despite not selling as well as its accessibility suggests it bought to have (perhaps due to the fact that a covers' album was too novel for many back in one thousand, nine hundred and seventy-two), \"Gonna Take A Miracle\" remains a good introduction to Nyro for the uninitiated - if one cannot handle this, one would have no hope of getting through Nyro's albums of original material with their complex, hyperfeminine lyrical style.","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":6943,"reviewerID":"AKNSC7IXWEYLA","asin":"B0000024XY","reviewerName":"mianfei","helpful":[2,2],"reviewText":"When \"Gonna Take A Miracle\" was released at one thousand nine hundred and seventy-one, it was a novelty in that it was expected that serious \"artists\" would write their own material. However, Laura Nyro wanted to pay tribute to her soul roots after she couldn't record any more songs of her own after the wonderful, but calm and therefore very challenging Christmas And The Beads Of Sweat last year. The result was \"Gonna Take A Miracle\", an album with covers from the Motown and Brill Building soul era, recorded with the vocal group LaBelle (Patti LaBelle, Nona Hendyx and Sarah Dash). In general, the huge hooks and frantic changes in pace of New York Tendaberry were never seen there, nor was the amazingly soft delicacy of Christmas And The Beads Of Sweat. Instead, the stone was impressionistic in nature but nonetheless intense and left a feeling of amazement, particularly at the power of the vocals in the magical medley \"Monkey Time \/ Dancing In The Street\" and \"Jimmy Mack,\" where Nyro's superb voice was truly breathtaking. The impressionistic stone and the lack of Nyro's own hyperfeminine lyrical style make \"Gonna Take A Miracle\" the tastiest Nyro for non-cultists (as can be clearly seen in many album guides). However, his impressionist stone was also out of place with the development of heavy metal that was happening around the time \"Gonna Take A Miracle\" was coming out. At the same time, the stone has retained the sheer brilliance of New York Tendaberry and Christmas And The Beads Of Sweater and does not go back to the rather thin First Songs. The beautiful, atmospheric ballad \"The Wind\" contained the only traces of the extraordinary softness of Christmas And The Beads Of Sweat, and \"Desiree\", though more approachable, was equally beautiful. Aside from the a cappella opener \"I Met Him On A Sunday\", the rest of \"Gonna Take A Miracle\" was the most accessible work Nyro never did, consisting of upbeat, happy soul-pop songs like \"Nowhere To.\" Run \"(where LaBelle does the lead vocals herself) and\" You've Really Got A Hold On Me \". In general, Nyro's piano wasn't nearly as prominent as it was on her previous three albums of original material, but she nonetheless showed her prowess in the sparse playing of \"The Wind\" and \"Spanish Harlem\" (which is the origin of one of her lines in the amazing \"Map To The Treasure \"from their previous album). LaBelle herself added excellent harmony chants to the entire album and managed to consistently surpass Nyro's angelic voice without missing a beat - surprising as the album was recorded from the first takes due to time constraints - although Nyro toured extensively to support it, before retiring for several years. The impressionism and vocal styling of \"Gonna Take A Miracle\" was an inspiration for artists like the Roches in later years, and is even reminiscent of ESG's wonderful A South Bronx story. Still, while it didn't sell as well as its accessibility suggests (perhaps due to the fact that a cover album in one thousand nine hundred and seventy-two was too new for many), \"Gonna Take A Miracle\" remains a good introduction to Nyro for the uninitiated - if you can't handle it, you have no hope of getting through Nyro's albums with original material with their complex, hyper-feminine lyrical style.","overall":5,"summary":"Magical again, and most palatable Nyro for an outsider","unixReviewTime":1038441600,"reviewTime":"11 28, 2002"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"Had this a long time ago on vinyl and just recently replaced it on CD -- WOW! I forgot how landmark this CD is. What a classic. The O'Jays -- along with producers Gamble & Huff and a collection of fabulous songwriters -- had (and have) GUTS to tackle the tough issues through song and verse. A wonderful song, \"This Air I Breath\" has got to be the funkiest song about pollution. You can dance, listen, and think about important issues at the same time! The title track is a legendary ballad -- along with chilling whip sounds -- about slavery. Few people were singing about this back in the day, and today's wrap is lost in horrible songwriting, no singing, bad verse, obscenities, and bad musicianship. Not this stuff, The O'Jays are for real!\"Put Your Hands Together\" in't about clapping, it's about praying for the world to get better. \"For the Love of Money\" in't about being proud of having lots of money, it's about the abuse of money.\"Don't Call Me Brother\" is about how people lie and deceive others . a continuance of \"Backstabbers.\"This seems like an underrated album to me as the legendary \"Backstabbers\" receives its just due as one of the greatest musical pieces of all time, but this one is right there with it. This is a classic and a must-buy for all music lovers.","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7056,"reviewerID":"A1IM23VVIS7CFL","asin":"B000002510","reviewerName":"Timothy R. Sullivan","helpful":[4,4],"reviewText":"Replaced this a long time ago on vinyl and only recently on CD - WOW! I forgot how groundbreaking this CD is. What a classic. The O'Jays - along with producers Gamble & Huff and a collection of fabulous songwriters - had (and have) GUTS for tackling the difficult song and verse problems. A wonderful song, \"This Air I Breath\" has to be the funniest song about pollution. You can dance, listen, and think about important topics at the same time! The title track is a legendary ballad - together with chilled whip sounds - about slavery. Few people used to sing about it, and today's wrap is lost in terrible songwriting with no singing, bad verse, profanity, and bad musicality. Not that stuff, the O'Jays are real! \"Put Your Hands Together\" is not about clapping, but about praying for the world to get better. \"For the Love of Money\" is not about being proud of having a lot of money, but about misusing money. \"Don't Call Me Brother\" is about how people lie and deceive others. a sequel to \"Backstabbers\". This seems like an underrated album to me as the legendary \"Backstabbers\" deserves to be one of the greatest pieces of music of all time, but this one is spot on. This is a classic and a must for all music lovers.","overall":5,"summary":"Epic, landmark, and legendary","unixReviewTime":1098662400,"reviewTime":"10 25, 2004"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"Okay I am an Earth,Wind & Fire completist but no kidding-this is got to be the best! Words of mystical, positive affirmations abound,Maurice White's kalimba play is at it's topform. But great, catchy funky grooves such as \"Serpantine Fire\",\"Jupiter\",\"Magic Mind\" and the unforgettable hit \"Fantasy\" areperhapes some of the greatest music of this era, probably never! And the funk-jazz instrumental \"Runnin\" brings everyone togetherfor pop-funk religious ritual that everyone, of every spiritualcreed, can relate to. If your an EWF fan who does't own this albumyet, get it emmediatly; you need it. If your interested in exploringthe groups music for simply tired of today groovy but lyricallynegative R&B, rap, etc-then you'll be at home there as well.","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7459,"reviewerID":"A252HNVAZENVNE","asin":"B0000025AS","reviewerName":"Andre' S Grindle \"Funk Meister\"","helpful":[0,0],"reviewText":"Okay, I'm an Earth, Wind & Fire completist, but no kidding - this has to be the best! There are many mystical, positive affirmations, Maurice White's kalimba playing is at its best. But great, catchy funky grooves like \"Serpantine Fire\", \"Jupiter\", \"Magic Mind\" and the unforgettable hit \"Fantasy\" are perhaps the greatest music of this era, probably never! And the funk-jazz instrumental \"Runnin\" brings everyone together in a religious pop-funk ritual with which everyone, every spiritual belief, can identify. If you're an EWF fan who doesn't own this album yet, get it now; you need it. If you are interested in exploring the group's music for just tired of today's groovy but lyrically negative R&B, rap, etc. then this is your home too.","overall":5,"summary":"Just Plain Hard-To-Beat!","unixReviewTime":1055116800,"reviewTime":"06 9, 2003"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"Unfortunately, I had only heard of her after a commercial she did with her daughter for The Gap. I heard her using and the first thing I thought is, \"I have to find out who that woman is.\"I bought this CD and am so glad I did. Though her voice is much more rich after all these years (as it should be for all real vocalists), her talent is undeniable.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":7529,"reviewerID":"A2057OCR8NKRKY","asin":"B0000025BA","reviewerName":"ghettotechnology","helpful":[0,0],"reviewText":"Unfortunately, I only heard from her after a commercial she did with her daughter for The Gap. I heard her use it and the first thing I thought was, \"I need to find out who this woman is.\" I bought this CD and I am so glad I did. Although her voice is much richer after all these years (as it should be for any real singer), her talent is undeniable.","overall":5,"summary":"Lush and soulful...","unixReviewTime":1081555200,"reviewTime":"04 10, 2004"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"you have probably heard \"Down under\" on the radio and liked it, but not known who played it. Well, if you have heard a song that went \"we come from a land down under. where women glow and men plunder (I think those are actual lyrics)\" then that song is on there. Far from one hit wonders, these guys were table to put out an album chock full of brilliant compositions. It was a career defining album, and was never really surpassed by them afterwards. It is a fun sort of album, just having some fun with great music. They are one of the best bands to come out of Australia, and are well worth your listening if you missed out on them back in the day. Highly recommended eighty's classic, along the lines of Pat Benatar, Cyndi Lauper, The Buggles, and the other cool musicians from that time. I have the original version of this disc, but based on the strength of the normal tracks, I can easily say that the new jones will also be fun and brilliant.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":8356,"reviewerID":"A7JRDNX3WOMTR","asin":"B0000025R3","reviewerName":"tupac wayne gacy \"me\"","helpful":[1,3],"reviewText":"You probably heard \"Down Under\" on the radio and liked it, but don't know who played it. Well, if you heard a song that was called \"We are from a country Down Under. Where women glow and men pillage (I think these are the actual lyrics)\" then this song is there. Far from being a single hit wonder, these guys were ready to bring out an album full of brilliant compositions. It was a career-defining album and has never really been surpassed since. It's a fun type of album, just having fun with great music. They are one of the best bands from Australia and worth listening to if you missed them earlier. Highly recommended 80s classic, based on the example of Pat Benatar, Cyndi Lauper, The Buggles and the other cool musicians from that time. I have the original version of this disc, but due to the strength of the normal tracks, I can easily say the new Jones will be fun and brilliant too.","overall":5,"summary":"who's says 80's music is bad?!","unixReviewTime":1110931200,"reviewTime":"03 16, 2005"}
{"orig_index":9632,"reviewerID":"A2L7SP2QIU0BOH","asin":"B0000027RY","reviewerName":"Mr Joshua","helpful":[0,0],"reviewText":"In my opinion this is better than Black Sunday. Better production and hardcore lyrics. Favorites are Real Estate. This album has for a long time got mad play from me, at home, my car, anywhere I have a chance to listen to music. This is a hiphop classic. If you are a Cypress Hill fan and done have this album you need to take these works of advice and get this.","overall":5,"summary":"BEST CYPRESS HILL ALBUM","unixReviewTime":998352000,"reviewTime":"08 21, 2001"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is Joni's most popular & well known album, with smash classics such as \"Raised On Robbery\", \"Help Me\", & \"Free Man In Paris\". But it's so much more than that. This album touches the soul & makes you want to dance & using along in joy. With beautiful jazz tinges on songs like \"Car on a Hill\" & \"Twisted\", to down & dirty 'seventys rock & roll soul on \"Trouble Child\" & \"Just Like This Train\". This album is as much a historical achievement as it is a simple record of great songs. The annihilating \"The Same Situation\" is one of the most well written songs never. With impossibly brilliant lyrics such as:\"Still I sent up my prayerWondering where it had to goWith heaven full of astronautsAnd the Lord on death rowWhile the millions of this lost and lonely jonesCall out and clamour to be foundCaught in their struggle for higher positionsAnd their search for love that sticks around.\"I can't begin to describe the genius of this record. It will complete your collection perfectly. HIGHLY recommended.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":12412,"reviewerID":"A28QSPI70EMHPT","asin":"B000002GXL","reviewerName":"Anthony \"Unfettered & Alive\"","helpful":[2,2],"reviewText":"\"Court & Spark\" is Joni's most popular and best-known album with smash classics like \"Raised On Robbery\", \"Help Me\" and \"Free Man In Paris\". But it's so much more. This album touches the soul & makes you want to dance & join in. With nice jazz echoes with songs like \"Car on a Hill\" & \"Twisted\", to Down & Dirty '70s Rock'n'Roll Soul with \"Trouble Child\" & \"Just Like This Train\". This album is both a historic achievement and a simple recording of great songs. The devastating \"The Same Situation\" is one of the best-written songs of all time. With incredibly brilliant lyrics like: \"Still I sent up my prayer and wondered where to go With the sky full of astronauts And the Lord on death row While the millions of these lost and lonely Jones call and scream to be found Trapped in their struggle about higher positions and their search for love that lasts. \" I cannot describe the genius of this record. It will complete your collection perfectly. Highly recommended.","overall":5,"summary":"Lush execution & an instant classic.","unixReviewTime":1131840000,"reviewTime":"11 13, 2005"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"A good CD, quite clearly. My favourite is \"Hey Jupiter\" but I love the whole CD. It's much darker and deeper in content than \"Little Earthquakes.\" A clue to listening to this CD is not to analyse what she's saying, don't spoke around in the lyrics to look for something. It won't be there. Listen to enjoy it. I'm sure you will.","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":14310,"reviewerID":"A219AJPHV49WYI","asin":"B000002J88","reviewerName":"Lou","helpful":[2,2],"reviewText":"A good CD, of course. My favorite is \"Hey Jupiter\", but I love the whole CD. It's much darker and deeper in content than \"Little Earthquakes\". A tip when listening to this CD is not to analyze what it says, not to mess around in the lyrics to look for something. It won't be there. Listen to enjoy it. I am sure you will.","overall":5,"summary":"Darker and Deeper...","unixReviewTime":1049328000,"reviewTime":"04 3, 2003"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"OOooh , yeah! Uncontrollable surge is surging. Every time I listen to this CD,I cannot help giggling over those guys who have fire inside them with all their might. They severely criticize and using cabot the modern civilization and corruption of your society. That is, they have a cool perspective towards your way of living. The sound they use is more punish and violent and more intelligent with a distorted and twisted edge. They always whip your years with their savant-garde taste futuristic sound texture.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":15391,"reviewerID":"A3M1091E7F2E19","asin":"B000002KJ1","reviewerName":"Sound Profiler","helpful":[6,7],"reviewText":"Ooooh, yes! An uncontrollable increase rises. Every time I listen to this CD I can't help but giggle at these guys who are on fire with all their might. They criticize and use modern civilization and the corruption of your society in the strongest possible way. That said, they have a cool perspective on your way of life. The sound they use is more punitive and violent and intelligent with a distorted and twisted edge. They always lash your years with their futuristic sound structure.","overall":5,"summary":"Great performance by robotic intelligence","unixReviewTime":1088726400,"reviewTime":"07 2, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"It seems this is Madonna's last great album, well to me at least. On two thousand's MUSIC she stumbled, and two thousand and three's AMERICAN LIFE she plummeted even further into the abyss. On one thousand, nine hundred and ninety-eight, she seems more focused than never before on her music, which is more than I can say about her newer stuff. This was one of the best era's of her career, she truly made a huge comeback and impact with this album. A lot happened between one thousand, nine hundred and ninety-four's BEDTIME STORIES and the release of this album in March of one thousand, nine hundred and ninety-eight. She starred as Evita Peron in EVITA in one thousand, nine hundred and ninety-six, and gave birth to daughter Lourdes in the same year. Did motherhood change Madonna? Yes it did. Working with producer William Orbit, the album has a sonically sweet sound that borrows heavily from electronica without overshadowing the poignant impact of the lyrics. She sings about how she's changed on \"Drowned World\/Substitute For Love\", \"Nothing Really Matters\", and others. \"Swim\" seems to be an epiphany about how she longs to be renewed and whole again. She sings of motherhood on the lullaby-ish \"Little Star\". She tackles past demons about her own mother on \"Mer Girl\", which is haunting and graphic. \"To Have And Not To Hold\" is an excellent ballad, as is \"The Power of Goodbye\". Overall a strong collection of songs from the material from.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":18339,"reviewerID":"A2JAKHFYI88ZX0","asin":"B000002NJS","reviewerName":"Jake Z \"holden84\"","helpful":[2,3],"reviewText":"Es scheint, dass dies Madonnas letztes großartiges Album ist, zumindest für mich. Über zweitausender MUSIK stolperte sie, und zweitausenddreier AMERICAN LIFE stürzte sie noch weiter in den Abgrund. Auf eintausendneunhundertachtundneunzig scheint sie sich mehr denn je auf ihre Musik konzentriert zu haben, was mehr ist, als ich über ihre neueren Sachen sagen kann. Dies war eine der besten Ära ihrer Karriere, sie hat mit diesem Album wirklich ein riesiges Comeback und einen großen Einfluss. Zwischen tausendneunhundertvierundneunzig BEDTIME STORIES und der Veröffentlichung dieses Albums im März eintausendneunhundertachtundneunzig ist viel passiert. Sie spielte als Evita Peron in EVITA in tausendneunhundertsechsundneunzig und brachte im selben Jahr Tochter Lourdes zur Welt. Hat die Mutterschaft Madonna verändert? Ja, tat es. In Zusammenarbeit mit dem Produzenten William Orbit hat das Album einen klanglich süßen Sound, der sich stark an Electronica anlehnt, ohne die ergreifende Wirkung der Texte zu überschatten. Sie singt darüber, wie sie sich auf „Drowned World\/Substitute For Love“, „Nothing Really Matters“ und anderen verändert hat. \"Swim\" scheint eine Offenbarung darüber zu sein, wie sie sich danach sehnt, erneuert und wieder ganz zu werden. Sie singt von der Mutterschaft auf dem Wiegenlied \"Little Star\". In \"Mer Girl\", das eindringlich und anschaulich ist, setzt sie sich mit vergangenen Dämonen über ihre eigene Mutter auseinander. \"To Have And Not To Hold\" ist eine ausgezeichnete Ballade, ebenso wie \"The Power of Goodbye\". Insgesamt eine starke Sammlung von Songs aus dem Material aus.","overall":5,"summary":"Madonna's last great album?","unixReviewTime":1073692800,"reviewTime":"01 10, 2004"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"There is something delectable different about this album, it has a lot of the usual style and slickness of or+b but somehow transcends the mainstream with its special feel. The difference being more than the usual nod at past influences, there is a lovely reincarnated feel of the sixty's about it and though it has echoes of early Stevie Wonder, it stands out also as sassy and sexy ninety's album from a unique and experimental artist.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":20228,"reviewerID":"A13STKDYQO5DQ8","asin":"B000002TWN","reviewerName":"S. Hebbron \"S B H.\"","helpful":[0,0],"reviewText":"There is something deliciously different about this album, it has a lot of the usual style and slickness of or + b, but somehow works with its special feel beyond the mainstream. The difference is more than the usual nod to past influences, there is a nice reincarnated feeling of the sixties and while it has echoes of early Stevie Wonder, it also stands out as a cheeky and sexy nineties album by a unique and experimental artist.","overall":5,"summary":"A great introduction.","unixReviewTime":1111363200,"reviewTime":"03 21, 2005"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"Tru's debut album \"True\" (one thousand, nine hundred and ninety-five) opened some eyes back in the day when No Limit was just another unknown record label to many of us. While Master P had been in the game for a number of years, the combined forces with this brothers Silkk the Shocker and C-Murder and collectively they would release three group albums as Tru. This was the first No Limit release I came across. Executive produced by Master P, guest appearances come from Mia X, King George, Mo. B Dick, Tobin \"TC\" Costen, Big Ed, Uhuru Wright and C-Bo. After the intro, hardcore \"Last Dance\" feat. Mia X starts things off, a track where Tru talk about murder, drugs and life and death. \"That's How We Break Bread\" feat. C-Bo is placed with a killer beat. Tru talk about the hustling life on \"Living that Life\" and \"Another Day, Another Dollar\" has a laid back beat and is about getting money. \"I'm Bout' It, Bout It\" is that track that blew up and made people pay attention to Tru, placed with a sick background beat, this is one of those cuts that became an anthem. My favourite track on this album is \"Ain't No Glock\" a track where C-Murder excels and P drops a nice chorus over an addictive beat. \"Would You Take a Bullet for Your Homie\" feat. Big Ed is another standout track about loyalty and death. The second to last track \"Keep It All Good\" is a nice feel good track to bump. The album ends with Tru giving shutouts to fam, friends, industry peoples and God. I enjoyed lot of the production on this release, and while Tru's lyrical content is limited and there is some skip material, overall they came out well on \"True\" delivering some real standout cuts that still play well many years later.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":22678,"reviewerID":"A2L3WEVFOCA7OY","asin":"B000003B5O","reviewerName":"Done","helpful":[3,3],"reviewText":"Tru's debut album \"True\" (one thousand nine hundred and ninety-five) opened some eyes back when No Limit was just another unknown record label for many of us. While Master P had been in the game for a few years, they joined forces with these brothers Silkk the Shocker and C-Murder and together they released three group albums as Tru. This was the first no limit release I came across. Executive Producer of Master P, guest appearances from Mia X, King George, Mo.B Dick, Tobin \"TC\" Costen, Big Ed, Uhuru Wright and C-Bo. After the intro the hardcore \"Last Dance\" feat. Mia X begins, a track in which Tru talks about murder, drugs, and life and death. \"This is how we break bread\" feat. C-Bo is placed with a killer beat. Tru Talk about the busy life in \"Living that Life\" and \"Another Day, Another Dollar\" has a relaxed beat and is about making money. \"I'm Bout 'It, Bout It\" is that track that blew up and got people interested in Tru, placed with a sick background beat, this is one of those cuts that became an anthem. My favorite track on this album is \"Ain't No Glock\", a track where C-Murder towers above and P drops a nice chorus over an addicting beat. \"Would you take a bullet for your homie\" feat. Big Ed is another standout track about loyalty and death. The penultimate track \"Keep It All Good\" is a nice feel-good track to toast. The album ends with Tru excluding family, friends, industrialists and God. I enjoyed the production of this release a lot, and while Tru's lyrical content is limited and there is some skipped material, they came out well overall on True, and made some really standout edits that still play well many years later.","overall":4,"summary":"Tru- True","unixReviewTime":1073260800,"reviewTime":"01 5, 2004"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"Possibly the greatest Hip-Hop album you've never heard of. easily as significant & as important as \"DJ Shadow's - Endtroducing\", with 'Dr Octagon' (aka legendary wrapper \"Kool Keith\"), who assumes the guise of \"Dr Octagon\" a time travelling alien surgeon, pretending to be a female gynaecologist, and through this pseudonym the plays down some of the most creative, witty, brash, menacing & self-indulgent beats & Rhymes to unparalleled effect, with Kool Keith himself having a very distinctive lyric delivery. seemingly straying out of rhyme frequently and then seemingly managing to pull it all back into a focus and amazingly it all sound completely coherent. Dj Q-Bert handles the turntable duties on this album, and cuts & scratches everything from obscure dialogue (although keeping completely in theme with the 'Dr Octagon' concept) innovative beat construction and deft turntable trickery, and with 'Dan the Automator' casting this sublime leftfield approach to production, this is an album that delights in being quirky, but being a showcase for: the producer (Dan). Dj (Q-Bert) and wrapper (Kool Keith). And with \"Blue Flowers\" a single that went on to become a cult underground Classic, that still beats ninety% of alternative Hip-Hops singles released today hands down. 'Kool Keith', has since distanced himself from this album. complaining that all this subsequent work was being compared to this, and the only new audience the picked up through this album was 'white', irrespective of it's creators 'Negative' views, this is quite possibly one of the finest alternative & influential underground Hip-Hop albums never released.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":23732,"reviewerID":"A1XNPOQDLLJJU3","asin":"B000005AM7","reviewerName":"fetish_2000","helpful":[2,3],"reviewText":"Possibly the best hip hop album you've never heard of. easily as significant and as important as \"DJ Shadow's - Endtroducing\", with \"Dr Octagon\" (aka legendary wrapper \"Kool Keith\") taking the form of \"Dr Octagon\", a time-traveling alien surgeon who pretends to be a female gynecologist and through that pseudonym some of the most creative, funniest, sassy, ​​menacing, and rampant beats and rhymes are downplayed with unprecedented impact, with Kool Keith himself having a very distinctive lyrical performance. seemingly often to get out of the rhyme and then seem to manage to bring everything back into focus, and amazingly everything sounds perfectly coherent. Dj Q-Bert takes on the turntable chores on this album, cutting and scratching everything from obscure dialogues (although they stay entirely on the theme of the 'Dr Octagon' concept), innovative beat construction and nifty turntable tricks, and with ' Dan the Automator 'casting that sublime approach to left field production, this is an album that delights in being whimsical but a showcase for: the producer (Dan). Dj (Q-Bert) and cover sheet (Kool Keith). And with \"Blue Flowers\" a single that became a cult underground classic that still beats 90 percent of the alternative hip-hop singles released today. 'Kool Keith' has since distanced himself from this album. complained that all of this subsequent work was compared to it and the only new audience that was drawn in by this album was \"white\" regardless of the \"negative\" views of its creators, this is probably one of the best alternative and influential underground hip music -Hop albums were never released.","overall":5,"summary":"A Truly Essential Leftfield Hip-Hop Album.....","unixReviewTime":1067472000,"reviewTime":"10 30, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"When first listening to Opeth's first album, I understood why it took them four years to conceive. The whole album beginning with the first track \"In the mist she was standing\" is incredible. The album starts off with a three minute guitar riff that will make any guitar player question this ability. Soon the album will progress into more heavy laden songs and finally into a few instrumentals. I must recommend this to any metal fan around, you will love this album. I often find this to be their best album as well, definitely give this one a look.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":24039,"reviewerID":"A2E2AHXKVRXVHF","asin":"B000005HN6","reviewerName":"Bill Lockhart","helpful":[0,0],"reviewText":"When I first heard Opeth's first album, I understood why it took them four years to comprehend. The whole album that starts with the first track \"In the mist she was stand\" is amazing. The album begins with a three minute guitar riff that will make any guitarist question that ability. Soon the album will transition into heavier songs and eventually a few instrumentals. I have to recommend it to every metal fan, you will love this album. I think this is often their best album too, be sure to check it out.","overall":5,"summary":"Opeth's first album kicks off with a bang","unixReviewTime":1072569600,"reviewTime":"12 28, 2003"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"i always thought that stupa was never that great. i never never listened to this MUSIC! yea, MUSIC.i borrowed this from a friend from school and i loved it so i had to get it. so if rya done have it then get it! to get off the subject, this is to all rock music fans that thinks wrap is not music. how can of call wrap a no talent musicless hobby? all of you or stupid for saying that because all wrap fans can get right back in our face! how can you say its not music?? yet you listen to rock and metal! at least in wrap you can understand what they are saying. all rock says is boroughroughroughrough obi*** boroughroughrough lima slit my wrists and you should too borughroughroughrough. on and on and on and on and on and on and on! so shut up and shut our a$$ up! back to Pac its a great cd! cop it!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27530,"reviewerID":"AJJYB8VYH43PB","asin":"B00000FCBH","reviewerName":"\"blackhawkmuzik\"","helpful":[0,2],"reviewText":"I always thought Stupa was never that great. I've never heard this MUSIC! Yes, MUSIC. I borrowed this from a school friend and I loved it so I had to get it. so when rya is done then get it! To get away from the subject, this is out to any rock music fan who thinks wrap is not music. How can you wrap up a musicless hobby without talent? All of you or stupid for saying that, because all wrap fans can hit us in the face right away! How can you say it's not music? still you listen to rock and metal! At least in abundance you can understand what they are saying. all rock says is boroughroughrough obi *** boroughroughrough lima slit my wrists and you should boroughroughrough too. on and on and on and on and on and on and on! So shut up and shut up our a $$! back to Pac is a great CD! copy it!","overall":5,"summary":"this cd rocks","unixReviewTime":1084060800,"reviewTime":"05 9, 2004"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"Never really liked this cat West coast wrap never really moved me plus the wears a gay sperm. WTF??? that was never ship shop that some wack pimp garbage . one love to try head. real niggas is still watching and listening.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":27648,"reviewerID":"A28FWE3UF0HQ5K","asin":"B00000FDHE","reviewerName":"PRINCE LUV \"QUEENS SOLDIER\"","helpful":[1,24],"reviewText":"This cat never really liked me West Coast Wrap never really moved me and it carries a gay sperm. WTF ??? This has never been a ship store that has some crazy pimp junk. you love to try your head. real niggas still watch and listen.","overall":1,"summary":"32 Year old Queens nigga","unixReviewTime":1121212800,"reviewTime":"07 13, 2005"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"The Russian mystic GI Gurdjieff says people are not born with souls, most people have insignificant souls, and those who do only have souls if they grow them! They grow them through patient work to overcome adversity, perhaps dealing with difficult people, and spain in life. Dido strikes me as someone who has a soul. She seem to write from a place deep within her (as opposed to the superficiality of most pop singers her page). She writes as someone with more experience than her page. Within this place where she writes there seems to be much spain, sadness and melancholy. I don't believe this is a pose. But this area from which she writes communicates for resonates with many listeners. The writing seems like non-fiction, autobiography. It's all out there and it's all exposed. The music there has an underlying wistful sadness, even the more (nearly) upbeat itunes. From a musical perspective, this is good and bad - there is little contrast in tempo and emotional content between many of the songs herein. Dido sings with a soft voice and a somewhat limited pitch range. Musically, a little more contrast would help. But what's there, if it resonates with you, communicates to the heart.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":28297,"reviewerID":"A2ZQXJD7YUIEHB","asin":"B00000IAU3","reviewerName":"rash67","helpful":[6,8],"reviewText":"Russian mystic GI Gurdjieff says that people are not born with souls, most people have insignificant souls, and those who have souls only have souls if they let them grow! You grow it through patient work to overcome adversity, maybe dealing with difficult people and Spain in life. Dido appears to me as someone who has a soul. She seems to be writing from deep inside (in contrast to the superficiality of most pop singers on her side). She writes as someone with more experience than her side. In this place where she writes there seems to be a lot of Spain, sadness and melancholy. I don't think that's a pose. But this area from which she writes meets with a response from many listeners. Writing looks like a non-fiction book, an autobiography. It's all out there and it's all exposed. The music there is based on a wistful sadness, even the (almost) optimistic Itunes. From a musical point of view, this is good and bad - there is little contrast in tempo and emotional content between many of the songs in this. Dido sings with a soft voice and a somewhat limited range. Musically, a little more contrast would help. But what is there, when it resonates with you, communicates the heart.","overall":4,"summary":"Dido communicates to the heart","unixReviewTime":1074124800,"reviewTime":"01 15, 2004"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"I bought four hundred and eleven and I really loved it. However there were a few albums before SHARE MY WORLD AND MARY I did not purchase. I was't really feeling them. This is a dynamic cd from beginning to send. All that I can say*,Sexy,Deep Inside***,Beautiful One*** should be enough to get you hooked. Mary has definitely matured as an artist. This cd is memorable and she takes you on a journey.\"Your Child\" is a true but sad statement of what's going on in lives. \"Give me you** a gem of a song. This cd goes through a myriad of emotions she was going through and the follow up \"No more Drama is evident she was making her peace. Find strength in your moments of weakness. Deep Inside I wish everyone could listen to Rascal Flatts's I'M MOVING ON.***God Bless you Mary, Keep your head up","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":29314,"reviewerID":"A8YDK6N6OHMDA","asin":"B00000JWQH","reviewerName":"\"allseasonscafe\"","helpful":[2,2],"reviewText":"I bought four hundred and eleven and I really liked it. However, before SHARE MY WORLD AND MARY there were a few albums that I didn't buy. I didn't really feel it. This is a dynamic CD from start to finish. All I can say *, Sexy, Deep Inside ***, Beautiful One *** should be enough to get you hooked. Mary has definitely matured as an artist. This CD is unforgettable and it takes you on a journey. \"Your Child\" is a true but sad statement about what is going on in life. \"Give me ** a gem of a song. This CD relives a multitude of emotions she went through, and the sequel\" No more drama is evident that she has made her peace. Find strength in your moments of weakness. Deep Inside I wish everyone could hear Rascal Flatts' I'M MOVING ON soul \", especially with her second album My Life, Mary had established herself as a female artist who was shaped by her duality - the meaning of both musical and lyrical Breadth of their sound as well as their sensitivity and self-confidence. When this was realized the 90s were drawing to a close and there were many conflicting thoughts about the upcoming new millennium - not all of them positive. Romantic, social, political - in relation to interpersonal Relationships were pretty much anything. As with many great artists speaking from their soul, knowing these concerns, Mary decided to translate those ideas into her music. This particular album may indeed be her best of the nineties. And it also established her as someone who would create the space for what was to come in the new millennium, the d This album would feed into it in terms of success. Recorded between East and West Coast studios with an incredible cast of guests ranging from Stevie Wonder, Eric Clapton, Nathan East of the seventies to stars of the coming decades like Babyface and Jam & Lewis, Mary now had the opportunity to see her masterpiece do. And she did. As another reviewer described there, this music is very similar to an auditory painting. The melodies, the rhythms, the grooves - even the way everything is arranged together tell as much, if not more, story than the lyrics. Utilizing the ideas of cinematic funky soul channeled through the most streamlined ship-hop productions of today, this album enabled Mary's stories of love, loss, and personal reflection to flow perfectly with the music. It starts right off with Stevie Wonder's warm synthesizer sounds from \"All That I Can Say,\" her hit single from that album. On the funky \"Sexy\" she again picks up Stevie's \"I Can Help It\" as part of the lyrical chorus. On \"Deep Inside\" she points out the important idea of ​​romance versus being in love when it comes to love affairs with famous people, in this case a piano riff borrowed from Elton John's \"Rocket Man\". And that's just the first three songs. Gap band member Ronnie Wilson delivers the beautifully laced and guitar-based \"Beautiful One\". \"I'm In Love\", \"The Love I Never Had\" and \"No Happy Holidays\" set the standard for Mary in terms of the cinematic soul in which she is once longing, hoping and confronted with rejection: Auf \" Don't Waste Your Time \"Mary and The Queen of Soul really let go of even Aretha, what they call a deeper soul number, and she gets the same emotional note from a duet with K-Ci Hailey on\" Not Lookin '\". While \"Time\", \"Memories\" and \"Don't Waste Your Time\" are a bit more contemporary, they don't disturb the flowing flow of the groove. On \"Your Child\" Mary stands in front of what actually turns out to be a surprisingly informative encounter with the \"Baby Mama\" of her Beaus and learns something on the way. Although this album is more mid-tempo, it ends with the excellent, percussive sophistifunk jam \"Let No Man Put Asunder\", which celebrates the spiritual joy of love itself. From the first song to the last, this turns out to be one of the purest forms of album-length creative expression by Mary J. Blige. In the style of the soul and funk artists of the sixties and seventies, which she admires most, she manages to use her creative talents for this session to bring her conceptual vision directly into harmony with her music. It's a quality that she can't always maintain and that has resulted in a slightly uneven career, much like R. Kelly's. And that's another reason why this album is so wonderful. She manages to reconcile her twin identity - the proud street-oriented ship-hop soul poet with the elegant funky diva - in such a way that you can tell that the differences between these two personalities are literally only superficial. And not to mention the artistic quality, if music can help the listener understand the person making it as well as the music, you know you have something great.","overall":5,"summary":"Find Strength In Your Moments Of Weakness","unixReviewTime":1058572800,"reviewTime":"07 19, 2003"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"I was a little bit sceptical before buying this cd last week. I was't too much of a fan of 'Sugar' which was a big hit a couple years ago, so I at first dismissed System as another [. ] MTV band. Hearing 'Chop Suey!' on the radio over the summer gave me second thoughts. I'm going to give the first cd a well-deserved second chance now. I bought the cd, put it in, then 'Prison Song' hit right away. The opener is probably one of the best, if not the best song on the cd. It's a very hard, upbeat song dealing with the drug war and prison systems. This cd has its fast parts (Prison Song, Deer Dance, X), its slow parts (Chop Suey! ATWA, Aerials), and its weird and kooky parts (Bounce, Shimmy, Psycho) that made them what they were before, and made the fast faster, the slow slower, and the kooky kookier. They experiment a lot of different time signatures and tempo changes, as well as using different levels of guitar distortion. From heavy distortion to clean electric, to acoustic. Serj Tankian switches this vocal setting many times during the cd. often many times during one song. From crooning, to screaming, to singing very very quick (first couple verses of 'Prison Song', chorus of 'Psycho'. He's also penned some very good lyrics which have some truth behind them and are fun to using along with. About every instrument is noteworthy from Daron's guitar, and Shavo's bass, to John's hard and fast drumming. The use of keyboards is also evident on a couple songs ('Chop Suey!', 'Aerials'). The bonus disc includes footage from live shows and backstage. Also a \"Making Of\" feature with more behind the scenes stuff. This is a very diverse cd full of lots of different sounds and tempos. It's refreshing in this sad \"verse, chorus, verse\" to have some different stuff. I'd recommend this to just about anyone who is looking for a break from wrap metal and manufactured \"nu-metal\".","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":30003,"reviewerID":"A2YB1UZYI727N2","asin":"B000021YQV","reviewerName":"Eric Edelin","helpful":[5,6],"reviewText":"I was a little skeptical before buying this CD last week. I wasn't a huge fan of 'Sugar', which was a huge hit a few years ago, so I started with System as another [. ] MTV band. Hearing “Chop Suey!” On the radio over the summer raised my concerns. I am now giving the first CD a well-deserved second chance. I bought the CD, put it in, then it was Prison Song. The opener is probably one of the best, if not the best, songs on the CD. It's a very heavy, upbeat song that deals with the drug war and the prison system. This CD has its fast parts (Prison Song, Deer Dance, X), its slow parts (Chop Suey! ATWA, Aerials) and its weird and crazy parts (Bounce, Shimmy, Psycho) that made them what they were before, making the fast faster, the slow slower, and the crazy even crazier. You will experiment with many different time signatures and tempo changes, as well as with different guitar distortions. From strong distortion to clean electrical to acoustic. Serj Tankian changes this vocal setting several times during the CD. often many times during a song. From singing to screaming to very, very fast singing (first few verses of 'Prison Song', chorus of 'Psycho' instrument is remarkable, from Daron's guitar and Shavo's bass to John's hard and fast drumming. The use of keyboards is also evident on some songs ('Chop Suey!', 'Aerials'). The bonus disc contains recordings from live shows and backstage. Also a \"making of\" feature with more behind the scenes. This is a very varied one CD with lots of different sounds and tempos. It's refreshing to have a few different things in this sad \"verse, chorus, verse\". I would recommend it to anyone looking for a break from wrap metal and manufactured \"nu-metal\".","overall":5,"summary":"Diverse, multifaceted hard rock","unixReviewTime":1001116800,"reviewTime":"09 22, 2001"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"For their third album, The Fifth Dimension made a bit of a departure from their previous two \"conceptional pop\" albums, having more of a commercial feel to it. The album spawned the hit singles \"Sweet Blindness\", \"California Soul\" and \"Stoned Soul Picnic\" and also features many other fine moments. Most notable of the album tracks is \"The Sailboat Song\" which is beautiful in it's simplicity. The flow of the chord changes and vocal harmony add for a definite \"take you away\" feel. This song is probably one of my favourites right up there with \"Never Gonna Be The Same\" from 'Up Up And Away' and \"The Magic Garden\" from 'The Magic Garden'. Other notable mentions are the ballads \"Broken Wing Bird\", and \"Bobbie's Blues\"; the funky \"Lovin' Stew\", and Billy's triumphant \"It'll Never Be The Same Again\".","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32108,"reviewerID":"A3IGS38X9J079E","asin":"B00004SBSS","reviewerName":"yokoboy@hotmail.com","helpful":[2,2],"reviewText":"For their third album, The Fifth Dimension deviated a little from their two previous \"conceptual pop\" albums and had a more commercial feel. The album produced the hit singles \"Sweet Blindness\", \"California Soul\" and \"Stoned Soul Picnic\" and also offers many other wonderful moments. The most notable of the album tracks is \"The Sailboat Song\" which is beautiful in its simplicity. The flow of the chord changes and the vocal harmony create a definite \"take you away\" feeling. This song is probably one of my favorites with \"Never Gonna Be The Same\" from \"Up Up And Away\" and \"The Magic Garden\" from \"The Magic Garden\". Other notable mentions are the ballads \"Broken Wing Bird\" and \"Bobbie's Blues\"; the funky \"Lovin 'Stew\" and Billy's triumphant \"It'll Never Be The Same Again\".","overall":4,"summary":"A slight departure","unixReviewTime":964396800,"reviewTime":"07 24, 2000"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"When Eminem first arrived on the scene, I, like many, did't take him seriously. When I first heard \"My Name Is\", I thought that Vanilla Ice had been resurrected, but that was far from the truth. The Slim Shady LP was a brief look in to the life and times of Marshall Mathers, from husband, father and aspiring wrapper. Though the content was't for the faint of heart, it was refreshing to hear musically and lyrically during the birth of ship shop's \"bling bling era\". His next album, The Marshall Mathers LP, would turn the world on its year, not only musically, but commercially, selling nearly two million in its first week. This is easily Dr. Dre's best production work since Snoop Dogg's undeniable classic, Doggystyle. If you did't like what Em had to say on this first album, stop reading now. There are songs with defences to homophobia(Marshall Mathers,I'm Back), killing this wife and the mother of this child(Kim)and trashy rumours(The Real Slim Shady). Some of pop's music's top dogs get trashed on I'm Back and The Real Slim Shady. There are some standout songs though, like Remember Me with Sticky Fingaz and RBX, Bitch Please II with Dr. Dre, Snoop Dogg,Xzibit and Nate Dogg, and of course, Stan, about a deranged fan who takes this obsession with Slim over the edge. Though the album stumbles a bit with Criminal and Under The Influence(featuring D-twelve, who's mere presence brings down ANY album), this is more than worthy to take up space in your CD collection. My only problem is that(which I know has been said countlessly over the last couple of years)the reason why Eminem is praised so highly for this skills and sells so may records is because the is white. I know that the has had to prove himself twice as hard to get respect, but the has reaped twice the credit, which is unfair to all the great black lyricists that have come before him and influenced him(Big Daddy Kane, Rakim, KRS-ONE, twoPac, The Notorious B. I. G, Kool G. Rap) and the great jones out know(Mos Def, Talib Kweli, Black Thought, Xzibit, Ras Kass, Nas, Jay-Z, Method Man, Redman, Keith Murray, Outkast, etc). It's hilarious to me to hear white rock and pop fans that proclaim this as the greatest wrap album of all time, yet know jack about the music; if they than't already known, ship shop had been around for twenty years before Eminem arrived on the scene; go do your homework.","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32513,"reviewerID":"A2K150EBPF8LT7","asin":"B00004T9UF","reviewerName":"hiphopforlife","helpful":[2,2],"reviewText":"When Eminem first appeared, like many others, I didn't take him seriously. When I first heard \"My Name Is\" I thought Vanilla Ice was being revived, but that was far from the truth. The Slim Shady LP was a brief glimpse into the life and times of Marshall Mathers, husband, father, and aspiring wrapper. While the content was not for the faint of heart, it was refreshing to hear musically and lyrically during the birth of the ship store's \"bling-bling era\". His next album, The Marshall Mathers LP, would upset the world, not only musically but commercially, and sold nearly two million in the first week. This is for sure the best production by Dr. Dre since Snoop Dogg's undeniable classic doggystyle. If you didn't like what Em had to say on that first album, now stop reading. There are songs with defenses against homophobia (Marshall Mathers, I'm Back), the killing of this woman and mother of this child (Kim), and trashy rumors (The Real Slim Shady). Some of the top dogs in pop music are devastated at I'm Back and The Real Slim Shady. There are some standout songs, however, like Remember Me with Sticky Fingaz and RBX, Bitch Please II with Dr. Dre, Snoop Dogg, Xzibit and Nate Dogg and of course Stan about a deranged fan who over the edge of this obsession with Slim. Though the album stumbles a bit with Criminal and Under The Influence (with D-twelve, whose mere presence brings down EVERY album), it's more than worthy to take up space in your CD collection. My only problem is that (which has been said countless times over the past few years) the reason why Eminem is so highly praised for his skills and sells so many records is because he is white. I know he had to prove himself twice as hard to get respect, but he got twice the credit which is unfair to all of the great black copywriters who came before him and influenced him (Big Daddy Kane, Rakim, KRS- ONE, twoPac, The Notorious BI G, Kool G. Rap) and the big Jones out know (Mos Def, Talib Kweli, Black Thought, Xzibit, Ras Kass, Nas, Jay-Z, Method Man, Redman, Keith Murray, Outkast, etc). It's hilarious to me to hear white rock and pop fans who call this the best wrap album ever but know Jack about the music; in case they didn't already know, there had been ship shops for twenty years before Eminem showed up; Go do your homework","overall":4,"summary":"A good album built on a bad premise","unixReviewTime":1096675200,"reviewTime":"10 2, 2004"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"In A. B. Spellman's excellent liner notes to the original alp release of this remarkable session the observed, \"It is not intended that 'Ascension' will be background music for polite dinner conversation.\" The uninitiated listener who comes to \"Ascension\" should be forewarned by this words. Above all, \"Ascension\" demands concentrated listening. Spellman further commented that the session begins at an extraordinarily high level of intensity, rather than building to a speak as most other jazz for rock recordings do. In fact, the record begins with a simple motif sketched by Coltrane, followed by an extended and sustained blast of sound from the six other horns, two basses, and drums. (Don't look for much from pianist McCoy Tyner -- except during the solos -- as the has little chance to be heard through the onslaught.)The amazing thing about \"Ascension,\" for me, is that during the stretches of seemingly unstructured, free playing so much drama is generated. To be sure, it is not the conventional drama of the classically constructed jazz solo, with its rise and fall of tension and perfectly created marc and climax. Rather, this is the drama parallel to that produced from the chaos and clamour of modern life. One of the mental pictures that emerged for me in my early listening to the album was of the streets of a giant urban center, a jumble of sounds from which emerged recognizable human voices. These vast aural canvases are also dotted with more conventional solos from Coltrane and the other musicians (notably Freddie Hubbard, Archie Shepp, John Tchicai, and Pharaoh Sanders), although all of these artists push the boundaries of sound in their solos as well. Each has marvellous moments, from Hubbard's soaring trumpet line to Sanders' eruptions in the upper register of this horn to Tchicai's lithe alto dancing against a figure by Tyner, to Coltrane's own powerful cry.\"Ascension\" is a hard album to write about. It is best experienced as an immersion in sound. As Spellman said in speaking of each of the musicians, \"Give them a hearing. Give them a few.\" Same can be said about the record itself.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32661,"reviewerID":"AJYSM99XWVT4O","asin":"B00004TA40","reviewerName":"Tyler Smith","helpful":[10,11],"reviewText":"In A. B. Spellman's excellent liner notes on the original Alp release of this remarkable session, it says, \"It is not intended that 'Ascension' be background music for polite conversation over dinner.\" The uninitiated listener who comes to \"Ascension\" should be forewarned by these words. Above all, \"Ascension\" demands concentrated listening. Spellman went on to comment that the session begins with an exceptionally high intensity, rather than developing into a lecture like most other jazz-for-rock recordings. In fact, the record begins with a simple motif sketched by Coltrane, followed by an extended and sustained rush of sound from the other six horns, two basses and drums. (Don't look for much from pianist McCoy Tyner - except during the solos - as he has little chance of being heard through the onslaught.) The amazing thing about \"Ascension\" for me is that during the seemingly unstructured, free play it becomes so creates a lot of drama. It is of course not the conventional drama of the classically constructed jazz solo with its ups and downs of tension and the perfectly created Marc and climax. Rather, this is the drama parallel to that created by the chaos and noise of modern life. One of the mental images that popped up when I first listened to the album was that of the streets of a huge urban center, a jumble of sounds from which recognizable human voices emerged. These huge acoustic canvases are also littered with more conventional solos from Coltrane and the other musicians (notably Freddie Hubbard, Archie Shepp, John Tchicai, and Pharaoh Sanders), though all of these artists push the boundaries of sound in their solos as well. Everyone has wonderful moments, from Hubbard's ascending trumpet line to Sanders' eruptions in the upper register of that horn to Tchicai's lithe alto dancing against a Tyner character to Coltrane's own powerful scream. \"Ascension\" is a difficult album to write. It is best experienced as an immersion in sound. As Spellman said of each of the musicians, \"Give them a listen. Give them a few.\" The same can be said about the record itself.","overall":5,"summary":"Imagination stretching","unixReviewTime":1010102400,"reviewTime":"01 4, 2002"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Busta Rhymes in ninety-eight came out with what i felt was the most creative album of this career ELE is back with another slamming CD while Anarchy may not be as innovative as ELE was this CD still is blazing. Busta's flows are tight as never. Production is on point with long time producer DJ. Scratch who has been down since Busta's solo debut The Coming. DJ Scratch deliver such banners on Busta's new CD Salute Da Goods, We Comin Through which the takes a page out of Swizz Beatz book of beats . This track sounds like something Swizz Beatz would have done . One of the best cuts on the album . Producer Jay Dee brings a raw banging sound to tracks Enjoy Da Ride, Live It Up, Show Me What You Got For Me all these tracks mention are hot . The best cut on the album clearly is The Heist featuring Raekwon, Ghostface Killa, Flip Mode's newest member Roc-Marciano this track is worth the price of CD alone the song depict jewerly robbery gone bad. Other noteworthy cuts; Make Noise featuring Lenny Kravitz, Why We Die featuring DMX &Jay-Z, Get Out, How Much We Grew this song depict the beginning of Busta Rhymes all the people that have been down with him from the beginning people that made it happen for him . This CD is hot and belongs in all true ship head collection Pick it up you wont regret it .","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32798,"reviewerID":"A3RI9UWBHQ6D51","asin":"B00004TL26","reviewerName":"Tony_Tone \"Anthony   Jamal Smith\"","helpful":[11,11],"reviewText":"Busta Rhymes in ninety-eight came out with what I thought was the most creative album of this career. Busta's flows are closer than ever. The production runs with the longtime producer DJ. Scratch, who's been down since Busta's solo debut The Coming down. DJ Scratch delivers such banners on Busta's new CD Salute Da Goods, We Comin Through, which takes a page from Swizz's Beatz book. This track sounds like something Swizz Beatz would have done. One of the best cuts on the album. Producer Jay Dee brings a raw bang sound to the tracks Enjoy Da Ride, Live It Up, Show Me What You Got For Me, all of these tracks are hot. The best cut on the album is clearly The Heist with Raekwon, Ghostface Killa, Flip Mode's newest member Roc-Marciano. This track is worth the price of a CD alone. Other notable cuts; Make Noise with Lenny Kravitz, Why We Die with DMX & Jay-Z, Get Out, How Much We Grew This song shows the beginning of Busta Rhymes to all the people who were with him from the beginning, people who made it possible for him to have. This CD is hot and belongs in every true ship's head collection. Get it, you won't regret it.","overall":4,"summary":"BUSTA STRIKES AGAIN","unixReviewTime":962409600,"reviewTime":"07 1, 2000"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Antonio Carlos Jobim's Finest Hour is an excellent collection of jazz bossanova recordings by one of the leaders of the bossanova sound. Jobim's solo and accompaniment with vocalist Astrud Gilberto and legendary saxophonist, Stan Getz, offers a melodic and sensuous effect to this flush Brazilian sound. The cd's crispness makes the recordings timeless, but not without a thought of one thousand, nine hundred and sixtys cocktail sounding nostalgia (dependent on your page, these are itunes you heard your father play on the good vol' chi-fi system). The songs make you imagine you're on a beach with the palm trees gently swaying back and forth, for simply lounging on the patio listening to tracks, such as the all too familiar, \"The Girl From Impanema,\" my favourite version of \"Meditation,\" for the delicious hipster trappings of \"Desfinado\" with Getz's exceptional sax solo. Finest Hour will not disappoint those listeners looking for the quiet jazz sounds that whisper in your year for simply let you relax. So, grab yourself a copy, and while you're at it, mix a cocktail for two and add one of those little umbrellas.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":32901,"reviewerID":"AFJFXN42RZ3G2","asin":"B00004TWRR","reviewerName":"R. DelParto \"Rose2\"","helpful":[17,17],"reviewText":"Antonio Carlos Jobim's Finest Hour is an excellent collection of jazz Bossanova recordings of one of the leading Bossanova sounds. Jobim's solo and accompaniment with the singer Astrud Gilberto and the legendary saxophonist Stan Getz give this rich Brazilian sound a melodic and sensual effect. The crispness of the CD makes the recordings timeless, but not without a thought of one thousand nine hundred and sixty cocktail bell nostalgia (depending on the side, these are Itunes your father heard playing on the good vol'-chi-fi system). The songs make you think you're on a beach where the palm trees sway gently back and forth, just to lounge on the terrace and listen to tracks like the all-too-famous \"The Girl From Impanema\", my favorite version of \" Meditation \"for the delicious hipster trapping of\" Desfinado \"with Getz 'extraordinary saxophone solo. Finest Hour won't disappoint those listeners looking for those soft jazz sounds whispering in your year to just relax you. So, grab a copy, and while you're at it, make a cocktail for two and add one of those little umbrellas to it.","overall":4,"summary":"Timeless Tunes For Any Time","unixReviewTime":1108771200,"reviewTime":"02 19, 2005"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is the best and my favourite R. Kelly's album. Nuff said.","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":33258,"reviewerID":"A1143SNKOV0ZIT","asin":"B00004WIZA","reviewerName":"Eyebrows","helpful":[3,3],"reviewText":"This is the best and my favorite R. Kelly album. said Nuff.","overall":5,"summary":"R. Kelly's BEST ALBUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","unixReviewTime":1086048000,"reviewTime":"06 1, 2004"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Who could forget the summer of ninety-five, when Hootie & The Blowfish's songs were on every station every three seconds?:) As the years have gone by, my musical taste has changed, and I'm not too into Hootie's style of music anymore- I'm mainly into heavy stuff like KoRn and Metallica. But I just recently heard news of Darius Rucker's solo album, and knowing the always had an excellent voice, so I decided to download a few songs. I'm not too into R&B, but the is GOOD! I can't get enough of \"Wild One\". Yea i know, it's not at all cool to like Hootie anymore, but any R&B song that catches the eye of a KoRn fan is definitely worth checking out. I'd actually like to hear him do an R&B version of \"Let Her Cry\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38614,"reviewerID":"A1XJPGV4KPIQWM","asin":"B000066HQD","reviewerName":"\"krusty_the_clown\"","helpful":[1,1],"reviewText":"Who could forget the summer of 95 when the songs from Hootie & The Blowfish were on every network every three seconds? :) Over the years my taste in music has changed, and I'm not that into Hootie's style of music anymore - I mostly like heavy stuff like KoRn and Metallica. But I only heard about Darius Rucker's solo album recently and knew he always had an excellent voice, so I decided to download a couple of songs. I'm not that into R&B, but that's GOOD! I can't get enough of Wild One. Yeah, I know it's not cool to like Hootie anymore, but any R&B song that catches the eye of a KoRn fan is definitely worth a look. Actually, I'd love to hear him do an R&B version of \"Let Her Cry\"","overall":5,"summary":"He's pretty good solo","unixReviewTime":1028332800,"reviewTime":"08 3, 2002"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"Who cares it's the rhcps , strong album i can listen to it anytime.","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38730,"reviewerID":"A28AIG15GAA581","asin":"B000067CPX","reviewerName":"Kurt Hungus \"Kurt\"","helpful":[2,12],"reviewText":"Who cares about the rhcps, strong album I can listen to it anytime.","overall":5,"summary":"who cares?","unixReviewTime":1140307200,"reviewTime":"02 19, 2006"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Wow!! That is what you will say after listening to this for the first time. Balligomingo is the brainchild of basically one man, named Garrett Schwarz. The music facts like a tornado as it pulls the listener into its funnel of sound. This is one hell of a great debut. The singers are a little pop sounding at times, but the music is the star, and the singing is just the background. Let me tell you my five favourites of this magnificent album. one)\"Beyond\". Incredible. Be prepared to be blown over by this one. two)\"Sweet Allure\". Another spellbounder. The beats and rhythms come from all areas, and is just awesome. three)\"Heat\". Garrett needs to release this one, this is a hit begging to be a smash. four)\"Marooned\". The music shimmers on this one, and is reminiscent of Enigma's sound with its own uniqueness. And the singing on this is perfect. five)\"Lust\". The title of this one says it all about what you will feel after listening to it. After reading this please go buy it, we all need to do what we can to keep the talented Garrett Schwarz making more of this great music. And hurry up, Garrett, I am wearing this CD out.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":38792,"reviewerID":"A82HCBH6DD3GZ","asin":"B000067NW0","reviewerName":"Thomas R. Carley Jr.","helpful":[3,3],"reviewText":"Wow !! This is what you will say after the first listen. Balligomingo is the brainchild of a man named Garrett Black. The music works like a tornado and pulls the listener into its sound funnel. It's a hell of a debut. The singers sound a little poppy at times, but the music is the star and the vocals are just the background. Let me tell you my five favorites from this great album. one) \"beyond\". Incredible. Be prepared to be overwhelmed by this. two) \"Sweet Allure\". Another wizard. The beats and rhythms come from all areas and are just awesome. three) \"heat\". Garrett has to put this out, this is a hit begging to be a hit. 4) \"Marooned\". The music shimmers on this and, with its own uniqueness, is reminiscent of the sound of Enigma. And the singing to go with it is perfect. five) \"lust\". The title of this book says everything about how you will feel after hearing it. After reading this, please buy it. We all have to do our best to have the talented Garrett Schwarz make more of this great music. And hurry up, Garrett, I'll take this CD out.","overall":5,"summary":"&quot;Take too much, but don't take too long&quot;.","unixReviewTime":1085270400,"reviewTime":"05 23, 2004"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"I thoroughly enjoyed the CD \"Floetic\" by Floetry. The CD is filled with songs that touch the deepest part of your soul. Floetry truly captures the essence of any and every emotion you have felt in their music. The song \"Floetic\" allows you to groove to the ladies' voices as well as the terrific beat and melody. \"Say Yes\" exudes so much sensuality and desire that you immediately want to pull your significant other closer. I really loved the fact that the demo version of \"Butterflies\" was a bonus track. I have loved this song never since Michael Jackson released it on this \"Invincible\" album, so it was a real treat to hear a different take on the song. I did't think I could like the song any more than I already did, but hearing it from a woman's perspective was cool. Stand-out tracks:FloeticSay YesButterflies (Demo Version)Now You're GoneI would highly recommend this CD to a music lover who would like to hear something a little different, a little refreshing, and very interesting! You won't be disappointed!!!!","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":39681,"reviewerID":"A3U5JCXIXTGSLN","asin":"B00006JO3X","reviewerName":"musiclover13","helpful":[7,7],"reviewText":"I really liked the CD \"Floetic\" from Floetry. The CD is filled with songs that touch the deepest part of your soul. Floetry really captures the essence of all the emotions that you have felt in their music. The song \"Floetic\" lets you groove to the female voices as well as the terrific beat and melody. \"Say Yes\" radiates so much sensuality and lust that you want to draw your partner in closer immediately. I thought it was really great that the demo version of \"Butterflies\" was a bonus track. I've never loved this song since Michael Jackson put it on that \"Invincible\" album, so hearing a different take on the song was a real treat. I thought I couldn't like the song any more than I already did, but it was cool to hear it from a woman's perspective. Outstanding Tracks: FloeticSay YesButterflies (Demo Version) Now You're Gone I can warmly recommend this CD to any music lover who wants to hear something different, a little refreshing and very interesting! You will not be disappointed!!!!","overall":4,"summary":"Refreshingly Wonderful!!!","unixReviewTime":1052697600,"reviewTime":"05 12, 2003"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"Two superbly crafted pop songs seduce us into Arthur's third album. Deeply introspective, often perplexed, Arthur sings to save himself, though the rewards are karen't necessarily a renewal of energy. He rarely shakes free of a fog of resignation. This makes the more exuberant,'Let's Embrace','In the Night', or 'Permission' less convincing, an impression overscored by the inappropriateness of the Gabriel signature sound. For the most part though(and this is a long CD), the production palette is not excessively lavish. 'Termite's Song's' moog & dulcimer mantra recalls the innocence of the Donovan who gave us Songs For Children; fragile, nacrescent as the inside of an abalone shell, held to the year. By far the better part of the album is a genuine treasure. Those enticed by this work may wish to investigate Melbourne's, David Bridie whose ,'Act Of Free Choice' runs in parallel to Arthur's palette.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":40486,"reviewerID":"A3OJ012QPTGMLR","asin":"B00007E6WW","reviewerName":"R. J MOSS","helpful":[2,3],"reviewText":"Two excellently made pop songs seduce us to Arthur's third album. Deep within, often perplexed, Arthur sings to save himself, although the reward is not necessarily a renewal of energy. He seldom emerges from a fog of resignation. That makes the exuberant “Let's Embrace”, “In the Night” or “Permission” less convincing, an impression that is drowned out by the inappropriateness of the Gabriel-typical sound. For the most part (and this is a long CD), however, the production range isn't overly lavish. The moog and dulcimer mantra of 'Termite's Song' evokes the innocence of Donovan who gave us songs for children; fragile, mother-of-pearl like the inside of an abalone shell, marked with the year. The far better part of the album is a real treasure. Those lured by this work may want to examine Melbourne's David Bridie, whose \"Act Of Free Choice\" runs parallel to Arthur's palette.","overall":4,"summary":"Sweet and Sour","unixReviewTime":1092614400,"reviewTime":"08 16, 2004"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"For all Flip it is game over. Because cd sucks. One good songs out of two discs. That is bad. two out of five","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45524,"reviewerID":"A1SPYMGDEWKK6I","asin":"B0001MDPQ8","reviewerName":"K. Flatt \"The scorpion\"","helpful":[6,11],"reviewText":"It's game over for everyone Flip. Because CDs suck. A good song from two discs. This is bad. two out of five","overall":2,"summary":"For lil Flip it is game over. Because cd sucks.","unixReviewTime":1109980800,"reviewTime":"03 5, 2005"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"i like this crew but the disc is lacking.peep afroman and wrap with a live funk band. prepping the streetteam","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45764,"reviewerID":"A2XL4PQC24DRBJ","asin":"B0001Z53AQ","reviewerName":"rc41","helpful":[0,0],"reviewText":"I like this crew, but the disc is missing. prepping the streetteam","overall":3,"summary":"id expect more","unixReviewTime":1091750400,"reviewTime":"08 6, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"This guy Sasha is definitely evolved--to an artistic levelhigher than most human beings. How I would've love love loved this heavenly CD. IF it hadbeen vocal-free. but that's my bias. If you don't mindvocals in your electronica, this CD is really reallyoutstanding & serene & ecstatic. ahead of its time. I wish they'd release a vocal-free version of Involver. Also, I must agree with other reviews that trash the\"special packaging\" edition. (. ) Avoid that mess and get this CD in the regularcase. I wish I had.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":45808,"reviewerID":"A2QUXMCJVPF2M4","asin":"B00020H9ZW","reviewerName":"Kenneth M. Goodman","helpful":[2,4],"reviewText":"This type of Sasha is definitely evolved - on an artistic level higher than most people's. How I would have loved to have loved this heavenly CD. IF it was voiceless. but that's my bias. If you don't pay attention to the vocals in your electronica, this CD is really really standout & serene & ecstatic. ahead of its time. I wish they would release a voiceless version of Involver. I also have to agree with other reviews that discard the \"special packaging\" edition. (.) Avoid this mess and usually get this CD. I wish I had.","overall":4,"summary":"Heavenly","unixReviewTime":1093996800,"reviewTime":"09 1, 2004"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Ivy have always been one of those cool New York bands that have been around a while. Ivy have joined Luna and Blonde Redhead as the elder statesmen in the New York Pantheon. They combine French cool with flush vocals and memorable songs. I have heard many of their songs in commercials. Much of their music was used in the film Shallow Hal, and TV programs like Roswell and Kingdom Hospital. It's because the music of Ivy has that otherworldly feeling of some of the shoegazer bands that inspired them at first. Now they have been on the own for ten years for more, and have hooked up with producer Steve Osborne. The results are terrific. Whether it's the longing of \"Thinking About You\" for the quiet mood of \"Four In The Morning.\" Even fellow NYC scenesters James Iha (Smashing Pumpkins) and Scott McLoud (Girls Against Boys) show up on this CD. The song \"Feel So Free\" gives us the powerful music that this band has been doing for so long. They are great indeed. Fashion comes and goes. Ivy is a band that will be remembered.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":48461,"reviewerID":"A33D1LPCYUANWE","asin":"B0007GAEIU","reviewerName":"alexander laurence","helpful":[1,1],"reviewText":"Ivy has always been one of those cool New York bands that has been around for a while . Ivy has joined Luna and Blonde Redhead as Elder Statesmen in the New York Pantheon. They combine French coolness with snappy vocals and catchy songs. I've heard a lot of their songs in commercials. Much of their music was featured in the movie Shallow Hal and on television programs like Roswell and Kingdom Hospital used. It's because Ivy's music has the otherworldly feel of some of the shoegazer bands that first inspired them. Now they have been un alone for over ten years d teamed up with producer Steve Osborne. The results are great. Be it the longing of “Thinking About You” for the calm mood of “Four In The Morning”. Even the NYC scene colleagues James Iha (Smashing Pumpkins) and Scott McLoud (Girls Against Boys) appear on this CD. The song \"Feel So Free\" gives us the powerful music that this band has been making for so long. You are really great. Fashion comes and goes. Ivy is a band that will be remembered.","overall":5,"summary":"Flawless","unixReviewTime":1113696000,"reviewTime":"04 17, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"This would seem like an appropriate title for a Malkmus album. I've learned, throughout the years, never to listen to an artist like Malkmus one time and provide a review of that album. You must do an album justice. This is my current favourite solo Stephen. It's jagged. It's raw, and yet it's very cohesive. It reminds me of Wowee Zowee in many ways. In many ways, it's all over the place with a proton and a newton holding it all together. Pencil Rot is the jewel of the album, but Mama keeps creeping on. Kindling for the Master and No More Shoes are a couple other classics. Malkmus was once asked why the does't diversify this sound more. Well, when you're doing it this well. you have to Face the Truth. Behind Mr. Bungle and the various projects of the golden child Mike Patton, Stephen Malkmus and this former group Pavement have been making my favourite music for over a decade now.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49178,"reviewerID":"ADYNO5CD0GVFE","asin":"B0008FPIPY","reviewerName":"Mud Pyramid \"rilaly\"","helpful":[0,1],"reviewText":"This seems like a fitting title for a Malkmus album. I've learned over the years never to listen to an artist like Malkmus and give a review on this album. You have to do an album justice. This is my current favorite Stephen solo. It's jagged. It's raw and yet very cohesive. It reminds me of Wowee Zowee in many ways. In many ways, it's everywhere with a proton and a newton that hold everything together. Pencil Red is the jewel of the album, but mom sneaks on. Kindle for the Master and No More Shoes are a few other classics. Malkmus was once asked why that doesn't make this sound more varied. Well if you do it that well. You have to face the truth. Stephen Malkmus and this former group Pavement have been making my favorite music for over a decade, behind Mr. Bungle and the various projects of the gold kid Mike Patton.","overall":4,"summary":"Malkmus Malkmus","unixReviewTime":1118793600,"reviewTime":"06 15, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"Elephant is a hard act to follow. The greatest album of all time, and therein another one? Orson Welles may have had this feeling after Citizen Kane. Thomas Pynchon may have felt like this after Gravity's Rainbow. Now it's JackWhite's turn. \"Blue Orchid\" is a great single. One may notice the use ofmarimbas and more keyboards on this record. Some songs like \"My Doorbell\" recalltheir earlier album White Blood Cells: simple rock for party people. There arethrowback songs like \"Little Ghost.\" Some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\" which remind us why we liked The White Stripes ninth first place. Rita Hayworth is finally immortalized in song. The song, which is the most powerful, is \"Instinct Blues\" which is like this album's \"Balland Biscuit.\" I guess people will compare this album to Led Zeppelin III: lot of cool rocking itunes with some country rocking thrown in. But Zeppelincouldn't really achieve anything as moving as \"I'm Lonely.\" This is a personalalbum. It's pretty good. People expect a lot from this band, and they almostget it.","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":49308,"reviewerID":"A33D1LPCYUANWE","asin":"B00097A5H2","reviewerName":"alexander laurence","helpful":[1,3],"reviewText":"Elephants are difficult to follow. The greatest album of all time and one more? Orson Welles may have had this feeling after Citizen Kane. Thomas Pynchon may have felt this way after Gravity's Rainbow. Now it's JackWhite's turn. \"Blue Orchid\" is a great single. One can notice the use of marimbas and more keyboards on this platter. Some songs like \"My Doorbell\" are reminiscent of their earlier album White Blood Cells: simple rock for party-goers. There are throwback songs like \"Little Ghost\". Some of the best songs are \"The DenialTwist\" and \"Take, Take, Take\" which remind us why we dropped The White Stripes at number ninth. Rita Hayworth is finally immortalized in songs. The strongest song is \"Instinct Blues\" which is like \"Balland Biscuit\" on this album. I guess people will compare this album to Led Zeppelin III: lots of cool rocking itunes with a bit of country rock to it. But Zeppelin couldn't really achieve anything as moving as \"I'm Lonely\". This is a personal album. It is very good. People expect a lot from this band and they almost get it.","overall":5,"summary":"what can I say?","unixReviewTime":1121990400,"reviewTime":"07 22, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"What can I say that has not already been said. This is an EXCELLENT album! BUY IT!!!!!","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":50199,"reviewerID":"A1VWVD7O3WMB5G","asin":"B000AGTQKY","reviewerName":"Carson Morrill \"PRO SET\"","helpful":[0,2],"reviewText":"Was soll ich sagen, was noch nicht gesagt wurde. Dies ist ein AUSGEZEICHNETES Album! KAUF ES!!!!!","overall":5,"summary":"EXCELLENT!!!!!!","unixReviewTime":1133136000,"reviewTime":"11 28, 2005"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Zutons are a UK quintet from Liverpool, with a rough psychedelic rock\/R&B;\/ska\/folk sound, akin to fellow Brits, The Coral, with a small dash of The Smiths. `Tired of changing around' is their sophomore disc, and it's already stopped the UK albums chart. In Smiths-like mode, lyric wise is the rather dark but upbeat `Oh Stacey (look what you've done)' with an accompanying morbid but hilarious video.`Secrets' is a swinging ska tinged song (great horns) and an insistent chorus. Retro rocker `It's the little things we do' has a great guitar riff. Title track `Tired of changing around' features great story telling, set to a Paul Weller sound, with great harmonies, something to be found throughout the album. Other great upbeat songs are the jangly, sunny `Valerie', and the clap along `Hello conscience'. Slowing things down are `Someone's watching over me'which starts off like a lullaby before building up to a nice guitar ballad with dreamy harmonies. `You've got a friend' is a catchy skiffle, and `I know I'll never leave' is an hairy ballad with a raw vocal delivery and soothing harmonies. I think they'll be changing around for a long time to come.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":52124,"reviewerID":"A24N1BAS3CU27H","asin":"B000EUMO00","reviewerName":"Nse Ette","helpful":[6,7],"reviewText":"Zutons are a British quintet from Liverpool with a rough psychedelic rock \/ R & B; \/ Ska \/ folk sound, similar to the British The Coral, with a little dash of The Smiths. `Tired of change around 'is her second CD and she has already stopped the UK album charts. In Smiths-like mode, the rather gloomy, but optimistic `` Oh Stacey (look what you've done) '' is lyrically accompanied by an accompanying morbid but hilarious video choir. The retro rocker 'It's the little things we do' has a great guitar riff. The title track 'Tired of change around' offers great storytelling tuned for a Paul Weller sound, with great harmonies that can be found throughout the album. Other great, happy songs are the clinking, sunny “Valerie” and the clapping along with “Hello conscience”. Slowdown is 'Someone's watch over me' which starts like a lullaby before building up into a beautiful guitar ballad with dreamy harmonies. `You've got a friend 'is a catchy skiffle, and` I know I'll Never Leave' is a hairy ballad with raw vocals and calming harmonies. I think they will change for a long time.","overall":5,"summary":"Not tired of them hanging around.","unixReviewTime":1162080000,"reviewTime":"10 29, 2006"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"The Good\"It's Not Over\" is the catchy lead single that's tearing up both pop and rock radio. The hook is undeniable and Chris' vocals are full of heart and soul. Daughtry returns to the arms of this true love on the touching ballad \"Home.\" Chris puts this range to the test on the powerful chorus of \"Over You.\" Daughtry and company break out of their pop-rock comfort zone for the extra crunchy \"What I Want.\" The heavy clicks and rapid fire guitar clicks are supplied by legendary Guns and Roses taxman Slash. Chris faces breakup and heartbreak on \"Home.\" He runs a gamut of emotions there. \"There and Back Again\" is full of meaty riffs and in-your-face vocals. \"All These Lives\" is an acoustic power ballad that is sure to touch a nerve for two. The BadTo say that Chris is going it without the help of American Idol is not exactly true. Sure, the was voted off much too early, but from this management to this record label, Daughtry has the major moguls of Idol behind him all the way. Daughtry also has a lot of different professional songwriters behind him. To this credit the wrote three songs on this own. To top that off, the has some of the best producers behind him too. Now, this is not necessarily a bad thing depending on how you look at it. Sure, you're getting the best possible album that can be produced, but does it really matter who's behind the microphone? The VerdictDaughtry's debut is a well-balanced pop-rock crossover album. By that I mean this songs are edgy enough to meet the rock radio format, but they also have that smooth singer-songwriter quality that appeals to the soft rock and pop crowds.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53364,"reviewerID":"A235NA61RC6YC1","asin":"B000IY04RC","reviewerName":"George Dionne","helpful":[1,3],"reviewText":"The Good \"It's Not Over\" is the catchy lead single that got pop and rock radio into turmoil, the hook is undeniable and Chris's vocals are heart-filled and soul. Daughtry returns with the touching ballad \"Home\" into the arms of this true love. Chris tests this range in the powerful chorus of \"Over You\". Daughtry and company break out of their pop-rock comfort zone for the extra crisp \"What I Want \". The violent clicks and rapid guitar clicks are from the legendary Guns and Roses Taxman Slash. Chris is confronted with a breakup and heartbreak in \"Home\". There he has a whole range of emotions. \"There and Back Again\" is full of meaty riffs and straight vocals. \"All These Lives\" is an acoustic power ballad that is sure to hit a nerve for two. To say the BadTo that Chris is doing it without the help of American Idol isn't entirely true. Sure, he was voted out way too early, but from that management to this record label, Daughtry has the great idol moguls all the way behind. Daughtry has also worked with a wide variety of professional songwriters. To honor this, they wrote three songs alone. To top it off, this also has some of the best producers behind it. Well, that's not necessarily a bad thing depending on how you look at it. Sure, you get the best possible album that can be produced, but does it really matter who is behind the mic? VerdictDaughtry's debut is a balanced pop-rock crossover album. By that I mean these songs are edgy enough to be rock radio format, but they also have that slick singer-songwriter quality that appeals to the soft rock and pop crowds.","overall":4,"summary":"A well-balanced pop-rock crossover album","unixReviewTime":1197331200,"reviewTime":"12 11, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"When Lajon said in a interview awhile back that the new songs they were writing were some of the hardest stuff that they have never written, songs that make \"Enemy\" sound mellow. He was't kidding. If your a old school Sevendust fan, then this album is your album to send all Sevendust albums. This is a return to form of the in your face, trip your through your skull Sevendust. From beginning to send this album does't give up, its relentless, lyrically and musically. This is quite possibly the hardest, most in your face album since they released \"Sevendust\" back in one thousand, nine hundred and ninety-seven. I've been a fan of Sevendust since one thousand, nine hundred and ninety-nine when the released \"Home\", and I've eagerly awaited every album since. Every album they have made is very good, and Alpha is not an exception. Bottom Line: Alpha is just another great album from Sevendust. If you thought they got soft, they are back, and they are back to trip through your skull, and believe me, that a good thing.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":53805,"reviewerID":"ABEVLF9SUQYSU","asin":"B000MGBTIE","reviewerName":"ChuckMoses","helpful":[1,3],"reviewText":"When Lajon said in an interview a while ago that the new songs they write are some of the toughest things they have never written, songs that make \"Enemy\" sound soft. He wasn't kidding. If you're an old school Sevendust fan then this album is your album to send out all of the Sevendust albums. This is a return to the shape of the in your face, you stumble through your Sevendust skull. From start to finish, this album doesn't give up, it's relentless, lyrically and musically. This is probably the heaviest album since they released \"Sevendust\" around one thousand nine hundred and ninety-seven. I've been a fan of Sevendust since one thousand nine hundred and ninety-nine when Home was released, and I've eagerly waited for every album since. Every album they have made is very good and Alpha is no exception. Conclusion: Alpha is just another great album from Sevendust. If you thought they went soft, they're back, and they're back to stumble through your skull, and believe me, that's a good thing.","overall":5,"summary":"Vintage Sevendust....","unixReviewTime":1179014400,"reviewTime":"05 13, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" marks the very first CD release of an original album by Porter Wagoner and Dolly Parton in North America. Their very first LP \"Just Between You and Me\" was released in one thousand, nine hundred and ninety-five in Europe on CD and there have been various compilation CD's distributed, but RCA Records has been extremely slow in releasing any of the duos famous albums. Minnie Pearl once called Porter and Dolly the greatest man\/woman singing team in the history of country music. This CD shows why!\"Porter and Dolly\" has quite a history as an LP. It was the last album the duo never released in one thousand, nine hundred and eighty long after their partnership was over. It was originally to have been put out in one thousand, nine hundred and seventy-six, but Dolly's new management team headed by Sandy Gallin convinced RCA to shelve the duet album, citing that its release would hamper the growth of Dolly's new solo career. This did't sit too well with Porter who would go on to close royalties as a singer, songwriter, and producer of the album. In one thousand, nine hundred and seventy-nine Porter sued Dolly for three million dollars citing breach of contract and of blocking the release of this very album. After settling out of court for one million dollars, in which Dolly nearly ended up broke, the \"Porter and Dolly\" album was released. The album shot all the way to number nine and had two singles released; \"Making Plans\" hit number two and \"If You Go I'll Follow You\" went to number twelve, indicating the fans still loved their Porter and Dolly. The album is quite good. Featuring ten tracks the standout is the second single. Dolly's girlish voice blends perfectly with Porter's manly vocals and the song should have gone higher on the charts. All the songs were recorded prior to one thousand, nine hundred and seventy-six and the only song released before one thousand, nine hundred and eighty was \"If You Say I Can\", released as the B-Side to \"Is Forever Longer Than Always\" another top ten single not included on the album release. The album cover also features both Porter and Dolly photographed by two different photographers and their images were spliced together, since at that time the two were not talking. Happily they would rekindle their friendship in one thousand, nine hundred and eighty-eight. In my opinion all their albums were excellent and this ranks as one of their finest, and the fact that it finally has a home on CD makes me long to see more old Porter and Dolly LP's are-released on CD. On a final note the duos one thousand, nine hundred and sixty-nine LP \"Always, Always\" and one thousand, nine hundred and seventy-one's \"Two of a Kind\" will be released in February two thousand and eight together on one CD. Look for that.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":55540,"reviewerID":"A3FL6CIO8QIJ2F","asin":"B0011B9W4M","reviewerName":"Terrance Richard \"Terry Richard\"","helpful":[18,19],"reviewText":"\"Porter and Dolly\" is the very first CD release of an original album by Porter Wagoner and Dolly Parton in North America. Their very first LP \"Just Between You and Me\" was released in Europe in one thousand nine hundred and ninety-five on CD and various compilation CDs have been distributed, but RCA Records has released each of the famous duo albums extremely slowly. Minnie Pearl once called Porter and Dolly the best man-woman singing team in country music history. This CD shows why! \"Porter and Dolly\" has a long history as an LP. It was the last album the duo never released in one thousand nine hundred and eighty long after their partnership ended. It was originally scheduled to be released in one thousand nine hundred and seventy-six, but Dolly's new management team, led by Sandy Gallin, convinced RCA to put the duet album on hold as its release would hinder the growth of Dolly's new solo career. That didn't fit so well with Porter, who would later collect royalties as the singer, songwriter, and producer of the album. In one thousand nine hundred and seventy-nine, Porter sued Dolly for three million dollars for breach of contract and blocking the release of that album. After a $ 1 million out of court settlement that nearly broke Dolly, the album \"Porter and Dolly\" was released. The album shot to number nine and had released two singles; \"Making Plans\" reached number two and \"If You Go I'll Follow You\" reached number twelve, suggesting that fans still loved their porter and dolly. The album is pretty good. The second single is outstanding with ten tracks. Dolly's girlish voice harmonizes perfectly with Porter's male vocals and the song should have climbed higher in the charts. All songs were recorded before one thousand nine hundred seventy-six and the only song that was released before one thousand nine hundred and eighty was \"If You Say I Can,\" released as the b-side of \"Is Forever Longer Than.\" Always \"another top ten single not included on the album release. The album cover also shows Porter and Dolly, who were photographed by two different photographers and their images were stitched together as the two were not speaking at the time. Fortunately, they would they are reliving their friendship in one thousand nine hundred and eighty-eight. In my opinion, all of their albums have been excellent and this one is among the best, and the fact that it finally has a home on CDs makes me long for more old Porter and Dolly LPs will be released on CD. Finally, the duos one thousand nine hundred and sixty-nine LP \"Always, Always\" and one thousand nine hundred and seventy-one \"Two of a Kind\" will be released together on one CD in February two thousand and eight. Look for them.","overall":5,"summary":"Classic Porter and Dolly!","unixReviewTime":1198713600,"reviewTime":"12 27, 2007"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Young Jeezy really brought the fire to the party with The Recession. After two largely undeniable albums Lets Get It Thug Motivation one hundred and one and The Inspiration, Young Jeezy manages to equal and maybe surpass the quality of those two records. The Recession is well balanced and right on time. It's a given that Young Jeezy in't everyone's favourite cup of tea. Its been four years since Jeezy first dropped with countless features, appearances, and mixtapes and Some still haven't caught up with how the craps. He is indeed a very clever wrapper (read skilled) and that coupled with a nearly overwhelming presence tracks, excellent production, and a thing called charisma; it's no wonder the is one of the top wrappers releasing albums today. His flow is tighter this time around, this lyrics more potent, this focus much more clearer. Apperances are kept to a minimum with Lil Boosie (why people sleep on Boosie?!?), Nas (yes that Nas), and Kanye West as well as singers Anthony Hamilton and Trey Songz. Needless to say Jeezy can handle himself. Content is what you would expect from a ship shop album as well as a little politics and introspection. Put On is a monster track no doubt about that but also Circulate, Don't Do It, Crazy World, By The Way, Hustlaz Ambition, My President etc etc. There is not a weak song on this eighteen track album. The Itunes bonus track Done It should have definitely been on the album as well. Production is handled by DJ Toomp, Drumma Boy, Midnight Black, Don Cannon, Justice League, and others. The Recession is undoubtedly one of the best albums of the year so far (along with Lil Wayne, Plies, Nas, Killer Mike, Bun B) and will take a few monumental efforts to knock it out of top five and album of the year discussions. Young Jeezy, with this album, has established himself as one of the top wrappers of this decade and you should't miss out on it.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":56475,"reviewerID":"A3W0POMI33YQXQ","asin":"B001AGNRYY","reviewerName":"Enlightened \"Both Eyes Closed, see what u don...","helpful":[8,15],"reviewText":"Young Jeezy really brought the fire to the party with The Recession. After two largely indisputable albums, Lets Get It Thug Motivation one hundred and one and The Inspiration, Young Jeezy manages to match and perhaps even surpass the quality of these two albums. The recession is well balanced and on time. It goes without saying that Young Jeezy is not everyone's favorite mug. It's been four years since Jeezy first came out with tons of features, gigs, and mixtapes, and some still haven't gotten what craps is like. It is indeed a very clever wrapper (read experienced) and that coupled with an almost overwhelming presence of the tracks, an excellent production and a thing called charisma; It's no wonder this is one of the top wrappers to release albums today. This time his flow is tighter, this text more powerful, this focus much clearer. With Lil Boosie (why do people sleep on Boosie?!?), Nas (yes, that Nas) and Kanye West as well as the singers Anthony Hamilton and Trey Songz, the performances are reduced to a minimum. Needless to say, Jeezy can handle himself. The content is what you'd expect from a ship-shop album, plus a bit of politics and introspection. Put On is undoubtedly a monster track, but also Circulate, Don't Do It, Crazy World, By The Way, Hustlaz Ambition, My President etc. etc. There is no weak song on this 18 track album. The iTunes bonus track Done It should definitely have been on the album. Production is handled by DJ Toomp, Drumma Boy, Midnight Black, Don Cannon, Justice League and others. The Recession is hands down one of the best albums of the year to date (along with Lil Wayne, Plies, Nas, Killer Mike, Bun B) and will go in some monumental effort to knock it out of the top 5 and album of the year discussions . Young Jeezy has established itself as one of the top wrappers of the decade with this album and it shouldn't be missed.","overall":5,"summary":"Young Jeezy For President!","unixReviewTime":1220400000,"reviewTime":"09 3, 2008"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"I recently heard this song when i was watching some UK hoops this year. They broke for a commercial and this song started, I had to find out the name and who it was by. I have always loved Nelly especially since I heard the song Country Grammar. This song is a little different but it still has that Nelly style to it. You do not have to be a wrap lover for this song, this song will grab anybody's years. It is truly an amazing song. If you still need proof listen to the sample on Amazon MPthree, you wont be disappointed. THX,Kris L. CocKayne","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":59642,"reviewerID":"AVKHYC2D7MD56","asin":"B003YK9IOC","reviewerName":"K.L. CocKayne \"jedi master\"","helpful":[0,0],"reviewText":"I recently heard this song while watching some UK hoops this year. They dropped out for a commercial and this song started, I had to find out the name and who it was from. I've always loved Nelly, especially since listening to Country Grammar. This song is a little different, but it still has that Nelly style. You don't have to be a wrap lover for this song, this song will take the years away from everyone. It really is an amazing song. If you still need evidence, listen to the example on Amazon MPthree, you won't be disappointed. THX, Kris L. CocKayne","overall":5,"summary":"Nelly Is Awesome","unixReviewTime":1396137600,"reviewTime":"03 30, 2014"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"Listening these demos of the great and unique Carole, I reaffirm the statement: in those times the singer had to seduce, conquer and engage the listener through the music and not - as this page - through a video clip. Carole the songwriter for interpreter had that invisible hook to catch and capture your senses. Wonderful lyrics and fabulous arrangements made C. K.'s sound. And we are talking about the golden and highly inspired decade of the late sixties and early seventies. Singers, composers and bands gave the best they could. Just to cite a few names: Karen Carpenter, Aretha Franklin, Diana Ross, Joan Baez, Roberta Flack, Janis Joplin, Gladys Knight, Bobbie Gentry, Dionne Warwick, Dusty Springfield for Mary Hopkin still resound in your affective memory. Carole King meant for her generation a true driving force. Don't miss this extraordinary release.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":62014,"reviewerID":"A16CZRQL23NOIW","asin":"B007EM6FTW","reviewerName":"Hiram Gomez Pardo","helpful":[2,2],"reviewText":"When I hear these demos of the great and unique Carole, I confirm the statement: At that time the singer had to seduce, conquer and captivate the listener with the music and not - as on this page - cling to a video . Carole, the songwriter for performer, had this invisible hook to capture and capture your senses. Wonderful lyrics and fabulous arrangements made C. K.'s sound. And we're talking about the golden and highly inspired decade of the late sixties and early seventies. Singers, composers and bands gave their best. To name a few: Karen Carpenter, Aretha Franklin, Diana Ross, Joan Baez, Roberta Flack, Janis Joplin, Gladys Knight, Bobbie Gentry, Dionne Warwick, Dusty Springfield for Mary Hopkin still resonate in your affective memory. Carole King was a true driving force for her generation. Do not miss this extraordinary release.","overall":5,"summary":"A monolithic force in the history of American pop music","unixReviewTime":1346889600,"reviewTime":"09 6, 2012"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love this song! Miley is a little wild but the girl is talented. I love the lyrics and how the song sounds.","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}
{"orig_index":64227,"reviewerID":"AG3EK1W7AEJMA","asin":"B00ERMICY8","reviewerName":"Beccaree","helpful":[0,0],"reviewText":"I love this song! Miley is a little wild, but the girl is talented. I love the lyrics and how the song sounds.","overall":5,"summary":"Great song","unixReviewTime":1389484800,"reviewTime":"01 12, 2014"}