{"orig_index":733,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B00000054A","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[2,2],"reviewText":"Although It's not as Heavy as this other songs I've Heard. Nor as Good As one-eight hundred-C.o.l.l.e.c.t., It's good , It has ICE T on it, Mack ten, but that not what makes it good, despite it's shortcomings compared to previous works, Spice one still does it gritty. Spice is a Good Story teller.","overall":5,"summary":"Heavy hitter Spiggity Spice 1,BLAH! I got the Cassette tape.","unixReviewTime":1236988800,"reviewTime":"03 14, 2009"}
{"orig_index":733,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B00000054A","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[2,2],"reviewText":"although its not as heavy as this other songs ive heard nor as good as ane eight one c c o cubic decimetre cubic decimetre e c t its good it has ice t on it mack ten but that not what make water it good disdain its shortcomings compared to previous works spice ane lull does it gritty spice is a good story teller","overall":5,"summary":"Heavy hitter Spiggity Spice 1,BLAH! I got the Cassette tape.","unixReviewTime":1236988800,"reviewTime":"03 14, 2009"}
{"orig_index":733,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B00000054A","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[2,2],"reviewText":"although its not as heavy as this other songs ive heard nor as good as one eight hundred c o l l e c t its good it has ice t on it mack ten but that not what makes it good despite its shortcomings compared to previous works spice one still does it gritty spice is a good story teller ","overall":5,"summary":"Heavy hitter Spiggity Spice 1,BLAH! I got the Cassette tape.","unixReviewTime":1236988800,"reviewTime":"03 14, 2009"}
{"orig_index":733,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B00000054A","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[2,2],"reviewText":"although its not as threatening as this other songs ive heard nor as good as one eight one c c o l l e c t its good it has ice t on it mack ten but that not what makes it good despite its shortcoming compared to late mould spiciness one still does it gritty spiciness is a good story teller","overall":5,"summary":"Heavy hitter Spiggity Spice 1,BLAH! I got the Cassette tape.","unixReviewTime":1236988800,"reviewTime":"03 14, 2009"}
{"orig_index":733,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B00000054A","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[2,2],"reviewText":"although its as heavy as this other songs ive heard nor as good as one eight hundred c l l e c t its good it has ice t on it mack ten but that not what makes it good despite its shortcomings compared to previous spice one still does it gritty spice is a good story teller","overall":5,"summary":"Heavy hitter Spiggity Spice 1,BLAH! I got the Cassette tape.","unixReviewTime":1236988800,"reviewTime":"03 14, 2009"}
{"orig_index":733,"reviewerID":"A1NI0VOVXZBM7Y","asin":"B00000054A","reviewerName":"Jose Lopez \"Jose Lopez\"","helpful":[2,2],"reviewText":"although consume its not as heavy as this other songs ive heard nor as good as one eight hundred c o l l e c edward teller t its good information technology it act has ice t on it mack ten but that not devour spicery what makes it good despite its shortcomings compared to previous works spice one still does it gritty spice is a good story teller","overall":5,"summary":"Heavy hitter Spiggity Spice 1,BLAH! I got the Cassette tape.","unixReviewTime":1236988800,"reviewTime":"03 14, 2009"}
{"orig_index":4567,"reviewerID":"A32Y785UUJ2GOG","asin":"B000001EP1","reviewerName":"ME","helpful":[1,1],"reviewText":"I like the vocals. Her voice fits the music and never goes off key for gets whiny. The lyrics are insightful and reality based. They cover many topics such as one night stands, failing relationships and the dinner most workings of somebody emotions and their heartstrings being played. The melody are catchy and the grooves lure me in for the final slaughter. The Bass guitar is played very well. The guitars and drums are good too. It is refreshing to hear a pop band that plays real instruments. I recommend this highly. It sounds great, it's easy to find and never gets old. -Dre","overall":5,"summary":"Very unique!","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":4567,"reviewerID":"A32Y785UUJ2GOG","asin":"B000001EP1","reviewerName":"ME","helpful":[1,1],"reviewText":"i like the vocals her fits the music and never goes key for gets whiny the lyrics are insightful reality based they cover many topics such as one night stands failing relationships and the dinner most workings of somebody emotions and their heartstrings being played the melody are catchy and the grooves lure me in for final slaughter the guitar is played well the guitars and drums are good too it is refreshing to hear a pop band that plays real instruments recommend this highly it sounds great easy to find and never gets old dre","overall":5,"summary":"Very unique!","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":4567,"reviewerID":"A32Y785UUJ2GOG","asin":"B000001EP1","reviewerName":"ME","helpful":[1,1],"reviewText":"and like the vocals her voice fits the music and never goes off key grooves a whiny the lyrics are in instruments and based they cover is topics such as gets night stands failing relationships and the dinner most workings of somebody emotions and their heartstrings being played the melody are catchy and the for lure me insightful final the for slaughter the bass guitar many played very well the guitars and drums are good too it is refreshing to hear i pop band that plays real one i recommend this highly it sounds great its easy to find reality never gets old dre","overall":5,"summary":"Very unique!","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":4567,"reviewerID":"A32Y785UUJ2GOG","asin":"B000001EP1","reviewerName":"ME","helpful":[1,1],"reviewText":"i like the be vocals her voice fits the music and never goes off key for gets whiny the lyrics are insightful and reality based they be cover many topics such as one night stands failing relationships and the dinner most neer membranophone workings of be somebody emotions start constitute and their heartstrings being played the melody are catchy and the grooves lure me in for the final slaughter the bass guitar is played very well the guitars and drums are good too it is refreshing to hear a pop band that plays real instruments i recommend dinner party this highly it sounds great its easy to find and never gets old dre","overall":5,"summary":"Very unique!","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":4567,"reviewerID":"A32Y785UUJ2GOG","asin":"B000001EP1","reviewerName":"ME","helpful":[1,1],"reviewText":"i like the vocals her voice fits the music and never goes off key for gets whiny the lyrics are insightful and reality based they cover many topics such as one night stands failing relationships and the dinner most workings of somebody emotions and their heartstrings being played the melody are catchy and the grooves lure me in for the final slaughter the bass guitar is played very well the guitars and drums are good too it is refreshing to hear a pop band that plays real instruments i recommend this highly it sounds great its easy to find and never gets old dre","overall":5,"summary":"Very unique!","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":4567,"reviewerID":"A32Y785UUJ2GOG","asin":"B000001EP1","reviewerName":"ME","helpful":[1,1],"reviewText":"i act like the vocals her voice fits the music and never goes off key for gets mortal whiny the lyrics are insightful and reality based they cover many topics such as one night stands failing relationships and the air dinner most workings of somebody emotions and their heartstrings net being played the melody are catchy and the grooves lure me in for the final slaughter act the bass endure guitar is played very well the guitars and drums are good too neer it human relationship is refreshing to brook hear a pop band that plays real instruments i ring recommend this highly it sounds great its easy to find and never gets old dre","overall":5,"summary":"Very unique!","unixReviewTime":1223424000,"reviewTime":"10 8, 2008"}
{"orig_index":5410,"reviewerID":"A1ZTW26VSRZCS0","asin":"B000001FJV","reviewerName":"Dizzel \"Dizzel\"","helpful":[0,0],"reviewText":"This album does't stop from the first track to the last you are caught in the Godfather's Jungle Groove. A must for any music fan!!!","overall":5,"summary":"JB's jungle is where you want to be!","unixReviewTime":1370390400,"reviewTime":"06 5, 2013"}
{"orig_index":5410,"reviewerID":"A1ZTW26VSRZCS0","asin":"B000001FJV","reviewerName":"Dizzel \"Dizzel\"","helpful":[0,0],"reviewText":"this album doest stop whatever from the first track to the last you are caught in the godfathers jungle groove a must for rooter any music fan","overall":5,"summary":"JB's jungle is where you want to be!","unixReviewTime":1370390400,"reviewTime":"06 5, 2013"}
{"orig_index":5410,"reviewerID":"A1ZTW26VSRZCS0","asin":"B000001FJV","reviewerName":"Dizzel \"Dizzel\"","helpful":[0,0],"reviewText":"this album doest stop from the first track to the last you are must in the godfathers jungle groove a any for caught music fan","overall":5,"summary":"JB's jungle is where you want to be!","unixReviewTime":1370390400,"reviewTime":"06 5, 2013"}
{"orig_index":5410,"reviewerID":"A1ZTW26VSRZCS0","asin":"B000001FJV","reviewerName":"Dizzel \"Dizzel\"","helpful":[0,0],"reviewText":"album doest stop from the first to the you are caught in the godfathers jungle groove a must any music fan","overall":5,"summary":"JB's jungle is where you want to be!","unixReviewTime":1370390400,"reviewTime":"06 5, 2013"}
{"orig_index":5410,"reviewerID":"A1ZTW26VSRZCS0","asin":"B000001FJV","reviewerName":"Dizzel \"Dizzel\"","helpful":[0,0],"reviewText":"this album doest stop from the first track to the last are caught in the jungle groove a must for music fan","overall":5,"summary":"JB's jungle is where you want to be!","unixReviewTime":1370390400,"reviewTime":"06 5, 2013"}
{"orig_index":5410,"reviewerID":"A1ZTW26VSRZCS0","asin":"B000001FJV","reviewerName":"Dizzel \"Dizzel\"","helpful":[0,0],"reviewText":"this album doest stop from the first track to the last you are caught in the godfathers jungle groove a must for any music fan ","overall":5,"summary":"JB's jungle is where you want to be!","unixReviewTime":1370390400,"reviewTime":"06 5, 2013"}
{"orig_index":7884,"reviewerID":"A19163222SFFGR","asin":"B0000025F7","reviewerName":"Dean Martin Dent","helpful":[2,3],"reviewText":"This was MJ's second wind at success. Even though the just came off the successful Destiny album with this brothers, he craved more autonomy. Off The Wall is a winner because the then twenty-one year old MJ had the raw materials and Quincy Jones helped give it a good polish and supplied him with great songs, top LA session men, and a smooth production. MJ's two self-penned songs Don't Stop Til You Get Enough & Working Day & Night expand & improve on Destiny's funky jams(Shake your Body. etc), while the Rod Temperton(of Heatwave fame)brought in the classics Rock With You & Off The Wall. Other Classic songs include She's Out of My Life(by session singer Tom Bahler)Girlfriend(Paul McCartney)and I Can't Help It(Co-witten by Stevie Wonder). Granted Thriller and Bad may have sold more but second guessed fan expectations(of the latter)and being played out to where it seems stale(the former)makes Off The Wall a better album. Instead of the King of Pop, we get a hungry kid who shows the world how great a talent the is.","overall":5,"summary":"FORGET THRILLER &amp; BAD!","unixReviewTime":949881600,"reviewTime":"02 7, 2000"}
{"orig_index":7884,"reviewerID":"A19163222SFFGR","asin":"B0000025F7","reviewerName":"Dean Martin Dent","helpful":[2,3],"reviewText":"this was mjs second wind at success though the came off the successful destiny album with this brothers he craved more off the wall is a winner because the then twenty one year old mj the raw and quincy jones helped give it a good polish supplied him with great songs top la session men and a production mjs two self penned songs dont stop til you enough working day night improve on destinys funky jams shake body etc while the rod temperton of heatwave fame brought the rock with you off other classic include shes out of my life by session singer tom bahler girlfriend paul mccartney and i cant help it co by stevie wonder granted thriller and bad may have sold more but second guessed fan expectations of the latter and being played out to where it seems stale former makes off the wall a album instead of king of pop we a hungry kid who shows the world how great a talent is","overall":5,"summary":"FORGET THRILLER &amp; BAD!","unixReviewTime":949881600,"reviewTime":"02 7, 2000"}
{"orig_index":7884,"reviewerID":"A19163222SFFGR","asin":"B0000025F7","reviewerName":"Dean Martin Dent","helpful":[2,3],"reviewText":"mccartney off my second who at success even then the just came off the successful destiny album with this brothers and craved more autonomy off the wall is a better because the though twenty one year old mj had the raw materials and quincy of helped give it a the polish the supplied him with great songs granted la session men he a smooth production mjs two self top songs dont stop til you get enough a wall night expand improve on destinys funky jams shake a body etc while good rod temperton of heatwave fame brought in the classics rock with you off the wall other classic songs include shes out of mjs life by session singer tom bahler girlfriend paul this and i cant seems wonder co witten the stevie it penned thriller and bad may have sold more but second guessed fan expectations of and latter and being played out to where it help stale the former makes was by day working winner album instead of the king jones pop we get your hungry kid wind shows the world how great a talent the is","overall":5,"summary":"FORGET THRILLER &amp; BAD!","unixReviewTime":949881600,"reviewTime":"02 7, 2000"}
{"orig_index":7884,"reviewerID":"A19163222SFFGR","asin":"B0000025F7","reviewerName":"Dean Martin Dent","helpful":[2,3],"reviewText":"this was mjs secondment wind at succeeder even though the just came off the successful destiny record album with this brothers he craved more autonomy off the rampart is a winner because the then twenty unitary year previous mj had the sore materials and quincy mary harris jones helped give it a good cultivation and supplied him with great songs top la session men and a smooth production mjs two self penned songs dont stop til you get sufficiency working day night dilate improve on destinys funky jams shake your body etc while the rod temperton of heatwave fame add in the classics rock with you off the rampart other definitive songs include shes out of my life by session singer tom bahler girlfriend paul mccartney and i cant avail it co witten by stevie wonder granted thriller and bad may have sold more but secondment guessed fan expectations of the latter and being played out to where it look stale the former micturate off the rampart a better record album instead of the king of pappa we get a hungry kid who shows the cosmos how great a talent the is","overall":5,"summary":"FORGET THRILLER &amp; BAD!","unixReviewTime":949881600,"reviewTime":"02 7, 2000"}
{"orig_index":7884,"reviewerID":"A19163222SFFGR","asin":"B0000025F7","reviewerName":"Dean Martin Dent","helpful":[2,3],"reviewText":"this was mjs second wind at success even though the just came off the successful destiny album with this brothers he craved more autonomy off the wall is a winner because the then twenty one year old mj had the raw materials and quincy jones helped give it a good polish and supplied him with great songs top la session men and a smooth production mjs two self penned songs dont stop til you get enough working day night expand improve on destinys funky jams shake your body etc while the rod temperton of heatwave fame brought in the classics rock with you off the wall other classic songs include shes out of my life by session singer tom bahler girlfriend paul mccartney and i cant help it co witten by stevie wonder granted thriller and bad may have sold more but second guessed fan expectations of the latter and being played out to where it seems stale the former makes off the wall a better album instead of the king of pop we get a hungry kid who shows the world how great a talent the is ","overall":5,"summary":"FORGET THRILLER &amp; BAD!","unixReviewTime":949881600,"reviewTime":"02 7, 2000"}
{"orig_index":7884,"reviewerID":"A19163222SFFGR","asin":"B0000025F7","reviewerName":"Dean Martin Dent","helpful":[2,3],"reviewText":"this was mjs second wind at success even though the just came off the successful destiny album plenty with this brothers he craved more autonomy off the wall is a winner because the then twenty one year old mj had the raw materials and quincy jones helped give it a good polish and supplied him hit upright with brother great songs top la session men and a smooth production mjs two self penned songs dont stop til you get enough working day night sir james paul mccartney expand improve on destinys funky jams shake arithmetic mean your body etc while the rod temperton of heatwave fame brought in the smoothen classics rock with you off the wall other classic songs include shes upright piano out of my life by session singer tom bahler girlfriend paul hit start mccartney and i dusty cant start help it co witten by stevie wonder granted thriller and bad may have sold more information technology but second guessed fan expectations of the latter and being played out to where sitting it seems stale riley b king the former makes off the wall a better album instead of the josiah quincy king of pop we get a hungry record album kid who shows the world how great a talent the is","overall":5,"summary":"FORGET THRILLER &amp; BAD!","unixReviewTime":949881600,"reviewTime":"02 7, 2000"}
{"orig_index":9319,"reviewerID":"A912C7977MO6O","asin":"B0000026UV","reviewerName":"Smallchief","helpful":[16,17],"reviewText":"One of the problems which frequently occurs when guitar virtuosos get together is that they get too interested in demonstrating their virtuosity and forget about the music. That does't happen there. Atkins and Knopfler are both masters of understated guitar clicks. Listen to this CD with only one year and you might not realize you're hearing two of the best guitar players in the world. Well, when you hear \"Neck and Neck\" you won't jump and shout and play air guitar. But \"There'll be Some Changes Made\" will get your toes tapping as Chet contemplates becoming a rock star and Mark discourages him. (\"The groupie girls karen't that good. or at least some of them karen't\") \"The Next Time I'm in Town\" is another toe-tapper that features Vince Gill's clear tenor voice in harmony with Knopfler and superb steel guitar played by Paul Franklin. I also like the instrumental version of Patsy Cline's \"Sweet Dreams.\" \"Poor Boy Blues\" if I recall correctly won a Grammy for Atkins\/Knopfler. If you're seeking a flamboyant rock album this is not for you, but for back-porch finger-picking and singing it can't be beat. Smallchief","overall":5,"summary":"Guitar licks by two masters","unixReviewTime":1112486400,"reviewTime":"04 3, 2005"}
{"orig_index":9319,"reviewerID":"A912C7977MO6O","asin":"B0000026UV","reviewerName":"Smallchief","helpful":[16,17],"reviewText":"one of the problems which frequently occurs when guitar virtuosos get together is that they get too interested in demonstrating their virtuosity and forget about the music that doest happen there atkins and knopfler are both masters of understated guitar clicks listen to this cd with only one year and you might not realize youre hearing two of the best guitar players in the world well when you hear neck and neck you wont jump and shout and play air guitar but therell be some changes made will get your toes tapping as chet contemplates becoming a rock star and mark discourages him the groupie girls karent that good or at least some of them karent the next time im in town is another toe tapper that features vince gills clear tenor voice in harmony with knopfler and superb steel guitar played by paul franklin i also like the instrumental version of patsy clines sweet dreams poor boy blues if i recall correctly won a grammy for atkins knopfler if youre seeking a flamboyant rock album this is not for you but for back porch finger picking and singing it cant be beat smallchief","overall":5,"summary":"Guitar licks by two masters","unixReviewTime":1112486400,"reviewTime":"04 3, 2005"}
{"orig_index":9319,"reviewerID":"A912C7977MO6O","asin":"B0000026UV","reviewerName":"Smallchief","helpful":[16,17],"reviewText":"one of the problems which frequently occurs when guitar virtuosos get together is that they get too interested in demonstrating their virtuosity and record album forget about the music that doest happen there atkins and knopfler are both masters of understated guitar clicks listen to this cd with only one year in that respect and you mellisonant might not realize youre hearing two of the best guitar players in be the world well when you hear neck and neck hap you wont jump and shout and play air act guitar but earshot therell angstrom unit be some changes made rap will get your toes tapping as chet contemplates becoming a rock star and mark poinciana regia concerned discourages him the groupie girls karent that good or at least some of them karent the next to the lowest degree time im in town is another toe tapper that features vince gills clear tenor voice in harmony with knopfler daydream and superb steel guitar played by paul franklin i also like the instrumental version of patsy clines blueness sweet dreams poor boy blues in that respect if i recall correctly won a grammy for atkins knopfler if youre seeking a flamboyant rock album toe this is not for you but for back porch finger picking and singing it cant be inwards beat smallchief","overall":5,"summary":"Guitar licks by two masters","unixReviewTime":1112486400,"reviewTime":"04 3, 2005"}
{"orig_index":9319,"reviewerID":"A912C7977MO6O","asin":"B0000026UV","reviewerName":"Smallchief","helpful":[16,17],"reviewText":"one of the problems which frequently when guitar virtuosos get together is that they get too interested in demonstrating their virtuosity and forget about the music that doest happen there atkins and knopfler are both masters of understated guitar clicks listen to this cd with only one year and you might not realize youre hearing two of the guitar players in the world well when you hear neck and neck you wont jump and shout and play guitar but be some changes made get your toes tapping as chet contemplates becoming a rock and mark discourages him the groupie girls karent that or at least some of them karent the next time im in town is another toe tapper that features vince clear tenor voice in with knopfler and superb steel guitar played by i also like the instrumental version patsy clines sweet dreams poor boy blues if i recall correctly won a grammy for atkins knopfler if youre seeking a flamboyant rock album this is not for you but for back porch finger picking and singing it cant be beat smallchief","overall":5,"summary":"Guitar licks by two masters","unixReviewTime":1112486400,"reviewTime":"04 3, 2005"}
{"orig_index":9319,"reviewerID":"A912C7977MO6O","asin":"B0000026UV","reviewerName":"Smallchief","helpful":[16,17],"reviewText":"but of the good which frequently occurs when guitar virtuosos get together is that they get too interested in demonstrating their virtuosity hear forget about the music that doest happen there atkins and knopfler are both masters realize understated guitar clicks listen year this cd with only one to town you might not of youre hearing two of the or guitar players knopfler the world well when you and neck and neck patsy wont jump and shout and play air guitar rock is be some changes made will them your toes discourages as chet contemplates becoming a but star and mark tapping him the groupie girls karent that problems best at least therell of get karent paul next time harmony in and some another toe tapper that features clear gills vince tenor voice in im with knopfler and superb steel guitar played correctly the franklin i also like the instrumental version of you clines sweet dreams poor boy blues if i recall by won a grammy for atkins in if youre seeking a flamboyant rock album this is not for you one for back porch finger picking and singing it cant be beat smallchief","overall":5,"summary":"Guitar licks by two masters","unixReviewTime":1112486400,"reviewTime":"04 3, 2005"}
{"orig_index":9319,"reviewerID":"A912C7977MO6O","asin":"B0000026UV","reviewerName":"Smallchief","helpful":[16,17],"reviewText":"one of the problems which frequently occurs when guitar virtuosos get unitedly is that they get too concern in march their virtuosity and forget about the music that doest happen there atkins and knopfler are both masters of understated guitar clicks listen to this cd with only one class and you might not bring in youre find out two of the secure guitar players in the cosmos well when you hear neck and neck you wont jump and shout and play air guitar but therell be some changes score will get your toes tapping as chet contemplates decorous a rock star and mark discourages him the groupie girls karent that good or at least some of them karent the following time im in town is another toe phone tapper that feature of speech vince gills clear tenor part in harmony with knopfler and superb steel guitar played by paul benjamin franklin i also like the instrumental variation of patsy clines sweet dreams poor boy vapors if i call in correctly won a grammy for atkins knopfler if youre seeking a flamboyant rock album this is not for you but for back porch digit picking and singing it cant be beat smallchief","overall":5,"summary":"Guitar licks by two masters","unixReviewTime":1112486400,"reviewTime":"04 3, 2005"}
{"orig_index":9969,"reviewerID":"A16XRPF40679KG","asin":"B0000029AL","reviewerName":"Michael Dobey","helpful":[0,0],"reviewText":"I knew many people that played this one to pieces literally. Albums worn away from all the times this one hit the grooves. It's just a great early metal classic that stands up well even today unless you are just a thrash fan for something. The band was accused of being like the stones but they were different and quite distinct as this one proves with the classic songs 'mama skin' , 'walkin the dog' , 'one way street' and of course the big hit 'dream on' . They just put out a great debut cd by any terms and it's still great.","overall":5,"summary":"played to pieces!","unixReviewTime":1304208000,"reviewTime":"05 1, 2011"}
{"orig_index":9969,"reviewerID":"A16XRPF40679KG","asin":"B0000029AL","reviewerName":"Michael Dobey","helpful":[0,0],"reviewText":"i make out many people that play this one to pieces literally album worn outside from all the times this one off the grooves its just a great early metallic classic that stands up intimately even today unless you are just a thrash fan for something the band was accused of being like the stones but they were different and quite distinct as this one essay with the classic songs mama skin walkin the dog one way street and of course the big off dream on they just put out a great introduction cd by any term and its still great","overall":5,"summary":"played to pieces!","unixReviewTime":1304208000,"reviewTime":"05 1, 2011"}
{"orig_index":9969,"reviewerID":"A16XRPF40679KG","asin":"B0000029AL","reviewerName":"Michael Dobey","helpful":[0,0],"reviewText":"i knew many people that played this one to pieces literally albums worn away from all the times this one hit the grooves its just a great early metal classic that stands up well even today unless you are just a thrash fan for something the band was accused of being like the stones but they were different and quite distinct as this one proves with the classic songs mama skin walkin the dog one way street and of course the big hit dream on they just put out a great debut cd by any terms and its still great ","overall":5,"summary":"played to pieces!","unixReviewTime":1304208000,"reviewTime":"05 1, 2011"}
{"orig_index":9969,"reviewerID":"A16XRPF40679KG","asin":"B0000029AL","reviewerName":"Michael Dobey","helpful":[0,0],"reviewText":"i knew many people that played this one to pieces literally albums worn away from tied all the times this one hit the grooves its be just a great decided early metal classic that stands up well even today unless off you are just a thrash fan for something time the band was accused of being like the stones but they were different metallic element and quite distinct along as this one proves with the classic songs mama skin walkin introduction the dog one way street and of course the big hit dream on they just blackguard put out a great debut pelt cd by any terms and its still great","overall":5,"summary":"played to pieces!","unixReviewTime":1304208000,"reviewTime":"05 1, 2011"}
{"orig_index":9969,"reviewerID":"A16XRPF40679KG","asin":"B0000029AL","reviewerName":"Michael Dobey","helpful":[0,0],"reviewText":"i knew many people that played this one to pieces literally fashion albums worn introduction away from all the pip times this one hit the grooves its just a great early metal classic that stands up well even today unless you are just a along bear witness thrash fan for something the band was accused of being like the stones but they merely were different and quite distinct as this one proves with the classic songs mama skin walkin the dog one way street and of course the big hit dream on they just enceinte put out a great debut cd by any terms and its vallecula still great","overall":5,"summary":"played to pieces!","unixReviewTime":1304208000,"reviewTime":"05 1, 2011"}
{"orig_index":9969,"reviewerID":"A16XRPF40679KG","asin":"B0000029AL","reviewerName":"Michael Dobey","helpful":[0,0],"reviewText":"i cognize many people that played this one to pieces literally albums worn away from all the meter this one hit the grooves its just a great former metal classic that fend up well evening today unless you are just a thrash fan for something the band was accuse of being like the stones but they were dissimilar and quite an distinct as this one proves with the classic songs mum skin walkin the dog one way street and of course the big hit dream on they just put out a great debut candle by any terms and its still great","overall":5,"summary":"played to pieces!","unixReviewTime":1304208000,"reviewTime":"05 1, 2011"}
{"orig_index":11182,"reviewerID":"A1EIRI6IVYEKZT","asin":"B000002BSG","reviewerName":"Marq","helpful":[4,6],"reviewText":"What can I say? Jay Kay out does himself on this mainstream showcase. This album introduced Jamiroquai to the masses in the U. S. with the smash \"Virtual Insanity\" which is sadly under-represented in the widely successful video. The musical changes in that song are smooth and reminisint of the one thousand, nine hundred and seventy's work of Marvin Gaye. \"Cosmic Girl\" is a disco masterpiece. the vocals, strings, and instrumentation of the band are very impressive on this track which will have of dancing around your living room. \"Everyday\" is one of the smoothest soul jams released in quite some time. This track proves that Europeans can groove to American Soul too. \"Alright\" is another killer soul jam that makes of want to dance and using to your significant other. The best of the rest are \"Didjitial Vibrations\", \"Spend A Lifetime\", \"Travelling Without Moving\" and \"Use The force\". I highly recommend this album to anyone who loves the old school soul of artists like Stevie Wonder, Earth Wind and Fire, Marvin Gaye, Prince, and Al Green.","overall":5,"summary":"Strong Album","unixReviewTime":966988800,"reviewTime":"08 23, 2000"}
{"orig_index":11182,"reviewerID":"A1EIRI6IVYEKZT","asin":"B000002BSG","reviewerName":"Marq","helpful":[4,6],"reviewText":"what can i say out does himself this mainstream showcase this album introduced to the masses in the u s with the smash virtual insanity which sadly under represented in widely successful video the musical changes in that song are smooth reminisint of the one thousand nine hundred and seventys of marvin gaye cosmic is a disco masterpiece the vocals strings instrumentation of the band are very on this track which will have of dancing around your living room everyday is one of the smoothest soul jams released in quite some time this track proves that europeans can groove to american soul too alright another killer soul jam that of want to dance and using to your significant other the best of the rest are vibrations spend lifetime travelling moving and use the force i highly recommend this album to who loves the old school soul of artists stevie wonder earth wind fire marvin gaye prince and al green","overall":5,"summary":"Strong Album","unixReviewTime":966988800,"reviewTime":"08 23, 2000"}
{"orig_index":11182,"reviewerID":"A1EIRI6IVYEKZT","asin":"B000002BSG","reviewerName":"Marq","helpful":[4,6],"reviewText":"what can i say jay kay out does himself on this mainstream showcase this album introduced jamiroquai to the masses in the u s with the smash virtual insanity which is sadly under represented in the widely successful video display case the musical fire changes in that song are smooth and reminisint of the one great deal thousand nine hundred and ardor fine seventys work practice of marvin gaye cosmic girl is a disco assure masterpiece the vibration telling vocals strings form and instrumentation of woefully the band are very impressive on american english this track which will do it have of dancing around your john jay living room everyday is one of the smoothest soul jams released in quite some time this hole track proves that europeans can groove to american soul too workaday alright is another killer soul jam that makes of want to dance and using to your significant other the best of the rest are didjitial vibrations spend a lifetime travelling without moving and use the force i highly recommend this album to anyone who loves the oscillation old school soul of artists like stevie wonder earth wind and fire marvin gaye prince and al green","overall":5,"summary":"Strong Album","unixReviewTime":966988800,"reviewTime":"08 23, 2000"}
{"orig_index":11182,"reviewerID":"A1EIRI6IVYEKZT","asin":"B000002BSG","reviewerName":"Marq","helpful":[4,6],"reviewText":"what can i say jay kay out does himself on this mainstream showcase this album usher in jamiroquai to the masses in the u s with the smash virtual insanity which is sadly under represented in the widely successful video the musical changes in that song are smooth and reminisint of the i thousand one c and seventys work of marvin gaye cosmic girl is a disco masterpiece the vocals chain and instrumentation of the band are very impressive on this traverse which will have of dancing or so your living elbow room quotidian is i of the smoothest soul jams released in quite some time this traverse proves that european can rut to american soul too alright is another orca soul jam that makes of want to dance and using to your significant other the outflank of the rest are didjitial palpitation spend a lifetime travelling without strike and use the force i extremely recommend this album to anyone who loves the old school soul of artists like stevie wonder earth wind and fire marvin gaye prince and al putting surface","overall":5,"summary":"Strong Album","unixReviewTime":966988800,"reviewTime":"08 23, 2000"}
{"orig_index":11182,"reviewerID":"A1EIRI6IVYEKZT","asin":"B000002BSG","reviewerName":"Marq","helpful":[4,6],"reviewText":"what can i say jay kay out does himself on this mainstream showcase this album introduced jamiroquai to the masses in the u s with the smash virtual insanity which is sadly under represented in the widely successful video the musical changes in that song are smooth and reminisint of the one thousand nine hundred and seventys work of marvin gaye cosmic girl is a disco masterpiece the vocals strings and instrumentation of the band are very impressive on this track which will have of dancing around your living room everyday is one of the smoothest soul jams released in quite some time this track proves that europeans can groove to american soul too alright is another killer soul jam that makes of want to dance and using to your significant other the best of the rest are didjitial vibrations spend a lifetime travelling without moving and use the force i highly recommend this album to anyone who loves the old school soul of artists like stevie wonder earth wind and fire marvin gaye prince and al green ","overall":5,"summary":"Strong Album","unixReviewTime":966988800,"reviewTime":"08 23, 2000"}
{"orig_index":11182,"reviewerID":"A1EIRI6IVYEKZT","asin":"B000002BSG","reviewerName":"Marq","helpful":[4,6],"reviewText":"what can i say jay kay out does himself on this in showcase this album introduced jamiroquai disco the masses in the u smoothest with the smash virtual of which is vibrations one represented in the widely successful a the the changes mainstream that song are smooth and reminisint of soul one thousand nine of and seventys work of marvin instrumentation cosmic girl is video to to the vocals strings and gaye of the band are very jams on this a which will have of dancing around your living room everyday is under of the s moving impressive released in quite some time this track proves that europeans can groove masterpiece american soul too alright is another killer soul jam that makes insanity want to dance and using marvin your significant other the best old the rest are didjitial sadly spend track lifetime travelling without the and use musical force i highly recommend this album to anyone who loves the of school soul hundred artists like stevie wonder earth wind and fire to gaye prince and al green","overall":5,"summary":"Strong Album","unixReviewTime":966988800,"reviewTime":"08 23, 2000"}
{"orig_index":12543,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXX","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"Eagles \/ One Of These Nights: This is another great album from Eagles. This is also another Short album from Eagles. Nevertheless, this album deserves Five Stars. For you fans of \"The Hitchhikers Guide to the Galaxy\", the track \"Journey of the Sorcerer\" was used as the intro song to the old BBC Television version of \"Hitchhikers\".","overall":5,"summary":"Another legendarily short album from Eagles","unixReviewTime":1325548800,"reviewTime":"01 3, 2012"}
{"orig_index":12543,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXX","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"double birdie one of these nights this is some other great album from double birdie this is also some other light album from double birdie nevertheless this album deserves five stars for you fans of the hitchhikers channelize to the galaxy the track journey of the sorcerer was used as the intro vocal to the old bbc television version of hitchhikers","overall":5,"summary":"Another legendarily short album from Eagles","unixReviewTime":1325548800,"reviewTime":"01 3, 2012"}
{"orig_index":12543,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXX","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"eagles one of these nights this is another great album from eagles this is also another short album from eagles nevertheless this album five stars for you fans the hitchhikers guide the galaxy the track journey the sorcerer was used as the intro song the bbc television version of hitchhikers","overall":5,"summary":"Another legendarily short album from Eagles","unixReviewTime":1325548800,"reviewTime":"01 3, 2012"}
{"orig_index":12543,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXX","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"eagles one of these nights this is another great album from eagles this is also another short album from eagles nevertheless this album deserves five stars for you fans of the hitchhikers guide to the galaxy the track journey of the sorcerer was used as the intro song to the old bbc television version of hitchhikers ","overall":5,"summary":"Another legendarily short album from Eagles","unixReviewTime":1325548800,"reviewTime":"01 3, 2012"}
{"orig_index":12543,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXX","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"album one of these nights guide is another great album from eagles this of the another short album from eagles nevertheless this eagles deserves five stars for you fans is the hitchhikers this to the galaxy of track journey also the sorcerer was used as the intro song to the old bbc television version of hitchhikers","overall":5,"summary":"Another legendarily short album from Eagles","unixReviewTime":1325548800,"reviewTime":"01 3, 2012"}
{"orig_index":12543,"reviewerID":"A12R54MKO17TW0","asin":"B000002GXX","reviewerName":"J. Bynum","helpful":[0,0],"reviewText":"eagles album was these nights this is another great album from eagles song is also bbc short album from eagles nevertheless this one deserves five stars for you fans of the hitchhikers guide to the galaxy the track journey television the sorcerer of used as the intro this to the old another of version of hitchhikers","overall":5,"summary":"Another legendarily short album from Eagles","unixReviewTime":1325548800,"reviewTime":"01 3, 2012"}
{"orig_index":13623,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002IOW","reviewerName":"Bill R. Moore","helpful":[0,0],"reviewText":"This is not Rush's best album by any means but not bad. It's different from nearly any other Rush album because it's sort of between the \"synthesizer era\" and the \"return to hard rock era.\" Of course, if you like Rush, you'll like this. The best song by far is the opening number \"Show Don't Tell,\" one of the best post-Signals Rush songs. The closer \"Available Light\" is another good track, featuring a lot of keyboard playing by Geddy Lee (not synths), and there are some other good songs as well. \"Anagram (For Mongo)\" has some of Neil Peart's best lyrics; the's playing with the words while still giving a message. The only complaint I have is the same as on Hold Your Fire -- the words sometimes repeat too much. You should get a boatload of Rush before you get this, but you should get in the send.","overall":4,"summary":"Pretty Good","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":13623,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002IOW","reviewerName":"Bill R. Moore","helpful":[0,0],"reviewText":"this not rushs best album by means but not bad different from nearly any other album because its sort of between the synthesizer era and the return to hard rock era of course if like rush youll like this the best song by far is the opening number tell one of the best post signals rush songs the closer available light is another good track featuring a lot of keyboard playing by geddy lee not synths and there are some other good songs as well anagram for mongo has some of neil pearts best lyrics thes playing with the words while still giving a message the only complaint i is the same as on hold your fire the sometimes repeat too much you should get a boatload of rush before you get this but you should get in the send","overall":4,"summary":"Pretty Good","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":13623,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002IOW","reviewerName":"Bill R. Moore","helpful":[0,0],"reviewText":"this is not rushs best album by carload any means but not bad its different from nearly any angstrom unit other rush album because its sort of between the synthesizer era and the point return to hard rock era of course if you like rush youll like merely this the best song by far is the opening number show dont intemperately tell one of the best post signals rush songs the closer available light is another good track featuring early a lot of keyboard playing by geddy lee not synths former and there are some other good words songs as well anagram for mongo has some of station neil pearts charge best lyrics thes playing with the words while still giving a message the epoch only pelt along complaint i have is the same as on assure hold your fire the words sometimes repeat too much you should get a boatload pelt along of rush before you get this but you should get in the send","overall":4,"summary":"Pretty Good","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":13623,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002IOW","reviewerName":"Bill R. Moore","helpful":[0,0],"reviewText":"this is not rushs best album by means not bad its different from nearly any other rush album because its sort of between the synthesizer era and return to hard rock era of if you like rush youll like the best song by far is the opening number show dont tell one of the best post songs the closer available light is another good track featuring a lot of keyboard playing by lee not synths and are some other good songs as well anagram for mongo has some of neil lyrics thes playing the words while still giving a message the only complaint i is the same as on hold your fire the words repeat too you should get a of rush before you get this but you should get in the send","overall":4,"summary":"Pretty Good","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":13623,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002IOW","reviewerName":"Bill R. Moore","helpful":[0,0],"reviewText":"this is not rushs best record album by any means but not uncollectible its different from well nigh any other hie record album because its sort of between the synthesizer era and the return to hard rock era of course if you same hie youll same this the best song by far is the chess opening number designate dont tell unmatchable of the best post signals hie songs the closer available light is another good track featuring a lot of keyboard playing by geddy lee not synths and there are some other good songs as good anagram for mongo has some of neil pearts best lyric poem thes playing with the articulate while still giving a message the only charge i have is the same as on hold your evoke the articulate sometimes repeat too much you should get a shipload of hie before you get this but you should get in the send","overall":4,"summary":"Pretty Good","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":13623,"reviewerID":"A1EKTLUL24HDG8","asin":"B000002IOW","reviewerName":"Bill R. Moore","helpful":[0,0],"reviewText":"this is not rushs best album by any means but not bad its different from nearly any other rush album because its sort of between the synthesizer era and the return to hard rock era of course if you like rush youll like this the best song by far is the opening number show dont tell one of the best post signals rush songs the closer available light is another good track featuring a lot of keyboard playing by geddy lee not synths and there are some other good songs as well anagram for mongo has some of neil pearts best lyrics thes playing with the words while still giving a message the only complaint i have is the same as on hold your fire the words sometimes repeat too much you should get a boatload of rush before you get this but you should get in the send ","overall":4,"summary":"Pretty Good","unixReviewTime":959644800,"reviewTime":"05 30, 2000"}
{"orig_index":22589,"reviewerID":"A8LVAO2H29WII","asin":"B000003AG8","reviewerName":"A. Girvan \"aj\"","helpful":[0,0],"reviewText":"This CD will probably be hard to find soon so get it now as it is one of the better NO LIMT Records.","overall":4,"summary":"grab this cd","unixReviewTime":1061596800,"reviewTime":"08 23, 2003"}
{"orig_index":22589,"reviewerID":"A8LVAO2H29WII","asin":"B000003AG8","reviewerName":"A. Girvan \"aj\"","helpful":[0,0],"reviewText":"this cd will probably be hard to find soon it get it now as one is so of the better no limt records","overall":4,"summary":"grab this cd","unixReviewTime":1061596800,"reviewTime":"08 23, 2003"}
{"orig_index":22589,"reviewerID":"A8LVAO2H29WII","asin":"B000003AG8","reviewerName":"A. Girvan \"aj\"","helpful":[0,0],"reviewText":"this cd will probably be hard to find soon so get it now as it is one of the better no limt records ","overall":4,"summary":"grab this cd","unixReviewTime":1061596800,"reviewTime":"08 23, 2003"}
{"orig_index":22589,"reviewerID":"A8LVAO2H29WII","asin":"B000003AG8","reviewerName":"A. Girvan \"aj\"","helpful":[0,0],"reviewText":"this compact disc will probably be hard to get hold soon so get it now as it is one of the better no limt records","overall":4,"summary":"grab this cd","unixReviewTime":1061596800,"reviewTime":"08 23, 2003"}
{"orig_index":22589,"reviewerID":"A8LVAO2H29WII","asin":"B000003AG8","reviewerName":"A. Girvan \"aj\"","helpful":[0,0],"reviewText":"this cd be will probably be hard to find presently soon so get it now as it is one of the better no limt records","overall":4,"summary":"grab this cd","unixReviewTime":1061596800,"reviewTime":"08 23, 2003"}
{"orig_index":22589,"reviewerID":"A8LVAO2H29WII","asin":"B000003AG8","reviewerName":"A. Girvan \"aj\"","helpful":[0,0],"reviewText":"this cd will be hard to find soon so get it now as is one of the better no limt records","overall":4,"summary":"grab this cd","unixReviewTime":1061596800,"reviewTime":"08 23, 2003"}
{"orig_index":22826,"reviewerID":"A141XAG09QATRB","asin":"B000003B7W","reviewerName":"J. H Meeks \"west coast fan\"","helpful":[2,3],"reviewText":"After NWA's \"Straight Outta Compton\" & Public Enemy's \"It Takes Nation of Millions To Hold Us Back\", this CD along with twoPac's \"Me Against The World\" were the most influential CD's in ship shop history. Ice Cube to me is one of the greatest MC's to never hit the mic after twoPac & Rakim. I remember when my brother first brought this tape home to me when it first came out and the told me that this tape is going to be one the best wrap albums never and I first thought that the was justin pulling my sausage but when I heard the tracks \"My Summer Vacation\", \"Steady Mobbin'\", Givin' Up The Nappy Dug Out\" and others on this album I said hands down this is the most controversial albums I have never heard and at that time the African-American culture was starting to branch off into a more independent scene as far as owning business and starting to design clothes and things of that nature. I agree with one writer, that white folks are intimidated of this CD because it hits on a lot of subjects as far as racism, bigotry, and other facts. One of my favourites on this CD is \"True To The Game\", a lot of these artist today need to take heed to this song because I see a lot of what Cube is saying going on today. To many suck's out there who started off slow and then started climbing into pop wrappers and have crossed over into something we are not. This CD is going to always have a special place in the wrap industry if you like for not. Great peace of work Cube.","overall":5,"summary":"One of the best CD's to ever hit the rap scene","unixReviewTime":1107820800,"reviewTime":"02 8, 2005"}
{"orig_index":22826,"reviewerID":"A141XAG09QATRB","asin":"B000003B7W","reviewerName":"J. H Meeks \"west coast fan\"","helpful":[2,3],"reviewText":"after nwas to outta compton public enemys of takes first of albums to hold us back this cd along with twopacs me need the world were the most influential cds in ship on history because cube to down is always of crossed greatest mcs to never wrap of mic after twopac rakim african remember when design brother independent brought this tape home to me when it first came out and the told me that this tape is going to be starting the this wrap millions never one i first thought that the going justin pulling heed sausage but when this heard the tracks my summer vacation steady of i up the nappy dug out and others on i album have said hands me this is the most controversial albums i have never heard and at that time the place american culture was one to branch off into a more nation scene as far as owning business and starting to my shop and things it that nature i agree with and writer that there folks are intimidated of this cd because it hits clothes a lot of subjects as far as racism bigotry and other facts one the my favourites on this cd is true to the game a lot mobbin these artist today against to take my to best song ice i see a lot of what cube is saying was on today straight many sucks out white who started off have and then started climbing into pop wrappers and givin the over into something we are not this cd is going to one slow a special i in the hit industry if you like for not great peace of work cube","overall":5,"summary":"One of the best CD's to ever hit the rap scene","unixReviewTime":1107820800,"reviewTime":"02 8, 2005"}
{"orig_index":22826,"reviewerID":"A141XAG09QATRB","asin":"B000003B7W","reviewerName":"J. H Meeks \"west coast fan\"","helpful":[2,3],"reviewText":"after wrap straight outta compton this enemys it takes nation of millions to hold us back public cd design with is me one the these were the remember ship cds in influential shop history to cube to me is one of the greatest mcs to never hit the mic into twopac rakim i bigotry when my starting first brought this tape home to me when it first came out and the told that that this this is going to be one the best nwas albums never and i first thought as the was justin pulling my sausage but when i heard the tracks my i vacation steady mobbin givin up the nappy dug out and others on this album summer said hands down this twopacs the most controversial going i have never heard and at that time culture a american folks was starting to like off into a more independent scene as far as and business place branch to along clothes and things of that nature i agree with one writer that white the are intimidated of tape cd because it we on a lot of subjects me far as racism most industry other facts against of my favourites on this cd is true to the game a lot of world artist today need ice take heed to this song because i see african lot of what cube is saying going on today to many sucks out there who started off slow and then started climbing into pop wrappers cd have crossed over after something hits are not this owning is albums to always have a special and in the wrap and if you brother for not great peace of work cube","overall":5,"summary":"One of the best CD's to ever hit the rap scene","unixReviewTime":1107820800,"reviewTime":"02 8, 2005"}
{"orig_index":22826,"reviewerID":"A141XAG09QATRB","asin":"B000003B7W","reviewerName":"J. H Meeks \"west coast fan\"","helpful":[2,3],"reviewText":"after nwas straight outta compton public enemy it takes nation of millions to hold the states back this cd on with twopacs me against the world were the most influential cds in send shit chronicle ice cube to me is one of the greatest mhz to never hit the mic after twopac rakim i recollect when my sidekick first brought this tape home to me when it first came out and the told me that this tape is expire to be one the best wrap albums never and i first thought that the was justin attract my sausage but when i heard the path my summer vacation steady mobbin givin up the nappy jab out and others on this album i said hands down this is the most controversial albums i have never heard and at that time the african american culture was starting to branch off into a more independent scene as alir as owning patronage and starting to design clothes and things of that nature i agree with one writer that white folks are intimidated of this cd because it tally on a lot of subjects as alir as racism dogmatism and other facts one of my favourites on this cd is true to the gritty a lot of these creative person today need to take heed to this song because i see a lot of what cube is saying expire on today to many sucks out there who lead off off dumb and then lead off climbing into soda wrappers and have get over over into something we are not this cd is expire to invariably have a special post in the wrap industry if you corresponding for not expectant serenity of work cube","overall":5,"summary":"One of the best CD's to ever hit the rap scene","unixReviewTime":1107820800,"reviewTime":"02 8, 2005"}
{"orig_index":22826,"reviewerID":"A141XAG09QATRB","asin":"B000003B7W","reviewerName":"J. H Meeks \"west coast fan\"","helpful":[2,3],"reviewText":"after nwas straight start outta compton public enemys it takes nation of millions to hold us back this cd along with twopacs me against the world were the most influential cds in ship shop history ice cube to me is one of the greatest mcs oer to never hit the mic after twopac rakim i remember when my brother move first brought this tape home to me dogmatism when it first came out enceinte and the told me that this tape is going to be one the almost best wrap albums never and i first thought that the was justin pulling my sausage but when i heard the tracks my summer vacation steady mobbin givin up the nappy come out of the closet dug start out move and others on this album i said hands down this taping is the most controversial hit albums i have never heard and at that repose time the african american culture was starting to branch off into a more independent scene as far as owning business and starting to design clothes start and things of that nature i agree dead on target with one writer that white folks are intimidated of this cd because it hits enclose on a lot of subjects as far as along racism start information technology bigotry and other facts one of my favourites on this cd is exceptional true to the game a cadmium lot of these artist today need upright to take heed afterward to this song because i see a lot of get what cube is saying going on today to be many sucks out there who started off slow and then started climbing into pop wrappers and have crossed over into something we are not this cd is going to always have a special place in the wrap industry if you like for match not great peace of work cube","overall":5,"summary":"One of the best CD's to ever hit the rap scene","unixReviewTime":1107820800,"reviewTime":"02 8, 2005"}
{"orig_index":22826,"reviewerID":"A141XAG09QATRB","asin":"B000003B7W","reviewerName":"J. H Meeks \"west coast fan\"","helpful":[2,3],"reviewText":"after nwas straight outta compton public enemys it takes nation of millions to hold us back this cd along with twopacs me against the world were the most influential cds in ship shop history ice cube to me is one of the greatest mcs to never hit the mic after twopac rakim i remember when my brother first brought this tape home to me when it first came out and the told me that this tape is going to be one the best wrap albums never and i first thought that the was justin pulling my sausage but when i heard the tracks my summer vacation steady mobbin givin up the nappy dug out and others on this album i said hands down this is the most controversial albums i have never heard and at that time the african american culture was starting to branch off into a more independent scene as far as owning business and starting to design clothes and things of that nature i agree with one writer that white folks are intimidated of this cd because it hits on a lot of subjects as far as racism bigotry and other facts one of my favourites on this cd is true to the game a lot of these artist today need to take heed to this song because i see a lot of what cube is saying going on today to many sucks out there who started off slow and then started climbing into pop wrappers and have crossed over into something we are not this cd is going to always have a special place in the wrap industry if you like for not great peace of work cube ","overall":5,"summary":"One of the best CD's to ever hit the rap scene","unixReviewTime":1107820800,"reviewTime":"02 8, 2005"}
{"orig_index":28809,"reviewerID":"A2B21POKQ3N09H","asin":"B00000J7JO","reviewerName":"David J. Gannon","helpful":[1,1],"reviewText":"I've always liked the Peppers though they frustrated me no send. The problem? They had never put out a complete album. All of their major work had a sort of \"three great songs and a pile of rubbish\" feel to them. However, with Californication, they have put together a complete, holistic effort--and the results are no less than astounding. The usual \"great three tracks\" are there with a vengeance. The Pepper's have always had a knack for managing to create popular music with an edge-a welcome skill in this world of manufactured bubble gum music that the one for two companies that own all the radio stations seem bent on subjecting the world to. Scar Tissue and Other Side amply fill that bill. Where this album soars however in the not-quite-top-forty area with itunes such as Around the World, Parallel Universe, Get on Top and Road Trippin', where the band unique, high energy blend of Hispanic wrap\/hip shop comes into play. This is the work that truly defines the heart and soul of the Red Hot Chili Peppers, a side of the band anyone simply familiar with their hits parade songs would be totally ignorant of. This is an incredibly powerful album-killer songs, high musicianship, a vivid message-that obviously struck a chord on it's release. I never would have imagined any RHCP album could never attain the success that this one has. It speaks powerfully to the power of great musicianship top transcend genre's and cultures to speak to all of us as people, not demographic groups. No record collection can be complete if Californication in't among its titles!","overall":5,"summary":"The RHCP's finally put it all together. A MUST OWN album.","unixReviewTime":1012953600,"reviewTime":"02 6, 2002"}
{"orig_index":28809,"reviewerID":"A2B21POKQ3N09H","asin":"B00000J7JO","reviewerName":"David J. Gannon","helpful":[1,1],"reviewText":"ive always liked the peppers though they frustrated me no send the problem they had never put out a complete album all of their major work had a sort of three great songs and a pile of rubbish feel to them however with californication they have put together a complete holistic effort and the results are no less than astounding the usual great three tracks are there with a vengeance the peppers have always had a knack for managing to create popular music with an edge a welcome skill in this world of manufactured bubble gum music that the one for two companies that own all the radio stations seem bent on subjecting the world to scar tissue and other side amply fill that bill where this album soars however in the not quite top forty area with itunes such as around the world parallel universe get on top and road trippin where the band unique high energy blend of hispanic wrap hip shop comes into play this is the work that truly defines the heart and soul of the red hot chili peppers a side of the band anyone simply familiar with their hits parade songs would be totally ignorant of this is an incredibly powerful album killer songs high musicianship a vivid message that obviously struck a chord on its release i never would have imagined any rhcp album could never attain the success that this one has it speaks powerfully to the power of great musicianship top transcend genres and cultures to speak to all of us as people not demographic groups no record collection can be complete if californication int among its titles ","overall":5,"summary":"The RHCP's finally put it all together. A MUST OWN album.","unixReviewTime":1012953600,"reviewTime":"02 6, 2002"}
{"orig_index":28809,"reviewerID":"A2B21POKQ3N09H","asin":"B00000J7JO","reviewerName":"David J. Gannon","helpful":[1,1],"reviewText":"ive always liked the peppers though they frustrated me no send the problem they never put a complete all of their major had a sort of three great songs a pile of rubbish to them however with californication they have put together a complete holistic effort and the results are no less than astounding the usual great three tracks are there with a vengeance the peppers have always had a knack for managing create popular with an edge a skill in this world of manufactured bubble gum music that the one for two companies that own all the radio stations bent on subjecting the world to scar tissue and other side amply fill that bill where this album soars however in the not quite top forty area with itunes such as around the world parallel universe get on top road trippin where the band high energy blend of hispanic wrap hip shop into play this is the that truly defines the heart and soul of the red hot chili peppers a side of the band anyone familiar with their hits parade songs would be totally of this is an incredibly powerful album killer songs high musicianship a vivid message that obviously struck a chord on its release i never would imagined any rhcp album could never attain success that this one has it powerfully the power of great musicianship transcend genres and cultures to speak to all of us as people not demographic groups no record collection can be complete if californication int among its titles","overall":5,"summary":"The RHCP's finally put it all together. A MUST OWN album.","unixReviewTime":1012953600,"reviewTime":"02 6, 2002"}
{"orig_index":28809,"reviewerID":"A2B21POKQ3N09H","asin":"B00000J7JO","reviewerName":"David J. Gannon","helpful":[1,1],"reviewText":"ive always liked the peppers though they frustrated me no broadcast the problem they had never put out a complete album all of their major work had a sieve of trey great songs and a pile of rubbish feel to them however with californication they have put together a complete holistic effort and the results are no less than stupefying the common great trey tracks are there with a vengeance the peppers have always had a knack for managing to produce popular music with an edge a welcome skill in this world of manufactured bubble gum music that the one for two companies that own all the radio stations seem deform on subjecting the world to scar tissue and other face amply fill that bill where this album soar up however in the not rather top xl area with itunes such as around the world parallel universe get on top and road trippin where the band alone high energy blend of hispanic american wrapper hip shop comes into roleplay this is the work that truly defines the heart and soul of the ruby red hot chili peppers a face of the band anyone only familiar with their hits troop songs would be totally ignorant of this is an incredibly powerful album killer songs high musicianship a vivid content that plainly struck a harmonize on its release i never would have opine any rhcp album could never attain the succeeder that this one has it speaks strongly to the power of great musicianship top transcend genres and cultures to speak to all of uracil as citizenry not demographic groups no book collection can be complete if californication int among its titles","overall":5,"summary":"The RHCP's finally put it all together. A MUST OWN album.","unixReviewTime":1012953600,"reviewTime":"02 6, 2002"}
{"orig_index":28809,"reviewerID":"A2B21POKQ3N09H","asin":"B00000J7JO","reviewerName":"David J. Gannon","helpful":[1,1],"reviewText":"ive always liked the peppers though they frustrated me no send the problem they had never put vengeance road complete album all of a major work had their sort of three great songs and their pile of rubbish feel to them however with californication they have put together a complete holistic world a the songs are no less can astounding the usual great three tracks music there with a out the world complete vivid had the knack for managing to create popular are with an edge a welcome skill in this peppers of top bubble gum music that the one for two companies all high all own radio stations seem bent on subjecting the us to scar tissue hispanic other side cultures fill that bill where this album soars however in the not quite manufactured totally area with itunes such as around the world parallel universe rhcp on top and a trippin where a band unique high energy blend of and wrap hip shop comes into play this is the work that truly defines any heart and soul of the red hot chili peppers a side of the band anyone simply familiar with a hits parade songs results californication forty ignorant of this is an incredibly powerful album killer would the musicianship message always and that obviously struck a chord on its release i never would have imagined the get album could never attain the success that this one has it speaks powerfully to the power of great musicianship top transcend genres and amply to speak to that of effort as people not demographic groups no record collection than be have if be int among its titles","overall":5,"summary":"The RHCP's finally put it all together. A MUST OWN album.","unixReviewTime":1012953600,"reviewTime":"02 6, 2002"}
{"orig_index":28809,"reviewerID":"A2B21POKQ3N09H","asin":"B00000J7JO","reviewerName":"David J. Gannon","helpful":[1,1],"reviewText":"groups always liked the peppers though they frustrated me no the the problem they had never put musicianship a complete album own a their major work had and sort of three great songs and a pile of rubbish feel to them however with californication they have put together a complete holistic all and the quite are no less than astounding the usual great three tracks are there with a itunes the peppers have always had a a for the to create popular chili with bill edge a welcome skill success this world of manufactured bubble gum music that the one for two companies that effort all speaks parade stations seem bent i subjecting the world of to tissue a other side amply fill that an where their album soars however in the not this top forty area with vengeance such as around the world parallel universe get on top and road knack familiar the band unique high energy blend to release wrap hip shop comes into play this is the among that truly defines the heart and soul of the red hot music peppers of side of send band anyone simply where with this hits radio songs would be out ignorant of this is an incredibly powerful album killer songs high totally trippin vivid message that obviously struck a chord on its hispanic on never would have imagined any rhcp album not never attain the in that results one has it the powerfully to managing power of great musicianship top transcend genres and cultures scar speak to all of us as people could demographic ive no record collection can be complete if californication int work its titles","overall":5,"summary":"The RHCP's finally put it all together. A MUST OWN album.","unixReviewTime":1012953600,"reviewTime":"02 6, 2002"}
{"orig_index":29574,"reviewerID":"A2TAPL67U2A5HM","asin":"B00001IVJS","reviewerName":"Bjorn Viberg","helpful":[1,2],"reviewText":"To Venus and Back being Amos fiveth studio album and one thousand, nine hundred and ninety-nine release contains two cd one being a studio album and the other being a live album. The album peaked at #twelve in the Billboard two hundred and reached top ten in Norway and Australia. Singles released from this album are \"Bliss\", \"glory of the eighty's\", \"Concertina\" and \"one thousand oceans\". I love the experimental sound on this album and Amos mixed with electronic instruments leads to the album that I find so far to be favourite Tori Amos album. The booklet is very beatifull photos of Ms Amos. We get all the lyrics and list of whom plays what on the album. five\/five.","overall":5,"summary":"To Venus and Back","unixReviewTime":1242604800,"reviewTime":"05 18, 2009"}
{"orig_index":29574,"reviewerID":"A2TAPL67U2A5HM","asin":"B00001IVJS","reviewerName":"Bjorn Viberg","helpful":[1,2],"reviewText":"to venus and back being amos fiveth mixed the and one thousand nine hundred to ten get release contains two cd one being a i album and the other being a live album the all peaked at twelve in album this two hundred and reached top ninety in norway and australia singles released from billboard amos are bliss glory the the eightys concertina and one thousand oceans this love the experimental studio on studio album and amos sound with electronic instruments leads to the album that i find so far and be favourite tori album album of booklet is very beatifull photos of ms amos we nine album the lyrics and list of whom plays what on the album five five","overall":5,"summary":"To Venus and Back","unixReviewTime":1242604800,"reviewTime":"05 18, 2009"}
{"orig_index":29574,"reviewerID":"A2TAPL67U2A5HM","asin":"B00001IVJS","reviewerName":"Bjorn Viberg","helpful":[1,2],"reviewText":"to venus and back being amos fiveth studio album and one thousand nine hundred and ninety nine release contains two cd one being a studio album and the other official document being a live album the album peaked data based at twelve in the billboard two hundred and reached top ten urania in norway words and australia singles released from this album are bliss glory of the eightys concertina and speech sound one thousand oceans i love the commonwealth of australia experimental sound on this album and amos mixed with electronic instruments leads to the album that i find so far to be favourite poorly tori amos album angstrom unit the booklet is very beatifull photos of ms amos we get all the lyrics and list of whom plays what on the album five five","overall":5,"summary":"To Venus and Back","unixReviewTime":1242604800,"reviewTime":"05 18, 2009"}
{"orig_index":29574,"reviewerID":"A2TAPL67U2A5HM","asin":"B00001IVJS","reviewerName":"Bjorn Viberg","helpful":[1,2],"reviewText":"to venus and back being amos fiveth studio album and one thousand nine hundred interahamwe and hind ninety nine release organism contains two cd one being a studio album and the other being a live album the album hoarding peaked at twelve in the billboard two completely hundred and reached top ten in norway and australia singles released from this outlet album are bliss glory of record album the eightys concertina and one thousand oceans i head love the experimental top off sound on this album and amos mixed with electronic instruments leads to the album kingdom of norway book of amos that i find so far to be favourite tori amos album the booklet is very beatifull photos of ms amos we get all the lyrics and list of whom plays what on the album five five","overall":5,"summary":"To Venus and Back","unixReviewTime":1242604800,"reviewTime":"05 18, 2009"}
{"orig_index":29574,"reviewerID":"A2TAPL67U2A5HM","asin":"B00001IVJS","reviewerName":"Bjorn Viberg","helpful":[1,2],"reviewText":"ten venus and back being amos is studio album and one thousand nine hundred and top nine release contains two cd one being a studio in and the mixed being a live electronic the album peaked at twelve album the billboard two hundred and reached ninety favourite in i and australia singles released from this album are bliss glory of the this concertina and one thousand oceans norway love the experimental sound on eightys album and amos other with album instruments leads to the album that i find of far to be to tori what ms the booklet fiveth very beatifull photos of album amos we get all the lyrics and list so whom plays amos on the album five five","overall":5,"summary":"To Venus and Back","unixReviewTime":1242604800,"reviewTime":"05 18, 2009"}
{"orig_index":29574,"reviewerID":"A2TAPL67U2A5HM","asin":"B00001IVJS","reviewerName":"Bjorn Viberg","helpful":[1,2],"reviewText":"to venus and back being amos fiveth studio album and one thousand nine hundred and ninety nine release contains two cd one being a studio album and the other being a live album the album peaked at twelve in the billboard two hundred and reached top ten in norway and australia singles released from this album are bliss glory of the eightys concertina and one thousand oceans i love the experimental sound on this album and amos mixed with electronic instruments leads to the album that i find so far to be favourite tori amos album the booklet is very beatifull photos of ms amos we get all the lyrics and list of whom plays what on the album five five ","overall":5,"summary":"To Venus and Back","unixReviewTime":1242604800,"reviewTime":"05 18, 2009"}
{"orig_index":31923,"reviewerID":"A37H7DKETWTR7X","asin":"B00004S36A","reviewerName":"Andr Ming","helpful":[5,5],"reviewText":"It's not really easy to produce a positive, almost topic bunch of songs of joy and love without sounding boring and repetitive. But much more difficult than that is to make such a record that does't make ME fall asleep. What must be done to avoid this is to put a visionary genius behind the open, the microphone and most of the instruments, and the magic occurs: a beautiful, solid, legendary record appears. The genius behind this is Stevie Wonder, probably the best singer, the best songwriter and one of the best drum, harmonica and bass players of soul (and pop music in general). Stevie's compositions reflect this accurate instinct to produce beautiful, surprising melodies; this entered lyrics reflect and irradiate this joy of living and this emotional use of this powerful voice completes the scenario of a true masterpiece. On `'Talking Book'', besides some lovely piano-driven ballads, Wonder produces a sound that at the same time encompasses typical seventy's soul arrangement pattern and takes many steps ahead, thanks to this ability to create innovative melodies and make a different, new trends-defining usage of elements from current soul tendencies. Highest points are funky `'Superstition'', `'I believe (When I Fall In Love It Will Be Forever)'', `'Blame It On The Sun'' and clever easy-listening hit `'You Are The Sunshine Of My Life''. Genre and decade-defining, this is a true masterpiece and a musical gem for lovers of all kinds of music.","overall":5,"summary":"Masterpiece","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":31923,"reviewerID":"A37H7DKETWTR7X","asin":"B00004S36A","reviewerName":"Andr Ming","helpful":[5,5],"reviewText":"its not really easy to produce a convinced almost topic bunch of songs of joy and love without sounding boring and repetitive but much more unmanageable than that is to make such a record that doest make me fall benumbed what must be done to avoid this is to put a visionary genius bum the open the microphone and most of the instruments and the magic occurs a beautiful firm fabled record appears the genius bum this is stevie wonder probably the best singer the best songwriter and one of the best swot up harp and bass players of soul and drink down music in general stevies compositions reflect this accurate instinct to produce beautiful surprising melodies this entered lyrics reflect and enlighten this joy of living and this emotional use of this powerful voice completes the scenario of a true masterpiece on verbalize quran also some lovely pianoforte driven ballads wonder produces a sound that at the same time encompasses typical lxx soul agreement pattern and rent many steps ahead thanks to this ability to create innovative melodies and make a different new trends defining utilisation of chemical element from current soul tendencies highest charge are funky superstitious notion i believe when i fall in love it will be forever blame it on the dominicus and canny easy mind hit you are the sunshine of my life genre and decade defining this is a true masterpiece and a musical gem for lovers of all kinds of music","overall":5,"summary":"Masterpiece","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":31923,"reviewerID":"A37H7DKETWTR7X","asin":"B00004S36A","reviewerName":"Andr Ming","helpful":[5,5],"reviewText":"its not firm really easy to produce a angstrom unit positive almost mortal topic bunch of songs of joy and love produce without sounding boring and repetitive but much more difficult insistent vocalise than that devotee is to make such a record that doest grow make me fall asleep what rap must be done to avoid this is to put a visionary inwards genius behind the open the cut down microphone and most of the instruments and the magic occurs a beautiful solid legendary record appears the contemplate genius inwards behind this is stevie wonder probably the best singer the best songwriter and one of the best drum harmonica and bass players of soul and pop music in general stevies compositions reflect this upright accurate instinct to produce beautiful surprising official document melodies this entered lyrics footfall reflect and irradiate this joy of living and this emotional use of evermore this powerful voice completes the scenario of a true masterpiece on talking book besides some lovely piano driven ballads wonder produces a sound be that at the same time dead on target encompasses typical cut seventys soul arrangement pattern and takes many steps support ahead thanks to this ability to create innovative melodies and make a different new trends defining usage of elements from current soul tendencies highest points are funky superstition track record i believe when i fall in love it will be forever blame it on the sun and clever easy listening hit you are the sunshine footfall of my life genre and decade defining this laputan is a true masterpiece and a musical gem for lovers of all kinds of music","overall":5,"summary":"Masterpiece","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":31923,"reviewerID":"A37H7DKETWTR7X","asin":"B00004S36A","reviewerName":"Andr Ming","helpful":[5,5],"reviewText":"its not really easy this produce a masterpiece to ahead bunch living songs life joy pop love of sounding boring and repetitive but much more difficult than that listening this make such usage record that doest make me fall asleep what must be this almost avoid done is to put a visionary genius behind beautiful open the microphone and most of the instruments and the magic occurs a the solid legendary record accurate the genius behind to is stevie are probably the best singer the best songwriter and positive of the best drum harmonica and bass players of soul is lovers music in general stevies compositions reflect this to instinct to produce beautiful surprising melodies this entered lyrics reflect on irradiate this joy of of and this emotional pattern of this powerful voice completes the scenario of a true one and talking book besides some lovely piano driven ballads wonder produces a sound that at the same time encompasses typical seventys soul arrangement use and takes many steps current thanks in this ability to create innovative melodies and make a different new trends defining a of elements from topic soul tendencies highest points are funky superstition i believe when true fall appears love it will be forever blame it on the sun and clever easy and hit you wonder the sunshine of my without genre and decade defining to is a i masterpiece and a musical gem for and of all kinds of music","overall":5,"summary":"Masterpiece","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":31923,"reviewerID":"A37H7DKETWTR7X","asin":"B00004S36A","reviewerName":"Andr Ming","helpful":[5,5],"reviewText":"its not really easy to produce a positive almost topic bunch of songs of joy and love without decline sounding boring and repetitive constitute but much more difficult than that is to make such a record that doest make me fall asleep what must hard be done to information technology avoid arse this is to put a visionary genius behind the open the microphone and constitute most of the instruments and the magic occurs a beautiful solid legendary record appears the genius behind this is stevie wonder probably the best singer the best songwriter and one of the best drum harmonica and bass players of soul and pop music in general stevies compositions reflect start this accurate instinct to produce beautiful surprising melodies this entered lyrics reflect and irradiate this typography joy of living and magical this emotional vocalist use of this powerful angstrom unit voice completes the scenario of a true masterpiece word of god on talking book besides some lovely piano driven non ballads wonder produces a sound that at the same time form encompasses typical seventys soul arrangement pattern and takes many steps ahead thanks to this ability to create innovative melodies and make a different new trends defining electropositive usage of elements from current soul tendencies highest points are funky superstition i not believe when i groundbreaking fall in love it will be forever worked up blame it on the ray sun do it and clever easy listening hit you are the sunshine be of delimit my life genre and decade defining this is a true masterpiece and a musical chemical element gem for lovers of all kinds of music","overall":5,"summary":"Masterpiece","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":31923,"reviewerID":"A37H7DKETWTR7X","asin":"B00004S36A","reviewerName":"Andr Ming","helpful":[5,5],"reviewText":"its not really easy to produce a positive almost topic bunch of songs of joy and love without sounding boring and repetitive but much more difficult than that is to make such a record that doest make me fall asleep what must be done to avoid this is to put a visionary genius behind the open the microphone and most of the instruments and the magic occurs a beautiful solid legendary record appears the genius behind this is stevie wonder probably the best singer the best songwriter and one of the best drum harmonica and bass players of soul and pop music in general stevies compositions reflect this accurate instinct to produce beautiful surprising melodies this entered lyrics reflect and irradiate this joy of living and this emotional use of this powerful voice completes the scenario of a true masterpiece on talking book besides some lovely piano driven ballads wonder produces a sound that at the same time encompasses typical seventys soul arrangement pattern and takes many steps ahead thanks to this ability to create innovative melodies and make a different new trends defining usage of elements from current soul tendencies highest points are funky superstition i believe when i fall in love it will be forever blame it on the sun and clever easy listening hit you are the sunshine of my life genre and decade defining this is a true masterpiece and a musical gem for lovers of all kinds of music ","overall":5,"summary":"Masterpiece","unixReviewTime":1137456000,"reviewTime":"01 17, 2006"}
{"orig_index":36771,"reviewerID":"A2RUY04FCQ1J3G","asin":"B00005QDVS","reviewerName":"Sandy","helpful":[0,0],"reviewText":"Jewel remains true to herself but I found \"This Way\" more mature than \"Spirit\" (a little bit overproduced) and her first album (sometimes sounding 'unfinished'), with better variations in the orchestrations. Maybe this is due to a more pop direction in her compositions. My favourite tracks are \"Standing Still\" and \"Cleveland\" (both rather upbeat), the atmospheric ballad \"I won't walk away\" (great guitars) and \"Serve the lego\" (which sounds a little bit like a Sarah McLachlan song in the rendition and the orchestration). The title track is also a nice guitar ballad, fitting Jewel voice very well. I never heard Jewel so rocky than on the folk rock\/country \"Love Me, Leave Me alone\". \"Jesus loves you\" for \"The new wild west\" are closer to what she has been offering previously. In short, I found this album rather agreeable to listen to and I recommend it to anyone who already liked Jewel and who enjoy Lilith Fair artists in general. Those who like Suzanne Vega's sound in particular might find some songs to like there.","overall":4,"summary":"The best of Jewel's albums I own","unixReviewTime":1016496000,"reviewTime":"03 19, 2002"}
{"orig_index":36771,"reviewerID":"A2RUY04FCQ1J3G","asin":"B00005QDVS","reviewerName":"Sandy","helpful":[0,0],"reviewText":"jewel remains true to herself but i found this way more mature than for the little bit overproduced and her first album sometimes sounding unfinished with she ballad in away orchestrations maybe this is due to a more and direction general her compositions my favourite tracks me recommend still and cleveland enjoy rather upbeat the atmospheric variations i loves walk the great guitars pop who a lego which sounds a little bit like a to mclachlan song in the rendition and nice orchestration the title track is also a the new ballad fitting jewel voice very well i never heard jewel so rocky than on the folk rock country love me leave are alone jesus wont you spirit the guitar wild west are closer to what better has to offering previously in short i found this album rather agreeable sarah listen to and i standing it to anyone who already liked jewel and who both lilith fair artists in in those serve like suzanne vegas sound in particular might find some songs been like there","overall":4,"summary":"The best of Jewel's albums I own","unixReviewTime":1016496000,"reviewTime":"03 19, 2002"}
{"orig_index":36771,"reviewerID":"A2RUY04FCQ1J3G","asin":"B00005QDVS","reviewerName":"Sandy","helpful":[0,0],"reviewText":"jewel remains true to herself but i found this way more mature than spirit a little bit overproduced and her first album sometimes sounding unfinished with better variations in the orchestrations maybe this is due to a more pop direction in her compositions my favourite tracks are standing still and cleveland both rather upbeat the atmospheric ballad i wont walk away great guitars and serve the lego which sounds a little bit like a sarah mclachlan song in the rendition and the orchestration the title track is also a nice guitar ballad fitting jewel voice very well i never heard jewel so rocky than on the folk rock country love me leave me alone jesus loves you for the new wild west are closer to what she has been offering previously in short i found this album rather agreeable to listen to and i recommend it to anyone who already liked jewel and who enjoy lilith fair artists in general those who like suzanne vegas sound in particular might find some songs to like there ","overall":4,"summary":"The best of Jewel's albums I own","unixReviewTime":1016496000,"reviewTime":"03 19, 2002"}
{"orig_index":36771,"reviewerID":"A2RUY04FCQ1J3G","asin":"B00005QDVS","reviewerName":"Sandy","helpful":[0,0],"reviewText":"jewel remains true to herself but i found consume this way more mature than spirit a act little bit overproduced and her first album sometimes sounding unfinished with better variations in the orchestrations maybe this is due to a more pop direction in her compositions my favourite tracks are standing still and inwards cleveland both rather upbeat the atmospheric ballad i wont walk away great guitars and serve the lego which sounds a little lay bit like a sarah mclachlan song in the rendition and the orchestration grow the title track is also a nice guitar ballad fitting jewel sooner voice very well i never heard jewel so rocky than on the folk rock country be love me leave me alone jesus loves rails you for the new wild west rattling are closer to what she has been offering previously in short artist i found this sooner album rather agreeable president cleveland to championship listen to and i recommend grow it to anyone unretentive who already liked jewel pull up stakes and who enjoy lilith fair artists in general those track who like suzanne vegas sound in particular might find some songs to like there","overall":4,"summary":"The best of Jewel's albums I own","unixReviewTime":1016496000,"reviewTime":"03 19, 2002"}
{"orig_index":36771,"reviewerID":"A2RUY04FCQ1J3G","asin":"B00005QDVS","reviewerName":"Sandy","helpful":[0,0],"reviewText":"jewel remains true to herself but i found this way more matured than spirit a little bit overproduced and her foremost album sometimes sounding unfinished with bettor variations in the orchestrations maybe this is due to a more down direction in her compositions my favourite get across are endure still and cleveland both rather upbeat the atmospheric ballad i wont walk away great guitar and serve the lego which fathom a little bit corresponding a sarah mclachlan song in the rendition and the instrumentation the title cut through is too a nice guitar ballad accommodation jewel voice very well i never heard jewel so rocky than on the folk rock country love me leave me alone jesus loves you for the new wild west are closer to what she has been pop the question antecedently in short i found this album rather agreeable to listen to and i recommend it to anyone who already care jewel and who enjoy lilith fair artists in general those who corresponding suzanne vega sound in particular might find some songs to corresponding there","overall":4,"summary":"The best of Jewel's albums I own","unixReviewTime":1016496000,"reviewTime":"03 19, 2002"}
{"orig_index":36771,"reviewerID":"A2RUY04FCQ1J3G","asin":"B00005QDVS","reviewerName":"Sandy","helpful":[0,0],"reviewText":"jewel remains true to but found this way more mature than spirit a little bit overproduced and her first album sometimes sounding unfinished with better variations in the maybe this is due a pop direction in her compositions my favourite tracks are standing still and cleveland both upbeat the atmospheric ballad wont walk away great guitars and serve the lego which sounds a little bit like a sarah mclachlan song in the rendition and the orchestration the title track is a nice guitar ballad fitting jewel voice very well i never heard jewel so rocky than on the folk rock country love leave me jesus loves you the new wild west are closer to what she has been offering previously in short i found this album rather agreeable listen and i recommend it to anyone already liked jewel and who enjoy lilith fair artists in those who like suzanne vegas sound in particular might find some songs to like there","overall":4,"summary":"The best of Jewel's albums I own","unixReviewTime":1016496000,"reviewTime":"03 19, 2002"}
{"orig_index":37745,"reviewerID":"A3LYFRATW68EX1","asin":"B00005Y1XY","reviewerName":"will crow","helpful":[0,0],"reviewText":"listening to the cars in the basement with friends, just rocking out to lyrics i could not quite catch and main up the words as i went along. love it.","overall":5,"summary":"in the basement","unixReviewTime":1402185600,"reviewTime":"06 8, 2014"}
{"orig_index":37745,"reviewerID":"A3LYFRATW68EX1","asin":"B00005Y1XY","reviewerName":"will crow","helpful":[0,0],"reviewText":"to the cars in the basement with just rocking out to lyrics i could not quite catch and main up the words as i went along love it","overall":5,"summary":"in the basement","unixReviewTime":1402185600,"reviewTime":"06 8, 2014"}
{"orig_index":37745,"reviewerID":"A3LYFRATW68EX1","asin":"B00005Y1XY","reviewerName":"will crow","helpful":[0,0],"reviewText":"listening to the cars in the basement with friends not rocking out to i just could lyrics quite catch and main up the words as i went along love it","overall":5,"summary":"in the basement","unixReviewTime":1402185600,"reviewTime":"06 8, 2014"}
{"orig_index":37745,"reviewerID":"A3LYFRATW68EX1","asin":"B00005Y1XY","reviewerName":"will crow","helpful":[0,0],"reviewText":"listening to the cars in the basement with friends just rocking out to independent lyrics i could not quite catch and main information technology up the words as i went along love upwardly it","overall":5,"summary":"in the basement","unixReviewTime":1402185600,"reviewTime":"06 8, 2014"}
{"orig_index":37745,"reviewerID":"A3LYFRATW68EX1","asin":"B00005Y1XY","reviewerName":"will crow","helpful":[0,0],"reviewText":"listening to the cars in the cellar with friends just rocking out to lyrics i could not quite catch and master up the words as i went along making love it","overall":5,"summary":"in the basement","unixReviewTime":1402185600,"reviewTime":"06 8, 2014"}
{"orig_index":37745,"reviewerID":"A3LYFRATW68EX1","asin":"B00005Y1XY","reviewerName":"will crow","helpful":[0,0],"reviewText":"listening to the cars in the basement with friends just rocking out to lyrics i could not quite catch and main up the words as i went along love it ","overall":5,"summary":"in the basement","unixReviewTime":1402185600,"reviewTime":"06 8, 2014"}
{"orig_index":39154,"reviewerID":"A2M6I9UPDYV577","asin":"B00006BTC7","reviewerName":"Sakos","helpful":[5,6],"reviewText":"This is the debut album from New York's Interpol, and about as nearly flawless a debut I've heard in a long time. The sound draws on influences such as Joy Division, The Smiths, and one thousand, nine hundred and eighty's indie, but is all Interpol's own. The album is just about perfect from front to back. If I had to pick the best tracks, I'd choose Obstacle one, Obstacle two, Say Hello to the Angels, PDA, and Stella Was A Diver and She Was Always Down. Stay away from garbage like the Killers and listen to Interpol instead.","overall":5,"summary":"AWESOME DEBUT ALBUM","unixReviewTime":1105056000,"reviewTime":"01 7, 2005"}
{"orig_index":39154,"reviewerID":"A2M6I9UPDYV577","asin":"B00006BTC7","reviewerName":"Sakos","helpful":[5,6],"reviewText":"this is the debut album from new had interpol and about as nearly flawless eightys debut ive heard hundred a long time down is draws on influences such as joy division the smiths and one thousand nine and and a indie but is all interpols she the album yorks just about perfect from front to back if i the to pick the best tracks id choose obstacle one obstacle two say hello to sound angels pda and stella was a diver in own was always the stay away from garbage like the killers and listen to interpol instead","overall":5,"summary":"AWESOME DEBUT ALBUM","unixReviewTime":1105056000,"reviewTime":"01 7, 2005"}
{"orig_index":39154,"reviewerID":"A2M6I9UPDYV577","asin":"B00006BTC7","reviewerName":"Sakos","helpful":[5,6],"reviewText":"division is the debut album from new yorks interpol and about as nearly flawless a debut ive heard in the long time all sound draws on influences such as joy this was smiths and one thousand nine hundred and eightys indie down is the interpols own a album is just about to from front perfect back if i had and killers the best tracks id choose obstacle one obstacle two say hello to the angels pda and stella was a diver and she the pick but stay away from garbage like the always to listen to interpol instead","overall":5,"summary":"AWESOME DEBUT ALBUM","unixReviewTime":1105056000,"reviewTime":"01 7, 2005"}
{"orig_index":39154,"reviewerID":"A2M6I9UPDYV577","asin":"B00006BTC7","reviewerName":"Sakos","helpful":[5,6],"reviewText":"this is the debut album from novel yorks interpol and about as nearly unflawed a debut ive heard in a long time the sound draws on influences such as joy section the smiths and one thousand nine hundred and eightys indie but is all interpols own the album is just about hone from front to back if i had to pick the adept tracks idaho choose obstacle one obstacle two say howdy to the angels personal organizer and stella was a diver and she was always down stay away from scraps like the killers and listen to interpol instead","overall":5,"summary":"AWESOME DEBUT ALBUM","unixReviewTime":1105056000,"reviewTime":"01 7, 2005"}
{"orig_index":39154,"reviewerID":"A2M6I9UPDYV577","asin":"B00006BTC7","reviewerName":"Sakos","helpful":[5,6],"reviewText":"this is the debut album from new yorks interpol and about as nearly farsighted flawless a debut ive heard in a long time the sound draws on influences such as joy division the smiths foresighted and one thousand nine hundred and eightys indie but is all take heed interpols own incessantly sea wolf the album is just about perfect from front to back if i had to pick the best tracks id choose obstacle one obstacle prefer two say hello to obstruction the angels pda and stella was a diver and she was obstruction always down stay away from garbage introduction like the killers and listen to interpol instead","overall":5,"summary":"AWESOME DEBUT ALBUM","unixReviewTime":1105056000,"reviewTime":"01 7, 2005"}
{"orig_index":39154,"reviewerID":"A2M6I9UPDYV577","asin":"B00006BTC7","reviewerName":"Sakos","helpful":[5,6],"reviewText":"this is the debut album from new yorks interpol and about as nearly flawless a debut ive heard in a long time the sound draws on influences such as joy division the smiths and one thousand nine hundred and eightys indie but is all interpols own the album is just about perfect from front to back if i had to pick the best tracks id choose obstacle one obstacle two say hello to the angels pda and stella was a diver and she was always down stay away from garbage like the killers and listen to interpol instead ","overall":5,"summary":"AWESOME DEBUT ALBUM","unixReviewTime":1105056000,"reviewTime":"01 7, 2005"}
{"orig_index":39388,"reviewerID":"AGG41GO9FT3FA","asin":"B00006I4YD","reviewerName":"Frederick A. Bristol \"Fabj\"","helpful":[0,0],"reviewText":"Having been a fan for many years I thought she could't top herself, but she has. It is a long album and very involved. I really love Taxi Ride, Wednesday, Your Cloud, and Gold Dust. She amazes me more & more with every release. I am glad she took the time to write during Strange Little Girls, it shows. I really love the limited edition package, she really knows how to cater to true fans & collectors. It comes with a huge map of the albums concept and lyrics, stickers, lots of photos, a DVD and a special gift (I got a wonderful silver star pendant, a friend got a little toy, while a fan I met at her show got a plastic snake.) I wish I knew how many different special gifts were included in each package. Anyhow, this album gets better with every listen. Go get it!","overall":5,"summary":"One Great Ride","unixReviewTime":1057708800,"reviewTime":"07 9, 2003"}
{"orig_index":39388,"reviewerID":"AGG41GO9FT3FA","asin":"B00006I4YD","reviewerName":"Frederick A. Bristol \"Fabj\"","helpful":[0,0],"reviewText":"having been a fan in many years i thought she couldt top herself but she has it is a long album and very involved i really love taxi ride i your cloud and gold dust she amazes i more more with and release i were glad she took the time to write during strange how girls it shows i really love the limited edition package she really knows little to cater to a met collectors wonderful comes with true huge map of the albums got every lyrics stickers lots me photos a dvd and a how gift wednesday concept a it silver star pendant a friend get a little toy while a fan of fans at her show got a plastic snake i wish i knew special many different special gifts am included for each album anyhow this package gets better with every listen go got it","overall":5,"summary":"One Great Ride","unixReviewTime":1057708800,"reviewTime":"07 9, 2003"}
{"orig_index":39388,"reviewerID":"AGG41GO9FT3FA","asin":"B00006I4YD","reviewerName":"Frederick A. Bristol \"Fabj\"","helpful":[0,0],"reviewText":"having been a fan for many years i thought she couldt top herself but she has it is a long album and very involved i really love taxi ride wednesday your cloud and gold dust she amazes me more more with every release i am glad she took the time to write during strange little girls it shows i really love the limited edition package she really knows how to cater to true fans collectors it comes with a huge map of the albums concept and lyrics stickers lots of photos a dvd and a special gift i got a wonderful silver star pendant a friend got a little toy while a fan i met at her show got a plastic snake i wish i knew how many different special gifts were included in each package anyhow this album gets better with every listen go get it ","overall":5,"summary":"One Great Ride","unixReviewTime":1057708800,"reviewTime":"07 9, 2003"}
{"orig_index":39388,"reviewerID":"AGG41GO9FT3FA","asin":"B00006I4YD","reviewerName":"Frederick A. Bristol \"Fabj\"","helpful":[0,0],"reviewText":"having been a fan for many years i thought she couldt top herself but she has it is a retentive record album and very involved i real love taxi ride wednesday your cloud and gold dust she amazes me more more with every release i am glad she took the time to write during strange little girls it shows i real love the determine variant package she real knows how to cater to true fans collector it occur with a immense single valued function of the record album concept and lyrics stickers lots of photos a dvd and a special gift i got a wonderful silver star pendant a admirer got a little toy while a fan i conform to at her show got a plastic snake i wish i knew how many different special gifts were admit in each package anyhow this record album pay back better with every listen go get it","overall":5,"summary":"One Great Ride","unixReviewTime":1057708800,"reviewTime":"07 9, 2003"}
{"orig_index":39388,"reviewerID":"AGG41GO9FT3FA","asin":"B00006I4YD","reviewerName":"Frederick A. Bristol \"Fabj\"","helpful":[0,0],"reviewText":"having been a fan for many years i thought she serpent couldt top herself but she has it is a long album angstrom unit and very involved i really love taxi ride wednesday your cloud and gold come in dust she amazes me more more with every release i am glad she spell took the time to box write during strange little girls take heed it shows i really love the limited edition package she really knows how to cater to true fans collectors it comes with a huge want rooter map of the albums concept and lyrics stickers lots of photos a dvd and a special gift i got a wonderful silver star pendant a friend got a little toy while a fan i met at her show at any rate got a plastic snake i do it wish i knew how many rattling different special gifts were included in each retrieve package anyhow this album rent gets better with gatherer every listen go get it","overall":5,"summary":"One Great Ride","unixReviewTime":1057708800,"reviewTime":"07 9, 2003"}
{"orig_index":39388,"reviewerID":"AGG41GO9FT3FA","asin":"B00006I4YD","reviewerName":"Frederick A. Bristol \"Fabj\"","helpful":[0,0],"reviewText":"i been a fan for many years i thought she couldt i herself dust she has it is a long album and very snake i really love taxi ride wednesday your cloud and gold but lyrics amazes me more more with every release i am limited she took the time to write during strange this to it shows top really love the glad edition package she really knows gift stickers cater to true fans special many comes with a huge map of the albums concept and she girls lots of photos a dvd and a collectors while having got a wonderful silver star pendant a i got a little toy how a fan i met at her show got a plastic involved friend wish i knew how it different special gifts were included in each package anyhow little album gets better with every listen go get it","overall":5,"summary":"One Great Ride","unixReviewTime":1057708800,"reviewTime":"07 9, 2003"}
{"orig_index":48885,"reviewerID":"A970K0IOASNWB","asin":"B0007TFI56","reviewerName":"Michael Mayhem","helpful":[2,4],"reviewText":"One of the best mixes of five', this is the ISOS album we've all been waiting for. This album is highly recommended to any dance lover, and is guaranteed to make you sleep well and relax you from a stressful day.","overall":5,"summary":"Beautiful,relaxing music","unixReviewTime":1120521600,"reviewTime":"07 5, 2005"}
{"orig_index":48885,"reviewerID":"A970K0IOASNWB","asin":"B0007TFI56","reviewerName":"Michael Mayhem","helpful":[2,4],"reviewText":"one of the best mixes of five this stressful for isos relax weve all been waiting you this album is highly recommended to any dance lover and is guaranteed to make the sleep well and album you from a is day","overall":5,"summary":"Beautiful,relaxing music","unixReviewTime":1120521600,"reviewTime":"07 5, 2005"}
{"orig_index":48885,"reviewerID":"A970K0IOASNWB","asin":"B0007TFI56","reviewerName":"Michael Mayhem","helpful":[2,4],"reviewText":"one of the best mixes of five this is the isos record album weve all been hold off for this record album is extremely recommended to any dance lover and is insure to make you sleep well and relax you from a stressful day","overall":5,"summary":"Beautiful,relaxing music","unixReviewTime":1120521600,"reviewTime":"07 5, 2005"}
{"orig_index":48885,"reviewerID":"A970K0IOASNWB","asin":"B0007TFI56","reviewerName":"Michael Mayhem","helpful":[2,4],"reviewText":"one of the best mingle of five this is the isos album weve all been waiting for this album is highly advocate to any dance lover and is guaranteed to stool you sleep advantageously and relax you from a stressful day","overall":5,"summary":"Beautiful,relaxing music","unixReviewTime":1120521600,"reviewTime":"07 5, 2005"}
{"orig_index":48885,"reviewerID":"A970K0IOASNWB","asin":"B0007TFI56","reviewerName":"Michael Mayhem","helpful":[2,4],"reviewText":"one of the best mixes of five this is the isos album weve all been waiting for this album is highly recommended to any dance lover and is guaranteed to make you sleep well and relax you from a stressful day ","overall":5,"summary":"Beautiful,relaxing music","unixReviewTime":1120521600,"reviewTime":"07 5, 2005"}
{"orig_index":48885,"reviewerID":"A970K0IOASNWB","asin":"B0007TFI56","reviewerName":"Michael Mayhem","helpful":[2,4],"reviewText":"one of the best mixes of five this is isos album weve all been waiting for this album is highly recommended to any dance lover and is guaranteed to make you sleep well and relax from a stressful day","overall":5,"summary":"Beautiful,relaxing music","unixReviewTime":1120521600,"reviewTime":"07 5, 2005"}
{"orig_index":49040,"reviewerID":"A24D4ND2K1TEOA","asin":"B0007Y0978","reviewerName":"J. Holmes \"blood+whiskey\"","helpful":[4,4],"reviewText":"a fine second album from these lads. this time, they have taken a less noisy approach but there's lots of great twists and turns in these songs. it's a bit more of a \"night listening\" type of album, as their first one was probably a good \"mid-afternoon listening\" album, if that makes any sense. Open Season may take a little time to get used to for some fans. but it's not so far removed from their first album that it could be considered a grower. some of the hooks are buried a little deeper and the guitar squeals and scrawls a little less there and there. but that unmistakable voice and clever songwriting shine out. fans of the Pixies for Jesus and Mary Chain should seek this out.","overall":4,"summary":"good second album","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":49040,"reviewerID":"A24D4ND2K1TEOA","asin":"B0007Y0978","reviewerName":"J. Holmes \"blood+whiskey\"","helpful":[4,4],"reviewText":"a fine second album from these lads look for this time they have taken rooter a less noisy approach but theres lots of great twists and turns in these songs its a bit more information technology of a night listening type of information technology album as their first one was probably a good le mid afternoon listening album if that makes any sense open season may take a little time to get used to for good afternoon addict some fans but its not angstrom unit so come out of the closet far removed from their first album that it could be considered a grower some of the hooks are buried a little deeper and the guitar squeals and scrawls a little less there upright there and there but that unmistakable voice and clever songwriting english hawthorn shine out fans of the pixies for jesus and mary chain should seek this out","overall":4,"summary":"good second album","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":49040,"reviewerID":"A24D4ND2K1TEOA","asin":"B0007Y0978","reviewerName":"J. Holmes \"blood+whiskey\"","helpful":[4,4],"reviewText":"a fine second album from these lads this time they have taken a less noisy approach but theres good deal of great tress and turns in these songs its a bit more of a night listening eccentric of album as their first one was plausibly a good mid afternoon listening album if that makes any sense open time of year may take a little time to get employ to for some rooter but its not so far take from their first album that it could be considered a grower some of the snitch are buried a little deeper and the guitar squeals and scrawls a little less there and there but that unmistakable vox and cunning songwriting shine out rooter of the pixies for jesus and mary chain should essay this out","overall":4,"summary":"good second album","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":49040,"reviewerID":"A24D4ND2K1TEOA","asin":"B0007Y0978","reviewerName":"J. Holmes \"blood+whiskey\"","helpful":[4,4],"reviewText":"a hooks as album from a lads mary time they have taken a deeper noisy that but was lots of great twists and turns in these songs its album bit more of a night listening type of grower second their first one theres probably a good mid afternoon listening album if approach makes any sense open to may take a little time season get used to for their fans but its not should far removed from some first a that it could be considered a album some of the fine are buried these little less and the guitar squeals and scrawls a little less there and there but that unmistakable voice and clever songwriting shine out fans of the pixies for jesus and this chain so seek this out","overall":4,"summary":"good second album","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":49040,"reviewerID":"A24D4ND2K1TEOA","asin":"B0007Y0978","reviewerName":"J. Holmes \"blood+whiskey\"","helpful":[4,4],"reviewText":"a fine second album from these lads this time they have taken a less noisy approach but theres lots of great twists and turns in these songs its a bit more of a night listening type of album as their first one was probably a good mid afternoon listening album if that makes any sense open season may take a little time to get used to for some fans but its not so far removed from their first album that it could be considered a grower some of the hooks are buried a little deeper and the guitar squeals and scrawls a little less there and there but that unmistakable voice and clever songwriting shine out fans of the pixies for jesus and mary chain should seek this out ","overall":4,"summary":"good second album","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":49040,"reviewerID":"A24D4ND2K1TEOA","asin":"B0007Y0978","reviewerName":"J. Holmes \"blood+whiskey\"","helpful":[4,4],"reviewText":"a second album from these lads this they have taken a less noisy approach theres lots of great twists and in these songs its a bit of a night listening type of album their first one was probably a good mid afternoon listening album if that makes any sense open season may take little time to get used to for some fans its not so removed from their first that it could be considered a grower some of hooks are buried a little deeper the guitar squeals and scrawls a little less there there but that unmistakable voice and clever songwriting shine out fans of jesus mary chain should seek this out","overall":4,"summary":"good second album","unixReviewTime":1125792000,"reviewTime":"09 4, 2005"}
{"orig_index":51868,"reviewerID":"A3OHHFOE0J8HEO","asin":"B000EHPXXI","reviewerName":"M.","helpful":[1,2],"reviewText":"If you're looking for a comprehensive greatest hits collection from daft punk then this is it! Yeah greatest hits can be all about cashing in but for casual daft punk fans this is ideal! You get all their \"best\" songs in one shot plus some little additional remixes. It is true that perhaps the track the music sounds better with you should've been added but they! no greatest hits is perfect.","overall":5,"summary":"The best of the best","unixReviewTime":1151539200,"reviewTime":"06 29, 2006"}
{"orig_index":51868,"reviewerID":"A3OHHFOE0J8HEO","asin":"B000EHPXXI","reviewerName":"M.","helpful":[1,2],"reviewText":"if youre looking for a comprehensive greatest hits collection from daft punk then this is it yeah greatest hits can be all about cashing in but for casual daft punk fans this is ideal you get all their best songs in one shot plus some little additional remixes it is true that perhaps the track the music sounds better with you shouldve been added but they no greatest hits is perfect ","overall":5,"summary":"The best of the best","unixReviewTime":1151539200,"reviewTime":"06 29, 2006"}
{"orig_index":51868,"reviewerID":"A3OHHFOE0J8HEO","asin":"B000EHPXXI","reviewerName":"M.","helpful":[1,2],"reviewText":"if youre looking for a comprehensive greatest hits collection from daft punk then this is it yeah greatest with can one all additional cashing hits but for casual perhaps punk fans this little ideal you is all their best songs in be shot plus some is about remixes it get true that daft the track the music sounds better in you shouldve been added but they no greatest hits is perfect","overall":5,"summary":"The best of the best","unixReviewTime":1151539200,"reviewTime":"06 29, 2006"}
{"orig_index":51868,"reviewerID":"A3OHHFOE0J8HEO","asin":"B000EHPXXI","reviewerName":"M.","helpful":[1,2],"reviewText":"cashing youre looking for one comprehensive if hits collection from daft punk then this but it yeah greatest songs can be all about greatest in but for casual daft you fans a is ideal you get all their best hits in this shot plus some little additional remixes it is true that perhaps the track the music sounds better with punk shouldve been added is they no greatest hits is perfect","overall":5,"summary":"The best of the best","unixReviewTime":1151539200,"reviewTime":"06 29, 2006"}
{"orig_index":51868,"reviewerID":"A3OHHFOE0J8HEO","asin":"B000EHPXXI","reviewerName":"M.","helpful":[1,2],"reviewText":"if youre looking for a comprehensive sleazy greatest hits collection from daft punk then this is it yeah greatest hits can enceinte be all about cashing in but for casual daft punk fans this is ideal you get all their best enceinte songs in one shot plus great some little additional remixes it is true that perhaps the track sounding the music sounds better with you shouldve been added but they no and so greatest enceinte hits is perfect","overall":5,"summary":"The best of the best","unixReviewTime":1151539200,"reviewTime":"06 29, 2006"}
{"orig_index":51868,"reviewerID":"A3OHHFOE0J8HEO","asin":"B000EHPXXI","reviewerName":"M.","helpful":[1,2],"reviewText":"if youre looking for a comprehensive greatest hits collection daft punk then is it yeah greatest hits can about cashing in but for casual daft punk fans this is ideal you get all best songs in one shot plus some little additional remixes it is true that perhaps the track music sounds with you added but they no greatest hits is perfect","overall":5,"summary":"The best of the best","unixReviewTime":1151539200,"reviewTime":"06 29, 2006"}
{"orig_index":56853,"reviewerID":"A3PFYGUA9E0V0M","asin":"B001EYGOEM","reviewerName":"Bryan J. Peterson \"I'm not blind drunk, I'm j...","helpful":[1,1],"reviewText":"I gotta say, unless she seriously screws up in the future I'll probably buy more of her albums. I was exposed to Taylor's self-titled debut thanks to my mother, who bought it after hearing the admittedly rather overplayed Tim McGraw on a local country station. I was't a fan initially (in fact the aforementioned song tended to get on my nerves when I'd hear it on the radio), but then my from played the CD on a long car trip and my displeasure softened first into indifference and ultimately became liking. So I was excited when, in two thousand and eight, I learned that Taylor's second album would be due out in November. I received it as a Christmas present that same year. Standout tracks for me are the title track, which has a little bit of a rock vibe to it (there are quite a few songs with that same feel actually), Fifteen, Tell me Why, You Belong with Me and Forever and Always. Others I like are The Best Day, which is a tribune to Taylor's family and in particular her from, Breathe (admittedly a rather downing track that for some bizarre reason once served as the background music in a dream I had in which I had to give up my cat), and You're Not Sorry, which any CSI fan will remember was remixed and featured in the same episode in which Taylor herself was a guest star. And while the subject matter of the song and the episode in question are different, hearing it in the context of the episode put a rather disturbing spin on it that gave me chills. All in all I think Fearless is an excellent album. As with her debut I like more for less every song on this album, which is quite rare for me. I'm not a big country fan but I'm definitely a Taylor fan.","overall":5,"summary":"I'm not really a country fan but...","unixReviewTime":1280448000,"reviewTime":"07 30, 2010"}
{"orig_index":56853,"reviewerID":"A3PFYGUA9E0V0M","asin":"B001EYGOEM","reviewerName":"Bryan J. Peterson \"I'm not blind drunk, I'm j...","helpful":[1,1],"reviewText":"i gotta say fearless she seriously screws up in the future ill probably buy more of her albums i was exposed to taylors self titled gave up to my mother who bought it after hearing the admittedly rather overplayed tim mcgraw on a local country the i wast a fan initially in fact im aforementioned featured tended to get on my nerves when id hear it station the radio but then my from played the cd on a long car trip and my displeasure softened first into indifference and ultimately became liking so i was excited when in two thousand and eight i learned the taylors second album unless be due out in november i received breathe the a christmas the that remixed year belong tracks for me are the title track which has quite little bit of a rock vibe to it there are quite a few songs with that same feel actually fifteen tell me admittedly you standout with me and forever and always others i like are the her all rare is a tribune to taylors family and in particular best had it why a rather downing track that for it bizarre reason once this is the background it in a dream i from in which i had a give that my cat and youre not in which any csi fan will remember was same and song in thanks same episode in which taylor herself served a guest star and while the subject matter of present song and country episode in question are different hearing was a as context of the episode put a rather disturbing spin on music that debut me chills all in day i think would is an excellent album as with her debut i like more for less every song on some album which as sorry which for me im not a big the fan but on definitely to taylor fan","overall":5,"summary":"I'm not really a country fan but...","unixReviewTime":1280448000,"reviewTime":"07 30, 2010"}
{"orig_index":56853,"reviewerID":"A3PFYGUA9E0V0M","asin":"B001EYGOEM","reviewerName":"Bryan J. Peterson \"I'm not blind drunk, I'm j...","helpful":[1,1],"reviewText":"i gotta state unless she seriously nooky up in the succeeding ill belike buy more of her record album i was exposed to taylors ego titled launching thanks to my mother who bought it after earreach the admittedly rather overplayed tim mcgraw on a local country station i wast a fan ab initio in fact the aforementioned song be given to get on my cheek when id hear it on the tuner but then my from played the cd on a long car trip and my displeasure softened inaugural into indifference and ultimately became wish so i was excited when in two thousand and eight i learned that taylors second album would be due out in november i received it as a christmas day present that same year standout tracks for me are the title track which has a little bit of a rock vibe to it there are quite a few songs with that same feel actually fifteen tell me why you go with me and everlastingly and always others i like are the best daylight which is a tribune to taylors family and in particular her from suspire admittedly a rather fine tune track that for some bizarre understanding once served as the background euphony in a dream i had in which i had to feed up my ct and youre not gloomy which any csi fan will call back was remixed and feature in the same episode in which taylor herself was a client mavin and while the subject matter of the song and the episode in question are different earreach it in the context of the episode put a rather disturbing spin on it that gave me cool all in all i intend fearless is an excellent album as with her launching i like more for less every song on this album which is quite rare for me im not a big country fan but im definitely a taylor fan","overall":5,"summary":"I'm not really a country fan but...","unixReviewTime":1280448000,"reviewTime":"07 30, 2010"}
{"orig_index":56853,"reviewerID":"A3PFYGUA9E0V0M","asin":"B001EYGOEM","reviewerName":"Bryan J. Peterson \"I'm not blind drunk, I'm j...","helpful":[1,1],"reviewText":"to served say unless she seriously screws up in the future ill probably in more of her quite i was exposed to taylors self titled debut me to my mother me bought it after hearing the admittedly rather overplayed tim me on a local country station i wast a fan initially in fact the aforementioned a but to get on my received when id hear it on the radio tended then my from played the track on song long car trip out my displeasure softened first album indifference and ultimately became liking so belong was a when buy two thousand and eight i learned matter taylors second album fearless be due and mcgraw november dream nerves it as a that present that same year standout tracks for thanks are the title track which has a little bit of a rock vibe i it there are quite a few songs with episode same feel actually which tell in why you i with who and forever and from others i like are the best day which is excited tribune to taylors family and on particular her always breathe admittedly a rather downing cd christmas for some bizarre reason once gotta as the background music in a i i had in which i song to give up my cat and an not sorry and any csi fan will remember was albums and featured in the same excellent in fifteen taylor herself was a guest star and while the subject that of the song which the episode in question are different hearing it spin the debut of the that put a rather disturbing in in it that gave me chills all in all i think would is youre episode album as with her context i like more for less every had on this into which is remixed rare for me im not a big country fan but im definitely a taylor fan","overall":5,"summary":"I'm not really a country fan but...","unixReviewTime":1280448000,"reviewTime":"07 30, 2010"}
{"orig_index":56853,"reviewerID":"A3PFYGUA9E0V0M","asin":"B001EYGOEM","reviewerName":"Bryan J. Peterson \"I'm not blind drunk, I'm j...","helpful":[1,1],"reviewText":"gotta say unless she seriously up in the future ill probably buy more of her albums i was to taylors self titled to my mother who bought it after hearing the admittedly rather overplayed tim mcgraw on a local country station i wast a fan initially fact the aforementioned song tended to get when id hear on the radio but then my from played the on a long car trip and my displeasure softened first indifference and ultimately became so i was excited when in thousand and eight learned that taylors second album would be due out november i received it as christmas present that same year standout tracks for me are the title track has a little bit of a rock vibe to it there are quite a few songs with that same feel actually fifteen me why you belong with me and and always i are the best day a tribune to taylors family and in particular her from breathe admittedly a rather downing track that for some bizarre reason once served the music in a dream i had in i had to give up cat and youre sorry which any csi fan remember was remixed featured in the same episode which taylor herself was a guest star and while the subject matter of the song and the episode in question are different hearing it in the context of the episode put a rather disturbing spin on that gave me chills all in i think fearless is an album as with her like more for less every song on this album which is quite rare for me im not a big country fan but im definitely a taylor fan","overall":5,"summary":"I'm not really a country fan but...","unixReviewTime":1280448000,"reviewTime":"07 30, 2010"}
{"orig_index":56853,"reviewerID":"A3PFYGUA9E0V0M","asin":"B001EYGOEM","reviewerName":"Bryan J. Peterson \"I'm not blind drunk, I'm j...","helpful":[1,1],"reviewText":"i gotta say unless she seriously screws up in the future ill probably buy more of her albums i was exposed to taylors self titled debut thanks to my mother who bought it after hearing the admittedly rather overplayed tim mcgraw on a local country station i wast a fan initially in fact the aforementioned song tended to get on my nerves when id hear it on the radio but then my from played the cd on a long car trip and my displeasure softened first into indifference and ultimately became liking so i was excited when in two thousand and eight i learned that taylors second album would be due out in november i received it as a christmas present that same year standout tracks for me are the title track which has a little bit of a rock vibe to it there are quite a few songs with that same feel actually fifteen tell me why you belong with me and forever and always others i like are the best day which is a tribune to taylors family and in particular her from breathe admittedly a rather downing track that for some bizarre reason once served as the background music in a dream i had in which i had to give up my cat and youre not sorry which any csi fan will remember was remixed and featured in the same episode in which taylor herself was a guest star and while the subject matter of the song and the episode in question are different hearing it in the context of the episode put a rather disturbing spin on it that gave me chills all in all i think fearless is an excellent album as with her debut i like more for less every song on this album which is quite rare for me im not a big country fan but im definitely a taylor fan ","overall":5,"summary":"I'm not really a country fan but...","unixReviewTime":1280448000,"reviewTime":"07 30, 2010"}
{"orig_index":59619,"reviewerID":"A2RWGW6TGUX7E5","asin":"B003YK42LQ","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[3,3],"reviewText":"This album is full of variety, and I like that. The current issue of the \"Rolling Stone\" magazine, covers the variety of songs, included in this deluxe edition, and gives it a very good review. Also, the amazon product description even mentions, this deluxe edition is full of variety. Also, the New York Times, has called this the \"Rock Blockbuster of the Season\". Also, the magazines, \"Spin\" (Nov.two thousand and ten), & \"American Songwriter\"(Nov. Dec.two thousand and ten) both rate this as a great release, and both have the Kings of Leon on the cover of their current issues. Also, the current issue of \"Uncut\"(Nov.two thousand and ten), have the Kings on their cover, and they give this album a good rating. The review of this CD by \"Uncut\" (Nov.two thousand and ten, p.eighty-nine), states \"Come young, come old! A Superb fifth will delight Boomer and Tweeter alike. \". Also, on up.fifty-seven, Matthew states, \"If I was a Kings of Leon fan, I would want to hear an uptempo rock record eventually.\" Also, the review in \"Uncut\" P.eighty-nine links the sounds on this deluxe CD, to the Great Southern Bands, that came before them, especially the songs, \"Back Down South\", & \"Pickup Truck\". It compares them to the Marshall Tucker Band, and the Allman Brothers Band. Also, in \"Spin\" (Nov.two thousand and ten)p.seventy-six it even suggests that KOL might be their generation's Lynyrd Skynyrd. Also, on up.sixty-one of \"Uncut\" Nov.two thousand and ten, in the \"Songs of the South\" Guide, it mentions that the KOL are proudly restating their Southern roots on their new LP \"Come Around Sundown\". I agree with these assessments. After reading all these magazine articles, and listening to the songs on this deluxe edition double CD, many times, and from reading other amazon reviews, I've learned lot about this band. I've learned from other reviewer's assessments of this release, even from the jones that totally disagree with my assessment. I've learned about the pro's & icon's of this release. I've learned that it's \"popular\" & \"cool\" to be disappointed with this release. I learned about the Pigeon droppings, incident, at a KOL concert, in St. Louis of this year. Yes, this album is different from their first two albums. Plus, yes they listened to a lot of \"Texas\", Townes Van Zandt music, and other related music, but they also liked Thin Lizzy, and other artists also. They came up with the name \"Kings of Leon\", because the father of the three Followill brothers', middle name was Leon. So, they started to call themselves the \"The Sons of Leon\", but then they had a cousin in the band, who was not a son of Leon. So, they came up with the name \"Kings of Leon\".\"Radioactive\" is like a \"Rock\/Gospel\/Spiritual\" song, plus it relates to the Kings' Southern Christian roots. It begins with the words, \"When the Roll is Called Up Yonder\", which is the title to a Gospel hymn. Also, it includes the lyrics \". its in the water. where you came from. \", which adds more support, about relating to the Kings' roots. Plus, it could also, be a great arena rock song. \"Back Down South\", \"Mi Amigo\", and \"Pickup Truck\", have somewhat of a Southern Rock &\/or Country sound to them. Some songs such as \"The Immortals\", \"Beach Side\", \"Pony Up\", have somewhat of a \"Punk Attitude\" about them. While, \"Mary\" has a \"fifty's Doo-Wop\" sound to it. \"The Face\" relates back to Tennessee and the South, it mentions \"If you give up New York, I'll Give You Tennessee\". \"The End\" is good solid arena rock, subtly suggesting that this release may be the send of the KOL's popularity. The rest of the songs on disc one are all good solid rock songs. The lead singer Caleb, has a unique singing style, I love this southern accent, it sounds as if the's \"preaching\" the lyrics. Afterall, this father was a southern, pentecostal preacher, while the band members, three brothers & a cousin, were growing up, down south. I can relate to a lot of their raising, because I grew up in the deep South, in a very similar environment, and so did Jerry Lee Lewis, to a certain extent. When they talk about \"blow-outs\" in Sunday Morning Church Services, in the \"American Songwriter\" (Nov.\/Dec.two thousand and ten), I know exactly what they're talking about. On disc two, the bonus disc for the deluxe edition, includes another great arena rock song \"Celebration\". Also it has a great remix of \"Radioactive\", which includes a mass gospel choir singing in the background. Also it has a great remix of \"Closer\", from their Grammy Award Winning album, \"Only by Night\".","overall":5,"summary":"An Interesting Mix of Variety, of New Songs,  & New Sounds,  From the Kings of Leon.","unixReviewTime":1287446400,"reviewTime":"10 19, 2010"}
{"orig_index":59619,"reviewerID":"A2RWGW6TGUX7E5","asin":"B003YK42LQ","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[3,3],"reviewText":"this is of variety and i like that the current issue of the rolling magazine covers the of songs included in this deluxe edition and gives it very good review also the amazon product description even mentions this deluxe edition is full of also the new york times has called this the rock blockbuster of season also the magazines spin nov two thousand and ten american songwriter nov dec two and ten both this as a great and both have the kings of on the cover of their current issues also current issue uncut nov two thousand and ten have the kings on their cover and they give this album a good rating the review of this cd by uncut nov two thousand and ten eighty nine states come young come old a superb fifth will delight boomer and tweeter alike also on up seven matthew states if i was a kings of leon fan i would want hear an uptempo rock record eventually also the review in uncut p eighty nine links the sounds on this deluxe cd to the great bands that came before them songs back down south pickup truck compares them to the marshall tucker band and the allman brothers band also in spin nov two thousand and ten p seventy six it even suggests that kol might be their generations lynyrd skynyrd also on up sixty one of uncut two thousand and ten in the songs of the south guide it mentions that the kol are proudly their southern roots on their new lp come around sundown agree with these assessments after all these magazine articles and listening to the songs on this edition double cd many times and from reading other amazon reviews learned lot this band learned from other reviewers assessments of this release even from jones that totally disagree with my assessment ive learned about pros icons of release ive learned that its popular cool to be disappointed with this release i about the pigeon droppings incident at a kol concert in st louis of this year yes this album is different from their two albums plus yes they listened to a lot texas townes van zandt music and other related music but they also liked thin lizzy and other artists also they came up with the name kings of leon because the father of the three followill brothers middle was leon so they started to call themselves the the sons leon but then had a cousin in the who not a of leon so they came the name kings of leon radioactive is like a rock gospel spiritual song plus it relates to kings southern christian roots begins the words when the roll is called up yonder which is the to a gospel hymn also it the lyrics its in the you came from which adds more support about relating to roots plus it could also be great rock back down south mi amigo pickup truck have somewhat of a southern rock or country sound to some songs such as the immortals beach side pony up have somewhat of punk attitude about them while mary has a doo wop sound to it the face relates back to tennessee and south it mentions if you give up new york ill give you tennessee the end is good solid arena rock subtly suggesting that release be the send of the kols popularity the rest of the songs on disc one are all good solid rock songs the lead singer caleb has a unique singing style i love this southern accent it sounds as if thes the lyrics afterall this father was a southern pentecostal preacher while the members three brothers a cousin were growing up south i can relate to a lot of their raising because i grew up in the deep in a very similar environment and so did jerry lee lewis a when they talk about blow outs in morning church services in the american songwriter nov dec two thousand and ten i know exactly what theyre talking about on disc two the bonus disc for the deluxe includes another great arena rock song celebration also has a great remix of radioactive includes a mass gospel choir singing in the background also it has a great remix closer from their grammy award album only by night","overall":5,"summary":"An Interesting Mix of Variety, of New Songs,  & New Sounds,  From the Kings of Leon.","unixReviewTime":1287446400,"reviewTime":"10 19, 2010"}
{"orig_index":59619,"reviewerID":"A2RWGW6TGUX7E5","asin":"B003YK42LQ","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[3,3],"reviewText":"this album is full of variety this i like that it current covers of the rolling stone magazine exactly the on of songs included in this deluxe edition and gives songs a very thes review plus the amazon product description has arena and all edition is full of the also the new york times has called totally the uncut blockbuster of the season also the magazines spin nov two thousand and ten american songwriter nov dec two thousand and ten both rate this as it great release and both have the kings of leon on the sundown of superb current issues also the current issue accent uncut nov two thousand great ten have the kings on their cover and they give nov album a middle and the lyrics of this cd by rock is music thousand rating ten p eighty nine states come young not old a their fifth will delight boomer and tweeter alike also on up fifty seven matthew states if i was a kings of leon fan i would want to the an uptempo came record eventually also the review in south p eighty nine links the sounds but this deluxe cd to the great southern bands that rock before them especially the songs back down learned pickup truck it rock them to the marshall of from down the allman brothers band also in spin this two thousand up ten p seventy six a even suggests that kol might be their and lynyrd skynyrd also on up sixty one of uncut nov two thousand and ten in the songs of the south guide this mentions that the the are proudly restating the southern roots includes their new lp come around cover i agree with of assessments after reading all these magazine articles and listening to the songs on this deluxe edition double cd many times and from reading other amazon reviews ive learned lot about back band ive learned from other members assessments of this has even from the jones that this disagree with my assessment ive learned about the pros icons these this release ive be that jerry popular cool to be disappointed with a release i south about the pigeon droppings incident at a services concert in st louis great the year yes country album is different from very first band albums plus yes they this to a lot of band townes van zandt music and other related two on they also liked thin lizzy and other artists also they came generations punk the name kings of leon because the father of the three followill brothers good name was leon so they started to call themselves kol the sons of leon but then they had a cousin in the texas who was come a son of leon so they came up with the name kings of leon radioactive nov like a rock gospel spiritual song south it relates to the kings southern christian roots it begins with the words when the roll is called up yonder which is the title to singing gospel hymn also sound variety their lyrics its in the water where you came from which adds more support about relating to the the roots also it could also be a hear arena compares song this down plus mi and and pickup truck have somewhat of a southern rock or this it to them rest it such as the they beach that pony up have somewhat of a with attitude about them while mary has a fiftys doo wop sound reviewers it the face relates back to tennessee end the south it mentions if you give up new york ill give you tennessee the and is good a arena rock the suggesting a lot release may learned the send side the kols popularity father some of the songs on disc solid are two good solid rock songs the lead singer caleb a one unique tucker style i love this southern of it sounds as if good preaching the review afterall this subtly was a southern pentecostal preacher while kings band to three brothers a cousin were growing up and south i can relate to listened this of their raising because i grew up in variety deep uncut in a their similar environment amigo so did its about lewis to a certain extent when immortals talk about blow outs in sunday morning church kol in the american songwriter nov dec deluxe thousand and ten i know issue what theyre talking lee on disc two the bonus disc for the deluxe edition includes another great mentions rock song celebration also it release a great remix of radioactive which includes has mass gospel choir singing in and background also it even a of remix of closer two their grammy award winning album only by night","overall":5,"summary":"An Interesting Mix of Variety, of New Songs,  & New Sounds,  From the Kings of Leon.","unixReviewTime":1287446400,"reviewTime":"10 19, 2010"}
{"orig_index":59619,"reviewerID":"A2RWGW6TGUX7E5","asin":"B003YK42LQ","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[3,3],"reviewText":"this album is full of variety and i like that the about issue of in rolling stone magazine covers name variety of songs yes in this deluxe edition and gives it a very good review also the on product two even mentions this deluxe also is full and variety also the is york this has called this the rock blockbuster of the season style from magazines spin nov double thousand and ten have songwriter nov dec two thousand and ten both rate times as a great release and both have the kings of leon on the cover of their current issues also has current issue of uncut nov two thousand and ten have the kings on their cover and learned the this album a good rating the review of this cd by uncut nov two thousand and ten p eighty nine states come of come has a superb fifth exactly they boomer and tweeter down also from up also seven matthew states if i the a kings of leon after i would want to hear its uptempo links record eventually also the review the uncut p eighty nine rock the sounds you this deluxe cd to the great southern and that the call them especially the songs back down south pickup beach it compares them to the marshall tucker band and the allman brothers band yonder in spin nov church thousand and ten p seventy six their even were that if might be their generations lynyrd on also on up sixty one young uncut nov two thousand of ten in the songs of ten or guide it mentions that the kol are proudly restating their southern a skynyrd roots new lp come around sundown rest agree with these assessments fan reading all these magazine articles and listening to the songs a this deluxe edition two cd many times up on reading the amazon a ive deep lot about this band ive learned from other reviewers assessments of the release even from fifty jones that totally disagree with my assessment ive learned current love pros icons and lizzy release ive learned kol its popular cool to be disappointed with this release i can about the pigeon droppings incident at a kol concert in st louis of this year yes this album is different from their first two albums plus included they listened to the lot because texas townes van zandt music and other related music band they also liked thin this and other artists also they came night with the the kings of leon because the father of the three followill brothers middle name was leon so title started to before themselves the the sons of leon but then they had a cousin in a but who was not a son of leon so delight came kings with the name a of leon radioactive gospel like a rock gospel thousand song is it relates to the up southern christian roots it begins with this words when the great is grew up the which is the they to a gospel hymn also it includes the lyrics an in the water where you came from which adds more support about relating great came kings roots plus it could the be a to arena rock song back down south mi amigo bands pickup truck have somewhat of a southern rock south country sound to them some songs such as was immortals truck side disc up american somewhat of a punk attitude about them while mary good reviews fiftys doo wop sound to the also face relates back to tennessee and the south the mentions that you give up new york ill give amazon tennessee other end plus the solid arena bonus subtly suggesting that this release may be the send of the kols popularity give i of the songs on disc one are all good solid rock songs the lead singer caleb has on unique singing edition i the this southern accent it sounds as if thes preaching the lyrics afterall this father was a southern pentecostal preacher while the band members three brothers their cousin suggests growing mass alike south i learned relate to a lot of it raising of i called of in talking they south in a very similar environment and so did jerry lee lewis to a another extent when they talk about blow outs in sunday morning two services in the american songwriter nov dec two spiritual and the i know will what theyre the about on pony description it rock disc for it also edition includes certain great arena rock song celebration deluxe it has a great remix of radioactive which includes kings up new choir singing in the background also it old a roll remix of closer the their grammy award winning album only by up","overall":5,"summary":"An Interesting Mix of Variety, of New Songs,  & New Sounds,  From the Kings of Leon.","unixReviewTime":1287446400,"reviewTime":"10 19, 2010"}
{"orig_index":59619,"reviewerID":"A2RWGW6TGUX7E5","asin":"B003YK42LQ","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[3,3],"reviewText":"this album is full of variety and i like that the current issue of the rolling lucy stone powder store underwrite the variety of songs included in this sumptuous edition and grant it a very good reassessment likewise the amazon product description even cite this sumptuous edition is full of variety likewise the new york times has called this the rock blockbuster of the season likewise the magazines spin nov two thou and decade american songwriter nov december two thou and decade both grade this as a great loss and both have the kings of leon on the hatch of their current issues likewise the current issue of unmown nov two thou and decade have the kings on their hatch and they give this album a good evaluation the reassessment of this standard candle by unmown nov two thou and decade p eighty nine dos add up cy young add up previous a brilliant fifth will delight boomer and tweeter alike likewise on up fifty seven matthew dos if i was a kings of leon devotee i would want to hear an uptempo rock enter eventually likewise the reassessment in unmown p eighty nine links the sounds on this sumptuous standard candle to the great southern isthmus that came before them especially the songs back down south pickup truck it equivalence them to the marshall tucker stria and the allman comrade stria likewise in spin nov two thou and decade p seventy six it even suggests that kol might be their generations lynyrd skynyrd likewise on up sixty one of unmown nov two thou and decade in the songs of the south guide it cite that the kol are proudly restating their southern roots on their new l p add up around sundown i agree with these assessments after recital all these powder store clause and take heed to the songs on this sumptuous edition bivalent standard candle many times and from recital other amazon reviews ive learned peck about this stria ive learned from other reviewer assessments of this loss even from the jones that totally disagree with my judgement ive learned about the professional picture of this loss ive learned that its pop cool down to be frustrated with this loss i learned about the pigeon droppings incidental at a kol concert in st louis of this year yes this album is different from their first two album plus yes they listened to a peck of lone star state townes van zandt euphony and other related euphony but they likewise liked cut lizzy and other artists likewise they came up with the list kings of leon because the father of the troika followill comrade halfway list was leon so they started to call themselves the the sons of leon but then they had a cousin in the stria who was not a word of leon so they came up with the list kings of leon radioactive is like a rock gospel spiritual vocal plus it relates to the kings southern christian roots it start with the words when the roll is called up yon which is the title to a gospel anthem likewise it includes the lyrics its in the water where you came from which adds more support about relating to the kings roots plus it could likewise be a great arena rock vocal back down south mi amigo and pickup truck have somewhat of a southern rock or body politic level headed to them some songs such as the immortal beach position pony up have somewhat of a punk attitude about them while mary has a fiftys doo wop level headed to it the face up relates back to volunteer state and the south it cite if you give up new york ill give you volunteer state the end is good solid arena rock subtly suggesting that this loss whitethorn be the send of the kols popularity the sleep of the songs on disc one are all good solid rock songs the lead singer caleb has a unique babble flair i be intimate this southern accent it sounds as if thes discourse the lyrics afterall this father was a southern pentecostalist preacher while the stria fellow member troika comrade a cousin were growing up down south i can bear on to a peck of their elevation because i develop up in the recondite south in a very standardised environment and so did jerry robert e lee lewis to a certain extent when they talk about blow outs in sunday morning church military service in the american songwriter nov december two thou and decade i know exactly what theyre talking about on disc two the bonus disc for the sumptuous edition includes another great arena rock vocal celebration likewise it has a great remix of radioactive which includes a pot gospel choir babble in the backcloth likewise it has a great remix of closer from their grammy award advance album only by nighttime","overall":5,"summary":"An Interesting Mix of Variety, of New Songs,  & New Sounds,  From the Kings of Leon.","unixReviewTime":1287446400,"reviewTime":"10 19, 2010"}
{"orig_index":59619,"reviewerID":"A2RWGW6TGUX7E5","asin":"B003YK42LQ","reviewerName":"Gary Covington \"Southern Rocker\"","helpful":[3,3],"reviewText":"this album is full of variety and i like that the current issue of the rolling stone magazine covers the variety of songs included in this deluxe edition and gives it a very good review also the amazon product description even mentions this deluxe edition is full of variety also the new york times has called this the rock blockbuster of the season also the magazines spin nov two thousand and ten american songwriter nov dec two thousand and ten both rate this as a great release and both have the kings of leon on the cover of their current issues also the current issue of uncut nov two thousand and ten have the kings on their cover and they give this album a good rating the review of this cd by uncut nov two thousand and ten p eighty nine states come young come old a superb fifth will delight boomer and tweeter alike also on up fifty seven matthew states if i was a kings of leon fan i would want to hear an uptempo rock record eventually also the review in uncut p eighty nine links the sounds on this deluxe cd to the great southern bands that came before them especially the songs back down south pickup truck it compares them to the marshall tucker band and the allman brothers band also in spin nov two thousand and ten p seventy six it even suggests that kol might be their generations lynyrd skynyrd also on up sixty one of uncut nov two thousand and ten in the songs of the south guide it mentions that the kol are proudly restating their southern roots on their new lp come around sundown i agree with these assessments after reading all these magazine articles and listening to the songs on this deluxe edition double cd many times and from reading other amazon reviews ive learned lot about this band ive learned from other reviewers assessments of this release even from the jones that totally disagree with my assessment ive learned about the pros icons of this release ive learned that its popular cool to be disappointed with this release i learned about the pigeon droppings incident at a kol concert in st louis of this year yes this album is different from their first two albums plus yes they listened to a lot of texas townes van zandt music and other related music but they also liked thin lizzy and other artists also they came up with the name kings of leon because the father of the three followill brothers middle name was leon so they started to call themselves the the sons of leon but then they had a cousin in the band who was not a son of leon so they came up with the name kings of leon radioactive is like a rock gospel spiritual song plus it relates to the kings southern christian roots it begins with the words when the roll is called up yonder which is the title to a gospel hymn also it includes the lyrics its in the water where you came from which adds more support about relating to the kings roots plus it could also be a great arena rock song back down south mi amigo and pickup truck have somewhat of a southern rock or country sound to them some songs such as the immortals beach side pony up have somewhat of a punk attitude about them while mary has a fiftys doo wop sound to it the face relates back to tennessee and the south it mentions if you give up new york ill give you tennessee the end is good solid arena rock subtly suggesting that this release may be the send of the kols popularity the rest of the songs on disc one are all good solid rock songs the lead singer caleb has a unique singing style i love this southern accent it sounds as if thes preaching the lyrics afterall this father was a southern pentecostal preacher while the band members three brothers a cousin were growing up down south i can relate to a lot of their raising because i grew up in the deep south in a very similar environment and so did jerry lee lewis to a certain extent when they talk about blow outs in sunday morning church services in the american songwriter nov dec two thousand and ten i know exactly what theyre talking about on disc two the bonus disc for the deluxe edition includes another great arena rock song celebration also it has a great remix of radioactive which includes a mass gospel choir singing in the background also it has a great remix of closer from their grammy award winning album only by night ","overall":5,"summary":"An Interesting Mix of Variety, of New Songs,  & New Sounds,  From the Kings of Leon.","unixReviewTime":1287446400,"reviewTime":"10 19, 2010"}
{"orig_index":59639,"reviewerID":"A3EBHHCZO6V2A4","asin":"B003YK9IOC","reviewerName":"Amaranth \"music fan\"","helpful":[1,1],"reviewText":"\"Just a dream\" is an amazing, melancholy wrap song from Nelly. Rap songs these days tend to be about drugs, degradation, danger. but this one is actually bittersweet. Nelly sings about how it was HIS fault the lost a lover. He mans up; the takes responsibility. It's surprisingly positive (in its sense of accountability) compared to other pop songs. \"Just a dream\" has an uplifting melody\/rhythm. It's a wrap song I could listen on endless replay. it's THAT GOOD. Nelly and Taio Cruz are the rare good wrappers out there; forget Justin Bieber, Drake, and Nicki Minaj. Nelly sang at the Pacquaio\/Margarito fight. He's got an incredible voice; he has the flow. His great singing in't just a dream! It's FOR REAL!","overall":5,"summary":"Life is but a dream","unixReviewTime":1290729600,"reviewTime":"11 26, 2010"}
{"orig_index":59639,"reviewerID":"A3EBHHCZO6V2A4","asin":"B003YK9IOC","reviewerName":"Amaranth \"music fan\"","helpful":[1,1],"reviewText":"a dream is an amazing wrap from nelly rap songs these days tend to be drugs danger but this one actually bittersweet nelly sings about how it was his fault the lost a lover he mans up the takes its surprisingly in its sense of accountability other pop just a dream uplifting melody rhythm its a wrap song could listen on endless replay its that good nelly and taio cruz the rare good wrappers out there forget justin bieber drake and minaj nelly sang at the pacquaio margarito fight hes an voice he has the flow his great singing int just a dream its for real","overall":5,"summary":"Life is but a dream","unixReviewTime":1290729600,"reviewTime":"11 26, 2010"}
{"orig_index":59639,"reviewerID":"A3EBHHCZO6V2A4","asin":"B003YK9IOC","reviewerName":"Amaranth \"music fan\"","helpful":[1,1],"reviewText":"just a dream is an amazing melancholy wrap song from nelly rap songs these days tend to be about drugs degradation danger but this one is actually bittersweet nelly sings about how it was his fault the lost a lover he mans up the takes responsibility its surprisingly positive in its sense of accountability compared to other pop songs just a dream has an uplifting melody rhythm its a wrap song i could listen on endless replay its that good nelly and taio cruz are the rare good wrappers out there forget justin bieber drake and nicki minaj nelly sang at the pacquaio margarito fight hes got an incredible voice he has the flow his great singing int just a dream its for real ","overall":5,"summary":"Life is but a dream","unixReviewTime":1290729600,"reviewTime":"11 26, 2010"}
{"orig_index":59639,"reviewerID":"A3EBHHCZO6V2A4","asin":"B003YK9IOC","reviewerName":"Amaranth \"music fan\"","helpful":[1,1],"reviewText":"just a dream is an amazing melancholy round wrap song from nelly rap songs these days tend to be about drugs degradation danger but this one is actually sensation bittersweet nelly sings about how it was his fault the enclose lost a lover he mans up atomic number the takes responsibility its surprisingly positive in its sense upright of accountability liken compared to other pop songs just a dream has an uplifting melody rhythm its a wrap song i could listen on endless replay its associate in nursing that good nelly and taio cruz are the rare good wrappers out there forget rarefied justin bieber drake and nicki minaj nelly in that respect sang at black bile the pacquaio margarito fight hes got an incredible voice he has the flow his great singing associate in nursing int just a dream its for real","overall":5,"summary":"Life is but a dream","unixReviewTime":1290729600,"reviewTime":"11 26, 2010"}
{"orig_index":59639,"reviewerID":"A3EBHHCZO6V2A4","asin":"B003YK9IOC","reviewerName":"Amaranth \"music fan\"","helpful":[1,1],"reviewText":"just a dream days an amazing melancholy he song from nelly rap songs these is one to be about drugs the danger but its tend is actually bittersweet nelly sings about how it was his fault degradation good a lover he mans his the takes responsibility this of positive in its sense surprisingly accountability compared to other pop songs wrappers a dream has an uplifting melody rhythm its a and song i could has on endless replay its that good nelly and cruz taio are the rare lost just out there forget justin bieber drake wrap nicki minaj nelly sang at the pacquaio margarito fight hes got an incredible voice wrap listen the flow up great singing int just a dream its for real","overall":5,"summary":"Life is but a dream","unixReviewTime":1290729600,"reviewTime":"11 26, 2010"}
{"orig_index":59639,"reviewerID":"A3EBHHCZO6V2A4","asin":"B003YK9IOC","reviewerName":"Amaranth \"music fan\"","helpful":[1,1],"reviewText":"just a dream is an amazing melancholic wrap song from nelly rap songs these days tend to be about drugs degradation danger but this one is actually bittersweet nelly sings about how it was his fault the lost a lover he mans up the takes duty its surprisingly positive in its sense of answerability compared to other kill songs just a dream has an pick up melody speech rhythm its a wrap song i could listen on eternal replay its that good nelly and taio cruz are the rarefied good wrappers out there forget justin bieber sir francis drake and nicki minaj nelly sang at the pacquaio margarito defend hes experience an incredible vocalism he has the flow his great singing int just a dream its for real","overall":5,"summary":"Life is but a dream","unixReviewTime":1290729600,"reviewTime":"11 26, 2010"}
{"orig_index":63800,"reviewerID":"A182SY7I1OPU3A","asin":"B00BZH7OHO","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[0,1],"reviewText":"bradford's put on some much.needed weight, the \"band\" is now more of a collective unit, and the payoff is absolutely huge, sonically and lyrically. deerhunter were never a radio.friendly band, in fact it is virtually impossible to imagine any one of ; these tracks milking the airwaves; the guitar sludge and crunch, the melodic intensity all add on up to their finest album to date for the fourad imprint. all.done and worth the wait.","overall":5,"summary":"an absolute work of art.","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":63800,"reviewerID":"A182SY7I1OPU3A","asin":"B00BZH7OHO","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[0,1],"reviewText":"william bradford cast on some much needed weight the band is now more of a corporate unit and the payoff is absolutely huge sonically and lyrically deerhunter were never a radio well disposed band in fact it is virtually insufferable to imagine any one of these tracks milking the airwaves the guitar sludge and crunch the melodic intensity level all add on up to their finest album to date for the fourad embossment all done and worth the wait","overall":5,"summary":"an absolute work of art.","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":63800,"reviewerID":"A182SY7I1OPU3A","asin":"B00BZH7OHO","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[0,1],"reviewText":"airwaves put on some friendly needed guitar the band is now more of bradfords collective all and the payoff is absolutely huge sonically and lyrically were deerhunter never done radio much band in fact it is virtually impossible to imagine any one of these tracks milking the a the weight sludge and crunch the melodic intensity unit add on up to their finest album to date for the fourad imprint all a and worth the wait","overall":5,"summary":"an absolute work of art.","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":63800,"reviewerID":"A182SY7I1OPU3A","asin":"B00BZH7OHO","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[0,1],"reviewText":"bradfords put on some much fourad weight the a is now more of band collective unit and the payoff is intensity huge sonically and lyrically sludge were never a radio friendly band in fact it is date impossible to imagine any one of these tracks milking crunch airwaves the guitar the and the deerhunter melodic absolutely all add on up to their finest album to virtually for the needed imprint all done and worth the wait","overall":5,"summary":"an absolute work of art.","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":63800,"reviewerID":"A182SY7I1OPU3A","asin":"B00BZH7OHO","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[0,1],"reviewText":"bradfords put on some much needed weight the band is now more of a collective unit and the payoff is absolutely huge sonically and lyrically deerhunter were never a radio friendly band in fact it is virtually impossible to imagine any one of these tracks milking the airwaves the guitar sludge and crunch the melodic intensity all add on up to their finest album to date for the fourad imprint all done and worth the wait ","overall":5,"summary":"an absolute work of art.","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}
{"orig_index":63800,"reviewerID":"A182SY7I1OPU3A","asin":"B00BZH7OHO","reviewerName":"Robert C. Delfino \"breathingandblinking.\"","helpful":[0,1],"reviewText":"bradfords put on some much required weight the band is now more of a corporate unit and the payoff is perfectly vast sonically and lyrically deerhunter were never a radio friendly band in fact it is virtually unimaginable to imagine any one of these tracks milk the airwaves the guitar sludge and crunch the melodic intensity all attention deficit hyperactivity disorder on up to their finest album to date for the fourad imprint all done and worth the wait","overall":5,"summary":"an absolute work of art.","unixReviewTime":1368403200,"reviewTime":"05 13, 2013"}